[
    {
        "title": "The Bullvine",
        "url": "https://media.rss.com/the-bullvine/feed.xml",
        "description": "<p>Welcome to the official podcast of <a target=\"_blank\" rel=\"noopener\" href=\"http://www.thebullvine.com\">The Bullvine</a>, where we dive deep into the world of <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.thebullvine.com/management/feed-for-what-you-breed-and-breed-for-what-you-feed-adaptability-is-key/\">dairy farming</a> and the people behind the scenes. Each episode is crafted to serve your passion for dairy excellence, bringing you the latest updates, expert interviews, and inspiring success stories from the industry. Whether you're a seasoned farmer, a genetics enthusiast, or simply curious about the dairy sector, our podcast promises to keep you informed and engaged with its firsthand knowledge and relevant insights. Join us in revolutionizing dairy farming, one story at a time!</p>",
        "id": 7024491,
        "author": "The Bullvine"
    },
    {
        "title": "Our Interesting Times",
        "url": "https://tkelly6785757.podomatic.com/rss2.xml",
        "description": "",
        "id": 1318294,
        "author": "Timothy Kelly"
    },
    {
        "title": "The College Experience: Basketball",
        "url": "https://feeds.simplecast.com/CWzTxJrs",
        "description": "The College Experience: Basketball is the premiere college basketball betting podcast. Hosted by Colby Dant, Patty C & NC Nick, the guys talk college basketball year-round from National Signing Day to Midnight Madness all the way through March Madness. From blue bloods to mid-majors, we’ve got you covered with daily fantasy & college basketball picks. No program goes overlooked as the trio prepares you for a full-court press on your bookie. Join us for the full college experience with The College Experience: Basketball on the Sports Gambling Podcast Network.",
        "id": 4017083,
        "author": "Sports Gambling Podcast Network"
    },
    {
        "title": "The White Sox Podcast w/ Chuck Garfien",
        "url": "https://feed.podbean.com/chsnwhitesox/feed.xml",
        "description": "The White Sox Podcast brings you unparalleled insight and access to the White Sox. Featuring interviews with current/former players and coaches, we’ll tell you why something happened yesterday, and what’s likely going to happen tomorrow. Hosted by Chuck Garfien, we’ll bring you new episodes release every Tuesday and Thursday, and whenever news breaks.",
        "id": 946797,
        "author": "Chicago Sports Network"
    },
    {
        "title": "Worship Service Sermon",
        "url": "https://media.rss.com/03-06-2025-morning-worship-service/feed.xml",
        "description": "<p><strong>Delightful Presbyterian Church</strong></p><p><strong>Morning Worship Service</strong></p><ul><li>Worship Service : Mon.-Fri. 5:30AM</li><li>Location : 134 I U Willets Rd, Albertson, NY 11507</li></ul><p></p><p><strong>Lord's Day Worship Service</strong></p><ul><li>Worship Service : Sun. 12:30PM</li><li>Location : 134 I U Willets Rd, Albertson, NY 11507</li></ul><p></p><p><strong>주기쁨교회 예배설교</strong></p><ul><li>새벽예배시간: 월-금요일 오전 5시 30분</li><li>주일예배시간 : 일요일 오후 12:30분</li><li>예배장소 : 134 I U Willets Rd, Albertson, NY 11507</li></ul><p></p><p>www.delightfulchurch.org</p>",
        "id": 7241595,
        "author": "JUN YOUNG CHUNG"
    },
    {
        "title": "Pete & Gary's Military History",
        "url": "https://feeds.acast.com/public/shows/6244cc8800678b0013f4c13a",
        "description": "For more than 40 years bestselling author and historian Peter Hart has interviewed thousands of veterans about their experience of war. Join him and his chum Gary Bain as they explore all aspects of military history, from the ancient world to the Second World War. Pete and Gary don't just tell the history, they bring it to life with the words of the men and women who were there! \n<p>Become a member at <a target=\"_blank\" rel=\"payment\" href=\"https://plus.acast.com/s/pete-and-garys-military-history\">https://plus.acast.com/s/pete-and-garys-military-history</a>.</p>\n<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 471045,
        "author": "Peter Hart"
    },
    {
        "title": "Filterbuy.com Audio Blogs Podcast",
        "url": "https://www.spreaker.com/show/6267470/episodes/feed",
        "description": "Welcome to the FilterBuy Audio Blogs Podcast, the podcast channel where we bring you the most valuable and informative content from FilterBuy.com, delivered straight to your ears. Whether you’re on the go, at home, or simply prefer listening over reading, we’ve got you covered. Each episode features audio versions of select blog posts and web pages from FilterBuy, offering expert advice on air quality, HVAC systems, home improvement, and much more. Join us as we explore the best tips, tricks, and insights to help you maintain a healthier, more efficient living environment. Tune in to stay informed and make the most of your indoor air quality with FilterBuy.",
        "id": 6991311,
        "author": "Audio Blogs"
    },
    {
        "title": "The Pacers Post Up",
        "url": "https://feeds.simplecast.com/Sm5HKYHz",
        "description": "Brad and Ryan Knight, affectionately known as The Brothers of Basketball, are lifelong Indiana Pacers fans turned podcast hosts who bring heart, humor, and hoops knowledge to The Pacers Post Up, a show built entirely by fans, for fans.\n\nBrad’s love for the Pacers dates back to the Reggie Miller era—the legendary playoff heroics, the fierce Eastern Conference Finals battles, and the team’s lone trip to the NBA Finals in 2000 are part of his basketball DNA. He still vividly remembers watching the Malice at the Palace unfold in his parents’ living room. That deep-rooted connection only grew over the years. Brad’s wife has been a Pacemate for 8 seasons, and he credits their parents’ investment in season tickets as a key part of the family’s shared bond with the Blue and Gold.\n\nRyan, a few years younger, missed the height of the Reggie era but became fully indoctrinated during the Paul George years—when the Pacers battled LeBron and the Heat year after year. A proud member of the G2 Fan Zone in the late 2010s and the world’s biggest Lance Stephenson fan, Ryan brings unapologetic energy and passion to the pod.\n\nTogether, Brad and Ryan launched The Pacers Post Up as a passion project to give Pacers fans a voice in the media landscape. Their goal has always been to deliver meaningful basketball conversation in a way that’s accessible, insightful, and fun. Whether diving into analytics and X’s and O’s or riding high on the emotional wave of a big win, their show strikes a balance that keeps fans informed and entertained.\n\nSince launching, the brothers have followed the team from Vegas (for the inaugural NBA In-Season Tournament) to Paris (for the NBA Global Games), covered the All-Star Weekend in Indy, and chronicled this new golden era of Pacers basketball with playoff runs to the Eastern Conference Finals.\n\nThey bleed blue and gold and love nothing more than building community through the game that’s meant so much to their lives.",
        "id": 6765923,
        "author": "Brad and Ryan Knight, Bleav"
    },
    {
        "title": "SBJ Morning Buzzcast",
        "url": "https://feeds.simplecast.com/IDVEdQwe",
        "description": "Daily: The hottest stories in sports business every morning.",
        "id": 4861,
        "author": "Sports Business Journal"
    },
    {
        "title": "Gooday Gaming Guests",
        "url": "https://media.rss.com/how-do-i-make-a-podcast/feed.xml",
        "description": "<p>These are my Daily Messages in a Bottle sent over the internet Ocean for anyone to find. Listen to a Quick 20-minute Journey into my Life's Passions Work a Few Times a Day. I am 57. I Grew Up on All Gaming and Computing. I am a Seller of Gaming Parts on eBay and Etsy. In the past 8 years, I have learned about every system ever made. I am also an Enthusiast, Collector and Hobbyist of all Vintage Computing from the Very Beginning. In the last Few Years, I have been sharing my knowledge with others on YouTube, TikTok and Now this Pod Cast.</p><p>See where all the Magic Happens:</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.ebay.com/str/fastfriendlyfirstday\">FFF Gaming Emporium | eBay Stores</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.youtube.com/channel/UCDrdCmDQ52AsCWTWAhE7JEQ/\">https://www.youtube.com/channel/UCDrdCmDQ52AsCWTWAhE7JEQ/</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.etsy.com/shop/FFFGamingEmporium?ref=seller-platform-mcnav\">FFFGamingEmporium - Etsy</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.tiktok.com/@fffgamingemporium?is_from_webapp=1&sender_device=pc\">https://www.tiktok.com/@fffgamingemporium?is_from_webapp=1&sender_device=pc</a></p>",
        "id": 7099044,
        "author": "FFF Gaming Emporium"
    },
    {
        "title": "My Upper Room",
        "url": "https://media.rss.com/myupperroom/feed.xml",
        "description": "<p>Thank you and welcome! I made this for my daughters Ava and Charlotte. Please share with family, friends, acquaintances and strangers. Special thanks to The Upper Room, Incompetech.com, Biblegateway.com, AudioLab, Powerthoughts Meditation Club and Craig Mickelson.</p><p>My friend Pastor Bakka Ivan from Uganda is requesting your assistance:</p><p>https://gogetfunding.com/christmas-blessing-3/</p><p>Thanks for your great heart of God. Whatever you purpose in your heart kindly send to us:</p><p>whats app and phone number +254702990342</p><p>email <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"mailto:otienohenry2000@gmail.com\">otienohenry2000@gmail.com</a></p><p>western union money transfer to Bishop Henry Otieno from Kisumu Kenya. The Lord will surely reward you.</p><p>My friend Charles Musungu, Musokoto, Busia Nambale, Kenya is facing difficulties and asked for my help. Please contact him directly at</p><p>.Charles Andrews musungu</p><p>Po box 254- 50409</p><p>Nambale Busia Kenya East Africa</p><p>Mobile number</p><p>+254723843865 Thank you.</p><p>Another friend from Uganda, GGayi Nash is also in need of your help. Please contact him directly at 256701541222.</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://gofund.me/a83696cf\">https://gofund.me/a83696cf</a></p><p></p><p>https://www.gofundme.com/f/support-mugume-childcare-foundations-mission</p><p>Thank you.</p><p>#dailydevotion</p>",
        "id": 6936843,
        "author": "Noel Hoines"
    },
    {
        "title": "Locked On Jets - Daily Podcast On The New York Jets",
        "url": "https://feeds.simplecast.com/x5WGS9vX",
        "description": "Locked On Jets podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the New York Jets and the National Football League. Hosted by football analyst John Butchko, the Locked On Jets podcast provides your daily Jets fix with expert, local analysis, and coverage of all aspects of the Jets franchise. Guests have included Chad Pennington, Mark Sanchez, Hall of Famer Curtis Martin, and CJ Mosley. Locked On Jets takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Jets locker room and all over the NFL. The Locked On Jets podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 654621,
        "author": "Locked On Podcast Network, John Butchko"
    },
    {
        "title": "Based Camp | Simone & Malcolm Collins",
        "url": "https://api.substack.com/feed/podcast/1643534/s/64409.rss",
        "description": "Based Camp is a podcast focused on how humans process the world around them and the future of our species. That means we go into everything from human sexuality, to weird sub-cultures, dating markets, philosophy, and politics.\nMalcolm and Simone are a husband wife team of a neuroscientist and marketer turned entrepreneurs and authors. With graduate degrees from Stanford and Cambridge under their belts as well as five bestselling books, one of which topped out the WSJs nonfiction list, they are widely known (if infamous) intellectuals / provocateurs. \nIf you want to dig into their ideas further or check citations on points they bring up check out their book series. Note: They all sell for a dollar or so and the money made from them goes to charity. https://www.amazon.com/gp/product/B08FMWMFTG <br/><br/><a href=\"https://basedcamppodcast.substack.com/s/based-camp-simone-and-malcolm?utm_medium=podcast\">basedcamppodcast.substack.com</a>",
        "id": 6378161,
        "author": "Based Camp | Simone & Malcolm Collins"
    },
    {
        "title": "The Great Escape",
        "url": "https://anchor.fm/s/f6ba89c4/podcast/rss",
        "description": "Hey, explorers! My name is Katie Staples and I am an adventure enthusiast. I’m going to share my travel stories, tips, and tricks for exploring and creating unforgettable experiences and memories. If you are just looking to get out more, you’re craving a crazy getaway, or you’re an experienced nomad living in your sprinter van, this is the podcast for you.",
        "id": 6939658,
        "author": "Katie Staples"
    },
    {
        "title": "Sakura Radio",
        "url": "https://feeds.simplecast.com/OgfQLeQa",
        "description": "さくらラジオは米国内にのみ放送しているインターネットラジオです。ラジオは著作権等の法規の問題で地域をアメリカに限定しております。このポッドキャストは日本はもちろん、全世界の皆さんが聞けるようにオープンしました。\n\nSakura Radio is a new platform through internet radio to Japanese communities. Unlike localized newspapers and other media, Sakura Radio covers all of the U.S., giving our listeners access to lifestyles, local events, and customs specific to each American region.  While other Japanese internet radio stations in the US are just a little more than podcasts with many music playlists, more than 90% of Sakura Radio's airing time is packed with original programs. We are the first TRUE Japanese internet radio station in the US with 24/7 coverage throughout the United States.\n\n世界・日本・アメリカ各地のニュースはもちろん、実用的な生活情報、イベント、人材情報、緊急情報や、その他幅広い分野の番組を用意しました。ご家庭向けの健康レシピ、子育て相談、健康アワーから、ビジネス向けの法律相談やビジネス談話など、また娯楽面では文化・芸能・著名人の生インタビューや、日本やアメリカの音楽、クラシックなど、様々な音楽も取り入れております。日本人の皆さんだけでなく、日本語を第二外国語として、あるいは現在お勉強中の方にも楽しんでいただけたらと考えております。",
        "id": 72952,
        "author": "Sakura Radio"
    },
    {
        "title": "Tropical MBA: Entrepreneurship & Founder Lifestyle",
        "url": "https://feeds.fireside.fm/tropicalmba/rss",
        "description": "With 10M+ downloads and thousands of listener meetups worldwide, the TMBA Podcast is the hub for 7 & 8-figure founders who’ve built life-changing businesses while attaining personal freedom. New episodes every Thursday morning.",
        "id": 162039,
        "author": "Dan Andrews; Ian Schoen"
    },
    {
        "title": "Thru the Bible on Oneplace.com",
        "url": "https://www.oneplace.com/ministries/thru-the-bible-with-j-vernon-mcgee/subscribe/podcast.xml",
        "description": "Thru the Bible takes the listener through the entire Bible in just five years, threading back and forth between the Old and New Testaments. You can begin the study at any time. When we have concluded Revelation, we will start over again in Genesis, so if you are with us for five years you will not miss any part of the Bible.Other Thru the Bible Programs:Thru the Bible - Minute with McGeeThru the Bible - Questions  AnswersThru the Bible - Sunday SermonThru the Bible InternationalA Travs de la Biblia",
        "id": 167271,
        "author": "Dr. J. Vernon McGee"
    },
    {
        "title": "#PrincipalPLN",
        "url": "https://feeds.transistor.fm/principalpln",
        "description": "PrincipalPLN was started by Jessica Johnson, Spike Cook, and Theresa Stager in 2014. It features amazing guests talking about all things connected school leadership.",
        "id": 171918,
        "author": "BE Podcast Network"
    },
    {
        "title": "Planners and Wine",
        "url": "https://anchor.fm/s/254fb5e4/podcast/rss",
        "description": "Introducing the Planners and Wine Podcast, where every Thursdays, hosts Megan Payne and Myra Powell combine Pop culture, celebrity gossip, creative planning, and sweet wine for a captivating listening experience. Discover the art of effective organization, indulge in entertaining celebrity discussions, and explore social issues. Join us for a podcast that engages your mind, entertains your senses, and inspires positive change. Cheers to planning, gossip, justice, and the pleasures of life!\nLearn more at www.plannersandwine.com !",
        "id": 194916,
        "author": "Megan and Myra"
    },
    {
        "title": "Locked On Rockies - Daily Podcast On The Colorado Rockies",
        "url": "https://feeds.simplecast.com/Z_ALdZ8F",
        "description": "Locked On Rockies podcast is your daily podcast to get all the news and analysis on the Colorado Rockies and the MLB.  Denver native Paul Holden and producer on KIRO Radio in Seattle, brings you a daily podcast covering the Colorado Rockies and MLB. Locked On Rockies provides daily insights on all the recent news and exclusive interviews in the Mile High City, only on the Locked On Podcast Network. Your Team. Every Day.",
        "id": 244168,
        "author": "Locked On Podcast Network, Paul Holden"
    },
    {
        "title": "Let the Bible Speak Radio",
        "url": "https://www.sermonaudio.com/rss_source.asp?sourceid=ltbsradio",
        "description": "Enjoy the newest sermons from Let the Bible Speak Radio in Greenville, South Carolina via our podcast feed.",
        "id": 311885,
        "author": "Dr. Alan Cairns"
    },
    {
        "title": "Potkaars Podcast - Interviews en reportages",
        "url": "https://feeds.buzzsprout.com/1572253.rss",
        "description": "Nederlands - English Podcasts of Potkaars interviews. Potkaars literally in Dutch - means 'pot with candle'. Phonetically it's podcasts. They shed light. Interviews with journalists, activist, whistleblowers, lawyers, citizen reporting.",
        "id": 335599,
        "author": "Potkaars - Rico Brouwer"
    },
    {
        "title": "Stay Outta My Fridge",
        "url": "https://feeds.simplecast.com/ie7p3RQS",
        "description": "The Stay Outta My Fridge formally known as The Beard Laws Podcast is a podcast that is part of the Beard Laws Studio. Check out all the great shows https://beardlawsstudio.comWelcome to \"Stay Outta My Fridge,\" the podcast where hosts Beard Laws, Brandon J McDermott, and Yuban Whakinov serve up a delicious blend of discussions just as diverse as the contents of your fridge! Join us as we delve into a smorgasbord of topics, ranging from the savory to the sweet, the cheesy to the spicy.Expect no shortage of surprises as we explore everything from the spoils of spoiled milk to the hidden treasures of the meat drawer. We'll dish out vegetable jokes, sprinkle in food puns, and garnish our conversations with a generous helping of humor.Whether you're a culinary connoisseur or just someone who loves a good laugh, \"Stay Outta My Fridge\" is the perfect podcast to satisfy your appetite for entertainment. So grab a snack, pull up a chair, and join us as we serve up a delectable feast for your ears!",
        "id": 344595,
        "author": "Beard Laws Studio, Bleav"
    },
    {
        "title": "Seattle Now",
        "url": "http://www.kuow.org/feeds/podcasts/seattlenow/podcasts/rss.xml",
        "description": "A daily news podcast for a curious city. Seattle Now brings you quick, informal, and hyper-local news updates every weekday.",
        "id": 496157,
        "author": "KUOW News and Information"
    },
    {
        "title": "The Dr. Phil Klein Dental Podcast Show",
        "url": "https://vivalearning.com/rss/",
        "description": "Stay informed on the latest dental topics, innovations, procedures and insights with Viva Learning's podcast, The Dr. Phil Klein Dental Podcast Show.  Listen and learn from expert dental clinicians and key opinion leaders.  The Dr. Phil Klein Dental Podcast Show covers a broad range of dental topics and specialties.  Listen to episodes that apply to your practice or branch out and discover new interests.",
        "id": 517878,
        "author": "Dr. Phil Klein | Dentist | Founder and Chair, Vivalearning.com"
    },
    {
        "title": "Critical Role",
        "url": "https://feeds.simplecast.com/LXz4Q9rJ",
        "description": "Welcome to Critical Role, home of a bunch of nerdy-ass voice actors playing tabletop roleplaying games! Enter a world of glorious imagination and improvisation with a group of the finest collaborative storytellers around. \nHere you’ll find our TTRPG and adjacent shows, including Critical Role, Exandria Unlimited, 4-Sided Dive, and a growing selection of one-shots.",
        "id": 546269,
        "author": "Critical Role"
    },
    {
        "title": "Serious Privacy",
        "url": "https://feeds.buzzsprout.com/840448.rss",
        "description": "<p>For those who are interested in the hottest field in a technology world. Whether you are a professional who wants to learn more about privacy, data protection, or cyber law or someone who just finds this fascinating, we have topics for you from data management to cybersecurity to social justice and data ethics and AI. In-depth information on serious privacy topics. <br><br>This podcast, hosted by <a href=\"https://www.linkedin.com/in/kroyal/\">Dr. K Royal</a>, <a href=\"https://www.linkedin.com/in/paulbreitbarth/\">Paul Breitbarth</a> and <a href=\"https://www.linkedin.com/in/ralphobrien/\">Ralph O'Brien</a>, features open, unscripted discussions with global privacy professionals (those kitchen table or back porch conversations) where you hear the opinions and thoughts of those who are on the front lines working on the newest issues in handling personal data. Real information on your schedule - because the world needs serious privacy.</p><p><br>Follow us on BlueSky (<a href=\"http://seriousprivacy.eu\">@seriousprivacy.eu</a>) or <a href=\"https://www.linkedin.com/company/seriousprivacy/\">LinkedIn</a></p>",
        "id": 546954,
        "author": "Dr. K Royal, Paul Breitbarth & Ralph O'Brien"
    },
    {
        "title": "Rock Stock Channel",
        "url": "https://feed.podbean.com/rockstockchannel/feed.xml",
        "description": "Rock Stock Channel™ is a vibrant and engaging look at the mining and chemical industry supplying the lithium-ion battery-fuelled disruption of the Transportation and Utility industries.",
        "id": 633474,
        "author": "rockstockchannel"
    },
    {
        "title": "Social Proof Podcast",
        "url": "https://feeds.redcircle.com/a9b2dcd3-056f-4771-a45c-257dfa7193fc",
        "description": "The Social Proof Podcast is hosted by David Shands Entrepreneur and Founder of Sleep is 4 Suckers. David has been an authority in the entrepreneurship arena helping individuals make the transition from their job to their dream for years, since he's done it himself in 2012. David has a very unique ability to see the holes in your business and show you step -by - step how to patch them with easy to apply strategies. The objective of this coaching program is to help you build, market, and monetize your ideas, not by motivation, but with a money map!",
        "id": 680167,
        "author": "Social Proof Network"
    },
    {
        "title": "Comic Lab",
        "url": "https://feeds.simplecast.com/GAaIUAjz",
        "description": "The podcast about making comics — and making a living from comics! It's half shop talk, half how-to, and half friendship. WE SQUEEZED IN THREE HALVES. It's tips and tricks and all the joys of cartooning as a pro. So pull up your drawing chair, put on some headphones, and join us while you draw! And if you like what you hear, join our community at patreon.com/comiclab (For sponsorship inquiries: comiclabpodcast@gmail.com)",
        "id": 687123,
        "author": "Brad Guigar and Dave Kellett"
    },
    {
        "title": "The Smoking Tire",
        "url": "https://feeds.simplecast.com/c2RzTGta",
        "description": "Matt Farah and Zack Klapman sit down with automotive icons, pro drivers, comedians and other friends to discuss automotive industry news, racing, projects and whatever else comes to mind. \nWatch our car reviews at www.youtube.com/thesmokingtire\nFollow us!\nT: @thesmokingtire @zackklapman \nIG: @thesmokingtire @fakezackklapman \nRent or buy our movies!, where we find out if some bad CraigsList cars can cross an entire US State, off-road!https://vimeo.com/thesmokingtire",
        "id": 745200,
        "author": "Zack Klapman, Matt Farah"
    },
    {
        "title": "The SaaS Podcast - SaaS, Startups, Growth Hacking & Entrepreneurship",
        "url": "https://feeds.megaphone.fm/AHARO1075645324",
        "description": "<p>The SaaS Podcast - In-depth interviews with proven entrepreneurs and startup founders. Actionable insights to help you build, launch and grow your SaaS business</p>",
        "id": 745390,
        "author": "Omer Khan"
    },
    {
        "title": "The Dan Le Batard Show with Stugotz",
        "url": "https://feeds.megaphone.fm/ESP2298543312",
        "description": "<p>From the Elser Hotel in Downtown Miami, Dan Le Batard, Stugotz and company share their unique perspectives on all-things sports, pop-culture and more. This is the place for original content from Le Batard and Stugotz, including the daily “Local Hour” generally focusing on the South Florida scene, the Big Suey, and a few more surprises along the way.</p>",
        "id": 745415,
        "author": "Dan Le Batard, Stugotz"
    },
    {
        "title": "TSP怪奇档案",
        "url": "http://www.ximalaya.com/album/19206387.xml",
        "description": "<p style=\"font-size:16px;line-height:30px;font-family:Helvetica, Arial, sans-serif;color:#333333;font-weight:normal;text-align:justify;\" data-flag=\"normal\">《TSP怪奇档案》（The Strange Profile）是一档集合了科幻 / 野史 / 中外神话 / 都市传说 等题材于一身的强趣味，强科普性质的脱口秀节目。由《凹凸电波》原班人马共同打造，希望在带给你冷门科普的同时，让你获得更多有趣的谈资。<br /><br /><span>本节目由播客厂牌——凹凸宇宙出品</span><br /><br />weibo：凹凸电波<br />攻种号：凹凸电波<br /><span>商务联系：aotu_hezuo@163.com</span><br /></p>",
        "id": 877353,
        "author": "TSP怪奇档案"
    },
    {
        "title": "Le Batard & Friends - South Beach Sessions",
        "url": "https://feeds.megaphone.fm/ESP3822573043",
        "description": "<p><em>There's way more behind the biggest and most beloved personalities from sports, music, comedy and more... all it takes is longtime host and reporter Dan Le Batard revealing more about himself than ever before too. </em>South Beach Sessions is the cr<em>itically acclaimed </em>flagship podcast in the LeBatard and Friends Podcast Network. <em>These one-on-one conversations aren't the same old, boring sitdowns - there's no success story without some struggle, no laughs without a few tears, and no questions left unanswered by Dan who gets past what you've already heard and into more with Dan Le Batard. </em></p>",
        "id": 1017726,
        "author": "Dan Le Batard, Stugotz"
    },
    {
        "title": "Massive Agent Podcast",
        "url": "https://feeds.buzzsprout.com/147449.rss",
        "description": "<p>The <b>Massive Agent Podcast</b>, hosted by <b>Dustin Brohm</b>, is the go-to resource for entrepreneurial real estate agents & mortgage loan officers determined to escape the daily real estate grind and instead build a thriving, scalable business. If you’re a burned-out solo agent wanting to make more money, sell more homes, work fewer hours, and gain leverage, this podcast is your roadmap.</p><p><br></p><p>Realtors deserve to define their ideal lifestyle and build a business to support it—not the other way around. The Massive Agent Podcast equips you with the mindset, strategies, and systems to make that vision a reality.</p><p><br></p><p><b>Dustin Brohm</b>, one of the most recognized voices in real estate, brings you actionable insights and proven tactics to create freedom in your career. As host of the <b>Massive Agent Podcast</b>, a finalist for the <b>Inman Innovator of the Year award</b>, Dustin is a sought-after speaker who’s shared stages with industry giants at events like <b>Gary Vaynerchuk’s Agent2021, eXpCon, Inman Connect, HousingWire,</b> and more. With a sales organization of over <b>650 agents across 25 states</b>, Dustin is a proven expert in building successful real estate businesses.</p><p><br></p><p>This podcast goes beyond social media and lead generation tips—though you’ll get plenty of those, too. Dustin dives deep into CEO-level thinking, scalable systems, and strategies for creating a business that supports your life. Whether you’re starting a team, streamlining operations, or unlocking new revenue streams, you’ll get the tools and inspiration to achieve more with less.</p><p><br></p><p>As founder of the <b>Massive Agent Society</b>, a business-building incubator for agents, Dustin is dedicated to helping real estate professionals stop grinding and start growing. Part of the <b>Broke Agent Media network</b>, the podcast delivers fresh, actionable content weekly to empower agents to scale, thrive, and lead in today’s competitive market.</p><p><br></p><p><b>Subscribe now and redefine what’s possible in real estate.</b></p>",
        "id": 1018554,
        "author": "Dustin Brohm"
    },
    {
        "title": "The House of Pod",
        "url": "https://feeds.acast.com/public/shows/64e5149d04052a00118086ea",
        "description": "<p>Humor-adjacent medical podcast hosted by a GI doc and friends. Putting the “fun” back in mfunedicine.</p><br><p>Contact us at hopquestions@gmail.com and rate and review us at iTunes!</p><hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 1025528,
        "author": "Kaveh MD"
    }
]