[
    {
        "title": "The Lunatic Fringe Podcast",
        "url": "https://podcast.thefuckinpilot.net/feed.xml",
        "description": "Step into the void with The Pilot from Blue Skies Magazine as he talks to some of the worlds premiere as well as lesser known extreme air sports athletes to get their take on living life to the fullest, their paths along the “Lunatic Fringe” and how they fit into the mainstream world while living life on the dark side.",
        "id": 853864,
        "author": "The Pilot"
    },
    {
        "title": "David Bombal",
        "url": "https://feeds.soundcloud.com/users/soundcloud:users:599643036/sounds.rss",
        "description": "Want to learn about IT? Want to get ahead in your career?  Well, this is the right place! \nOn this channel, I discuss Python, Ethical Hacking, Networking, Network Automation, CCNA, Virtualization and other IT related topics.\n   \nThis YouTube channel has new videos every week! Subscribe for technical, detailed, no fluff content.\nDavid’s details:\nDiscord: https://discord.com/invite/usKSyzb\nTwitter: https://www.twitter.com/davidbombal \nInstagram: https://www.instagram.com/davidbombal \nLinkedIn: https://www.linkedin.com/in/davidbombal \nFacebook: https://www.facebook.com/davidbombal.co \nWebsite: http://www.davidbombal.com  \nYouTube: https://www.youtube.com/davidbombal \nAll the best!\nDavid",
        "id": 5315180,
        "author": "David Bombal"
    },
    {
        "title": "108.9 The Hawk with Jason Gore and Geoff Garlock",
        "url": "https://feeds.acast.com/public/shows/683fc7e2f711091cf43b8603",
        "description": "<p>Welcome to <strong>108.9 The Hawk</strong>, Val Verde’s only classic rock station. Hosted by Jason Gore and Geoff Garlock and featuring your favorite comedians, The Hawk keeps classic rock alive… on a dying medium.</p><br><p>108.9 The Hawk is a comedy podcast and loving parody of classic rock radio.</p><hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 4481047,
        "author": "Jason Gore and Geoff Garlock"
    },
    {
        "title": "Weltwoche Daily",
        "url": "https://feeds.acast.com/public/shows/6270efa390efae00152faf31",
        "description": "«Weltwoche Daily» – jetzt als Podcast für unterwegs. Steigen Sie ein, hören Sie mit! <a href=\"https://weltwoche.ch/\" rel=\"noopener noreferrer\" target=\"_blank\">www.weltwoche.ch</a><hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 5577362,
        "author": "Weltwoche"
    },
    {
        "title": "Persian News - NHK WORLD RADIO JAPAN",
        "url": "http://www3.nhk.or.jp/rj/podcast/rss/persian.xml",
        "description": "This is the latest news in Persian from NHK WORLD RADIO JAPAN. This service is daily updated. For more information, please go to https://www3.nhk.or.jp/nhkworld/.",
        "id": 760743,
        "author": "NHK WORLD-JAPAN"
    },
    {
        "title": "Talking Lead Podcast",
        "url": "https://talkinglead.libsyn.com/rss",
        "description": "Talking Lead is a pro 2nd amendment, pro United States Of America show that demonstrates the immense diversity within the outdoor community.  Interviews include people, products & companies not only from within but from outside the industry.  Topics are as wide and diverse as you can imagine.  Talking Lead keeps the content fun, educational, upbeat and positive by discussing product, people, places and event, keeping politics to a minimum.\nSocial Media is: @talkinglead #talkinglead Website is: www.talkinglead.com \n\nTalking Lead LLC Contact Details\nEmail: talkinglead@gmail.com\nWebsite: www.talkinglead.com",
        "id": 2445317,
        "author": "Talking Lead"
    },
    {
        "title": "Call Me Back - with Dan Senor",
        "url": "https://feeds.simplecast.com/5gzMlOG1",
        "description": "Presenting the challenges and dilemmas facing Israelis to a global audience.",
        "id": 1366374,
        "author": "Ark Media"
    },
    {
        "title": "Talking Lead Podcast",
        "url": "http://feeds.feedburner.com/TalkingLead",
        "description": "Talking Lead is a pro 2nd amendment show that demonstrates the immense diversity and inclusion within the outdoors community.  Interviews include people, products & companies not only from within but outside the industry.  Topics are as wide and diverse as you can imagine.  Talking Lead keeps the content fun, educational, upbeat and positive by keeping politics to a minimum.  Social Media: @talkinglead #talkinglead Website: www.talkinglead.com",
        "id": 1013106,
        "author": "Talking Lead LLC"
    },
    {
        "title": "Talking Lead Podcast",
        "url": "https://www.talkinglead.com/feed/podcast/",
        "description": "Talking Lead is a pro 2nd amendment show that demonstrates the immense diversity within the firearms community.  Interviews include people, products & companies not only from within the outdoors industry but from outside the outdoors industry as well.  Topics are as wide and diverse as you can imagine.  Talking Lead keeps the content fun, educational, upbeat and positive by discussing guns, knives, gear, hunting, cooking, training, music, movies, pop culture & leisure activities.  Social Media is: @talkinglead Website is: www.talkinglead.com  https://www.talkinglead.com/",
        "id": 1634596,
        "author": "Talking Lead"
    },
    {
        "title": "That Horror Movie Podcast",
        "url": "https://media.rss.com/thathorrormoviepodcast-yt/feed.xml",
        "description": "<p>Join Pat & Brett for That Horror Movie Podcast! Live every Sunday night at 8pm EST on YouTube! Each week we have a main topic of discussion, beer review, updates on our collection, movie review, what we watched that week, a collectible spotlight from each of our collections, and a Top 5 topic!! Lots of fun!</p><p>Pat, That Halloween Movie Collector YouTube Channel:</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.youtube.com/@thathalloweenmoviecollector/community\">https://www.youtube.com/@thathalloweenmoviecollector/community</a></p><p>Instagram:</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.instagram.com/that.halloween.movie.collector/\">https://www.instagram.com/that.halloween.movie.collector/</a></p>",
        "id": 6567489,
        "author": "Pat & Brett"
    },
    {
        "title": "2 Guys 1 Screen",
        "url": "https://feeds.zencastr.com/f/3l7J12v8.rss",
        "description": "Nick & Gerald review new and fan requested movies\nEmail the pod at 2guys1screenpod@gmail.com\n",
        "id": 7022369,
        "author": "Nick Ranni"
    },
    {
        "title": "Ultra Green Alex Jones",
        "url": "https://www.spreaker.com/show/6600939/episodes/feed",
        "description": "Alex Jones is above Evergreen, he's ULTRA GREEN. These episodes go all the way back to 1997.",
        "id": 7305380,
        "author": "Ultra Green AJ"
    },
    {
        "title": "High Vibe Table Talks: Empowering Solopreneurs",
        "url": "https://feeds.megaphone.fm/MOZAM2950181850",
        "description": "<p>This is the podcast for heart-centered women entrepreneurs who are ready to grow their impact, build aligned businesses, and stay rooted in what truly matters. Hosted by a fellow dream-chaser and doer, High Vibe Table Talks is about what it actually takes to show up, stand out, and stay in motion—without burning out.</p><p>Each week, we pull up a seat for high-vibe conversations on mindset, sales, self-leadership, and the real behind-the-scenes of building a business that feels good and works. Through honest solo episodes, powerful guest interviews, and relatable stories, you’ll feel seen, supported, and inspired to take aligned action—because clarity comes through movement, confidence grows through action, and your energy is your greatest asset.</p><p>This isn’t about hustle culture. It’s about heart, intention, and building something sustainable that honors you.</p><p>Here at the High Vibe Table we take big dreams and break them into small action steps that can transform your life. New Episodes every Wednesday on the JazzCast Pros Podcast Network.</p><p><br></p><p>Sponsored by: <a href=\"www.highvibecowork.com\">High Vibe Cowork </a></p><p>About the Host:</p><p>Merchon Hargrave isn’t just an entrepreneur—she’s a guide for ambitious women who are building something bigger than themselves. With a background in sales and business growth, Merchon has helped countless women navigate the ups and downs of entrepreneurship, blending practical strategy with the mindset shifts necessary to keep moving forward. Through mentorship and community, she creates a safe space where women can be vulnerable, find clarity, and transform their dreams into reality.</p><p><br></p><p>Follow us on Instagram <a href=\"https://www.instagram.com/highvibecowork\">@HighVibeCoWork</a></p><p>LinkedIn:<a href=\"https://www.linkedin.com/in/merchon-hargrave-8b606460/\"> Merchon Hargrave</a></p><p><br></p><p>Music: The Greatest by All Good Folks</p><p>Wanderer by Aylex, Weekend Livin’ by Konstantin Garbuzyuk</p><p>Produced + Edited by <a href=\"www.JazzCastPros.com\">JazzCast Pros</a></p><p><br></p><p><br></p><p>#SmallBusiness #Entrepreneur #HighVibes #CoWorking #Mastermind</p>",
        "id": 6440145,
        "author": "Merchon Hargrave"
    },
    {
        "title": "You Are Not So Smart",
        "url": "https://feeds.simplecast.com/N5eKDxJI",
        "description": "You Are Not So Smart is a show about psychology that celebrates science and self delusion. In each episode, we explore what we've learned so far about reasoning, biases, judgments, and decision-making.",
        "id": 756368,
        "author": "You Are Not So Smart"
    },
    {
        "title": "Two Grumpy Vets and a Duuude",
        "url": "https://serve.podhome.fm/rss/6d610788-42f7-4cc8-9184-7e651cf101e2",
        "description": "This show is about two grumpy vets and a duuude who became friends and have been talking once a week for the last 4 or 5 years. These conversations result in many rabbit holes being chased. Finally, in our infinite wisdom, we decided to share this with you. To let you know that you can find someone to talk to about anything and still maintain your manly attitude.\n\nThis show will talk about real subjects and real life, if that offends you, then change the channel. We are Podcast 2.0 compliant using the value-for-value model. So take a break and listen to 2 Grumpy Vets and a Duuude, solve the world's problems...and get nowhere!",
        "id": 6875853,
        "author": "Richard Chelson and Bryan Goodwin"
    },
    {
        "title": "Everyday Orthodox",
        "url": "http://feeds.ancientfaith.com/EverydayOrthodox",
        "description": "How well do we know the people beside us at liturgy? Every one of them has a story to tell! Live on Sunday's at 6:00pm Central/7:00pm Eastern.",
        "id": 60708,
        "author": "Elissa Bjeletich Davis, and Ancient Faith Ministries"
    },
    {
        "title": "PhotoActive",
        "url": "https://feeds.fireside.fm/photoactive/rss",
        "description": "Jeff Carlson and Kirk McElhearn discuss photography and the Apple ecosystem. We cover using an iPhone or any other camera with Apple hardware and software, and we welcome photographers to discuss their work.",
        "id": 68647,
        "author": "Jeff Carlson & Kirk McElhearn"
    },
    {
        "title": "Farm4Profit Podcast",
        "url": "https://feeds.simplecast.com/NQG_ZnDw",
        "description": "Our mission is to provide farms and operators an independent and unbiased outlet for information related to increasing the profitability of their farming operation. We will be providing farms and operators of all sizes and experience levels access to the latest trends, projections, and the tools necessary to increase farming profitability.   We will take each episode to deliver latest news, what's working for active farms, and a topic of focus each episode.  Remember, if you aren't farming for profit you won't be farming for long.",
        "id": 88385,
        "author": "David Whitaker, Corey Hillebo, Tanner Winterhof"
    },
    {
        "title": "ChooseFI",
        "url": "https://choosefi.libsyn.com/rss",
        "description": "How would your life change if you reached Financial Independence and got to the point where working is optional? What actions can you take today to make that not just possible but probable. Jonathan & Brad explore the tactics that the FI community uses to reclaim decades of their lives. They discuss reducing expenses, crushing debt, tax optimization, building passive income streams through online businesses and real estate and how to travel the world for free. Every episode is packed with actionable tips and no topic is too big or small as long as it speeds up the process of reaching financial independence.",
        "id": 203527,
        "author": "ChooseFI"
    },
    {
        "title": "Getting Better with Jonathan Van Ness",
        "url": "https://feeds.megaphone.fm/gettingcurious",
        "description": "Join Jonathan Van Ness (Queer Eye) each week for their next exciting endeavor! “Getting Better with Jonathan Van Ness\" is here to  empower listeners (and also make them laugh) by using curiosity as a tool for personal growth. In a world that often feels overwhelming—where it’s easy to feel stuck, frustrated, or helpless—Getting Better offers a lifeline. Each week, Jonathan Van Ness, alongside experts and thought leaders, guides us through our shared challenges—confidence, productivity, mental health, happiness, relationships, and more—helping us emerge thriving, invigorated, and most importantly - a little bit better. \nJoin us every Wednesday for brand new episodes, and catch full video episodes on YouTube! And tune in every Monday for brand new episodes of our companion show: The Monday Edit, where JVN and senior producer Chris giving you a behind the scenes look at the creation of Getting Better, hot takes on today’s headlines, and all in all share with you how the sausage gets made! \nCurious about bringing your brand to life on the show? Email podcastsales@sonymusic.com ",
        "id": 217073,
        "author": "Sony Music Entertainment / Jonathan Van Ness"
    },
    {
        "title": "How Leaders Lead with David Novak",
        "url": "https://feeds.megaphone.fm/howleaderslead",
        "description": "<p>How Leaders Lead gives you a front-row seat to exclusive conversations with the world’s most iconic leaders across business, sports, and entertainment. Hosted by David Novak, Co-founder and former CEO of Yum! Brands, this podcast pulls back the curtain on how top CEOs, founders, and game-changers make things happen. When you tune in, you’ll learn from legends like Tom Brady, Condoleezza Rice, Jamie Dimon, Coach Prime (Deion Sanders), Indra Nooyi, Stanley Druckenmiller, and more.</p><p>Other guests include:</p><ul>\n<li>CEO of Starbucks</li>\n<li>CEO of Target</li>\n<li>Co-founder of Home Depot</li>\n<li>and many others...</li>\n</ul><p><br></p><p>David’s unique perspective and thought-provoking questions distill the wisdom of these leaders into actionable insights you can use to elevate your own leadership game. Whether you’re just starting your leadership journey or already leading teams, this show helps you build the confidence you need to lead well.</p>",
        "id": 223023,
        "author": "David Novak"
    },
    {
        "title": "Sacred Symbols: A PlayStation Podcast",
        "url": "http://feeds.feedburner.com/SacredSymbolsAPlaystationPodcast",
        "description": "<p>Sacred Symbols: A PlayStation Podcast is the internet's premiere weekly PlayStation show dedicated to coverage of PS5, PS4, PSVR2, and Sony's deep gaming legacy stretching back to the mid-'90s. Join 20+ year gaming industry veteran and PlayStation brand expert Colin Moriarty -- along with his co-hosts comedian Chris Ray Gun and producer Dustin Furman -- as they go through the news of the week, highlight the best recent games, and interact with their incredibly loyal audience, all without taking anything too seriously. New episodes post each and every Monday. To get early access to each episode, join thousands and thousands of your fellow listeners by supporting the show on Patreon at <a href=\"https://nam04.safelinks.protection.outlook.com/?url=http%3A%2F%2Fpatreon.com%2Flaststandmedia&data=05%7C02%7Ccamille.khalili%40studio71us.com%7Cbfb691d7b47d40b03e8608dc42bb470f%7C42f71e00fe2746549915ab529795f091%7C0%7C0%7C638458619344425473%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C0%7C%7C%7C&sdata=Y11QPBwHAsOhPmpvLNHWDnhIPDsQQ%2FhkDf4QSN%2BAFnk%3D&reserved=0\">patreon.com/laststandmedia</a></p><p><br></p><p>We wanna make the podcast even better, help us learn how we can: <a href=\"https://bit.ly/2EcYbu4\">https://bit.ly/2EcYbu4</a> </p><p>For advertising opportunities please email <a href=\"mailto:PodcastPartnerships@Studio71us.com\">PodcastPartnerships@Studio71us.com</a>   </p><p>Privacy Policy: <a href=\"https://www.studio71.com/us/terms-and-conditions-use/#Privacy%20Policy\">https://www.studio71.com/us/terms-and-conditions-use/#Privacy%20Policy</a></p>",
        "id": 234431,
        "author": "Last Stand Media & Studio71"
    },
    {
        "title": "Drag Her! A RuPaul's Drag Race Podcast",
        "url": "https://feeds.megaphone.fm/IMP8716330518",
        "description": "<p>Welcome to the INTERNET'S ONLY Drag Race podcast! Comedians and self-proclaimed Drag Race her-storians Mano Agapion and Oscar Montoya dive deep into the latest episodes of RuPaul’s Drag Race every single week for your gag-ger-taint-ment, with a heavy focus on laughs above accuracy. </p><p><br></p><p>Joined by special guests like Rachel Bloom and Nicole Byer as well as former contestants like BenDeLaCreme & Peppermint, this pod is TRULY walking children in nature! You will be obsessed with this pod's deranged observations about the queens, the lip syncs, and each other.</p><p><br></p><p>BUT THAT'S NOT ALL: We’re continuing the queer pop culture kiki on Patreon! We’re covering drag beyond the Main Stage, queer pop culture, and so much more. Head to <a href=\"patreon.com/dragherpodcast\">patreon.com/dragherpodcast</a> to join the DragHerd.</p>",
        "id": 239805,
        "author": "Good Get"
    },
    {
        "title": "Joyce Meyer Enjoying Everyday Life® TV Audio Podcast",
        "url": "https://jmtvaudio.libsyn.com/rss",
        "description": "Enjoying Everyday Life® is a daily TV and radio broadcast provided by Joyce Meyer Ministries.",
        "id": 309514,
        "author": "Joyce Meyer"
    },
    {
        "title": "Your Kickstarter Sucks",
        "url": "https://rss.art19.com/your-kickstarter-sucks",
        "description": "<p>Mike Hale and Jesse Farrar comb through the crowdfunding dumpster to tell you what projects are worth supporting with your hard-earned dollar. So far, it's been absolutely nothing, but whether it's a social media website for dogs, a toilet brush that reminds you to drink more water, or 5,000 offensive card games, maybe something will eventually be good!</p>",
        "id": 325835,
        "author": "Jesse Farrar & Mike Hale"
    },
    {
        "title": "Where Should We Begin? with Esther Perel",
        "url": "https://feeds.megaphone.fm/ep-wswb",
        "description": "<p>Every Monday morning step into the office of iconic psychotherapist Esther Perel and listen in as real people in search of insight bare the raw, intimate, and profound details of their stories. From breakups and open relationships to workplace conflicts and fractures in the family, it’s a place to hear our own stories reflected in the lives of others. So…where should we begin?<em> Part of the Vox Media Podcast Network.</em></p>",
        "id": 326964,
        "author": "Esther Perel Global Media"
    },
    {
        "title": "Walk With The King Podcast",
        "url": "https://feeds.buzzsprout.com/976447.rss",
        "description": "Broadcast for decades on AM/FM across the world, Walk With The King is now available wherever you find your podcasts. A rebroadcast of original radio archives from Dr. Robert A Cook, Walk With The King Podcast aims to help people around the globe \"put a handle\" on God's Word in simple, practical, everyday ways. A production of Walk With The King Inc. To support this podcast, please www.walkwiththeking.org/donate ",
        "id": 363417,
        "author": "Walk With The King Inc."
    },
    {
        "title": "Joel Osteen Podcast",
        "url": "https://feeds.simplecast.com/_IGBdGdB",
        "description": "Welcome to the Joel Osteen Daily Podcast. \nJoel & Victoria Osteen inspire people to reach their dreams, find fresh beginnings and live their best life. \nBoth he and Victoria live in Houston, TX. \nVisit Joel’s website at joelosteen.com.\nSubscribe to SiriusXM Podcasts+ to listen to new episodes of the Joel Osteen Podcast ad-free and a whole week early. \nStart a free trial now on Apple Podcasts or by visiting siriusxm.com/podcastsplus.",
        "id": 396565,
        "author": "Joel Osteen, SiriusXM"
    },
    {
        "title": "The Intermittent Fasting Podcast",
        "url": "https://feeds.megaphone.fm/MAI7149670930",
        "description": "<p>Burn fat, gain energy, and enhance health by changing WHEN you eat, not WHAT you eat! Explore the intermittent fasting (IF) lifestyle, with Melanie Avalon - biohacker, founder of <a href=\"https://avalonx.us/\">AvalonX</a>, and author of <a href=\"http://amzn.to/2tKEAuI\">What When Wine Diet: Lose Weight And Feel Great With Paleo-Style Meals, Intermittent Fasting, And Wine</a> - and Barry Conrad - actor, singer-songwriter, and creator and host of <a href=\"https://podcasts.apple.com/us/podcast/banter-with-bc/id1743298020\">Banter with BC</a>. </p>",
        "id": 414095,
        "author": "Melanie Avalon, Barry Conrad"
    },
    {
        "title": "The Motivated Mind",
        "url": "https://feeds.simplecast.com/KNKePods",
        "description": "I'm Scott Lynch, host of The Motivated Mind, a Spotify top 100 Health & Fitness podcast with over 6 million downloads. Each week, I bring you practical and tactical insights on how to master your mindset and optimize your happiness. No fluff, no BS, no filter, just a swift kick in the mind. If you like learning about things like philosophy, psychology, lifestyle hacks, entrepreneurship, or dodging existential dread, then you're in the right place.",
        "id": 440461,
        "author": "Scott Lynch"
    },
    {
        "title": "The Diary Of A CEO with Steven Bartlett",
        "url": "https://feeds.megaphone.fm/thediaryofaceo",
        "description": "<p>Steven Bartlett is a British entrepreneur, investor, and author. He’s the founder of Flight Story – a media company – and Flight Fund, an investment fund backing the next generation of category-defining businesses.</p><p>He created The Diary Of A CEO to share the unfiltered pages of the personal diaries of the world’s most fascinating CEOs, experts, therapists, and leaders – with the hope that their lessons will help both you and him live better lives. </p><p>DOAC is a double acronym: Diary Of A CEO, but also Dreamers, Open-minded, Awareness, and Connection.This is your corner of the internet to dream boldly, think openly, expand your awareness, and feel more connected.</p><p><br></p><p>My New Book: <a href=\"https://g2ul0.app.link/DOAC\">https://g2ul0.app.link/DOAC</a></p><p>IG: <a href=\"https://www.instagram.com/steven\">https://www.instagram.com/steven</a></p><p>LI: <a href=\"https://www.linkedin.com/in/stevenbartlett-123\">https://www.linkedin.com/in/stevenbartlett-123</a></p>",
        "id": 499394,
        "author": "DOAC"
    },
    {
        "title": "Happy Homebirth",
        "url": "https://feed.podbean.com/podcast.myhappyhomebirth.com/feed.xml",
        "description": "The Happy Homebirth podcast is your source for positive natural childbirth stories, and your community of support, education and encouragement in all things homebirth and motherhood. This podcast takes a deep dive into the the authentic stories of mothers who have given birth (usually) at home, as well as the care providers who tend to them.  Although typically upbeat and fun, Happy Homebirth is unabashedly unafraid to examine the rawness, the pain and the struggle of some birthing situations.  Host Katelyn Fusco is a former student midwife, who joyously shares her experiences and provides a space for her guests to share theirs as well.  From pre-conception to pregnancy, to postpartum and beyond, Happy Homebirth is a podcast that focuses on how victorious birthing mothers are from around the globe and encourages you to have a magical birthing experience. To learn more, head over to www.myhappyhomebirth.com",
        "id": 524448,
        "author": "Katelyn Fusco"
    },
    {
        "title": "The Horror Virgin",
        "url": "https://rss.art19.com/the-horror-virgin",
        "description": "<p>What’s your favorite scary movie? Are you a fanatic or a fraidy-cat? Either way, we’ve got you covered. Each week, horror fan Paige will take Horror Virgin Todd through the encyclopedia of horror one movie at a time. We’ll discuss classics as well as fan favorites, with the occasional new release thrown in for good measure. Mikey will make inappropriate jokes and Todd will scream like a little girl at every jump scare. It’s hilarious. Prepare yourself for spoilers, tangents, and lots of irreverent fun. Follow us on Facebook, Twitter, and Instagram at @HorrorVirgin</p>",
        "id": 527993,
        "author": "The Horror Virgin"
    },
    {
        "title": "The Gray Area with Sean Illing",
        "url": "https://feeds.megaphone.fm/theezrakleinshow",
        "description": "<p>The Gray Area with Sean Illing takes a philosophy-minded look at culture, technology, politics, and the world of ideas. Each week, we invite a guest to explore a question or topic that matters. From the the state of democracy, to the struggle with depression and anxiety, to the nature of identity in the digital age, each episode looks for nuance and honesty in the most important conversations of our time. New episodes drop every Monday. From the Vox Media Podcast Network.</p>",
        "id": 548874,
        "author": "Vox"
    },
    {
        "title": "The Southern Outdoorsmen Hunting Podcast",
        "url": "https://feeds.megaphone.fm/TSOL7101221778",
        "description": "<p>Your go-to Deer Hunting Podcast! The Southern Outdoorsmen is a show dedicated to diving deep on the topics that will make you a better hunter. We interview guys who are the \"real deal\", the best hometown deer hunters across the country - the guys who have consistent success deer hunting the same public lands, leases, hunting clubs, or family farms as everyone else. Every Monday we post an episode with fresh tips, tactics and strategies to give you an edge in the woods this fall.</p>",
        "id": 559331,
        "author": "Andrew Maxwell & Jacob Myers"
    },
    {
        "title": "Only in OKlahoma Show",
        "url": "Https://onlyinok.libsyn.com/rss",
        "description": "Howdy Y’all…just kidding!  Welcome to our page.  We are the Only in Oklahoma Show, where you can hear about travel and entertainment in the Great State of Oklahoma.  Our sole purpose is to shine a light on some of the people, places and stories that make Oklahoma, more than just “OK”.  In fact, Oklahoma is one of the most underrated travel destinations in the country even by some of the locals.  \nPowered by award winning podcasters (2018 Podcast Award – Society and Culture), Harley C. and Brett Manzer.\nTune into the Only in Oklahoma Show to hear interviews, news and reviews about Oklahoma’s best restaurants, hotels, festivals, museums, outdoor activities, breweries, rodeos, concerts, casinos, Route 66, and more (literally this list is endless).  If it’s fun and in Oklahoma, we will be talking about it.  We will also be covering some not so topics, like bureaucrats, bridges, toll booths and taxes.  If it affects your bottom line or your lake time, we will be cussin’ and discussin’.\nIf you are joining us from the Odd Pod, some things never change.  Manzer and Harley will be trying to make you laugh while dropping some knowledge about the places we cover.  Don’t worry, we will still be covering the occasional red-dirt ghost story, cryptid, and UFO conspiracy…as long as it is north of the Red River (BOOMER!).\nBoots and straps and cowboy hats are optional.  Welcome to the Only in Oklahoma Show!",
        "id": 606539,
        "author": "Harley Covington and Brett Manzer"
    },
    {
        "title": "Financial Freedom with Real Estate Investing",
        "url": "https://feeds.captivate.fm/financial-freedom-real-estate-investing/",
        "description": "The Financial Freedom with Real Estate Investing podcast is about helping you achieve financial independence and control your time through apartment building investing. Michael Blank interviews experts in real estate, business, and investing.  From learning how to invest in multifamily real estate to navigating entrepreneurship, you will learn the keys to success in your journey towards financial freedom. Previous guests include Grant Cardone, Robert Kiyosaki, Ken McElroy, Robert Helms, Brandon Turner, and Hal Elrod. Whether you're new to real estate investing or a seasoned investor, you'll enjoy stories from our expert guests as well as hear from people who quit their jobs and are living life on their own terms because of investing in multifamily real estate. Thanks for listening and leave a review for a chance to get a shout-out on the show.",
        "id": 739376,
        "author": "Michael Blank"
    },
    {
        "title": "Everything Electric Podcast",
        "url": "https://fullychargedshow.libsyn.com/rss",
        "description": "Robert Llewellyn (Red Dwarf, Scrapheap Challenge) hosts a podcast about sustainability, eco-news and interviews from around the globe. Filled with interesting stories, almost breaking news, a pinch of wit and a dash of banter. A few guests who know what is going on in the world of EVs, renewable energy and sustainability.",
        "id": 743602,
        "author": "The Fully Charged Show"
    },
    {
        "title": "Joyce Meyer Enjoying Everyday Life® TV Podcast",
        "url": "https://jmmtvsd.libsyn.com/rss",
        "description": "Welcome to the Enjoying Everyday Life TV podcast with Joyce Meyer. To learn more, visit our website at joycemeyer.org or download the Joyce Meyer Ministries App. \n\nBy supporting Joyce Meyer Ministries, you can help us reach hurting people around the world. To find out more, go to joycemeyer.org/donate",
        "id": 765322,
        "author": "Joyce Meyer"
    }
]