[
    {
        "title": "DNVR Denver Broncos Podcast",
        "url": "https://feeds.simplecast.com/w3d46li7",
        "description": "The daily Denver Broncos podcast is hosted by credentialed journalists, insiders, and analysts Zac Stevens, Ryan Koenigsberg, and Henry Chisholm. Stay locked in with breaking news, expert analysis, and exclusive interviews covering Sean Payton, Bo Nix, Patrick Surtain II, and the latest Broncos storylines. With regular appearances from special guests and current Broncos players, DNVR Broncos is the #1 live podcast for Broncos fans worldwide—broadcasting LIVE, daily from the DNVR Bar in downtown Denver.",
        "id": 600079,
        "author": "ALLCITY Network, DNVR Sports"
    },
    {
        "title": "Contra Radio Network",
        "url": "https://www.spreaker.com/show/3522111/episodes/feed",
        "description": "A podcast and radio show for people who are preppers and patriots, where their needs and concerns are discussed and addressed.",
        "id": 1618225,
        "author": "john jeffers"
    },
    {
        "title": "Decouple",
        "url": "https://anchor.fm/s/23775178/podcast/rss",
        "description": "There are technologies that decouple human well-being from its ecological impacts. There are politics that enable these technologies. Join me as I interview world experts to uncover hope in this time of planetary crisis.",
        "id": 139643,
        "author": "Dr. Chris Keefer"
    },
    {
        "title": "The Exchange",
        "url": "https://feeds.simplecast.com/tc4zxWgX",
        "description": "\"The Exchange\" on CNBC is a one-stop shop for the day's top business stories, along with breaking news and the must-see market movers heading into the back half of the trading day. This newsroom-based program also features lots of original reporting, in-depth conversations and showcases CNBC's award-winning investigative work.",
        "id": 431205,
        "author": "CNBC"
    },
    {
        "title": "The Vault: A Podcast Covering the Baltimore Ravens",
        "url": "https://feeds.simplecast.com/FLv6o1WR",
        "description": "Welcome into the The Vault, where Bobby Trosset and Sarah Ellison cover all things Baltimore Ravens.\nHere’s what you can expect from the show:\nYou can wake up with us each day with the Morning Ravens Vault which is where you receive the most important Ravens news, in just 15 minutes. \nSarah and Bobby provide analysis throughout the week on the most pressing Ravens topics. And, they'll also have interviews with Ravens personnel. \n \nWe’re making you a promise: we are unlocking the Ravens vault and delivering any and all valuable team-related information.\nInterested in reaching out to the show? Hit us up: BaltimoreRavensVault@gmail.com\nThe Vault is not affiliated with the Baltimore Ravens' organization.",
        "id": 5593240,
        "author": "Blue Wire"
    },
    {
        "title": "Locked On Reds - Daily Podcast On The Cincinnati Reds",
        "url": "https://feeds.simplecast.com/zGyYJJga",
        "description": "Locked On Reds podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Cincinnati Reds and Major League Baseball. Hosted by Jeff Carr and Steven Offenbaker, the Locked On Reds podcast provides your daily Reds fix with expert, local analysis, and coverage of all aspects of the Reds franchise. Locked On Reds takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Reds locker room and all over MLB. The Locked On Reds podcast is part of the Locked On Podcast Network. Your Team. Every Day.Andrew Abbott, Graham Ashcraft, Alexis Diaz, and company taking the next step? Will the Reds win the NL Central division in 2024? Jeff and Steve will keep you tuned in to all the important things to know about your Cincinnati Reds every day. Part of the Locked On Podcast Network, your team every day.",
        "id": 810783,
        "author": "Locked On Podcast Network, Jeff Carr, Steven Offenbaker"
    },
    {
        "title": "In The Money Players' Podcast",
        "url": "https://feeds.captivate.fm/in-the-money-players-podcast/",
        "description": "Hello and welcome to the In the Money Players’ Podcast horse racing's longest continually running podcast. Peter Thomas Fornatale and Jonathon Kinchen talk racing news, look ahead to upcoming races, and talk a little nonsense along the way. This feed also houses our track specific shows for Keeneland and NYRA.",
        "id": 186261,
        "author": "In The Money Media"
    },
    {
        "title": "Bakıcaz",
        "url": "https://feeds.megaphone.fm/bakicaz",
        "description": "<p><a href=\"https://www.instagram.com/serdarcelikler/\">Serdar Ali Çelikler</a> ve <a href=\"https://www.instagram.com/legiogemina/\">Korhan Yılmaz</a> ile hayat, futbol, kültür, gündem hepsine bakıcaz.</p>",
        "id": 7327667,
        "author": "Podbee Media"
    },
    {
        "title": "Erotic Stories from Wylde in Bed",
        "url": "https://www.spreaker.com/show/5520412/episodes/feed",
        "description": "Welcome to the world of <b>sensual Erotic stories</b> where your <b>sexual desires and fantasies</b> can be brought to life, with me your host, Devlin Wylde, as we embark on a <b>journey of intense pleasure</b> and immerse ourselves in your deepest desires. <br />With surprise bonus episodes of my unique Experiential Erotica, Orgasmic Meditation and ASMR you know you want to subscribe so you don’t miss a single, throbbing pleasure. <br />So loosen those clothes, put your earbuds in and relax back on that bed. I will join you every Friday at 10pm CST to whisper an erotic story right there…can you feel my breath yet?",
        "id": 286797,
        "author": "Devlin Wylde"
    },
    {
        "title": "The College Experience: Basketball",
        "url": "https://feeds.simplecast.com/CWzTxJrs",
        "description": "The College Experience: Basketball is the premiere college basketball betting podcast. Hosted by Colby Dant, Patty C & NC Nick, the guys talk college basketball year-round from National Signing Day to Midnight Madness all the way through March Madness. From blue bloods to mid-majors, we’ve got you covered with daily fantasy & college basketball picks. No program goes overlooked as the trio prepares you for a full-court press on your bookie. Join us for the full college experience with The College Experience: Basketball on the Sports Gambling Podcast Network.",
        "id": 4017083,
        "author": "Sports Gambling Podcast Network"
    },
    {
        "title": "Ukrainecast",
        "url": "https://podcasts.files.bbci.co.uk/p0bqztzm.rss",
        "description": "<p>The BBC’s only English language programme entirely dedicated to the war in Ukraine and its fallout, Ukrainecast is your go-to podcast which investigates the biggest issues around the conflict: Could Putin push the nuclear button? How could Donald Trump end the war in 24 hours? What is the price for peace? The podcast is hosted by Newsnight presenter Victoria Derbyshire and BBC Monitoring’s Vitaly Shevchenko. Ukrainecast covers the most important topics around the conflict and speaks to the real people who’ve lived through several years of war. It also brings you agenda-setting interviews with special guests each week such as UK foreign secretary David Cameron, former US secretary of state Mike Pompeo and pre-eminent Russia expert Fiona Hill.\nGET IN TOUCH: You can join our Ukrainecastonline community here: tinyurl.com/ukrainecastdiscord Send us a message or voicenote via WhatsApp to +443301239480 Email Ukrainecast@bbc.co.uk\nYou can listen to the latest episode of Ukrainecast anytime on your smart speaker by saying “Alexa, Ask BBC Sounds for Ukrainecast.\"\nIf you enjoy Ukrainecast (and if you’re reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below. The Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsd The Today Podcast: https://www.bbc.co.uk/sounds/brand/p0gg4k6r Americast: https://www.bbc.co.uk/sounds/brand/p07h19zz Newscast: https://www.bbc.co.uk/sounds/brand/p05299nl</p>",
        "id": 5058050,
        "author": "BBC News"
    },
    {
        "title": "English News - NHK WORLD RADIO JAPAN",
        "url": "http://www3.nhk.or.jp/rj/podcast/rss/english.xml",
        "description": "This is the latest news in English from NHK WORLD RADIO JAPAN. This service is daily updated. For more information, please go to https://www3.nhk.or.jp/nhkworld/.",
        "id": 70123,
        "author": "NHK WORLD-JAPAN"
    },
    {
        "title": "Auburn Live Show",
        "url": "https://feeds.simplecast.com/5j_Zo0MI",
        "description": "The Auburn Live Show features Justin Hokanson and the staff from AuburnLive.com and the On3 Sports Network. This is your home for bold, interesting, insightful and honest conversations surrounding Auburn athletics, as we welcome fantastic guests from Auburn athletics and college sports world.",
        "id": 4127789,
        "author": "On3 Sports"
    },
    {
        "title": "5 Minute Food Fix",
        "url": "https://feeds.acast.com/public/shows/6615eeeedd3b8b0017356291",
        "description": "<p>Does the question <strong>“What’s for dinner?”</strong> make you groan with despair?</p><p>Are you lacking both time AND inspiration?</p><p>Author Yumi Stynes and cookbook publisher Simon Davis are both busy, love food, and here to help.</p><p>In a podcast you can whack on for the drive home from work, you get meal ideas <strong>realistic</strong> enough to be cooked that night, AND you get laughs while learning more about the food you've been cooking every day.</p><p>Easy recipes and cooking hacks that will save you time and get you loving food again. For recipes, videos and laughs, check out: instagram.com/5minutefoodfix/?hl=en https://www.tiktok.com/@5minutefoodfix</p><p>And to contact the show: foodfixemail@gmail.com</p><hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 5333870,
        "author": "Yumi Stynes"
    },
    {
        "title": "Sober Motivation: Sharing Sobriety Stories",
        "url": "https://sober-motivation.podbean.com/feed.xml",
        "description": "The Sober Motivation podcast will have new guests each week sharing their sobriety stories in hopes of inspiring others about what is possible.",
        "id": 5976612,
        "author": "Brad McLeod"
    },
    {
        "title": "JMO Podcast",
        "url": "https://media.rss.com/jmopodcast/feed.xml",
        "description": "<p>The Jason Mitchell Outdoors JMO Podcast covers stories and opinions from behind the scenes in the fishing industry. A deep dive for timely tips and tactics for Midwest fishing opportunities. Guests include some of the biggest and most entertaining names in the fishing world. From seasoned guides to NWT pros and industry insiders, the JMO Podcast delivers some of the most fascinating insights on fishing from across the Midwest.</p>",
        "id": 400165,
        "author": "Jason Mitchell Outdoors"
    },
    {
        "title": "Perfect Organism: The Alien Saga Podcast",
        "url": "https://feeds.simplecast.com/PmuMNRJT",
        "description": "Perfect Organism is the premier Alien Saga podcast on the internet. New episodes drop every other Tuesday!",
        "id": 885652,
        "author": "Perfect Organism Podcast, Bleav"
    },
    {
        "title": "The I Love CVille Show With Jerry Miller!",
        "url": "https://feeds.soundcloud.com/users/soundcloud:users:668831909/sounds.rss",
        "description": "The I Love CVille Show with Jerry Miller spotlights The Best of Charlottesville, Virginia! The I Love CVille Show streams live to Facebook Monday through Friday from 12:30 pm - 1:30 pm. You can also catch the archived version of each episode on iLoveCVille.com.",
        "id": 1180008,
        "author": "Jerry Miller"
    },
    {
        "title": "The Everyday Sniper",
        "url": "https://theeverydaysniper.podbean.com/feed.xml",
        "description": "The Everyday Sniper, talking Long Range Shooting, Precision RIfles, including Industry updates and interviews. Hosted by  Frank from Sniper's Hide.",
        "id": 446924,
        "author": "Frank Galli"
    },
    {
        "title": "Cloudy Groovez",
        "url": "https://www.spreaker.com/show/4659297/episodes/feed",
        "description": "<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/cloudy-groovez--4659297/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/cloudy-groovez--4659297/support</a>.",
        "id": 1591397,
        "author": "CLOUDY GROOVEZ"
    },
    {
        "title": "Theories of Everything with Curt Jaimungal",
        "url": "https://feeds.megaphone.fm/TOE4643226064",
        "description": "<p>Exploring theoretical physics, consciousness, Ai, and God in a technically rigorous manner. If you'd like to support this endeavor, then please visit the Patreon ( https://patreon.com/curtjaimungal ). Thank you for your charitable and kindhearted support. My name's Curt Jaimungal, a Torontonian with a degree in mathematical physics from the University of Toronto and I analyze various Theories of Everything from this analytic perspective, though more and more opening up to alternative approaches. The separating factor of TOE from other podcasts is its focus on depth even at the risk of limiting the audience due to how much detail we delve into subjects. Paralleling the intensity found in academic discourse, we're increasingly embracing a spectrum of unconventional ideas to conduct research during this podcast, rather than merely conveying existing information. Contact toe [at] indiefilmTO [dot] com for business inquiries / sponsorship.</p>",
        "id": 380149,
        "author": "Theories of Everything"
    },
    {
        "title": "Theories of Everything with Curt Jaimungal",
        "url": "https://feeds.simplecast.com/WoEHhoGp",
        "description": "<p>Exploring theoretical physics, consciousness, Ai, and God in a technically rigorous manner. If you'd like to support this endeavor, then please visit the Patreon ( https://patreon.com/curtjaimungal ). Thank you for your charitable and kindhearted support. My name's Curt Jaimungal, a Torontonian with a degree in mathematical physics from the University of Toronto and I analyze various Theories of Everything from this analytic perspective, though more and more opening up to alternative approaches. The separating factor of TOE from other podcasts is its focus on depth even at the risk of limiting the audience due to how much detail we delve into subjects. Paralleling the intensity found in academic discourse, we're increasingly embracing a spectrum of unconventional ideas to conduct research during this podcast, rather than merely conveying existing information. Contact toe [at] indiefilmTO [dot] com for business inquiries / sponsorship.</p>",
        "id": 6685488,
        "author": "Theories of Everything"
    },
    {
        "title": "Locked On Dodgers – Daily Podcast On The Los Angeles Dodgers",
        "url": "https://feeds.simplecast.com/hBP_n2oK",
        "description": "Locked On Dodgers podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Los Angeles Dodgers and Major League Baseball. Hosts Jeff Snider and Vince Samperio bring their smart, passionate Dodger takes as the Locked On Dodgers podcast provides your daily Dodgers fix with expert, local analysis, and coverage of all aspects of the Dodgers franchise. Locked On Dodgers takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Dodgers locker room and all over MLB. The Locked On Dodgers podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 769641,
        "author": "Locked On Podcast Network, Vince Samperio, Jeff Snider"
    },
    {
        "title": "Toni and Ryan",
        "url": "https://feeds.acast.com/public/shows/66b409fbec20c36e8e2e4115",
        "description": "<p>We’ll all giggle along at naughty jokes, your dating horror stories and give questionable recommendations on movies, food and relationships. This podcast is hot, fun garbage and we (Toni Lodge and Ryan Jon here in Melbourne, Australia) would love you to climb aboard and be our friends.</p><p>Join us everywhere: <a href=\"https://l.instagram.com/?u=https%3A%2F%2Flinktr.ee%2FToniAndRyan%3Ffbclid%3DPAZXh0bgNhZW0CMTEAAaajszCID4s47h494jZF7YXYSIzyOmJtT7pWI06HOQ5ZPENw_nbUC3mY_cM_aem_BMAZutXvJS_ExwFpqgCWug&e=AT3n1OErLgCVi4p7Gt9Urlio0_eIlm_sB7AyRFu80ITyDSOtwuL2JYWhZI9G4Bg-sU85UzizZCu792hplymuW50Xc8-DN3p4PJWh\" rel=\"noopener noreferrer\" target=\"_blank\">linktr.ee/ToniAndRyan</a></p><hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 6568199,
        "author": "Toni Lodge and Ryan Jon"
    },
    {
        "title": "The True Crime Tapes",
        "url": "https://www.spreaker.com/show/5621851/episodes/feed",
        "description": "<br />The True Crime Tapes pulls you into the shadowy depths of the criminal underworld, where the line between justice and chaos is razor-thin. Each episode dissects the minds of history’s most infamous serial killers, unravels the inner workings of organized crime syndicates, and investigates baffling missing person cases that still haunt the public’s imagination. From the bloody reign of ruthless mob bosses to the chilling patterns of elusive predators, True Crime Time delivers gripping, deeply researched storytelling that leaves no stone unturned.<br /><br />With a relentless pursuit of truth, True Crime Time goes beyond the headlines, diving into the psychology, motives, and investigations behind the world’s most shocking crimes. You’ll hear firsthand accounts, expert analysis, and rare archival material that shed new light on cases both well-known and obscure. Whether it’s the brutality of cartel wars, the sinister precision of serial murderers, or the eerie last-known moments of vanished souls, this podcast brings you face-to-face with the darker side of human.<br /><br />Every week, True Crime Time takes you on a journey through the twisted corridors of crime, guided by immersive storytelling and chilling attention to detail. Expect heart-pounding narratives, intricate conspiracy threads, and unsettling truths that will leave you questioning everything you thought you knew. If you crave the rush of uncovering the darkest mysteries, brace yourself—because in this world, the truth is often stranger, and far more terrifying, than fiction.",
        "id": 5596626,
        "author": "Bobby Capucci"
    },
    {
        "title": "Audiobooks",
        "url": "https://www.spreaker.com/show/6291958/episodes/feed",
        "description": "Follow us on Youtube<br />https://www.youtube.com/@anonimousauthorz<br />https://www.youtube.com/@Audiobooks_Trascendentall<br /><br />\"Audiobooks / personal ideas and reflections\" is a program dedicated to the narration of book fragments developed by Editorial Trascendental, in addition to the creation of important ideas with book application with a focus on personal growth, professional development, and spiritual transformation. The mission is to provide our users with inspiring and educational content that helps them reach their full potential and live more meaningful and fulfilling lives.",
        "id": 7015130,
        "author": "Audiobooks"
    },
    {
        "title": "The Matt Walsh Show",
        "url": "https://feeds.simplecast.com/pp_b9xO6",
        "description": "Fed up with the talking heads? Matt gives you a no-holds-barred take on today’s cultural, religious, and political issues. Monday thru Friday.",
        "id": 414123,
        "author": "The Daily Wire"
    },
    {
        "title": "The Deep End",
        "url": "https://www.spreaker.com/show/2590558/episodes/feed",
        "description": "If it isn't about ALL OF US it isn't about LOVE! With Redhawk Rice-Sauer.",
        "id": 1121898,
        "author": "Redhawk"
    },
    {
        "title": "PFF Fantasy Football Podcast",
        "url": "https://feeds.simplecast.com/lupMiJpJ",
        "description": "Fantasy football at an elite level. We break down all of the latest NFL news and gives you the analysis and unique insights you need to dominate your season-long fantasy football leagues and DFS contests. With cutting-edge stats and information from Pro Football Focus, get ready to take your game to another level. If you want to be the BEST, this fantasy football podcast is a must.",
        "id": 57005,
        "author": "Fantasy Football"
    },
    {
        "title": "Locked On Astros - Daily Podcast On The Houston Astros",
        "url": "https://feeds.simplecast.com/f7VQa1qK",
        "description": "Locked On Astros podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Houston Astros and Major League Baseball. Hosted by Eric Huysman and Brett Chancey, the Locked On Astros podcast provides your daily Astros fix with expert, local analysis, and coverage of all aspects of the Astros franchise. Locked On Astros takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Astros locker room and all over MLB. The Locked On Astros podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 340991,
        "author": "Locked On Podcast Network, Eric Huysman, Bret Chancey"
    },
    {
        "title": "Cold Brew Got Me Like",
        "url": "https://www.spreaker.com/show/4820062/episodes/feed",
        "description": "Chris and Greg Crofton have you over for a cup(s) of nitro, and a wide-ranging discussion of whatever is on their minds. Topics typically include injustice, poetry and payphones. New episode every Monday!",
        "id": 3681134,
        "author": "Chris Crofton"
    }
]