[
    {
        "title": "The Logos Podcast",
        "url": "https://www.spreaker.com/show/4760780/episodes/feed",
        "description": "This is the official Church of the Eternal Logos (COTEL) podcast! Topics discussed include but not limited to Christian theology, philosophy, world religions, magic, psychedelics, and cultural commentary.",
        "id": 3136599,
        "author": "Church of the Eternal Logos"
    },
    {
        "title": "Spirit Force",
        "url": "https://www.spreaker.com/show/4224461/episodes/feed",
        "description": "Greetings! Since age 15 at the turn of the Millennium I underwent an awakening of curiosity about the mysteries of the world. My grandfather Don Basham wrote many books about spiritual topics and my father Glenn Basham granted me a very artistic atmosphere of classical music in the home I was raised and homeschooled in. I spent about 15 years total traveling all throughout Asia and learning both Japanese and Chinese as well as a myriad of other topics. Now I'm excited to share these discoveries with you together with my beautiful wife, Jennifer Rimel-Basham. paypal: jenniferrimel@hotmail.com Email us at: bashasham@gmail.com",
        "id": 662590,
        "author": "Michael Basham"
    },
    {
        "title": "Going Nuclear with Justin Huhn and Trevor Hall",
        "url": "https://anchor.fm/s/aa38f4/podcast/rss",
        "description": "Uranium Insider's Justin Huhn and Mining Stock Daily's Trevor Hall provide the latest news and developments from the expanding nuclear power sector. Hear financial market updates, industry advancements, and uranium exploration news on every episode.",
        "id": 5930466,
        "author": "Going Nuclear"
    },
    {
        "title": "Experiencia Kidzania Monterrey",
        "url": "https://www.spreaker.com/show/5713632/episodes/feed",
        "description": "Aquí encontrarás las grabaciones de la cabina de iHeartRadio en Kidzania Monterrey<br /><br />Conviértete en un seguidor de este podcast: <a href=\"https://www.spreaker.com/podcast/experiencia-kidzania-monterrey--5713632/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/experiencia-kidzania-monterrey--5713632/support</a>.",
        "id": 6194914,
        "author": "ACIR - Kidzania"
    },
    {
        "title": "Ultimate Cleveland Sports Show",
        "url": "https://feeds.simplecast.com/5Lh7By4F",
        "description": "A daily one-stop shop for Cleveland sports fans. Host and WKYC sports anchor Jay Crawford (formerly from ESPN’s SportsCenter) and a panel of local Cleveland sports insiders including Adam “The Bull” Gerstenhaber, Garrett Bush (92.3 “The Fan”), Mike Polk (WKYC), Brad Sellers (former NBA Player & Buckeye), and Tyvis Powell (former NFL Player & Buckeye) get into the topics, news and stories Cleveland sports fans are talking about. While Cleveland's biggest sports superstars stop by to bring unique perspectives from the field or court into the studio.",
        "id": 5436507,
        "author": "Locked On Podcast Network, Jay Crawford"
    },
    {
        "title": "The Schilling Show",
        "url": "https://feeds.transistor.fm/the-schilling-show",
        "description": "Rob Schilling is a respected voice and trusted name in the Charlottesville community, as well as a nationally recognized, Associated Press and Virginia Association of Broadcasters award-winning investigative journalist. The Schilling Show is a venue for advocacy and change. While Rob takes strong stances on issues, all points of view are welcome, and Rob often hosts guests from divergent ends of the political and social spectrums.",
        "id": 6830358,
        "author": "Rob Schilling"
    },
    {
        "title": "Harvest Valley Church",
        "url": "https://feeds.buzzsprout.com/443236.rss",
        "description": "Harvest Valley Church, Pleasanton, CA has a passion to teach and equip people from various journeys of life through the LOVE & GRACE of Jesus.",
        "id": 169042,
        "author": "Pastor Derek Meekins"
    },
    {
        "title": "Unbelievable?",
        "url": "https://pcr-rss.streamguys1.com/the-unbelievable/unbelievable.xml",
        "description": "Unbelievable? offers a weekly podcast, blog, and video series hosted by Ruth Jackson and a team of thinkers and Christian apologists.",
        "id": 420579,
        "author": "Premier Unbelievable?"
    },
    {
        "title": "And Then It Hit Me with Cory Allen",
        "url": "https://feeds.buzzsprout.com/1990661.rss",
        "description": "<p>Learn how ordinary people became extraordinary–from the inside out. Join author Cory Allen as he asks the world’s leading thinkers what THE insight was that hit them, which was a turning point in their path to greatness. This podcast will give you behind-the-scenes blueprints that will show you the steps you can take to raise your life to the next level.</p>",
        "id": 450921,
        "author": "Cory Allen"
    },
    {
        "title": "The Filmcast",
        "url": "https://audioboom.com/channels/4997224.rss",
        "description": "",
        "id": 535854,
        "author": "The Filmcast"
    },
    {
        "title": "Bill O’Reilly’s No Spin News and Analysis",
        "url": "https://feeds.megaphone.fm/RSV2429196838",
        "description": "<p>No Spin. Just Facts. Always looking out for you. Head to BillOReilly.com for more analysis.</p>",
        "id": 545008,
        "author": "Bill O'Reilly"
    },
    {
        "title": "Strong Men Strong Marriages",
        "url": "https://feeds.buzzsprout.com/1065400.rss",
        "description": "<p>Helping high achieving Christian men have more intimate marriages. Start with episodes 1-4 for an introduction. Traditional marriage counseling, couples therapy, couples counseling and even Christian marriage counseling will tell you that a good marriage is based on compromise. Validating feelings. Sacrifice. I tried that for years. Unfortunately, it doesn’t work. That’s why most couples who go through marriage counseling are the same or worse off after. BUT, in my studies in neuroscience at BYU, MD training at UCLA, psychiatry residency, marriage coach training, and most importantly in my own marriage, I finally found what DOES work. Building strength. Spiritual, mental, emotional and sexual strength, while anchored in following Christian marriage principles. Strength is attractive. And, it feels great. It builds trust. Add to this the skills of communication and intimacy, and you get a marriage full of phenomenal mental, emotional and physical intimacy. And, you set the example for generations to follow. I applied this to my own marriage, I felt better than ever and had more connection and passion than I thought possible. I started teaching this to other men and couples and they were able to create mental, emotional and sexual intimacy faster than they thought possible. This even works for affair recovery and emotional affairs. Now it’s your turn. Become a strong, attractive man. Create a strong, passionate marriage.</p>",
        "id": 558895,
        "author": "Mike Frazier, MD"
    },
    {
        "title": "True Crime Today | Daily True Crime News & Interviews",
        "url": "https://audioboom.com/channels/5001260.rss",
        "description": "",
        "id": 568948,
        "author": "Real Story Media"
    },
    {
        "title": "Locked On NFL – Daily Podcast On The National Football League",
        "url": "https://feeds.simplecast.com/zx_GShic",
        "description": "Locked On NFL podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for all of the National Football League. Hosted by podcasters around the Locked On NFL channel, Kevin Oestreicher, Luke Braun, Ross Jackson, Tony Wiggins, James Rapien, Tyler Rowland, Alex Clancy, Your Boy Q and Christopher Carter, the Locked On NFL podcast will get you your daily NFL fix with expert, local analysis, rumors, opinions, breaking news, special guests, and coverage of all aspects of the NFL. The Locked On NFL podcast takes you beyond the scoreboard for the inside scoops on the biggest stories from within board rooms and locker rooms all over the NFL. The Locked On NFL podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 574592,
        "author": "Locked On Podcast Network"
    },
    {
        "title": "Vital MX",
        "url": "https://feeds.buzzsprout.com/184926.rss",
        "description": "<p>Are you ready to hear from some of the most interesting people in motocross and Supercross? That’s where Vital MX podcasts comes in. The Inside Line series features interesting conversations with riders past and present, as well as movers and shakers in the sport.</p>",
        "id": 639469,
        "author": "Vital MX"
    },
    {
        "title": "The Get Ready Money Podcast",
        "url": "https://feeds.buzzsprout.com/530449.rss",
        "description": "<p><b>The Get Ready Money Podcast with Tony Steuer features insightful conversations with thought leaders who are transforming how we think about money.</b><br> </p><p>Each episode provides actionable tips and meaningful insights to help you ask the right questions, improve your financial conversations, and take control of your financial future. Whether you’re a financial professional or simply looking to strengthen your financial foundation, this podcast will leave you empowered and prepared.</p><p><br></p><p>“The litmus test for a terrific podcast has to be that you found yourself wishing you were ‘in the room’ for the conversation you're listening to, so you could participate. I had that feeling when Tony Steuer, CLU, LA, CPFFE and Bobbi Rebell Kaufman, CFP® were discussing the importance of understanding who you are taking financial advice from, and how much further in life just a little more intention can get you. Worth a listen!” – Karen Holland</p><p><br></p><p><b>Support</b> the <b>Get Ready Movement</b> with a one-time donation to help keep financial literacy free and accessible through expert insights, practical tools, and The Get Ready Money Podcast. Here’s the link: https://www.tonysteuer.com/offers/LCyxRAaY</p><p><br></p>",
        "id": 642038,
        "author": "Tony Steuer"
    },
    {
        "title": "Magnetize Your Man | Dating & Relationship Advice For Successful Women",
        "url": "https://feeds.buzzsprout.com/1198922.rss",
        "description": "<p>We help successful women to attract a loving, long-term & committed relationship with a high-quality man to feel safe & excited with fast without a fear of opening your heart, trust-issues or emotionally unavailable men. Follow & subscribe for new weekly episodes with master love coaches & husband & wife team Antia & Brody Boyd who have been helping women to get the love they want for over 20 years combined.</p>",
        "id": 696977,
        "author": "Antia & Brody Boyd"
    },
    {
        "title": "Folk on Foot",
        "url": "https://feeds.acast.com/public/shows/66200129e1b2a400121801b1",
        "description": "“Modest people, playing gorgeous music, speaking articulately about areas they love. Fabulously calming” – one listener’s description of this multi-award-winning podcast in which Matthew Bannister goes walking with top folk musicians in the landscapes that have inspired them. “A restorative breathing space in sound” – The Telegraph. “Immaculately produced” – The Times<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 715648,
        "author": "Matthew Bannister"
    },
    {
        "title": "Art Wank",
        "url": "https://feeds.buzzsprout.com/933121.rss",
        "description": "<p>Come along for the ride with curious artists Fiona Verity, Julie Nicholson and host Gary Seller, as they talk about their creative journey. Hear them interviewing artists, curators, gallery owners, teachers and creatives to guide them, and the listeners, within the arts community. Enjoy the banter whilst they navigate through all the Art W**k.</p>",
        "id": 729674,
        "author": "Fiona Verity, Julie Nicholson and Gary Seller"
    },
    {
        "title": "Pitcher List Fantasy Baseball",
        "url": "https://feeds.simplecast.com/Rbrm7xIB",
        "description": "Award-winning daily and weekly Fantasy Baseball analysis from the Pitcher List staff.",
        "id": 771958,
        "author": "Pitcher List"
    },
    {
        "title": "Ones Ready",
        "url": "https://feeds.buzzsprout.com/680894.rss",
        "description": "<p>A team of active duty Combat Control (CCT), Pararescue (PJ), and Special Reconnaissance (SR) leveraging our 69 years of special operations experience to make the next generation of operators smarter, faster and stronger than we ever were. We are the PREMIERE resource for all things Air Force Special Warfare. The Ones Ready Podcast is honest talk about what it is like to go from a know-nothing high school graduate to an elite Special Operator. We will cover important practices for success including physical training, nutrition, recovery, and mindset traits essential to any team. Join us in The Team Room to get all your questions answered!! With battle-tested operators from across USAF SPECWAR and far-reaching web of recruiters, subject matter experts, and friends, there are no questions we can’t answer- and if we can’t, we know exactly where to look. See you in The Team Room!Disclaimer: The views and opinions expressed by the OnesReady team are those of the team and do not reflect the official policy or position of the DoD. Any content provided by our Podcast guests, bloggers, sponsors, or authors are of their opinion and are not intended to malign the DoD, any religion, ethnic group, club, organization, company, individual, or anyone. </p>",
        "id": 785053,
        "author": "Aaron Love, Trent Seegmiller, and Jared \"Peaches\" Pietras"
    },
    {
        "title": "The Eleven Dubcast",
        "url": "https://feeds.transistor.fm/the-eleven-dubcast",
        "description": "The Eleven Dubcast, hosted by George Eisner and Johnny Ginter of Eleven Warriors, goes deep every week on Ohio State football, basketball, and recruiting.",
        "id": 1093522,
        "author": "Eleven Warriors"
    },
    {
        "title": "The Sound Off Podcast",
        "url": "https://rss.art19.com/sound-off-podcast-series",
        "description": "<p>The Sound Off Podcast is a series of interviews and discussions about Broadcasting, podcasting and New Media. Matt Cundill is a 20 year veteran of radio and has worked on air, and as a program director. Matt has worked with podcasters since 2016 to increase their audience and the amount of time engaged on their audio. </p><p>⚡️mattcundill@getalby.com</p><p><br></p>",
        "id": 1108125,
        "author": "Matt Cundill"
    },
    {
        "title": "بودكاست دقائق",
        "url": "https://feeds.buzzsprout.com/1021528.rss",
        "description": "<p dir=\"rtl\">يقدم دقائق المعرفة في دقائق، ويفتح الباب لمن يدق عليه عارضا المساهمة ولو بمعلومة واحدة، أو فكرة، يريد أن يوصلها معلومة دقيقة. محسوبة بالدقيقة | بودكاست دقائق</p>",
        "id": 1320107,
        "author": "فريق دقائق"
    },
    {
        "title": "For the Love of Yoga with Nish the Fish",
        "url": "https://feeds.buzzsprout.com/1485745.rss",
        "description": "The world of Yoga is wide and varied. In this podcast, yogi Nish the Fish shares the deeper dimensions of Yoga, Vedanta and Tantra, asking the big questions: why do we practice? What is meditation? What is the purpose of a human life? What is Beauty? What is Death? Nishanth Selvalingam studied various South Asian philosophies with his Shaivite grandfather in an ashram in Kuala Lumpur, Malaysia and moved to Los Angeles to study philosophy, teach yoga and play guitar in a rock band. Join him and special guests as they explore Yoga, in all its splendours. For more episodes and instruction, and to support this humble offering of the heart, visit me on Patreon: patreon.com/yogawithnish ",
        "id": 1378531,
        "author": "Nishanth Selvalingam"
    },
    {
        "title": "Darling, Shine!",
        "url": "https://www.omnycontent.com/d/playlist/820f09cf-2ace-4180-a92d-aa4c0008f5fb/fbd93540-1e4f-4e2e-a43c-af4d000c6fb9/8b060976-545b-4a6c-b28a-af4d000c6fed/podcast.rss",
        "description": "Join us as we blindly navigate and unpack the raw and often unspoken experiences of womanhood, grief, friendship and everything in between. Darling, Shine is your survival kit to the unexpected shit life throws at you.",
        "id": 3935094,
        "author": "LiSTNR"
    },
    {
        "title": "Life After Medicine: How To Make a Career Change, Beat Burnout & Find Your Purpose For Doctors",
        "url": "https://feeds.buzzsprout.com/1825965.rss",
        "description": "<p><b>Are you exhausted by the daily grind of the healthcare system and questioning if your career in medicine is truly the right path for you?<br><br>This show helps millennial health professionals leave the system, find their purpose, and turn it into their paycheck.<br></b><br></p><p><b>Listen to discover tangible methods to identify your true purpose. Hear success stories of other health professionals who have pivoted- to gain the inspiration and motivation needed to take your first steps. Join a community of like-minded health professionals seeking something more. <br></b><br></p><p><b>Hosted by Chelsea Turgeon, an MD who left her OBGYN residency in 2019 and has built an online business generating over $300,000 while living and working in 40+ countries. <br></b><br></p><p><b>Every Tuesday, Chelsea shares actionable steps and insights to help health professionals navigate career transitions and avoid burnout.<br> <br>Every Thursday, tune in for “pivot profiles,” bite-sized interviews of health professionals making the transition and turning their purpose into their paycheck.<br></b><br></p><p><b>If you’re ready to find a fulfilling career that doesn’t drain you, start by listening to the fan-favorite audio series, starting at Season 2, Episode 7: Let’s Diagnose Your Career Unhappiness.</b></p><p><br></p>",
        "id": 4112130,
        "author": "Chelsea Turgeon"
    },
    {
        "title": "Houston Grass - How to Buy, Install and Care for Grass in the Houston Area",
        "url": "https://feeds.buzzsprout.com/1943551.rss",
        "description": "How to buy, install and care for grass in the Houston area.  From Michael Romine, the owner of Houston Grass in Arcola, Texas.",
        "id": 5041017,
        "author": "Michael Romine"
    },
    {
        "title": "Piers Morgan Uncensored",
        "url": "https://feeds.megaphone.fm/RSV2152356740",
        "description": "<p>Piers Morgan Uncensored is the global arena for fearless debate, bold opinions and major interviews. Follow the podcast for all-new and exclusive daily content.</p><p><br></p><p>YouTube: @PiersMorganUncensored</p><p>X: @PiersUncensored</p><p>TikTok: @piersmorganuncensored</p><p>Insta: @piersmorganuncensored</p>",
        "id": 5338451,
        "author": "Piers Morgan Uncensored"
    },
    {
        "title": "Hoss & Hopf",
        "url": "https://hossundhopf.podigee.io/feed/mp3",
        "description": "Sie könnten unterschiedlicher nicht sein, und doch haben sie so viel gemeinsam. Philip Hopf und Kiarash Hossainpour sind zwei bekannte Persönlichkeiten in der deutschen Finanzlandschaft; ihre Verbindungen zu Finanzen, Makroökonomie und Geopolitik haben sie zusammengebracht, um ein offenes Diskussionsumfeld zu schaffen und frei über die Welt und ihre aktuellen Trendthemen zu sprechen - auf fragende, aber auch antwortende Weise. Dieser Podcast nimmt kein Blatt vor den Mund, mit dem Ziel ihre geteilte Kuriosität zu erforschen und in jeder Folge möglichst etwas Neues zu lernen.\nJeden Montag und Freitag um 19 Uhr, überall verfügbar.\nImpressum/Imprint:\nKiarash Hossainpour\nHOSS HOPF PRODUCTION SERVICES - FZE\nDUQE SQUARE BUSINESS CENTER,\nQuarter Deck\nQE2, Mina Rashid\nP.O. Box 554789\nDubai, UAE\n+97148716555\nTax ID: in formation\nFor urgent inquires: hossundhopf@gmail.com",
        "id": 5702250,
        "author": "Kiarash Hossainpour, Philip Hopf"
    },
    {
        "title": "The Bread of Life",
        "url": "https://feeds.buzzsprout.com/2159447.rss",
        "description": "<p>Rev. Joel Van Hoogen is the Executive Director of Church Partnership Evangelism (CPE), an international ministry devoted to equipping and engaging the members of Christ’s Body in personal evangelism, discipleship, and church planting.</p>",
        "id": 6252031,
        "author": "Joel Van Hoogen"
    },
    {
        "title": "Stand on Guard with David Krayden",
        "url": "https://feeds.buzzsprout.com/2177957.rss",
        "description": "<p>Resolve to Resist with Stand on Guard and David Krayden. Join David and his guests on a new broadcast called Stand on Guard, to explore the latest Canadian, American, and global news, politics & views you won't hear anywhere else.  <br><br>David is a journalist writing for the Post Millennial, the Epoch Times, Human Events, Townhall.com. He is Daily Caller Alumni, a former Royal Canadian Air Force Public Affairs and Parliament Hill legislative staffer. <br><br>Find David Krayden on the following podcasts: Spotify, Apple, YouTube Music + more.<br><br>Social Media<br>-YouTube (https://www.youtube.com/@KraydensRightwithDavidKrayden), <br>-Twitter (@davidkrayden), <br>-Substack (https://davidkrayden.substack.com/), <br>-Facebook (https://www.facebook.com/KraydensRight), <br>-Rumble (https://rumble.com/user/KraydensRight)<br>+Gettrr, Gab,<br><br>Contact David through DM @davidkrayden</p>",
        "id": 6327947,
        "author": "DAVID KRAYDEN"
    },
    {
        "title": "teleSUR Podcast",
        "url": "https://feeds.buzzsprout.com/2219261.rss",
        "description": "<p>Aquí encontrarás una amplia variedad de contenido en formato podcast que te mantendrá informado y entretenido con una visión desde el sur. Con teleSUR Podcast, puedes estar seguro de que estarás conectado con los hechos más importantes y relevantes del momento.</p>",
        "id": 6466793,
        "author": "teleSUR"
    },
    {
        "title": "PowerGab",
        "url": "https://feeds.captivate.fm/powergab/",
        "description": "An Independence Institute production focusing on the unique energy challenges facing Colorado. ",
        "id": 6822290,
        "author": "Independence Institute"
    },
    {
        "title": "The Trial Of Karen Read | Justice For John O'Keefe",
        "url": "https://audioboom.com/channels/5125261.rss",
        "description": "",
        "id": 6882259,
        "author": "True Crime Today"
    },
    {
        "title": "Achievers Therapy: Christian Motivation",
        "url": "https://feeds.redcircle.com/21eed26d-3d2a-49e9-9f19-450839d2a3ef",
        "description": "A self-improvement show where spiritual wisdom inspires personal growth.",
        "id": 6937806,
        "author": "iMedia"
    },
    {
        "title": "Bourbon Kingdom's Podcast",
        "url": "https://feeds.buzzsprout.com/2405593.rss",
        "description": "<p>Just a couple of guys talking about and drinking bourbon</p>",
        "id": 7020483,
        "author": "Bourbon Kingdom"
    },
    {
        "title": "My World of Crime Fiction",
        "url": "https://feeds.buzzsprout.com/2399641.rss",
        "description": "<p><b><em>My World of Crime Fiction</em></b> is an audio podcast featuring crime-fiction series created by America's Best Crime Writer Barry Bowe.</p>",
        "id": 7020772,
        "author": "Barry Bowe"
    },
    {
        "title": "The Freedom Therapist",
        "url": "https://app.kajabi.com/podcasts/2147815457/feed",
        "description": "Welcome to The Freedom Therapist podcast. I'm your host Mia Poklepovich a previously burnt out mental health occupational therapist and business owner, who found her way to fall back in love with business and life all over again. \n\nThis podcast was created to be your safe space to learn AND unlearn all the things about scaling your business, without losing yourself in the process. Each week will be talking about ALL the things. And feeling ALL the feels. \n\nBecause business is a wild ride, at all stages. So if you need an extra dose of inspo, a soft landing or just a moment to unwind you are SO welcome here. \n\n\nEach week we’ll go deep on all things business, self, energy and freedom. There's growth, giggles AND tears, as we lean into the best version of our business - and selves too. We’ll also get to chat with some incredibly inspiring women who will generously share their stories on finding that magic. \n\n\nIf you’re looking for deep conversations, no gatekeeping, practical advice all with a little bit of chaos, you’re in the right place.\n\nGive yourself permission to take some space for you, and let’s be besties. \n\nI can’t wait!",
        "id": 7026015,
        "author": "Mia Poklepovich"
    },
    {
        "title": "The Mami Collective",
        "url": "https://feeds.buzzsprout.com/2379214.rss",
        "description": "<p>Motherhood changes you, but it shouldn't erase you.<br><br></p><p>Hosted by media personality and new mom Paulina Roe, The Mami Collective Podcast is a space for moms who are ready to stop shrinking and start reclaiming their voice, wellness, income, and identity.</p><p><br>Through candid solo episodes and empowering guest interviews, Paulina dives into real conversations about navigating motherhood while pursuing your ambitions...without guilt or apology.<br><br>Join us each week for raw stories, honest talk, and a reminder that you're still you-even when \"mom\" is your biggest role.</p><p><br>Welcome to The Mami Collective. Let's build the collective, one story at a time.</p><p><br></p>",
        "id": 7026517,
        "author": "Paulina Roe"
    },
    {
        "title": "Prosty Angielski - Instytut Lingwistyki",
        "url": "https://www.spreaker.com/show/5554183/episodes/feed",
        "description": "Nauka Języków Obcych jest..... PROSTA! Przekonaj się o tym z Instytutem Lingwistyki i naszymi metodami na skuteczną naukę! :)<br /><br />💪 Dołącz do naszego 7-dniowego wyzwania językowego: <a href=\"https://bit.ly/3nyliUw\" rel=\"noopener\">https://bit.ly/3nyliUw</a><br />👉 Sprawdź się w bezpłatnym językowym quizie: <a href=\"https://instytutlingwistyki.pl/quiz/\" rel=\"noopener\">https://instytutlingwistyki.pl/quiz/</a><br />🇬🇧🇪🇸🇩🇪 Poznaj Nasze Pełne Szkolenia Językowe: <a href=\"https://instytutlingwistyki.pl\" rel=\"noopener\">https://instytutlingwistyki.pl</a><br /><br />Polub nas na Facebooku:<br />👥 <a href=\"https://www.facebook.com/InstytutLingwistyki\" rel=\"noopener\">https://www.facebook.com/InstytutLingwistyki</a><br /><br />...i dołącz do naszej grupy:<br />👩‍👨‍ <a href=\"https://www.facebook.com/groups/szybkanaukajezykow/\" rel=\"noopener\">https://www.facebook.com/groups/szybkanaukajezykow/</a><br /><br />Skontaktuj się z naszym biurem: <br />📨 <a href=\"mailto:kontakt@instytutlingwistyki.pl\">kontakt@instytutlingwistyki.pl</a>",
        "id": 6135785,
        "author": "Expertia"
    },
    {
        "title": "The Diddy Diaries",
        "url": "https://www.spreaker.com/show/5976627/episodes/feed",
        "description": "The Diddy Diaries: The Downfall of Sean Combs is a raw, unflinching look at the dramatic collapse of one of hip-hop’s biggest moguls. For decades, Sean 'Diddy' Combs seemed untouchable—a figure who rose from the streets to become a titan of the music, fashion, and entertainment industries. His Bad Boy Entertainment label defined a generation of hip-hop, and his entrepreneurial spirit made him a household name. But beneath the surface of this glittering success lay darker currents—currents that have now surged into the spotlight as the empire he built threatens to crumble beneath the weight of scandal and serious criminal allegations.<br /><br />This podcast dives deep into the allegations that have sent shockwaves through the entertainment world. At the center of it all are the accusers—those who have come forward with shocking claims of misconduct, manipulation, and abuse. These aren’t just sensational headlines—they are stories that expose a side of Sean Combs the public never saw. The Diddy Diaries explores how these accusations began to surface, what drove his accusers to finally speak out, and how the legal system has responded.<br /><br />But this isn’t just about Diddy’s public image taking a hit—The Diddy Diaries zeroes in on the high-stakes battle that Diddy now faces to stay out of jail. Each episode unpacks the legal drama as it unfolds in real-time: the charges, the court proceedings, and the fight for his freedom. Once a man who had it all—fame, fortune, and influence—Diddy now stands at the center of a legal storm that threatens to strip him of everything, including his freedom.<br /><br /><br />We trace the events that led up to this moment, looking at how Diddy’s larger-than-life persona masked a pattern of behavior that would ultimately bring him to this point. Listeners will get a front-row seat to the high-stakes legal battles, where the possibility of incarceration looms large. The tension is palpable as Diddy’s legal team works to combat the mounting evidence against him, while his accusers push for justice.<br /><br />Through riveting storytelling, The Diddy Diaries paints a full picture of Diddy’s downfall, from the heights of his stardom to the depths of his legal fight for survival. This is not a story about maintaining power or influence—it’s a fight to avoid the ultimate consequence: prison. As the allegations mount and the legal drama intensifies, The Diddy Diaries delivers a compelling narrative of a man grappling with the very real possibility of losing everything he once held dear.<br /><br />With every episode, listeners are drawn deeper into this unfolding saga of celebrity, power, and justice. The Diddy Diaries not only explores the high-profile case but also delves into the human cost behind the headlines. As Diddy’s world unravels, so too does the carefully constructed image he spent decades building. This podcast is a must-listen for anyone who wants to understand the full scope of Sean Combs’ downfall, where the stakes couldn’t be higher and the outcome remains uncertain.<br /><br />Prepare for a rollercoaster ride through the most shocking and consequential scandal in recent entertainment history. Tune in to The Diddy Diaries: The Downfall of Sean Combs to witness the dramatic fall of a man who once ruled the music world but now fights for his freedom in the face of life-altering allegations.<br />",
        "id": 6672935,
        "author": "Bobby Capucci"
    },
    {
        "title": "مقالات",
        "url": "https://www.spreaker.com/show/4323286/episodes/feed",
        "description": "",
        "id": 2413761,
        "author": "Radio Mojahed - رادیو مجاهد"
    },
    {
        "title": "FTN Fantasy Baseball Podcast",
        "url": "https://feeds.simplecast.com/QE6FyHY7",
        "description": "The FTN Fantasy Baseball Podcast is your ultimate weekly strategy session to dominate your fantasy baseball leagues! Join hosts Vlad Sedler and Jason Anthony as they deliver expert analysis, insider tips, and in-depth breakdowns to give you a winning edge. From player evaluations to waiver wire gems, trade advice to lineup optimization, Vlad and Jason cover it all with precision and passion. Tune in each week to stay ahead of the competition and transform your fantasy baseball experience with actionable insights and winning strategies. Elevate your fantasy game and WIN MORE with this podcast.",
        "id": 213890,
        "author": "FTN Media"
    },
    {
        "title": "Tea For 2",
        "url": "https://media.rss.com/tea-for-2/feed.xml",
        "description": "<p><strong><em>Giggles & Gossip To Fill Your Cup - Us, You And A Brew!</em></strong></p><p>Join <strong>Caitlin</strong> <strong>Lavagna</strong> and <strong>Kaysha</strong> <strong>Louvain</strong> for a cuppa as they chat all things music, stage and screen. Plus it wouldn’t be <em>‘Tea For 2’</em> without plenty of gossip and giggles!</p><p><strong><em>Nothing is off-limits!</em></strong></p>",
        "id": 7143696,
        "author": "Tea For 2"
    },
    {
        "title": "Lehto's Law",
        "url": "https://feeds.soundcloud.com/users/soundcloud:users:117273733/sounds.rss",
        "description": "Steve Lehto: author, attorney.  Over 30 years of practicing Michigan Lemon Law and more than a dozen books written.\nTo support my audio podcast: www.patreon.com/stevelehto\nhttp://www.lehtoslaw.com",
        "id": 752632,
        "author": "Lehto's Law"
    },
    {
        "title": "Gold Goats 'n Guns Podcast",
        "url": "https://www.spreaker.com/show/3131277/episodes/feed",
        "description": "Handing Out Red-Pills on the Street Corner of the Culture War",
        "id": 236253,
        "author": "Tom Luongo"
    },
    {
        "title": "Noticias Hispanas 02",
        "url": "https://www.spreaker.com/show/4964733/episodes/feed",
        "description": "Escucha nuestra emisora en vivo aquí: <a href=\"https://widget.spreaker.com/player?show_id=3279340\" rel=\"noopener\">https://widget.spreaker.com/player?show_id=3279340</a>",
        "id": 4919801,
        "author": "Noticias Hispanas"
    },
    {
        "title": "Las noticias de la SER",
        "url": "https://www.spreaker.com/show/6154643/episodes/feed",
        "description": "¿Qué ha pasado en el mundo? ¿Qué ha ocurrido en tu país? El podcast para estar enterado. Las noticias, actualizadas cada hora. Suscríbete para estar siempre al tanto.",
        "id": 6883060,
        "author": "Felipe Areal"
    },
    {
        "title": "Las noticias de la SER",
        "url": "https://www.spreaker.com/show/6154891/episodes/feed",
        "description": "¿Qué ha pasado en el mundo? ¿Qué ha ocurrido en tu país? El podcast para estar enterado. Las noticias, actualizadas cada hora. Suscríbete para estar siempre al tanto.",
        "id": 6883598,
        "author": "Felipe Areal"
    }
]