[
    {
        "title": "As The Money Burns",
        "url": "https://feeds.simplecast.com/Bo77djko",
        "description": "All they want is love.  Everyone else wants their fortune.  Based on historical research, As The Money Burns is a deep exploration into the lives of actual heirs and heiresses to some of America’s most famous fortunes and what happens when the Great Depression hits.A narrative podcast that explores history, psychology, and finance.",
        "id": 804426,
        "author": "Nicki Woodard"
    },
    {
        "title": "The John Batchelor Show",
        "url": "https://audioboom.com/channels/4002274.rss",
        "description": "",
        "id": 440473,
        "author": "John Batchelor"
    },
    {
        "title": "Unresolved",
        "url": "https://www.spreaker.com/show/3266604/episodes/feed",
        "description": "Every day, stories unfold that have no resolution. Unresolved is an immersive look at those stories, as host Micheal Whelan tries to determine why these stories - unsolved crimes and other unexplained phenomena - have no ending.<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/unresolved--3266604/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/unresolved--3266604/support</a>.",
        "id": 743080,
        "author": "Unresolved Productions"
    },
    {
        "title": "Daf From RBS",
        "url": "https://feeds.transistor.fm/daf-from-rbs",
        "description": "Daily Daf Yomi shiur delivered in Ramat Bet Shemesh.\nShiur is in English and approximately 30 minutes.",
        "id": 6241916,
        "author": "R' Mendy Newman"
    },
    {
        "title": "Theology Central",
        "url": "https://www.spreaker.com/show/3577399/episodes/feed",
        "description": "Theology Central is a podcast dedicated to deep theological analysis, critical sermon reviews, and doctrinal clarity in an age of confusion. Each episode explores Scripture through a confessional, law and gospel lens—rejecting celebrity-driven faith and focusing on truth, not trends. From exegetical teaching to historical theology and cultural critique, this podcast challenges mainstream assumptions and calls the church back to serious, Scripture-centered thinking. <br />Expect honest engagement with difficult texts, critical interaction with popular Christian messages, and a refusal to compromise biblical fidelity for modern relevance.<br /><br />Topics include biblical exegesis, sermon reviews, church history, spiritual deception, false teaching, and the danger of politicized Christianity.”",
        "id": 413403,
        "author": "Theology Central Media | Confessional Theology & Critical Analysis"
    },
    {
        "title": "LOA Recon with the Good Vibe Coach",
        "url": "https://loarecon.libsyn.com/rss",
        "description": "Good Vibe Coach Jeannette Maw offers manifesting support and inspiration for conscious creators mastering the law of attraction to create their own reality.",
        "id": 50918,
        "author": "Jeannette Maw"
    },
    {
        "title": "Deuce & Mo: A Sacramento Kings, NBA & WNBA podcast",
        "url": "https://feeds.redcircle.com/f0efa5ce-f8a2-4a23-b0dd-6390d214cfb4",
        "description": "We talk hoops. Deuce Mason and Morgan Ragan are basketball junkies based in Sacramento who talk a ton of Kings basketball and about all the big topics in the NBA. They also talk with NBA players, broadcasters and journalists around the league.",
        "id": 1106493,
        "author": "Deuce & Mo"
    },
    {
        "title": "Los Come Banco",
        "url": "https://www.spreaker.com/show/4355296/episodes/feed",
        "description": "Sea sincero,<br /><br />Como fanatico del deporte, dime cuantas veces has tenido discusiones con tus panas de quien es el mejor.<br /><br />Jordan vs Lebron<br />Yankees vs Red Sox<br />Lakers vs Celtics<br />Cowboys vs Steelers<br /><br />Entre nuestros panas, esto es algo a diario.",
        "id": 931996,
        "author": "Los Come Banco"
    },
    {
        "title": "The Age of Napoleon Podcast",
        "url": "https://feeds.megaphone.fm/ADL5280986787",
        "description": "<p>The Age of Napoleon is a history podcast about the life and career of Napoleon Bonaparte as well as the general context of Europe between the early eighteenth and early nineteenth century. It is about big trends and the grand sweep of history, as well as the smaller, individual stories that bring them to life.</p>",
        "id": 1117878,
        "author": "Everett Rummage"
    },
    {
        "title": "Dodger Talk",
        "url": "https://www.spreaker.com/show/5937289/episodes/feed",
        "description": "Dodger Talk with David Vassegh, Tim Cates, José Mota bringing you the latest on the Los Angeles Dodgers ",
        "id": 327247,
        "author": "AM 570 LA Sports (KLAC-AM)"
    },
    {
        "title": "History of Persia",
        "url": "https://feeds.redcircle.com/60378feb-a889-47bf-b268-3de2fe6f93f3",
        "description": "A podcast dedicated to the history of Persia, and the great empires that ruled there beginning with the Achaemenid Empire of Cyrus the Great and the foundation of an imperial legacy that directly impacted ancient civilizations from Rome to China, and everywhere in between. Join me as we explore the cultures, militaries, religions, successes, and failures of some of the greatest empires of the ancient world.",
        "id": 620591,
        "author": "Trevor Culley and HoPful Media"
    },
    {
        "title": "Reading With Your Kids Podcast",
        "url": "https://readingwithyourkids.libsyn.com/rss",
        "description": "Reading With Your Kids is all about encouraging parents to read with their kids, and cook with their kids, and do activities with their kids, and experience tv, movies and music together. In other words, our podcast is all about helping parents build stronger relationships with their kids.",
        "id": 793427,
        "author": "Jedlie Circus Productions, Inc"
    },
    {
        "title": "Battered Herons: An Inter Miami Podcast",
        "url": "https://feeds.transistor.fm/battered-soccer-fans",
        "description": "Two Inter Miami fans and Season Ticket Holders have a weekly podcast about all things Inter Miami. Daniel a life long soccer fan, and Kris who has just recently fallen in love with the beautiful game. Two different points of view, but a shared love for the club and game.",
        "id": 5557477,
        "author": "Battered Fans"
    },
    {
        "title": "The Playbook Podcast",
        "url": "https://feeds.megaphone.fm/ASD6963560714",
        "description": "<p>POLITICO’s Jack Blanchard and Dasha Burns bring their fresh insight, analysis and reporting to the biggest story driving the day in the nation’s capital.</p>",
        "id": 53549,
        "author": "POLITICO"
    },
    {
        "title": "The NoSleep Podcast",
        "url": "https://audioboom.com/channels/5101646.rss",
        "description": "",
        "id": 504657,
        "author": "Creative Reason Media Inc."
    },
    {
        "title": "The Conversation with Dasha Burns",
        "url": "https://feeds.megaphone.fm/ASD7844263268",
        "description": "<p>The Conversation with POLITICO’s Dasha Burns is a fresh take on the traditional Sunday show format, going beyond conventional wisdom and short sound bites to broaden the political conversation. Each week, Dasha will sit down with one of the most compelling – and sometimes unexpected – power players in Washington and beyond for a real discussion about how they are shaping the current moment.</p>",
        "id": 642858,
        "author": "POLITICO"
    },
    {
        "title": "Couchgeflüster",
        "url": "https://couchgefluester.podigee.io/feed/mp3",
        "description": "Kinderwunsch, Beziehungskrisen, Dating, Liebeskummer: In ihrem Podcast Couchgeflüster (@couchgeflüster.vienna) diskutieren Influencerin Leonie-Rachel Soyel (@leonie_rachel) und Journalistin Sinah Edhofer (@sinahsinsta) die großen und kleinen Fragen des Lebens, der Liebe und teilen witzige Anekdoten aus ihrem eigenen Leben und dem ihrer \"Lauschis\".\nCouchgeflüster zählt zu Österreichs größten und beliebtesten Podcasts. Kooperationsanfragen sowie alle anderen Anfragen gerne an: pr@leonierachel.com",
        "id": 884747,
        "author": "Leonie Rachel Soyel, Sinah Edhofer"
    },
    {
        "title": "bto – der Ökonomie-Podcast von Dr. Daniel Stelter",
        "url": "https://feeds.acast.com/public/shows/649948e4db3d690011987638",
        "description": "bto – beyond the obvious – der Ökonomie-Podcast von Dr. Daniel Stelter. Der Ökonom und Strategieberater bringt Wirtschaft und Finanzen auf den Punkt. Unverblümt und unabhängig gibt Stelter pointierte Antworten auf die Wirtschaftsfragen unserer Zeit. Featured by Handelsblatt.<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 3667427,
        "author": "Dr. Daniel Stelter"
    },
    {
        "title": "Missing Persons Mysteries",
        "url": "https://www.spreaker.com/show/5624803/episodes/feed",
        "description": "<a href=\"https://www.youtube.com/@MissingPersonsMysteries\" target=\"_blank\" rel=\"noreferrer noopener\">Welcome to Missing Persons Mysteries!</a><br /><br />Best Selling Author and Entertainment Icon Steve Stockton discuss Missing Persons Cases, True Paranormal Stories, Unsolved Mysteries, Missing 411 Cases, Unexplained Phenomenon, The Supernatural, True Crime, Bizarre and Unsolved Disappearances and Stories of Survival.<br /><br /><a href=\"https://www.youtube.com/@MissingPersonsMysteries\" target=\"_blank\" rel=\"noreferrer noopener\">🎞️ Check out our YouTube channel!</a><br /><br /><a href=\"https://www.patreon.com/missingpersons\" target=\"_blank\" rel=\"noreferrer noopener\"> 🎉 Check out our Patreon for exclusive content! </a><br /><br /><a href=\"https://www.spreaker.com/show/missingpersonsmysteries\" target=\"_blank\" rel=\"noreferrer noopener\">🙌 Missing Persons Mysteries Podcast</a><br /><br /><a href=\"https://www.youtube.com/playlist?list=PLBX35PgIa2RCg7nAlODRiMOsjQ7FD-XoI\" target=\"_blank\" rel=\"noreferrer noopener\">🆕 Playlist with ALL the channels content</a><br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/missing-persons-mysteries--5624803/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/missing-persons-mysteries--5624803/support</a>.",
        "id": 4261229,
        "author": "Steve Stockton"
    },
    {
        "title": "مقالات",
        "url": "https://www.spreaker.com/show/4323286/episodes/feed",
        "description": "",
        "id": 2413761,
        "author": "Radio Mojahed - رادیو مجاهد"
    },
    {
        "title": "Software Unscripted",
        "url": "https://feeds.acast.com/public/shows/664fde3eda02bb0012bad909",
        "description": "Software Unscripted, A weekly podcast of casual conversations about code hosted by Richard Feldman.<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 5320480,
        "author": "Richard Feldman"
    },
    {
        "title": "The Pacers Post Up",
        "url": "https://feeds.simplecast.com/Sm5HKYHz",
        "description": "Brad and Ryan Knight, affectionately known as The Brothers of Basketball, are lifelong Indiana Pacers fans turned podcast hosts who bring heart, humor, and hoops knowledge to The Pacers Post Up, a show built entirely by fans, for fans.\n\nBrad’s love for the Pacers dates back to the Reggie Miller era—the legendary playoff heroics, the fierce Eastern Conference Finals battles, and the team’s lone trip to the NBA Finals in 2000 are part of his basketball DNA. He still vividly remembers watching the Malice at the Palace unfold in his parents’ living room. That deep-rooted connection only grew over the years. Brad’s wife has been a Pacemate for 8 seasons, and he credits their parents’ investment in season tickets as a key part of the family’s shared bond with the Blue and Gold.\n\nRyan, a few years younger, missed the height of the Reggie era but became fully indoctrinated during the Paul George years—when the Pacers battled LeBron and the Heat year after year. A proud member of the G2 Fan Zone in the late 2010s and the world’s biggest Lance Stephenson fan, Ryan brings unapologetic energy and passion to the pod.\n\nTogether, Brad and Ryan launched The Pacers Post Up as a passion project to give Pacers fans a voice in the media landscape. Their goal has always been to deliver meaningful basketball conversation in a way that’s accessible, insightful, and fun. Whether diving into analytics and X’s and O’s or riding high on the emotional wave of a big win, their show strikes a balance that keeps fans informed and entertained.\n\nSince launching, the brothers have followed the team from Vegas (for the inaugural NBA In-Season Tournament) to Paris (for the NBA Global Games), covered the All-Star Weekend in Indy, and chronicled this new golden era of Pacers basketball with playoff runs to the Eastern Conference Finals.\n\nThey bleed blue and gold and love nothing more than building community through the game that’s meant so much to their lives.",
        "id": 6765923,
        "author": "Brad and Ryan Knight, Bleav"
    },
    {
        "title": "VOV - Chương trình thời sự",
        "url": "https://anchor.fm/s/86ec8d4/podcast/rss",
        "description": "Các chương trình thời sự trực tiếp trong ngày. Thời sự sáng: 6h00-6h30. \nThời sự trưa: 12h00-13h00. Thời sự chiều: 18h00-19h00.\nSearch \"VOV\" trên ứng dụng để nghe nhiều kênh khác của VOV.",
        "id": 480076,
        "author": "Đài Tiếng nói Việt Nam"
    },
    {
        "title": "Ninos Corner",
        "url": "https://back.studeo.fm/api/v1/podcasts/93/rss-feeds",
        "description": "Ninos Corner",
        "id": 5594980,
        "author": "David Rodriguez"
    },
    {
        "title": "Sons of Liberty Podcast",
        "url": "http://rss.gcnlive.com/sonsOfLiberty/feed.xml",
        "description": "Then get ready for the revolution with The Sons of Liberty! Bradlee Dean delivers a hard-hitting message of truth, exposing unconstitutional policy through constitutional law.",
        "id": 736091,
        "author": "Genesis Communications Network, Inc."
    },
    {
        "title": "Ghost of a Podcast: Astrology & Advice with Jessica Lanyadoo",
        "url": "https://feeds.megaphone.fm/JESSICALANYADOOGHOSTOFAPODCAST3541145811",
        "description": "<p>Ghost of a Podcast is your twice weekly Astrology + Advice podcast hosted by Jessica Lanyadoo, an astrologer, psychic medium, and animal communicator with over 28 years of consulting experience. On Sundays, Jessica guides you through your horoscope, providing valuable insights and strategies for the week ahead — both personally, as well as from a social and political perspective. Then, on Wednesdays, she offers a listener one of her highly relatable readings which reveal the human side of Astrology + woo. https://www.lovelanyadoo.com/ghost-of-a-podcast Song: Sonny & The Sunsets</p>",
        "id": 632210,
        "author": "Jessica Lanyadoo"
    },
    {
        "title": "Céu do Momento - Astrologia no seu dia a dia",
        "url": "http://rss.castbox.fm/everest/0a610f48a36549ff8312691fc5a24d0d.xml",
        "description": "Olá, sejam bem-vindos a mais um \"CÉU DO MOMENTO\", trazendo a cada dia uma pílula da sabedoria dos astros no seu dia a dia! Meu nome é Guilherme Schultz, sou astrólogo e professor de astrologia. Fico extremamente contente em poder compartilhar minhas reflexões sobre a observação dos astros e suas influências a nível coletivo, a fim de provocá-los diariamente a um despertar de consciência.",
        "id": 438444,
        "author": "Guilherme Schultz"
    },
    {
        "title": "St. Anthony's Catholic Church of Shenzhen",
        "url": "https://feeds.simplecast.com/zBAgUjq3",
        "description": "深圳市圣安多尼教堂 地址：深圳市福田区农林路65号 弥撒时间：周一至周六早7:15, 周六晚间7:00, 周日上午9:00(中文), 上午11:00(英文), 晚间7:00(英文). 堂区办公室电话：0755-83799096; 堂区公众号：深圳圣安多尼堂 Mass Time:Mon.-Sat.7:15am;Sun.9am.(CH);11am(Eng);7pm(CH)",
        "id": 6772018,
        "author": "XAVIER"
    },
    {
        "title": "Republic Broadcasting Network",
        "url": "https://www.republicbroadcastingarchives.org/feed/",
        "description": "Real News Real Talk Real People",
        "id": 1057998,
        "author": "Republic Broadcasting Network"
    },
    {
        "title": "Josh Monday Christian and Conspiracy Podcast",
        "url": "https://www.spreaker.com/show/6611118/episodes/feed",
        "description": "This Podcast is two brothers exposing the evil we face in this world. We go over conspiracy theories and show the audience how it relates to the bible. We will feature one guest a week so you will get different perspectives and personalities weekly. The host Josh Monday is a Christian rapper and Army Veteran. His co host Jason Monday is a Christian, a father and devoted husband. You will see a variety of different podcast come through and be guest on the show, rap artist, Pastors, subject matter experts and Servants of the Lord. Please listen with an open heart and share with everyone.<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/josh-monday-christian-and-conspiracy-podcast--6611118/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/josh-monday-christian-and-conspiracy-podcast--6611118/support</a>.",
        "id": 3652447,
        "author": "Josh Monday"
    },
    {
        "title": "Locked On NHL - Daily Podcast On The National Hockey League",
        "url": "https://feeds.simplecast.com/_72Ry4s_",
        "description": "Locked On NHL podcast is the daily podcast that drops the puck and keeps you ahead of the game and the first to know the latest news, analysis, and insider info from all around the National Hockey League. Whether you bleed the colors of the Original Six teams or cheer for the newest franchises, the Locked On NHL podcast provides your daily hockey fix with expert opinions, local analysis, and coverage of all aspects of the NHL. Starting Mondays with Gil Martin chatting about the biggest stories around the NHL with the local experts of the Locked On NHL channel; to Tuesdays with Seth Toupal and Nick Morgan, who tackle all the news from the Western Conference; to Ross Levitan and Mike DiStefano with a deep dive into the Eastern Conference on Wednesdays; to Jay Forster and Hunter Hodies presenting league Power Rankings each Thursday and rounding the week out on Fridays with Gil Martin and Rachel Donner reviewing the week that was, featuring bi-weekly updates on the world of women’s hockey with Erica L. Ayala. Locked On NHL takes you beyond the ice for the inside scoops on the biggest stories from every locker room all over the NHL. The Locked On NHL podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 494711,
        "author": "Locked On Podcast Network"
    },
    {
        "title": "Hack The Movies",
        "url": "https://www.spreaker.com/show/5023627/episodes/feed",
        "description": "Join Tony and the Hack The Movies crew twice a week as they talk about tapes or discuss newer movies and film topics!",
        "id": 3696245,
        "author": "Screenwave Media"
    },
    {
        "title": "Locked On NBA – Daily Podcast On The National Basketball Association",
        "url": "https://feeds.simplecast.com/XThpxTzR",
        "description": "The Locked On NBA podcast is your daily ticket to everything NBA. \nOn the daily Locked On NBA show, Matt Moore (Locked On Nuggets), Haize (Locked On Bulls), and Doug Branson (Locked On Hornets) discuss the latest news, rumors, analysis, and insider info in 30 minutes from all over the league.\nOn the Locked On NBA Game Night show, our group of local experts tackle \"Every Game, Every Night\" by literally covering every game 7 days a week from the Pre-season to the NBA Finals and beyond. Hosts Danny Cunningham (Locked On Cavs), Swipa (Locked On Nuggets), Nick Angstadt (Locked On Mavericks), Camille Davis (Locked On Bucks), Wes Goldberg (Locked On Heat), Tony East (Locked On Pacers), Jackson Gatlin (Locked On Rockets), David Ramil (Locked On Heat), John Karalis (Locked On Celtics), Jake Madison (Locked On Pelicans), Rylan Stiles (Locked On Thunder), Gavin Schall (Locked On Knicks), Haize (Locked On Bulls) & Swipa (Locked On Nuggets) will take you beyond the scoreboard with the best NBA analysts in the business. Part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 217331,
        "author": "Locked On Podcast Network"
    },
    {
        "title": "SilviCast",
        "url": "https://feeds.buzzsprout.com/1135730.rss",
        "description": "<p><a href=\"https://www.uwsp.edu/wfc/wisconsin-forestry-center/silvicast/\">SilviCast</a> is a podcast devoted to silviculture: the science, practice, and art of forestry. We explore current topics in forest management, highlight innovative practices, and interview practitioners and researchers aiming to solve challenges facing today’s managers. The show is tailored for foresters and other land managers, whether it’s listening at the office or in the truck on the way to the field. SilviCast is hosted by <a href=\"https://dnr.wisconsin.gov/topic/forestry\">Wisconsin Department of Natural Resources</a> silviculturists Greg Edge and Brad Hutnik and produced by the University of Wisconsin-Stevens Point’s <a href=\"https://www.uwsp.edu/wfc/wisconsin-forestry-center/\">Wisconsin Forestry Center</a>. </p>",
        "id": 36309,
        "author": "Wisconsin Forestry Center and Wisconsin Department of Natural Resources"
    },
    {
        "title": "Best of the Spectator",
        "url": "https://feeds.acast.com/public/shows/68358fb5e1abc4be6b0308eb",
        "description": "Home to the Spectator's best podcasts on everything from politics to religion, literature to food and drink, and more. A new podcast every day from writers worth listening to.<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 45373,
        "author": "The Spectator"
    },
    {
        "title": "Mindful In Minutes Meditation",
        "url": "https://feeds.megaphone.fm/MINDMM9513882275",
        "description": "<p>Short, weekly guided meditations to help you stress less and live more. Each week join Kelly Smith, founder of Yoga For You, for simple and grounded guided meditations that are 20 minutes or less and cover an array of topics that will help you with real life struggles like anxiety, insomnia, self-esteem and creating a morning ritual.</p>",
        "id": 226511,
        "author": "Mindful In Minutes Meditation"
    },
    {
        "title": "Joel Osteen Podcast",
        "url": "https://feeds.simplecast.com/_IGBdGdB",
        "description": "Welcome to the Joel Osteen Daily Podcast. \nJoel & Victoria Osteen inspire people to reach their dreams, find fresh beginnings and live their best life. \nBoth he and Victoria live in Houston, TX. \nVisit Joel’s website at joelosteen.com.\nSubscribe to SiriusXM Podcasts+ to listen to new episodes of the Joel Osteen Podcast ad-free and a whole week early. \nStart a free trial now on Apple Podcasts or by visiting siriusxm.com/podcastsplus.",
        "id": 396565,
        "author": "Joel Osteen, SiriusXM"
    },
    {
        "title": "The Cloudcast",
        "url": "https://feeds.buzzsprout.com/3195.rss",
        "description": "<p>The Cloudcast (@cloudcastpod) is the industry's #1 Cloud Computing podcast, and the place where Cloud meets AI.  Co-hosts Aaron Delp (@aarondelp) & Brian Gracely (@bgracely) speak with technology and business leaders that are shaping the future of business. Topics will include Cloud Computing | AI | AGI | ChatGPT | Open Source | AWS | Azure | GCP | Platform Engineering | DevOps | Big Data | ML | Security | Kubernetes | AppDev | SaaS | PaaS . </p>",
        "id": 407552,
        "author": "Massive Studios"
    },
    {
        "title": "Effizienter Lernen - Arbeiten - Leben! Der Selbstmanagement und Zeitmanagement Podcast!",
        "url": "https://selbstmanagement.podigee.io/feed/mp3",
        "description": "Dieser Podcast liefert dir wöchentlich Ideen zum effizienteren Arbeiten, Lernen und Leben. Es gibt kein Patent-Rezept zum Thema Selbstmanagement, aber es gibt viele Tipps, Tricks und Informationen mit denen du dein Selbstmanagement massiv verbessern kannst. \nWenn du also produktiver und effizienter werden und mehr Zeit für die wirklich wichtigen Dinge im Leben haben willst, bist du in diesem Podcast genau richtig.",
        "id": 452210,
        "author": "Thomas Mangold"
    },
    {
        "title": "Unnamed Automotive Podcast",
        "url": "https://feeds.fireside.fm/unnamedautomotivepodcast/rss",
        "description": "Benjamin and Sami are two journalists who take a weekly look at the funnier side of the automotive industry and the cars they drive.",
        "id": 532003,
        "author": "Unnamed Automotive Podcast"
    },
    {
        "title": "Abierta Mente: Conversaciones con Yoga al Alma",
        "url": "https://abiertamente.libsyn.com/rss",
        "description": "Yoga, literatura, nutrición, crecimiento personal y vida plena. Alimentamos el alma a través de conversaciones y entrevistas llenas de contenido positivo. Quiero que podamos ser nuestra mejor versión y vivir más abiertamente. Comparto desde mi experiencia como profesora de yoga, comunicadora, mamá y empresaria. Y como no tengo todas las respuestas, invito a otros para que nos complementen.",
        "id": 572291,
        "author": "Ana Isabel Santa María"
    },
    {
        "title": "The Rachel Hollis Podcast",
        "url": "https://feeds.simplecast.com/j2OmaLnl",
        "description": "From 4 x New York Times best-selling author Rachel Hollis comes the ultimate podcast for anyone looking for more joy and purpose in their lives. Featuring candid interviews with top performers in business, media, and lifestyle, as well as deep dives into topics like health and motivation, The Rachel Hollis Podcast has everything you need to level up your life!",
        "id": 584526,
        "author": "Three Percent Chance"
    },
    {
        "title": "Psychologie to go!",
        "url": "https://psychologie-to-go.podigee.io/feed/mp3",
        "description": "Bin ich ein Messie? Wie bekomme ich meine Eifersucht in den Griff? Woran erkenne ich einen Narzissten? \nJeden Sonntag gibt die Psychotherapeutin Franca Cerutti Einblicke in ihre Praxis und in die spannende Welt der Psychologie. Unterhaltsam und erfrischend direkt greift sie auf, was Menschen bewegt. Mal teilt sie pragmatische Impulse, mal führt sie ihre Zuhörer:innen durch fesselnde Lebensgeschichten - immer sorgt sie für Ahas.\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/psychologietogo\nDu möchtest Werbung in diesem Podcast schalten? Dann erfahre hier mehr über die Werbemöglichkeiten bei Seven.One Audio: https://www.seven.one/portfolio/sevenone-audio",
        "id": 626095,
        "author": "Dipl. Psych. Franca Cerutti"
    },
    {
        "title": "KREWKAST",
        "url": "https://cdn.julephosting.de/podcasts/544-krewkast/feed.rss",
        "description": "Podcast by Felix Bahlinger, Julian Völzke",
        "id": 633213,
        "author": "Felix Bahlinger, Julian Völzke"
    },
    {
        "title": "Holy Smoke",
        "url": "https://feeds.acast.com/public/shows/6835905c2780b226c72e9d0d",
        "description": "The most important and controversial topics in world religion, thoroughly dissected by a range of high profile guests. Presented by Damian Thompson.<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 637985,
        "author": "The Spectator"
    },
    {
        "title": "Value Investing FM",
        "url": "https://www.ivoox.com/value-investing-fm_fg_f1499494_filtro_1.xml",
        "description": "Podcast en el que Paco Lodeiro y Adrián Godás tenemos como objetivo ayudarte a rentabilizar ese dinero que tanto cuesta ganar y ahorrar a través de la inversión en bolsa mediante el método más seguro, sensato y rentable, el value investing.",
        "id": 714412,
        "author": "Value Investing FM"
    },
    {
        "title": "The Michigan DNR's Wildtalk Podcast",
        "url": "http://feeds.feedburner.com/wildtalkpodcast",
        "description": "The Wildtalk Podcast is a production of the Michigan Department of Natural Resources Wildlife Division. On the Wildtalk Podcast, representatives of the Wildlife Division chew the fat and shoot the scat about all things habitat, feathers, and fur. With insights, interviews, and listener questions answered on the air, you'll come away with a better picture of what's happening in the world of Michigan's wildlife. Thank you for listening.\r\n\r\nEmail questions to:\r\ndnr-wildlife@michigan.gov\r\nor call 517-284-9453",
        "id": 743487,
        "author": "Michigan Department of Natural Resources Wildlife Division"
    },
    {
        "title": "The WW2 Podcast",
        "url": "https://ww2podcast.libsyn.com/rss",
        "description": "A military history podcast that looks at all aspects of WWII.\n\nWith WW2 slipping from living memory I aim to look at different historical aspects of the Second World War.",
        "id": 745440,
        "author": "Angus Wallace"
    },
    {
        "title": "Why Am I Sleeping Alone",
        "url": "https://feeds.buzzsprout.com/1003321.rss",
        "description": "<p>Comedy and Relationship advice from “So-Called” experts ???<br><br>Ever wonder …. #whyamisleepingalone !!!<br><br>We are here to HELP… with a unique perspective on Life, Marriage, Friendship and ALL around happiness 🤩<br><br>Podcast theme song - Sleeping With My Clothes On -by Don Shenenberger, ASCAP, Cabin Hill Media, 2024</p>",
        "id": 798449,
        "author": "Me (Chris), STACEY, & Mr Jeff’s Podcast"
    },
    {
        "title": "Revista 5W",
        "url": "https://www.ivoox.com/feed_fg_f1295879_filtro_1.xml",
        "description": "Cada mes un nuevo podcast monográfico para comprender qué ocurre en el mundo. Realizado por los periodistas y analistas que mejor conocen el terreno y su contexto. Revista 5W: pequeñas historias, grandes explicaciones.",
        "id": 850239,
        "author": "Revista 5W"
    },
    {
        "title": "Un Libro Una Hora",
        "url": "https://fapi-top.prisasd.com/podcast/playser/un_libro_una_hora/itunestfp/podcast.xml",
        "description": "Aprende a leer, aprende de literatura escuchando. Un programa para contar un libro en una hora. Grandes clásicos de la literatura que te entran por el oído. Dirigido por Antonio Martínez Asensio, crítico literario, productor, escritor y guionista. En directo los domingos a las 05:00 y a cualquier hora si te suscribes. En Podimo, ¿Y ahora qué leo? nuestro spin off con los imprescindibles de la temporada https://go.podimo.com/es/ahoraqueleo",
        "id": 854189,
        "author": "SER Podcast"
    },
    {
        "title": "Achtsamkeit leben – Dein Podcast mit Peter Beer",
        "url": "https://peterbeer.libsyn.com/rss",
        "description": "Wo ist der Unterschied zwischen Menschen, die glücklich und erfolgreich sind und denjenigen, die sich jeden Tag durchs Leben schleppen? In diesem Podcast gehen wir gemeinsam der Frage nach, was es braucht, um in dieser Gesellschaft ein zufriedenes und erfolgreiches Leben zu führen. Es erwartet dich praktisches Wissen aus dem Coaching, der Lehre der Achtsamkeit, meinen Büchern, der positiven Psychologie, Experteninterviews mit inspirierenden Persönlichkeiten und vielem mehr! Lass uns loslegen!",
        "id": 863568,
        "author": "Peter Beer"
    },
    {
        "title": "Pack-A-Day: Your Daily Packers Podcast",
        "url": "https://feeds.simplecast.com/wX3kDX_W",
        "description": "Writers and podcasters from all over Packers Nation bring you this new and exciting daily Packers podcast. Twenty minutes a day, 365 days a year, this is your new number one source for one-of-a-kind Packers' content every single day of the year. We've designed a podcast for Packer fans so that you can stay up-to-date with every piece of Packers information including news, rumors, game reviews, player grades, NFL Draft information, and much, much more! Join us everyday for the Pack-A-Day podcast! TickPick.com/PackADay",
        "id": 953559,
        "author": "Blue Wire"
    },
    {
        "title": "Lifespring! Media All Shows",
        "url": "https://lifespringmedia.com/feed/podcast/",
        "description": "This is where you will hear all the content produced by Lifespring! Media. The flagship show is \"LIfespring!\", which was the world's first Christian podcast not based on repurposed church sermons. Host Steve Webb, the O.G. Godcaster, discusses a varied mix of subjects from \"If there is really a God, why do horrible things happen in the world?\" to \"Does God hate gays?\". In addition, there are interviews, music and lots more fun. Other shows in the Lifespring! Media family are \"Lifespring! HymnStories\", \"In Touch With God's Character\", \"Lifespring! One Year Bible\", and \"The Lifespring! Weekend Music Show\".",
        "id": 958956,
        "author": "Steve Webb"
    },
    {
        "title": "Law School",
        "url": "https://anchor.fm/s/1a19a1a8/podcast/rss",
        "description": "The Law School of America podcast is designed for listeners who what to expand and enhance their understanding of the American legal system. It provides you with legal principles in small digestible bites to make learning easy. If you're willing to put in the time, The Law School of America podcasts can take you from novice to knowledgeable in a reasonable amount of time.",
        "id": 989505,
        "author": "The Law School of America"
    },
    {
        "title": "Terrores Nocturnos",
        "url": "https://feeds.megaphone.fm/ESCP9726090222",
        "description": "<p>Historias de terror, misterio, casos reales, hechos inexplicables... Cada martes te traemos una nueva historia que no te dejará dormir. Con Emma Entrena y Silvia Ortiz. Realizado por Yes We Cast. Ilustraciones TheGray.Art</p><p>Hazte con una suscripción de pago: <a href=\"https://www.patreon.com/Terroresnocturnos\">https://www.patreon.com/Terroresnocturnos</a></p>",
        "id": 1022185,
        "author": "Terrores Nocturnos"
    },
    {
        "title": "Real Ghost Stories Online",
        "url": "https://audioboom.com/channels/4567086.rss",
        "description": "",
        "id": 1059526,
        "author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio"
    },
    {
        "title": "The Capital Radio 604 Podcast",
        "url": "https://capitalradio604.libsyn.com/rss",
        "description": "Archived material from the original broadcast days of the station, plus new archives from the online stream.",
        "id": 1065381,
        "author": "Capital Radio 604"
    },
    {
        "title": "Defining Duke: An Xbox Podcast",
        "url": "http://feeds.feedburner.com/DefiningDuke",
        "description": "<p>Defining Duke is a weekly podcast dedicated to all things Xbox co-hosted by beloved YouTuber MrMattyPlays and Lord Cognito. Whether you're a fan and player of Xbox Series X|S, still hanging around on Xbox One, or have fond memories of Xbox 360 and the original Xbox, our show is for you. We go over the news, talk about the games we're playing, scour rumors and speculation, and much more. We publish each and every Sunday, and you can get the show three days early and ad-free by supporting us on Patreon at patreon.com/laststandmedia</p><p>We wanna make the podcast even better, help us learn how we can: <a href=\"https://bit.ly/2EcYbu4\">https://bit.ly/2EcYbu4</a> </p><p>For advertising opportunities please email <a href=\"mailto:PodcastPartnerships@Studio71us.com\">PodcastPartnerships@Studio71us.com</a>   </p><p>Privacy Policy: <a href=\"https://www.studio71.com/us/terms-and-conditions-use/#Privacy%20Policy\">https://www.studio71.com/us/terms-and-conditions-use/#Privacy%20Policy</a></p>",
        "id": 1366004,
        "author": "Last Stand Media & Studio71"
    },
    {
        "title": "Erfolg ist kein Zufall – Der Nummer 1 Podcast in Deutschland zum Thema Erfolg",
        "url": "https://anchor.fm/s/4d21cd00/podcast/rss",
        "description": "SPIEGEL-Besteller-Autor Maurice Bork interviewt in diesem Podcast erfolgreiche Menschen in unterschiedlichen Bereichen und findet heraus, was sie zu ihrem Erfolg geführt hat. \nMaurice Bork hat es selbst vom Pizza Lieferfahrer zum Multi-Millionär geschafft und führt heute Deutschlands stärkstes Netzwerk für persönliche Weiterentwicklung mit dem Namen Die wichtigste Stunde. \nLerne in diesem Podcast von mehr als 300 erfolgreichen Menschen und nutze ihr Wissen als Inspiration für mehr Glück, Reichtum und Erfüllung auch in deinem Leben. Doch was bedeutet überhaupt Erfolg für dich?",
        "id": 3609220,
        "author": "Maurice Bork"
    },
    {
        "title": "Living for the Cinema",
        "url": "https://feeds.buzzsprout.com/1764842.rss",
        "description": "<p>Short movie reviews from the last 50+ years by Geoff Gershon. https://livingforthecinema.com/</p>",
        "id": 3843086,
        "author": "Geoff Gershon"
    },
    {
        "title": "Scripture Studies with Derek",
        "url": "https://feeds.buzzsprout.com/280189.rss",
        "description": "Scripture studies and thoughts. Testimonies of Believers in Jesus Christ.",
        "id": 4466434,
        "author": "Derek"
    },
    {
        "title": "Learn With Thai Van Linh",
        "url": "https://anchor.fm/s/c556fe1c/podcast/rss",
        "description": "Chào mừng bạn đến với kênh Podcast của Thái Vân Linh. Hy vọng chúng ta sẽ học hỏi và phát triển cùng nhau.\nLinh đã có hơn 23 năm kinh nghiệm trong lĩnh vực tài chính, tiếp thị và vận hành. Linh có niềm đam mê muốn giúp mọi người khám phá trọn vẹn tiềm năng của họ bằng cách cung cấp các công cụ và cảm hứng để làm điều đó. Hiện tại, Linh là Nhà sáng lập và Giám đốc điều hành của Skills Bridge, một công ty tư vấn tập trung vào đào tạo và phát triển các kỹ năng, cũng như cung cấp các dịch vụ tiếp thị và xây dựng thương hiệu. \nĐể liên hệ hợp tác, bạn vui lòng gửi email đến partners@thaivanlinh.com.",
        "id": 5778335,
        "author": "Linh Thai / Thái Vân Linh"
    },
    {
        "title": "dreißig.",
        "url": "https://feeds.acast.com/public/shows/649062107ded6b00111e718e",
        "description": "<p>Hi, wir sind Christina, Katrin und Clare. Wir drei sind Freundinnen, die sich seit 13 Jahren kennen. Mittlerweile sind wir 32. Das heißt auch: Wir haben unsere Zwanziger zusammen erlebt. Haben in WGs gewohnt, studiert, sind gemeinsam gereist, haben unsere Liebe für Weißweinschorle entdeckt und irgendwo zwischen Festivals und Abschlussarbeiten sind wir erwachsen geworden. Und wer erwachsen ist, hat ein Haus, einen Ring am Finger, ein bis drei Kinder, einen guten Job und weiß, wie man eine Dinnerparty ausrichtet. Oder?</p><br><p>Christina lebt in ihrer Altbauwohnung in der Hamburger Innenstadt statt Eigentum zu besitzen. Statt ihre Traumhochzeit zu planen, datet Clare Männer, die mit 38 noch herausfinden müssen, was sie im Leben wollen. Katrin hat zwar ein Kind und ein Haus mit Garten, aber die Pflanzen sterben weiterhin jeden Sommer.</p><br><p>Ist das jetzt also dieses Erwachsen sein, von dem alle früher gesprochen haben? So unterschiedlich unser Leben ist, so wenig oder viel wir Dreißiger-Checklisten abhaken können, so sehr verbindet uns unsere Freundschaft. Wir sprechen über unsere unterschiedlichen Lebensphasen, über Unsicherheiten, Mom Guilt, Datingkatastrophen, Körperstruggle und unsere Beziehungen. Jede Woche Sonntag. Bist du dabei?</p><br><p>Hier findet ihr uns bei Instagram: @dreissig.podcast (<a href=\"https://www.instagram.com/dreissig.podcast/\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.instagram.com/dreissig.podcast/</a>)</p><hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 5780350,
        "author": "Katrin Feuerstein, Christina Calaminus, Clare Devlin"
    },
    {
        "title": "The Bible Breakdown",
        "url": "https://feeds.buzzsprout.com/2164615.rss",
        "description": "<div>Welcome to \"The Bible Breakdown,\" where we break down God’s Word so we can know God better. I'm your host, Brandon Cannon, and I'm here to guide you through the pages of the Bible, one day at a time.</div><div><br><br></div><div>Each day, we'll read through a section of the Bible and explore key themes, motifs, and teachings. Whether you're new to the Bible or a seasoned veteran, I guarantee you'll find something insightful or inspiring. My hope is to encourage you to dive deeper and deeper. </div><div><br></div><div>So grab your Bible, your journal, your coffee, and join me on this journey of faith and discovery. And don't forget to hit that subscribe button to stay up-to-date with our daily readings and breakdowns.</div><div><br></div><div>Remember, as we journey through the pages of the Bible together, we're not just reading a book, we're unlocking the secrets to eternal life. The more we dig, the more we find! Let's get started!<br><br>Bible reading plan and SOAP guide: www.experiencerlc.com/the-bible <br><br>Subscribe to  my weekly newsletter: www.brandoncannon.com</div>",
        "id": 6269103,
        "author": "Brandon Cannon"
    },
    {
        "title": "Past Present Future",
        "url": "https://feeds.megaphone.fm/ARML2708405200",
        "description": "<p>Past Present Future is a bi-weekly History of Ideas podcast with David Runciman, host and creator of Talking Politics, exploring the history of ideas from politics to philosophy, culture to technology. David talks to historians, novelists, scientists and many others about where the most interesting ideas come from, what they mean, and why they matter.</p><p>Ideas from the past, questions about the present, shaping the future.</p><p>New episodes every Thursday and Sunday.</p>",
        "id": 6300636,
        "author": "David Runciman"
    },
    {
        "title": "Wisdom for the Day - Everyday",
        "url": "https://feeds.buzzsprout.com/2272735.rss",
        "description": "<p>This daily meetup is a great way to start or end your day, in the Word of God. Short, daily devotionals designed to set you on the correct course for your life. Wisdom for YOUR day, Everyday!</p>",
        "id": 6735253,
        "author": "Rick Yuhas"
    },
    {
        "title": "The Kirsty Gallagher Podcast",
        "url": "https://feeds.acast.com/public/shows/668bf003c4d72731dfe6961a",
        "description": "Kirsty shares what is happening in the skies so you can work with these energies to support your soul's path.<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 6761149,
        "author": "Kirsty Gallagher"
    },
    {
        "title": "Daybreak Devotionals",
        "url": "https://feeds.buzzsprout.com/2336674.rss",
        "description": "<p>Welcome to \"Daybreak Devotionals\", where every morning becomes a moment to connect, reflect, and grow. Join your host, Jordan Hansing, on a daily journey through faith, wisdom, and inspiration drawn directly from the scriptures. Each day, we'll explore meaningful insights, share uplifting stories, and offer practical advice to integrate spiritual truths into our everyday lives.</p>",
        "id": 6849390,
        "author": "Jordan Hansing"
    },
    {
        "title": "VA Vibes",
        "url": "https://app.springcast.fm/podcast-xml/21030",
        "description": "VA Vibes is dé podcast over het werken als Virtual Assistant, het online ondernemen, het moederschap en natuurlijk vrijheid!\n            ",
        "id": 7031347,
        "author": "Indy Zonnevijlle"
    },
    {
        "title": "Mimarlıque",
        "url": "https://anchor.fm/s/f9fd9928/podcast/rss",
        "description": "Mimarlıque, Begüm Şardan’ın ev sahipliğinde, mimarlık dünyasına ışık tutuyor. Eğlenceli ve samimi bir dille ele alınan her bölüm, konuşulmayanları konuşarak mimarlık yaşamının arka planını ortaya koyuyor.\nBu podcast sadece profesyonellere değil, mimarlıkla ilişkilenmiş herkese hitap ediyor. \nSiz de bu keyifli yolculuğa eşlik etmek isterseniz, Instagram’da @mimarlique.podcast, @begumsardan ve @__sardan__ hesaplarından ya da YouTube’da Mimarlique Podcast kanalından Mimarlique Podcast'i takip edebilirsiniz.",
        "id": 7031831,
        "author": "Begüm Şardan"
    },
    {
        "title": "The Light",
        "url": "https://feeds.godcaster.fm/player_53.xml",
        "description": "The Light is a Contemporary Christian talk radio with positive, uplifting and inspirational programs broadcasting throughout Southern Alberta",
        "id": 7097537,
        "author": "Touch Canada"
    },
    {
        "title": "Your Personal Revolution",
        "url": "https://www.spreaker.com/show/5510562/episodes/feed",
        "description": "<b>🎙️ Your Personal Revolution – A Podcast About Love, Self-Concept, and Living Without</b><br /><br />Compromises\"Personal Revolution\" is a daily podcast for women and men over 40 who crave deep, authentic love—without games, compromises, or pretending. This space invites you to join Bea, a life and mindset coach, and Max, her partner and co-creator of transformational courses, as they guide you on a journey to self-discovery and relationships built on mutual respect, safety, and freedom.📌 <br /><br />Two Core Themes of the Podcast:<br /><ul><li><b>Love</b> – How to attract genuine partnership? How to recognize illusion, break free from toxic patterns, and open up to intimacy?</li><li><b>Self-Concept </b>– Who are you when no one is watching? How to build self-confidence, inner peace, and personal strength that attracts healthy relationships?💬 Each episode is an authentic dialogue between Bea and Max – filled with reflections, open-ended questions, personal stories, and practical insights.No clichés or shallow advice here. This podcast is for those who want to aim higher but from a place of groundedness, not chaos.</li></ul>✨ At the end of every episode, we’ll invite you to take a free quiz that will help you understand your current challenges in love and relationships and show you the first step toward change.<br /><br /><b>🔍 Who Is This Podcast For?</b><br /><br /><ul><li>For those who have stopped settling for superficial love</li><li>For women and men who want to consciously build relationships</li><li>For anyone who feels that \"something more\" is possible – and is ready to reach for it</li></ul><br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/your-personal-revolution--5510562/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/your-personal-revolution--5510562/support</a>.",
        "id": 5891872,
        "author": "Bea Badura & Max Zieliński"
    },
    {
        "title": "Ahi Va",
        "url": "https://www.spreaker.com/show/4858324/episodes/feed",
        "description": "Since 1914, the New Mexico Wildlife Federation has been protecting our state’s wildlife, habitat and public lands for all to enjoy. Now the federation is kicking off a new chapter, launching the Ahi Va Podcast to present information to inform and inspire New Mexicans to conserve our resources for future generations. Stay connected to learn about important issues and ways to take action.",
        "id": 3881054,
        "author": "Driftwood Outdoors"
    },
    {
        "title": "7 Good Minutes",
        "url": "https://www.spreaker.com/show/5701156/episodes/feed",
        "description": "Begin each day with purpose and positivity with the 7 Good Minutes Daily Self-Improvement Podcast, the essential listen for mindful achievers.<br /><br />Tailored for those who strive for personal growth amidst their busy lives, our podcast offers daily guidance in mindfulness, gratitude, and maintaining a positive mindset.<br /><br />Explore a world of transformative ideas and begin your day with the inspiration you need to cultivate a life of awareness, appreciation, and optimism.<br /><br />Subscribe now to ensure you never miss an episode on your journey to a more mindful and positive life.",
        "id": 5802935,
        "author": "Clyde Lee Dennis"
    },
    {
        "title": "G.I.O. Get It On",
        "url": "https://feeds.feedburner.com/GioGetItOn",
        "description": "Adam Carolla Flashback podcast featuring fan sourced clips from 1995-2005 and beyond.",
        "id": 471679,
        "author": "Superfan Giovanni"
    },
    {
        "title": "Géopolitique",
        "url": "https://apis.rfi.fr/products/get_product/rfi_getpodcast_by_nid?token_application=975d23b8-7a07-11e8-9f62-005056a90194&program.entrepriseId=WB1294-RFI-FR-20090930",
        "description": "<p>Géopolitique parcourt les grandes régions du monde auxquelles sont associés des enjeux majeurs. Marie-France Chatin invite au débat chercheurs et experts, afin que soient expliqués et mis en lumière les différents mécanismes qui régissent les rapports entre les sociétés et leur environnement. Les invités de Géopolitique confrontent leurs regards sur un sujet d’actualité internationale. Une émission présentée par Marie-France Chatin. Réalisation et technique : Mathias Golshani. Avec la collaboration de Cécile Lavolot. *** Diffusions le samedi et le dimanche à 17h10 TU vers toutes cibles.</p>",
        "id": 4383543,
        "author": "RFI"
    },
    {
        "title": "Devos",
        "url": "https://equipu.kids4truth.com/feed/podcast/devos/",
        "description": "A daily podcast \"All About God!\"",
        "id": 245229,
        "author": "Kids4Truth Clubs"
    },
    {
        "title": "WDR Hörspiel-Speicher",
        "url": "https://www1.wdr.de/mediathek/audio/hoerspiel-speicher/wdr_hoerspielspeicher150.podcast",
        "description": "Hörspiele ohne Ende: Literatur, aktuelle <span lang=\"en\">Storys</span> und spannende Geschichten - hört doch, was ihr wollt! Serien und Doku-<span lang=\"en\">Fictions</span> mit prominenten Stimmen, bekannten Büchern und besonderen Themen. Lasst das Durchhören beginnen. // Holt euch jede Woche Tipps von unserem Team: www.wdr.de/k/hoerspiel-newsletter // Schickt uns <span lang=\"en\">Feedback</span> an: hoerspiel@wdr.de",
        "id": 42058,
        "author": "Westdeutscher Rundfunk"
    },
    {
        "title": "To The Contrary with Charlie Sykes",
        "url": "https://feeds.acast.com/public/shows/67a407e5340a5590cd2953ad",
        "description": "You are not the crazy ones.<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 7201870,
        "author": "Charlie Sykes"
    },
    {
        "title": "Habits of A Goddess",
        "url": "https://feeds.megaphone.fm/habitsofagoddess",
        "description": "<p>A personal development podcast for women to activate their inner goddess through the power of affirmations. Hosted by : Jasmine Rasco Here's how to support the podcast: <a href=\"https://linktr.ee/habitsofagoddess\">https://linktr.ee/habitsofagoddess</a></p>",
        "id": 858714,
        "author": "CAKE MEDIA"
    },
    {
        "title": "Regard sur la semaine",
        "url": "https://radiofrance-podcast.net/podcast09/rss_17933.xml",
        "description": "Regard sur la semaine Rendez-vous sur l'application Radio France pour découvrir tous les autres épisodes.",
        "id": 1742099,
        "author": "franceinfo"
    },
    {
        "title": "Monday devotion",
        "url": "https://www.spreaker.com/show/5598058/episodes/feed",
        "description": "Dev",
        "id": 6150923,
        "author": "sabelo masuku"
    },
    {
        "title": "The Eden Podcast with Bruce C. E. Fleming",
        "url": "https://feeds.simplecast.com/g6MeO9Bp",
        "description": "The Eden Podcast, where we start with a correct understanding of what happened in the Garden of Eden. Bruce C. E. Fleming is Co-Founder of the Tru316 Foundation (Tru316.com). Based on the research of his wife, Dr. Joy Fleming, he helps us understand the 7 Key Bible Passages on women and men.",
        "id": 3366638,
        "author": "Bruce C. E. Fleming, Dr. Joy Fleming"
    },
    {
        "title": "Cult of Conspiracy",
        "url": "https://www.spreaker.com/show/5700337/episodes/feed",
        "description": "We cover conspiracies of all types. From government coverups and cryptids knocking at your door, to ancient spiritual understandings and  astrology. One thing is always sure to happen, you’ll “open up that 3rd eye” !<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/cult-of-conspiracy--5700337/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/cult-of-conspiracy--5700337/support</a>.",
        "id": 1302684,
        "author": "Jonathon and Jacob"
    },
    {
        "title": "Doc Malik",
        "url": "https://anchor.fm/s/e25d829c/podcast/rss",
        "description": "Become a Paid Subscriber: <a href=\"https://creators.spotify.com/pod/show/docmalik/subscribe\" target=\"_blank\">https://creators.spotify.com/pod/show/docmalik/subscribe</a>\nBecome a Paid Subscriber: <a href=\"https://podcasters.spotify.com/pod/show/docmalik/subscribe\" target=\"_blank\">https://podcasters.spotify.com/pod/show/docmalik/subscribe</a>\nDoc Malik is on a journey of discovery when it comes to health and wellness. Through honest conversations with captivating individuals, Doc explores an array of topics that profoundly impact our well-being and health.",
        "id": 6396939,
        "author": "Ahmad Malik"
    },
    {
        "title": "In Right Relationship",
        "url": "https://anchor.fm/s/feb1d330/podcast/rss",
        "description": "In Right Relationship is a portal into the sacred process of expansion through psychedelics—where awareness, practices, and spiritual opening meet.\nWe bring you stories, wisdom and experiential deep-dives with experts in the field—including healers, coaches, clinicians, spiritual guides, artists, and beyond—rooted in a shift towards greater authenticity, choicefulness, and interconnectedness.\nWhether you’re new to psychedelics or a seasoned psychonaut, you can expect practical insights and tools for getting the most from your psychedelic experiences.",
        "id": 7144080,
        "author": "Liz Chernett, Lily Eggers"
    },
    {
        "title": "Ask Dr. Drew",
        "url": "https://feeds.megaphone.fm/DRPI5481918824",
        "description": "<p>On Ask Dr. Drew, no question is too extreme or embarrassing because the Dr. has heard it all. For over 30 years, Dr. Drew Pinsky has taken calls from all corners of the globe, answering thousands of questions from teens and young adults. To millions, he is a beacon of truth, integrity, fairness, and common sense. Now, after decades of hosting Loveline and multiple hit TV shows – including Celebrity Rehab, Teen Mom OG, Lifechangers, and more – Dr. Drew is opening his phone lines to the world by streaming LIVE from his studio in California. Don’t hold in your deepest, darkest questions any longer. Ask Dr. Drew and get real answers today.</p><p>Produced by <a href=\"https://kalebnation.com/\">Kaleb Nation</a> and <a href=\"https://twitter.com/firstladyoflove\">Susan Pinsky</a>.</p>",
        "id": 259999,
        "author": "Dr. Drew"
    },
    {
        "title": "Kitap Okumaları",
        "url": "https://www.spreaker.com/show/5453350/episodes/feed",
        "description": "Herkese merhabalar. Kitap ruhumuzun inceliklerini hitap eder. Ruhlarımızın manevi gıdaya ihtiyacı vardır. Her gün güncellenen yeni kitaplarla hizmetinizdeyiz.",
        "id": 5831397,
        "author": "Kitap Okumaları"
    },
    {
        "title": "The Dig Bible Podcast",
        "url": "https://media.rss.com/thedig/feed.xml",
        "description": "<p>Welcome to The Dig Bible Podcast, do you have a curious mind? Often thought to yourself there has to be more to these stories in my Bible. Is knowing the “whys” important to you? Then you’ve found the right place! We are looking for those people that know there is more than what we’ve been taught. We are looking for those people that their beliefs that don’t “fit into the box”, and know that “For everyone who asks receives, and the one who seeks finds, and to the one who knocks it will be opened.” We believe that to truly understand the Bible we must put ourselves in the mindset of the writers, and to do that we must restore the “supernatural worldview” of the original audience to which they were writing to! So, with that being said don’t care to roll up your sleeves and get your hands dirty? LET’S DIG! Questions, comments, suggestions on future episode ideas we’d love to hear from you: thedig423@gmail.com. Join in on the conversations and exclusive content with our facebook group: https://www.facebook.com/groups/thedig423/</p>",
        "id": 5454533,
        "author": "Justin Brown"
    },
    {
        "title": "Experiencia Kidzania Monterrey",
        "url": "https://www.spreaker.com/show/5713632/episodes/feed",
        "description": "Aquí encontrarás las grabaciones de la cabina de iHeartRadio en Kidzania Monterrey<br /><br />Conviértete en un seguidor de este podcast: <a href=\"https://www.spreaker.com/podcast/experiencia-kidzania-monterrey--5713632/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/experiencia-kidzania-monterrey--5713632/support</a>.",
        "id": 6194914,
        "author": "ACIR - Kidzania"
    },
    {
        "title": "Aeon Byte Gnostic Radio",
        "url": "https://feeds.simplecast.com/9wi6CXEM",
        "description": "Journey into the mystical world of Gnosticism and Hermeticism with Aeon Byte Gnostic Radio. From the ancient Gnostic Gospels and Nag Hammadi Library to the wisdom of Sophia and the challenge of the Archons, we explore the path to Gnosis – inner knowing and spiritual awakening. But the Gnostic quest doesn't end in antiquity! We connect these timeless ideas to today's mind-bending topics: UFO phenomena, Carl Jung's psychology, the visionary fiction of Philip K. Dick, mind parasites, simulation theory, and conspiracy theories. Seeking alternative spirituality, deeper meaning, and a challenge to conventional reality? Subscribe to Aeon Byte.",
        "id": 311727,
        "author": "Aeon Byte Gnostic Radio, Bleav"
    },
    {
        "title": "North Shore Nine: A Pittsburgh Pirates Podcast",
        "url": "https://feeds.simplecast.com/9n8N04U5",
        "description": "NS9 is a Podcast about the Pittsburgh Pirates! We record multiple times throughout the week and almost daily during the season. #LetsGoBucs #Pirates #MLB",
        "id": 996056,
        "author": "North Shore Nine, Bleav"
    },
    {
        "title": "Aeon Byte Inner Sanctum of Gnosis",
        "url": "https://thegodabovegod.com/feed/subscriber",
        "description": "Bringing ancient Gnostic mysteries to a modern meaning. Podcasts, articles, and occult communities.",
        "id": 2503817,
        "author": "Aeon Byte Inner Sanctum of Gnosis"
    },
    {
        "title": "世界盡頭深夜酒館",
        "url": "https://feed.firstory.me/rss/user/cl73fj8k80b7201z65r8bh7w7",
        "description": "<p>這東西太好了，不能只有我知道。 <br /> <br />我們每個禮拜互相出題，輪流分享生活中觀察到那些太好的事物。 <br /> <br />【其他單元】 <br /> <br />〈五分推〉：推薦那些我們覺得超讚的各種事物。 <br />〈417包廂〉：用一集到兩集探討那些我們愛的作品。 <br />〈借我一下下，時事一 shot 〉：像小 shot 杯一樣的小討論時事！ <br /> <br />【主持人】 <br />｜第二季：克勞高雅&力瑋。 <br />｜第一季：茹茹&力瑋。 <br /> <br/>Powered by <a href=\"https://firstory.me/zh\">Firstory Hosting</a></p>",
        "id": 5768207,
        "author": "克勞高雅&力瑋"
    },
    {
        "title": "Dr. Anne Karl Academy",
        "url": "https://dr-anne-karl-academy.podigee.io/feed/mp3",
        "description": "Herzlich willkommen zum Dr. Anne Karl Academy Podcast – dein Podcast für Inspiration, Wachstum und ein neues Verständnis von Medizin! In jeder Folge nehmen wir dich mit auf eine spannende Reise, die über die klassische Medizin hinausgeht. Hier treffen großartige Persönlichkeiten aus unterschiedlichen Bereichen zusammen, um gemeinsam die Zukunft der funktionellen und ganzheitlichen Medizin zu gestalten.\nErlebe inspirierende Gespräche, innovative Behandlungsansätze und frische Impulse, die dir nicht nur in der Praxis, sondern auch im Leben weiterhelfen. Dieser Podcast steht für mehr als nur Wissensaustausch – hier geht es um echte Verbindungen, gemeinsames Lernen und das Entfalten deines vollen Potenzials. Tauche ein in eine unterstützende Community, die sich für eine gesündere und ganzheitlichere Welt stark macht.\nFreu dich auf Expertinnen und Experten, die mit Herz und Leidenschaft neue Wege gehen, und lass dich inspirieren, um gemeinsam die Zukunft der Medizin neu zu gestalten. Schön, dass du dabei bist – lass uns gemeinsam Grenzen verschieben!",
        "id": 7103373,
        "author": "Dr. Anne Karl"
    },
    {
        "title": "Korean News - NHK WORLD RADIO JAPAN",
        "url": "http://www3.nhk.or.jp/rj/podcast/rss/korean.xml",
        "description": "This is the latest news in Korean from NHK WORLD RADIO JAPAN. This service is daily updated. For more information, please go to https://www3.nhk.or.jp/nhkworld/.",
        "id": 653823,
        "author": "NHK WORLD-JAPAN"
    },
    {
        "title": "Crypto Voices",
        "url": "https://anchor.fm/s/d8decf3c/podcast/rss",
        "description": "Podcast covering diverse trends in Bitcoin and blockchain tech, decentralization, entrepreneurship, cryptoeconomics and liberty.\nAuthor note: All authors, whose content is featured on Crypto Voices, are contacted beforehand for permission, regardless of copyright or license such as Creative Commons. If you are an author whose work is reproduced here and you have not heard from Crypto Voices, it's because we couldn't find a way to contact you. However, in this situation your work was already licensed Creative Commons, and it was so great anyway that we just couldn't wait to turn it into audio and put it up!\nAny questions, please write info@cryptovoices.com, we'd love to hear from you.",
        "id": 325414,
        "author": "Matthew Mezinskis"
    },
    {
        "title": "Locked On LSU - Daily Podcast On LSU Tigers Football & Basketball",
        "url": "https://feeds.simplecast.com/4q9SasrY",
        "description": "Locked On LSU podcast is the daily podcast that keeps you ahead of the games and the first to know the latest news, analysis, and insider info for the LSU Tigers. Hosted by Caroline Fenton, an LSU grad and co-host of Stillman and Company on ESPN 102.5 The Game in Nashville, the Locked On LSU podcast provides your daily LSU Tigers fix with expert opinions, film reviews, interviews, recaps, local analysis, and coverage of all things Tigers. If you’re talking about it, Caroline is going to be talking about it. From the gridiron battles at iconic Tiger Stadium to courtside at the Pete Maravich Assembly Center, and everywhere in between, the Locked On LSU podcast takes you beyond the headlines for the inside scoops from the biggest stories inside the Tigers’ locker room and the SEC. Locked On LSU podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 72564,
        "author": "Locked On Podcast Network, Caroline Fenton"
    },
    {
        "title": "ACE and Co: Full STEAM Ahead",
        "url": "https://anchor.fm/s/f9b800c0/podcast/rss",
        "description": "Welcome to the ACE & Co Spotify podcast, your premier destination for exploring careers in Science, Technology, Engineering, Arts, and Math (STEAM).\nOur podcast is dedicated to providing a comprehensive overview of the diverse and exciting opportunities within the STEAM fields. Whether you're a student contemplating your future career path, a professional looking to transition into a new field, or simply curious about the cutting-edge innovations shaping our world, ACE & Co is here to inform, inspire, and guide you.",
        "id": 7026782,
        "author": "Ace and Co"
    },
    {
        "title": "睡眠音 | ホワイトノイズ (すいみんおと, suimin oto)",
        "url": "https://feeds.acast.com/public/shows/66df3a3a8050843a93451dea",
        "description": "<p><strong>最高の睡眠と集中のためのサウンドコレクション</strong>。</p><p>毎晩、心地よい <strong>睡眠音</strong> と <strong>ホワイトノイズ</strong> で深い眠りへ。私たちは自然の最も純粋な音を厳選し、人工的なループやAI生成された音ではなく、<strong>本物の環境音</strong> をお届けします。<strong>快眠、リラックス、集中、ストレス解消</strong>に最適なサウンドをお楽しみください。</p><br><p>🔹 <strong>全世界で250万回以上のダウンロード</strong></p><p><strong>🔹 100以上の睡眠・集中用サウンドスケープ</strong></p><p><strong>🔹 毎週2回、新しいエピソードを配信</strong></p><p><strong>🔹 8時間の拡張バージョンを提供</strong></p><br><p><strong>夜の静けさの中、雨音や波の音、森林のさざめきがあなたを深いリラックスへ導きます。ホワイトノイズ、環境音、自然音、瞑想用BGM</strong> など、あらゆるシーンに最適な音を見つけてください。</p><p><strong>💤 さらに長時間の音源や広告なしのエピソードを楽しみたい方へ！</strong></p><br><p><strong>👉 8時間のエピソードを今すぐ解放！</strong></p><p><strong>▶ </strong><a href=\"https://podcasts.apple.com/us/podcast/%E7%9D%A1%E7%9C%A0%E9%9F%B3-%7C-%E3%83%9B%E3%83%AF%E3%82%A4%E3%83%88%E3%83%8E%E3%82%A4%E3%82%BA-%E3%81%99%E3%81%84%E3%81%BF%E3%82%93%E3%81%8A%E3%81%A8-suimin-oto/id1702709091\" rel=\"noopener noreferrer\" target=\"_blank\">7日間無料でApple Podcastsで試す</a></p><br><p><strong>🌿 より多くのリラックスサウンドを体験するには？</strong></p><p><strong>▶ </strong><a href=\"http://youtube.com/@liminal_spaced\" rel=\"noopener noreferrer\" target=\"_blank\">YouTubeでより多くの睡眠サウンドをチェック</a></p><br><p><strong>☕ サポートのお願い:</strong></p><p><strong>▶ </strong><a href=\"https://ko-fi.com/peteingo\" rel=\"noopener noreferrer\" target=\"_blank\">Ko‑fiで寄付をする</a></p><br><p><strong>あなたの毎日のリラックスと睡眠のために、最高のサウンドをお届けします</strong>。フォローして新しいエピソードをお楽しみください！</p><hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 6578811,
        "author": "睡眠集中音"
    },
    {
        "title": "RADIO KULTURAEUROPA",
        "url": "https://www.spreaker.com/show/4283974/episodes/feed",
        "description": "<b>Radio Kulturaeuropa nasce come un'altra tappa di un percorso iniziato nel 2020. Lo scopo è quello di dotarsi di un altro strumento di diffusione delle tematiche culturali legate all'Idea di Rinascita della Potenza Europa. Mettiamo in campo quest' ulteriore iniziativa anche per dare spazio e voce a tutte quelle realta' che si muovono su questo crinale e intendono collaborare con spirito comunitario. Podcast, dirette, musica e molto, molto altro.. Ascolta Radio Kulturaeuropa, la radio del risveglio dello Spirito e dell'assalto al Futuro.</b>",
        "id": 2370148,
        "author": "RADIO KULTURAEUROPA"
    },
    {
        "title": "365 con Dios",
        "url": "https://feeds.simplecast.com/YhB6WdXx",
        "description": "Cada día Dios quiere hablarte, te invito a que me acompañes diariamente en este devocional, donde compartiremos una reflexión inspiradora para cada día. Este podcast está inspirado en mi libro #365conDios. No te pierdas la oportunidad de escuchar la voz de Dios y profundizar tu relación con Él. \nwww.wenddyneciosup.com",
        "id": 3472158,
        "author": "Wenddy Neciosup | Genuina Media"
    },
    {
        "title": "Chassé-croisé",
        "url": "https://radiofrance-podcast.net/podcast09/rss_17313.xml",
        "description": "Chassé-croisé Rendez-vous sur l'application Radio France pour découvrir tous les autres épisodes.",
        "id": 1724402,
        "author": "France Inter"
    },
    {
        "title": "गीता का सार (Geeta Ka Saar) #BhagavadGita #SpiritualKnowledge",
        "url": "https://media.rss.com/apkamohitsharma/feed.xml",
        "description": "<p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">\"स्वागत है आपका \"\"गीता का सार (Geeta Ka Saar)\"\" की इस नई कड़ी में! 📖✨</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">Add Podcast to your Youtube Music - </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://media.rss.com/apkamohitsharma/feed.xml\">https://media.rss.com/apkamohitsharma/feed.xml</a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">💬 Join our WhatsApp Channel for more details and update - </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://whatsapp.com/channel/0029Vb4wtr31noz8J0GHfT01\">https://whatsapp.com/channel/0029Vb4wtr31noz8J0GHfT01  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">📺 YouTube Playlist -  </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.youtube.com/playlist?list=PLmqdCCZAKuDiSQUJGe114tsIGg0Z6K658\">https://www.youtube.com/playlist?list=PLmqdCCZAKuDiSQUJGe114tsIGg0Z6K658</a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">🎙️ Kuku FM - </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://kuku.page.link/?apn=com.vlv.aravali&link=http://kukufm.com/show/1a1e6296-7af4-4d21-bf14-c84ce5113ecc/?utm_source=share_ch&lang=english\">https://kuku.page.link/?apn=com.vlv.aravali&link=http://kukufm.com/show/1a1e6296-7af4-4d21-bf14-c84ce5113ecc/?utm_source=share_ch&lang=english</a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">📖 Blogs Link - </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://vickyggp.blogspot.com\">https://vickyggp.blogspot.com</a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">Quora - </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://qr.ae/pYoAFM\">https://qr.ae/pYoAFM</a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">🚩 हर घर गीता, हर मन गीता! 🚩</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">🙏 धन्यवाद! आपने आज का श्लोक सुना और समझने का प्रयास किया।</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">आपका समय और ध्यान इस दिव्य ज्ञान के प्रति आपकी रुचि को दर्शाता है। श्रीमद्भगवद्गीता सिर्फ एक ग्रंथ नहीं, बल्कि जीवन को सही दिशा देने वाला मार्गदर्शन है। आज हमने जाना कि भगवान हर जगह हैं, लेकिन फिर भी वे इस संसार में रहते हुए इससे अलग हैं। यह हमें यह सिखाता है कि हमें भी अपने कर्मों को सही दिशा में लगाना चाहिए और संसार में रहते हुए भी आत्मिक रूप से जुड़े रहना चाहिए।</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">हमारा उद्देश्य है कि श्रीमद्भगवद्गीता का ज्ञान हर व्यक्ति तक पहुंचे। अगर आपको यह वीडियो उपयोगी लगा, तो आपका एक छोटा-सा योगदान इस गीता यात्रा में बड़ा बदलाव ला सकता है। 🙏</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">📌 #BhagavadGita #SpiritualJourney #DivineTeachings #KrishnaWisdom #गीता_ज्ञान #आध्यात्मिकता #Motivation #SelfRealization #InnerPeace #LifeLessons</a></p>",
        "id": 6979995,
        "author": "Mohit Sharma"
    },
    {
        "title": "Cisco Podcast Network",
        "url": "https://feeds.soundcloud.com/users/soundcloud:users:304226927/sounds.rss",
        "description": "The Cisco Podcast Network is a collective of podcasts from across Cisco spanning technology to culture and everything in between. Hear from Cisco customers, partners, and Cisco insiders on the topics that matter most to you. Email us with your feedback and suggestions. Discover your favorite playlists today!",
        "id": 609546,
        "author": "Cisco"
    },
    {
        "title": "Ve stínu",
        "url": "https://feeds.transistor.fm/ve-stinu-celibatu",
        "description": "Případy a příběhy od vás. Z míst, která média často opomíjejí. Rozkrývá je pro vás investigativní a reportážní tým Jiřího Kubíka. Nová epizoda vždy v neděli na Seznam Zprávách, Podcasty.cz a ve všech podcastových aplikacích.",
        "id": 3939302,
        "author": "Seznam Zprávy"
    },
    {
        "title": "İçeriden Bi'olog",
        "url": "https://anchor.fm/s/fba78a90/podcast/rss",
        "description": "Biyolojiye olan tutkumla yola çıkarak hazırladığım \"İçeriden Bi'olog\" podcast'ine hoş geldiniz! \nBilimi herkes için anlaşılır kılmayı hedefleyen bu seride, evrimden genetiğe, ekolojiden biyoteknolojiye kadar geniş bir yelpazede konulara değineceğiz. Hayatın gizemlerini keşfetmek, bedenin nasıl işlediğini anlamak ve bilimle bağınızı güçlendirmek için bizi takip edin. \nHer bölümde, doğanın derinliklerine yolculuk yaparken öğrenmeye ve sorgulamaya hazır olun!\n@iceridenbiolog instagram hesabından bana her zaman ulaşabilirsiniz :)",
        "id": 7033554,
        "author": "Ayça Can"
    },
    {
        "title": "De GeenStijl Podcast",
        "url": "https://anchor.fm/s/fe1f1fb8/podcast/rss",
        "description": "Een podcast over het persoonlijke, het politieke, het professionele, het pietluttige en het potsierlijke",
        "id": 7145067,
        "author": "GeenStijl"
    },
    {
        "title": "Unterwegs",
        "url": "https://www.inforadio.de/podcast/feeds/unterwegs/podcast--unterwegs.xml/feed=podcast.xml",
        "description": "<p>Die Sendung gegen Heimweh und Fernweh: Das Reisemagazin im rbb24 Inforadio erkundet exotische Ziele in weiter Ferne ebenso wie sehenswerte Orte in der unmittelbaren Umgebung.</p>\n",
        "id": 993660,
        "author": "rbb24 Inforadio"
    },
    {
        "title": "Experiencia Kidzania Santa Fe",
        "url": "https://www.spreaker.com/show/4239775/episodes/feed",
        "description": "Aquí encontrarás las grabaciones de la cabina de iHeartRadio en Kidzania Santa Fe (:",
        "id": 2258694,
        "author": "ACIR - Kidzania"
    },
    {
        "title": "Professor P with Dr.Peykar",
        "url": "https://feed.podbean.com/professorppodcast/feed.xml",
        "description": "Dr.Parsa Peykar, a psychologist, university professor and author, shares through the episodes lessons on leadership, influence and service.  Each episode is like a ”mini-research” which answers the ”Research question” related to the topic and will be divided into three parts: 1-A book review/ Art analysis. 2- A podcast with an influential person. 3- University student’s feedback on the topic. One theme is common among all episodes: All the guests suggest at least one act of kindness for listeners to do.  \nThe Professor P Podcast acts as a fun, engaging ”university” which tends to bring both educational and experimental lessons to each listener and help them to be influential figure in their chosen field! Also, it exists to add value to its follower’s lives and encourage them to add value to others.\nPlease reach out to us for comments or by simply saying hi: contact@parsapeykar.com",
        "id": 6735085,
        "author": "Parsa Peykar"
    },
    {
        "title": "シドニーの 中国語 台湾華語ラジオ",
        "url": "https://feeds.soundon.fm/podcasts/24d8a3b8-0905-46bc-a233-2361e5b68462.xml",
        "description": "皆さん、こんにちは！シドニーです！\u2028納豆とふりかけを混ぜて食べるのが大好きな台湾人です～🇹🇼🍚\n2023年に日本に行って、大学院で勉強していました。今年から日本で新しい仕事と生活を始める予定です✨\n留学した時に、日本人の友達が中国語を勉強していることに気づきました。そして、よくこんな質問をされます。\n\u2028\n「台湾人って本当にこうやって話すの？」\u2028\n「どう言えばもっと自然に聞こえる？」\nそんな会話を重ねるうちに、「日本人がもっとリラックスしながら台湾の中国語に慣れる場所があったらいいな」と思うようになりました。\nそこで、このポッドキャストを始めることにしました🎙\n日常会話のような気軽な雰囲気で、私の生活や台湾と日本の違いなどを楽しくシェアしながら、実際に台湾人が話す中国語を聞いていただけます！\n1エピソードは10分以内なので、通勤中、家事、トイレの掃除、眠れない時など、どんな時でも気軽に聞けますよ～🎧\n一緒に頑張りましょう💪\nもし気に入ったら、ぜひフォローしてみてくださいね🌸\nスクリプト　https://www.notion.so/9c9b0431b37145ce847557b126698b08\n私のThread  https://www.threads.net/@talktalksydney\n#中国語 #台湾華語 #台湾 \n--\nHosting provided by <a href=\"https://www.soundon.fm/\" target=\"_blank\">SoundOn</a>",
        "id": 7247905,
        "author": "シドニー"
    },
    {
        "title": "The Parsha Podcast - With Rabbi Yaakov Wolbe",
        "url": "http://rabbiwolbe.com/feed/parsha/",
        "description": "Join Rabbi Yaakov Wolbe for a parsha by parsha journey through the entire Torah. Every week we will outline of the parsha, delve into its major themes and draw valuable and interesting insights from it.",
        "id": 508545,
        "author": "TORCH"
    },
    {
        "title": "Rabbi Yaakov Wolbe Podcast Collection",
        "url": "http://jewishpodcast.org/index.php/feed/podcast/",
        "description": "The Rabbi Yaakov Wolbe Podcasts Collection gives you the opportunity to listen and enjoy to all the Torah & Insights from Rabbi Yaakov Wolbe in one feed. The The Parsha Podcast, Jewish History Podcast, The Mitzvah Podcast, This Jewish Life, TORAH 101 and The Ethics Podcast in one convenient place. Enjoy!",
        "id": 17529,
        "author": "TORCH"
    },
    {
        "title": "EV QUEST",
        "url": "https://feeds.transistor.fm/ev-quest",
        "description": "Welcome to EV Quest — your source for electric vehicle insights, based in New Zealand. Hosted by Adrian Maidment, the podcast features a weekly roundup of the latest EV news from Aotearoa, Australia, and around the world, often joined by Riz Akhtar from Carloop. You'll also hear interviews with key figures from the EV industry and the wider sustainability sector, along with reviews of the latest electric vehicles.",
        "id": 5029186,
        "author": "Adrian Maidment"
    },
    {
        "title": "TrueLife",
        "url": "https://feeds.transistor.fm/truelife",
        "description": "The TrueLife Podcast: Rise Against the Illusion\n\nWelcome to The TrueLife Podcast—a battlefield of ideas where the mind is the ultimate weapon and complacency is the enemy. This is not a place for passive listening. It’s a war cry for those who refuse to bow to the hollow gods of conformity, a call to dismantle the systems that chain our thoughts and numb our souls.\n\nHere, we tear through the lies of modern life with the precision of a scalpel and the force of a sledgehammer. Psychedelics are our compass, suffering is our teacher, and uncertainty is the fuel that drives us forward. Every episode is an incitement to think dangerously—fusing psychology, philosophy, and mysticism with a rage against the machine edge that burns away illusion.\n\nThis isn’t just a podcast; it’s a counterattack against the programmed mediocrity of our times. We explore the hidden architectures of power, the rapid evolution of language, and the forbidden territories of consciousness. We weaponize words, images, and melodies to cut through the fog of deception.\n\nFor the misfits, the rebels, and the seekers who know there’s something rotten at the core—this is your refuge and your rallying point. Tune in if you’re ready to unshackle your mind and fight for the freedom to think, feel, and live without restraint.\n\nAloha, and welcome to the resistance.",
        "id": 753669,
        "author": "George Monty"
    },
    {
        "title": "The Money Mosaic",
        "url": "https://feeds.captivate.fm/the-money-mosaic/",
        "description": "The Money Mosaic is your go-to podcast for a diverse blend of financial insights and artistic exploration brought together for you by AI (artificial intelligence). Join us every Tuesday and Friday as we delve into the dynamic world of forex trading, providing you with the latest trends, strategies, and market analysis to help you navigate the forex landscape with confidence. On Saturdays, we shift our focus to shares and index funds, offering expert advice and in-depth discussions to help you make informed investment decisions. Finally, unwind with us on Sundays as we explore the vibrant world of alternative investment, celebrating creativity and its intersection with finance. Whether you're a seasoned investor or just starting out, The Money Mosaic has something for everyone. Tune in and enrich your financial and artistic journey with us!",
        "id": 7119906,
        "author": "Pastime Agency"
    },
    {
        "title": "Personal Belongings @ Pure Ibiza Radio",
        "url": "https://feeds.soundcloud.com/users/soundcloud:users:806995126/sounds.rss",
        "description": "Beach-friendly Deep House label coming from the need of an artist's self-expression, no signature sounds needed. #DeepHouse #ChillHouse #BeachHouse.\nContact, demos: personalbelongings@kanedomusic.com",
        "id": 3430973,
        "author": "Personal Belongings"
    },
    {
        "title": "BEARcast - Motorrad Reise Podcast",
        "url": "https://14hxtzb.podcaster.de/bearcast.rss",
        "description": "Die Bears sind immer auf der Suche nach neuen Abenteuern, ob in der Ferne oder direkt vor der Haustür. Wer sich für Motorrad-Reisen, Ferntouren, Enduro und das Leben unterwegs interessiert, wird hier regelmäßig Podcasts finden, die Fernweh wecken und vom Spaß auf zwei Rädern erzählen. Let me take you offroad. Werdet unsere Patronen und unterstützt uns unter: https://www.patreon.com/bearsontour",
        "id": 794903,
        "author": "Bears on Tour"
    },
    {
        "title": "The Ethics Podcast - With Rabbi Yaakov Wolbe",
        "url": "http://rabbiwolbe.com/feed/pirkeiavos/",
        "description": "Rabbi Yaakov Wolbe's Pirkei Avos Lectures. Please email questions and comments to rabbiwolbe@gmail.com",
        "id": 881096,
        "author": "TORCH"
    },
    {
        "title": "The Ringer NBA Show",
        "url": "https://feeds.megaphone.fm/the-ringer-nba-show",
        "description": "<p>The Ringer NBA squad provides the insight, reporting, and analysis that you need in your life right here on The Ringer NBA Show. On Mondays and Thursdays, check out 'Group Chat' with Justin Verrier, Wosny Lambre and Rob Mahoney. Tap in on Tuesdays and Fridays for 'Real Ones' with Logan Murdock, Raja Bell and Howard Beck.</p>",
        "id": 488939,
        "author": "The Ringer"
    },
    {
        "title": "DEKONSTRUKTIV KRITIK",
        "url": "https://feeds.acast.com/public/shows/645019e350acd0001196262c",
        "description": "Aron Flamwww.aronflam.comDonera: https://www.aronflam.com/contact-1/Merch: https://www.aronflam.com/merchandiseSWISH 0768943737<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 5654,
        "author": "Aron Flam"
    },
    {
        "title": "Latino USA",
        "url": "https://latinousa.feeds.futuromedia.org/",
        "description": "Latino USA is the longest-running news and culture radio program in the U.S. centering Latino stories, hosted by Pulitzer Prize winning journalist Maria Hinojosa  Every week, the Peabody winning team brings you revealing, in-depth stories about what’s in the hearts and minds of Latinos and their impact on the world. \nWant to support our independent journalism? Join Futuro+ for exclusive episodes, sneak peaks and behind-the-scenes chisme on Latino USA and all our podcasts. www.futuromediagroup.org/joinplus",
        "id": 45412,
        "author": "Futuro Media and PRX"
    },
    {
        "title": "That's What I Call Science!",
        "url": "https://feeds.buzzsprout.com/402661.rss",
        "description": "<p>National award-winning radio show and podcast bringing a fresh new perspective on the issues that matter to you from the heart of Tasmania. We cover all things Science, Technology, Engineering, Maths and Medicine (STEMM) from medical marijuana to science behind mental health issues, we feature expert guests and get to the guts of the issue. </p>",
        "id": 182805,
        "author": "That’s What I Call Science"
    },
    {
        "title": "James Sinclair's Business Broadcast",
        "url": "https://anchor.fm/s/10152b244/podcast/rss",
        "description": "The Business Broadcast is the weekly podcast from the award-winning entrepreneur James Sinclair. James operates 17 family-based brands which welcome over one million customers through the doors of their every year. His insights are all based on the experience,, mistakes and successes that have led to his current businesses employing 1000 people, turning over £40 million annually. Each week James will speak with different business owners who have multiple challenges. Listen in as James attempts to help these guests overcome their challenges and grow their business.",
        "id": 266253,
        "author": "James Sinclair"
    },
    {
        "title": "Resident by Hernan Cattaneo",
        "url": "https://podcast.hernancattaneo.com/feed.xml",
        "description": "Hernan Cattaneo’s podcast. \nVisit www.hernancattaneo.com for further info and tracklisting",
        "id": 312498,
        "author": "Hernan Cattaneo"
    },
    {
        "title": "Italian Wine Podcast",
        "url": "https://feeds.megaphone.fm/MJS8122694951",
        "description": "<p>The Italian Wine Podcast is a storytelling project dedicated to the fascinating world of Italian wine. New episodes are published every day – so stay tuned! With more grape varieties and more diverse grape growing regions than any other country in the world, the story of Italian wine is a rich and captivating one. While the popularity of Italian wine continues to grow in every corner of the globe, inspired by a deep affection for the Italian way of life, the Italian Wine Podcast seeks to entertain, educate and inform. Embracing Italian food, travel, lifestyle and culture, IWP has something for every taste!</p>",
        "id": 326131,
        "author": "Italian Wine Podcast"
    },
    {
        "title": "Change Your Mind - Kommunikation, NLP, Hypnose, Coaching und Psychologie",
        "url": "https://dialoge-mit-dem-unterbewusstsein.podigee.io/feed/aac",
        "description": "Mein Name ist Alexander Schelle und ich stehe seit mehr als 20 Jahren als Mentalist und Hypnotiseur auf der Bühne. Ich bin ausgebildet als Hypnose- und NLP-Coach und biete neben meinen Shows auch Seminare und Vorträge. Der Podcast ‘Die Geheimnisse eines Mentalisten’ soll auf unterhaltsame Weise einen Einblick in die Welt des Unterbewusstseins geben – in die Welt der Psychologie und der Hypnose.\nIn den psychologischen Folgen werde ich einen Blick auf ansonsten weitgehend verborgene Seiten unserer Persönlichkeit werfen – auf unbewusste Muster in unserer Kommunikation und Motivation, aber auch unserem Wahrnehmen, Fühlen, Denken, Entscheiden und Handeln. Ich werde beleuchten, wie wir Menschen ticken, wie es mit unserer Menschenkenntnis aussieht und auch Schlussfolgerungen für den konkreten Alltag oder ein Coaching daraus ziehen.\n \nJene Folgen, die sich der Hypnose oder der Meditation widmen, bietet dir einen Einblick in die faszinierende Welt, die sich öffnet, wenn wir einen gezielten Blick hinter die Kulissen unserer bewussten Entscheidungen werfen. Was du schon immer über Hypnose oder Selbsthypnose, beispielsweise zur Gewichtsreduzierung, Nichtraucher werden, Ängste besiegen oder der Burnout Prävention, wissen wolltest – hier erhältst du in kurzen Podcast Folgen einen Überblick.\nFirmen können mich auch für Vorträge oder Veranstaltungen zu den Themen Bewusstsein, Unterbewusstsein, Persönlichkeitsentwicklung, Motivation, Kommunikation, NLP, Hypnose, Meditation, Selbsthypnose, Empathie, Menschenkenntnis, Stressabbau, Selbstverwirklichung und Burnout Prävention buchen.\nIn individuelles Coaching helfe ich Menschen, ihre work-life-balance zu finden. \nWenn du mehr über die Angebote von mir erfahren möchtest, findest du unter **[www.alexander-schelle.de](http://www.alexander-schelle.de)** weitere Informationen.  \nSelbstverständlich bin ich auch auf Facebook und auf Instagram für dich zu erreichen.",
        "id": 328797,
        "author": "Alexander Schelle - Mentalist und Hypnotiseur - Persönlichkeitsentwicklung, Kommunikation, Coaching, NLP und Psychologie"
    },
    {
        "title": "How to Live in Denmark",
        "url": "https://howtoliveindenmark.libsyn.com/rss",
        "description": "Quick takes on life in Denmark, in 10 minutes or less. Life as an international in Denmark, one of the world's most homogenous countries, isn't always easy. In Denmark’s longest-running English-language podcast, Kay Xander Mellish, an American who has lived in Denmark for more than a decade, offers tips for enjoying your time in “the world’s happiest country” plus insights on Danish culture and Danish working culture.\nWhether you're living in Denmark, thinking about moving to Denmark, or interested in a job in Denmark and want to understand Danish business culture, this podcast will offer insights and guidance.\nEach episode of How to Live in Denmark is less than 10 minutes long—perfect for your coffee break or commute. Join Kay Xander Mellish as she shares quick, witty, and useful insights on Danish culture and Danish working life in this short-form podcast series.\n\"How to Live in Denmark\" tackles topics that will help you understand the Danish way of living, emphasizing work-life balance, the unique Danish workplace culture, and the social norms that define Danish society. With Denmark's renowned flat hierarchy, workplace flexibility, and emphasis on equality, understanding the subtleties of Danish work etiquette is essential for anyone working in Denmark or engaging with Danish businesses.\nOur discussions also delve into Denmark's flexicurity system, a distinctive approach to labor market regulation that blends flexibility with security, providing insights on how this model supports a dynamic and adaptive work environment. Listeners considering entrepreneurship in Denmark or business ventures in Denmark will find strategic advice on navigating the Danish labor market and leveraging business opportunities in a society known for its innovation and egalitarian corporate culture. (Is Denmark socialist? No, it's more free-market than the US or UK.)\nExpats in Denmark will particularly benefit from episodes focusing on cultural integration, socializing in Danish workplaces, and the crucial role of professional networking in Denmark. Learn how to navigate Denmark's informal communication styles, engage with the Danish sense of humor in the workplace, and appreciate the significant autonomy given to employees in Danish companies.\nKay's short episodes about her experiences in Denmark illuminate the practicalities of living in Denmark and pleasures of Danish life. From understanding Danish employment law to embracing the social trust that is so basic to Danish society, \"How to Live in Denmark\" equips you with the knowledge to survive and thrive in Denmark.\nWhether it's deciphering Danish management style, exploring how to maintain work-life balance, or understanding the egalitarian mindset that pervades Danish workplaces, this podcast is your companion in mastering the art of living Danishly.\nSubscribe to \"How to Live in Denmark\"  start your journey to a deeper understanding of Denmark, ensuring your Danish experience is both successful and enjoyable. Whether you're in Denmark for a new job, a safer home protected by the Danish welfare state, or new business opportunities, let's explore together what it means to live and work in Denmark, raise your family in Denmark, and advance your career in Denmark.",
        "id": 390038,
        "author": "Kay Xander Mellish"
    },
    {
        "title": "Se Habla Español",
        "url": "https://www.ivoox.com/feed_fg_f1171214_filtro_1.xml",
        "description": "Aprender español escuchando la voz de personas famosas. Learn spanish by listening to the voices of famous people.",
        "id": 404874,
        "author": "Se Habla Español"
    },
    {
        "title": "Awakening Worth in Childless Women",
        "url": "https://feeds.buzzsprout.com/830326.rss",
        "description": "<p>You are about to discover how to embrace your life as a childless woman who wanted to have a family and never could.  This is where we combine mindset shifting tools with practical tips so you can break free of outdated societal norms that condition us all to believe that women without kids don’t measure up to the moms.  <br><br>This is where we take action on processing grief and accelerating the healing journey so you can feel free.  When childless women awaken their self-worth, they transform from hopeless and inadequate to worthy, accepting and purposeful.  <br><br></p><p>Think of this podcast as your weekly dose of lightbulb moments that will shift your perspective as a childless woman - about yourself and your innate power to change yourself, your future and even the world we live in.   If that’s what you want, then start listening!</p>",
        "id": 427987,
        "author": "Sheri Johnson"
    },
    {
        "title": "The Overwhelmed Brain",
        "url": "https://theoverwhelmedbrain.libsyn.com/rss",
        "description": "Get to the root of emotional issues and learn the best way to relate to yourself and others by honoring your personal boundaries and making decisions that are in alignment with what's most important to you. \n\nThis is not a \"common-sense\" personal growth and development show. You won't be told to think positively or create affirmations. The Overwhelmed Brain is about accessing that deeper mental and emotional strength inside you so that you can decrease or even eliminate old fears and evolve into the person you want to be. \n\nLearn what your parents or caretakers never taught you about emotional wellness and creating strong, non-toxic bonds with others. \n\nIf you want the exact instructions that will help improve your life, you're in the right place.",
        "id": 487674,
        "author": "Paul Colaianni"
    },
    {
        "title": "Happy Valley Baptist Church Sermons",
        "url": "https://feeds.simplecast.com/OQT0DWGJ",
        "description": "Weekly sermons from Happy Valley Baptist Church\n4103 W. Texas St.\nCarlsbad, NM 88220",
        "id": 502705,
        "author": "Happy Valley Baptist Church"
    },
    {
        "title": "Bitcoin verstehen",
        "url": "https://bitcoinverstehen.podcaster.de/bitcoin-verstehen.rss",
        "description": "Was ist Bitcoin und wieso benötigen wir ihn? In diesem Podcast bringen wir neugierigen Einsteigern und auch Fortgeschrittenen alles rund um das Thema Bitcoin einfach & verständlich näher.\nIn unseren wöchentlichen Episoden sprechen wir über die unterschiedlichen Aspekte Bitcoins, wie bspw. dessen ökonomische Grundlagen, die Einordnung in das aktuelle Finanzsystem und dessen technologische Funktionsweise. Darüber hinaus befassen wir uns mit der praktischen Umsetzung bspw. dem Kauf und Verkauf von Bitcoin sowie dessen Aufbewahrung.",
        "id": 558916,
        "author": "Jonas Hofmeister, Manuel Bassler"
    },
    {
        "title": "Pitcher List Fantasy Baseball",
        "url": "https://feeds.simplecast.com/Rbrm7xIB",
        "description": "Award-winning daily and weekly Fantasy Baseball analysis from the Pitcher List staff.",
        "id": 771958,
        "author": "Pitcher List"
    },
    {
        "title": "Nemos News Network",
        "url": "https://feeds.buzzsprout.com/958231.rss",
        "description": "The Great Awakening and the Silent War Between Trump & The Deep State.Updates on Q, The Economy, The News, the REAL News, and the FAKE NEWS. w/ Bestselling QAnon Researcher Dustin Nemos named \"Digital Soldier\" by Joe Flynn.",
        "id": 837784,
        "author": "Nemos News Network"
    },
    {
        "title": "Faith Journey | Rev. Kenn Blanchard",
        "url": "https://speaklife.libsyn.com/rss",
        "description": "A faith journey is a lifelong process of discovery and defining what faith means to you. It can also be described as a journey of thanksgiving and praise, and a time of depending on God. \nSome say that faith is a journey that involves different stages or seasons, and that it's normal to experience struggles and disappointment along the way. Others say that faith is something that can be understood and defined, and that the journey of faith is a process of defining what faith means for you personally. \nA faith journey can involve:\nConnecting with God: Some say that scripture is a place to encounter God and grow your faith.\n \nDefining faith: Some say that you must walk your own path to determine what faith means to you. \nExpressing faith: Some say that faith can be expressed in many different ways. \nLearning about faith: Some say that it's important to understand the multiple meanings of faith, and how it relates to events in the past, present, and future. \n Hosted by Rev. Kenn Blanchard",
        "id": 896185,
        "author": "Rev. Kenn Blanchard"
    },
    {
        "title": "Morning Mindset Christian Daily Devotional Bible study and prayer",
        "url": "https://feed.cdnstream1.com/zjb/feed/download/fd/e9/ee/fde9ee96-3704-405c-8919-faf9f4ddc623.xml",
        "description": "<p>Over 18,000 people per day, from all over the world have found the Morning Mindset a great, Jesus-filled way to help them get their minds aligned with the truth of God's word, every single morning! Episodes are drawn directly from scripture, life-application-based, steeped in prayer, and challenging to mature and beginning Christ-followers alike. 7 minutes to get your day started with Jesus! <br><br>Find out more at <a href=\"http://YourMorningMindset.com\">http://YourMorningMindset.com</a> or become a monthly partner and get access to our Partners-only podcast feed of bonus material at <a href=\"https://MorningMindsetMedia.com/partner\">https://MorningMindsetMedia.com/partner</a>. <br><br>Contact Carey at <a href=\"mailto:admin@morningmindsetmedia.com\">admin@morningmindsetmedia.com</a> </p>",
        "id": 962811,
        "author": "Carey Green"
    },
    {
        "title": "Macroaggressions",
        "url": "https://audioboom.com/channels/5020005.rss",
        "description": "",
        "id": 974509,
        "author": "Charlie Robinson"
    },
    {
        "title": "TED Talks Daily",
        "url": "https://feeds.feedburner.com/TEDTalks_audio",
        "description": "Want TED Talks on the go? Everyday, this feed brings you our latest talks in audio format. Hear thought-provoking ideas on every subject imaginable – from Artificial Intelligence to Zoology, and everything in between – given by the world's leading thinkers and doers. This collection of talks, given at TED and TEDx conferences around the globe, is also available in video format.<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 980370,
        "author": "TED"
    },
    {
        "title": "Besser leben. Der Bayern 1 Nachhaltigkeitspodcast",
        "url": "https://feeds.br.de/umweltkommissar/feed.xml",
        "description": "Wie viel Tierwohl steckt wirklich hinter den Haltungsformen beim Fleisch? Was bringt ein Baum inmitten der Stadt eigentlich in Sachen Wärmeregulierung an heißen Tagen? Und welcher Käse ist vegetarisch, welcher nicht? Umweltfragen mit Alltagsbezug klären unsere Hosts Melitta Varlam und der Neue im Team, Florian Kienast, im Nachhaltigkeits-Podcast \"Besser leben\". \nJede Woche nehmen sich BAYERN 1 Moderatorin Melitta Varlam und Florian Kienast, den viele aus der Sendung \"Unser Land\" im BR Fernsehen kennen, ein neues Thema vor, immer unter dem Blickwinkel der Nachhaltigkeit – aber auch immer unter dem Blickwinkel Verbraucherschutz. Und immer bekommen wir Hörerinnen und Hörer einfache, machbare Tipps an die Hand, wie wir unsere Gesundheit und die persönliche Umweltbilanz ein bisschen besser gestalten können. Beim Einkaufen. Im Haushalt. Beim Essen. Unterwegs. \nUnd so freuen wir uns auf Antworten, in der mittlerweile achten Staffel des erfolgreichen Umweltpodcasts von BAYERN 1, beispielsweise auch auf Fragen nach der Nachhaltigkeit von Discounterpflanzen.  \nDabei ist dem \"Besser leben\"-Team wichtig: Umweltbewusstsein, ja – aber ohne erhobenen Zeigefinger und ideologischen Druck. Stattdessen garantiert mit einigen \"Oh, dass wusste ich ja gar nicht\"-Momenten. Übrigens freuen wir uns jederzeit über Feedback, Fragen oder auch Themenanregungen. Einfach per Mail an besserleben@bayern1.de \nGerade wenn es um Themen wie Fleischkonsum oder regenerative Energien und Energiewende geht, ist es meist schwer, unabhängige und seriöse Informationen zu bekommen. Und genau das ist eine weitere zentrale Aufgabe unseres Verbraucher-Podcasts: Hintergrund geben, sorgfältig recherchiert, mit sachkundigen Expertinnen und Experten untermauert – so dass sich jede Hörerin und jeder Hörer auf dieser Basis selbst eine Meinung bilden kann. Und zwar eine, die nicht auf Streit und Panikmache basiert, sondern auf Fakten. \nMelitta Varlam und Florian Kienast sind die Hosts des BAYERN 1 Nachhaltigkeitspodcast \"Besser leben\". Sie beantworten jede Woche, immer sonntags, eine dieser Fragen und stellen uns Verbraucherinnen und Verbraucher dabei in den Mittelpunkt. Obendrein geben die beiden stets nützliche Tipps, wie wir auf wirklich einfache Art und Weise umweltbewusster leben können. Das können Kleinigkeiten im Haushalt, beim Einkaufen oder beim Essen sein. So stellen sie auch unangenehme Fragen, wenn es zum Beispiel um die Muttergebundene Kälberaufzucht geht und geben Tipps, welche Milch man in diesem Kontext mit gutem Gewissen kaufen kann. Ihr habt euch für eine Wärmepumpe entschieden und braucht Tipps zur Wartung? Dieser Podcast kniet sich für euch rein. Melitta Varlam und Florian Kienast recherchieren mit ihrem Team sorgfältig und stellen den richtigen Expertinnen und Experten die wichtigen Fragen zum Thema. \nHört rein und erfahrt, wie nachhaltig Mikroplastikfilter und Waschnüsse in der Waschmaschine sind. Wie findet man guten Honig und vermeidet gepanschten? Und welche Matratze ist wohl die beste?  \nOder ob bei Obst und Gemüse \"regional\" besser als \"bio\" ist. Und kann man jetzt schon guten Gewissens gebrauchte E-Autos kaufen? Und was hat es mit dem Refurbished-Trend auf sich: Was heißt generalüberholt? Und viele weitere Umweltthemen findet ihr beim Nachhatligkeitspodcast \"Besser leben\". \nWir wünschen viel Spaß und gute Unterhaltung mit unserem Verbraucherschutz-Podcast \"Besser leben\".",
        "id": 1054857,
        "author": "Bayerischer Rundfunk"
    },
    {
        "title": "First Pitch Podcast Podcast",
        "url": "https://feeds.simplecast.com/Lvj_5WZV",
        "description": "Pitcher List's Brian Entrekin and Jake Crumpler tell you everything you need to know to win your fantasy baseball league in just fifteen minutes. Every morning, seven days a week.",
        "id": 2235604,
        "author": "Pitcher List"
    },
    {
        "title": "TRUTH TASK Radio Podcast",
        "url": "https://feeds.buzzsprout.com/1150748.rss",
        "description": "<p>TRUTH TASK Radio Podcast … A Global Garden Projects, Inc. Hope and Beyond Project ...The Projects’ Edutainment Mission provides for independent thinking, engagement forwarding personal potential, and public benefiting awareness...Opinions and Views Independently Expressed as Presented May Not or Do Not Reflect those of Global Garden Projects, Inc. Hope and Beyond Project or it’s associations. TruthTask©2024-2016 Global Garden Projects, Inc. Hope and Beyond Project, San Francisco, California U.S.A. </p>",
        "id": 3455259,
        "author": "Ron Frazier and David P Grace"
    },
    {
        "title": "Online Marketing Podcast",
        "url": "https://feeds.captivate.fm/online-marketing-podcast/",
        "description": "Welcome to the Online Marketing Podcast, where we help Course Creators, Membership Owners & Coaches market and sell their offers.\nYou get results for your students, members, and students and are confident that your offers work. Now you just have to market and sell them to bring the right people into your world! \nEach episode of the podcast we do a deep dive into strategies and mindset that high earners take action on for themselves (and we pull back the curtain on our 6 Figure Online Business as well!)\nBrought to you by Paul & Melissa Pruitt, husband & wife and business partners who help top professionals launch online courses, memberships & coaching programs.\nJust sign up to be notified at onlinemarketingpodcast.com",
        "id": 3607993,
        "author": "Paul Pruitt"
    },
    {
        "title": "Startband - Der Speedwaypodcast",
        "url": "https://feeds.buzzsprout.com/1814416.rss",
        "description": "<p>Ebi und Micha bringen euch die Welt des Speedways näher. Mehrmals im Monat, werden sich die beiden für einen \"Kaffeeklatsch\" an die Mikros setzen. Kontakt : startbandpodcast@web.de / Impressum : Michael Czechan & René Eberhardt, Bergstraße 16 / 17033 Neubrandenburg</p>",
        "id": 4064895,
        "author": "Micha & Ebi"
    },
    {
        "title": "Al Ahly Pharos",
        "url": "https://feeds.buzzsprout.com/1830222.rss",
        "description": "Welcome to our daily podcast featuring the day's top news commentary and technical recommendations delivered to you before the opening bells of the Egyptian Stock Exchange (EGX).Alongside our morning podcasts, we will be publishing a collection of episodes presenting indepth analysis and insights on EGX's equities, all brought to you by Al Ahly Pharos.",
        "id": 4124751,
        "author": "Al Ahly Pharos"
    },
    {
        "title": "The Plumley Pod",
        "url": "https://feeds.libsyn.com/558480/rss",
        "description": "Prepare to lift the lid on all things Education not indoctrination! Your voice of reason for Home Education: The Plumley Pod. Hosted by Sarah Plumley BA, PGCE (Maths). Professional Mathematics Teacher, GCSE Maths Examiner, Independent Private Tutor, and Home Education Advocate.\n\nsarahplumley.substack.com",
        "id": 4260396,
        "author": "Sarah Plumley BA PGCE(Maths)"
    },
    {
        "title": "SBS News",
        "url": "https://sbs-ondemand.streamguys1.com/sbs-news-latest/",
        "description": "A bulletin of the day’s top stories from SBS News.",
        "id": 4431866,
        "author": "SBS"
    },
    {
        "title": "A WORD for This Day",
        "url": "https://feeds.buzzsprout.com/1910821.rss",
        "description": "<p>This podcast has a daily bible verse focus. The scripture is a reference that corresponds to the day ( For example January 1st might be John 1:1, March 16th might be John 3:16, June 8th could have Micah 6:8, etc.). This podcast stems from a project Jori was inspired to start in 2020 to see if she could find a verse that corresponded with the calendar date to share with friends and prayer partners each day. Jori says, \"It has been such an amazing blessing to be reminded again and again, how truly living and active the Word of GOD is.\" There is a daily devotion with each day's chosen scripture and some additional encouragement and exhortation for the listener to be able to dig in and study even more on their own. Jori's prayer is that this will be a blessing to each audience member who takes the time to read, study, and meditate on the TRUTH that is GOD'S Holy Word!</p>",
        "id": 4662206,
        "author": "Dr. Jori Shaffer"
    },
    {
        "title": "The Hello Mornings Podcast",
        "url": "https://feeds.transistor.fm/hello-mornings-podcast",
        "description": "The Hello Mornings podcast hosted by Kat Lee helps YOU build a consistent morning routine and 12 key habits in a peaceful, grace-filled way. We focus on one habit per month and offer a quick daily tip, wrapping up each podcast with our 3-Minute Morning Routine. Our goal is to help Christian women, like you, build habits peacefully, so you can impact your world powerfully.",
        "id": 5196033,
        "author": "Kat Lee"
    },
    {
        "title": "Dry Creek Wrangler Podcast",
        "url": "https://feeds.megaphone.fm/dry-creek-wrangler",
        "description": "<p>Dewayne Noel has been living the horse life for over 30 years as a professional and private owner. A husband of 30 years, the father of 7 grown children, and \"Grumpa\" to many grandchildren, this life experience cannot be separated from the reality of who he is and often makes its way into the mix. As a Christian with a varied and unique history in ministry and law enforcement, he also brings these life experiences to the table.</p><p>It is not the purpose of this podcast to present \"the\" way to do anything but rather to use simple logic and experience to try and help others who might be looking for answers. It does not always offer direct answers to certain questions but instead humbly seeks to show a road one might go down to find the answers they need for themselves.</p>",
        "id": 5979790,
        "author": "Dewayne Noel"
    },
    {
        "title": "Oi, Let's Talk",
        "url": "https://app.kajabi.com/podcasts/2147512555/feed",
        "description": "<p><b>For the girlies that want more. </b><br>Fitness | Health | Business | Unfiltered<em> </em><br><em>Expect banter, education & organised chaos.  </em><br>HOSTS- @thekatemorris & @coachgemma <br><br></p>",
        "id": 6136758,
        "author": "Kate Morris & Gemma Mullins"
    },
    {
        "title": "Daily Readings by Wild at Heart",
        "url": "https://feeds.transistor.fm/wildatheart-daily",
        "description": "Daily Readings are a daily excerpt from books and teachings from John and Stasi Eldredge and Morgan Snyder.",
        "id": 6318470,
        "author": "John Eldredge"
    },
    {
        "title": "Small Ways To Live Well from The Simple Things",
        "url": "https://feeds.buzzsprout.com/2280335.rss",
        "description": "<p>Small Ways to Live Well is a podcast from <a href=\"http://thesimplethings.com/\">The Simple Things</a>, a monthly magazine about slowing down, remembering what’s important and making the most of where you live. </p><p><br></p><p>Hosted by the Editor, <a href=\"https://www.instagram.com/lisasthinks/\">Lisa Sykes</a>, in Season 5: Return of the light, she’ll be seeking out glimpses of spring, shrugging off winter and embracing some self-care, alongside wellbeing editor <a href=\"https://www.instagram.com/becsfrank/?hl=en-gb\">Becs Frank</a> and regular contributor <a href=\"https://www.instagram.com/slowjotinsley/\">Jo Tinsley</a>. </p><p> </p><p>The beginning of February marks the half-way point between the winter solstice and the spring equinox, from here on in there are increasing glimpses of spring right through to the clocks going forward in late March when hopefully the proverbial lion turns into a lamb. This is an optimistic, forward-looking time, when we’re more than ready to come out of hibernation to take on new projects. And there are festivals and feasts to brighten the still grey days. February is the chilliest month but it’s all about cold hands and warm hearts.</p><p><br>Let our podcast be your soothing companion to see out winter and welcome in spring.  Six episodes released weekly from 9 February. Plus don’t miss our Easter Special on Good Friday. Season 5: Return of the Light is supported by <a href=\"https://www.blackdownshepherdhuts.co.uk/\">Blackdown Shepherd Huts</a></p><p> </p><p>To subscribe or order a copy of The Simple Things visit <a href=\"http://thesimplethings.com/\">thesimplethings.com</a></p>",
        "id": 6720001,
        "author": "The Simple Things"
    },
    {
        "title": "Word Up Oxford Town",
        "url": "https://feeds.buzzsprout.com/2402485.rss",
        "description": "<p>Numbers</p>",
        "id": 7010848,
        "author": "Chester Murray"
    },
    {
        "title": "MasilyJohn",
        "url": "https://feeds.buzzsprout.com/2385664.rss",
        "description": "<p>Nơi cảm xúc dâng trào với từng tập Podcast!</p>",
        "id": 7019518,
        "author": "MasilyJohn"
    },
    {
        "title": "Drabbletober",
        "url": "https://caribou-mango-x7yw.squarespace.com/drabbletober?format=rss",
        "description": "<p>The podcast of tiny speculative fiction. Brand new drabbles (stories of exactly 100 words) every day during October.</p>",
        "id": 7026165,
        "author": "Elizabeth Guilt"
    },
    {
        "title": "I Don’t Know What You’re Talking About",
        "url": "https://feeds.buzzsprout.com/2393005.rss",
        "description": "<p>Welcome to <em>I Don’t Know What You’re Talking About with E & G </em>the podcast where a married couple meets at their kitchen table to dive into the delightful unknown! Here is what AI thinks our podcast is all about: <br><br>Join us as we explore topics that lie outside our everyday lives, sparking unexpected conversations, random tangents, and some laughs along the way.</p><p> </p><p>Each episode features each partner introducing a subject the other knows little about, from quirky historical events to obscure hobbies, and everything in between. Picture a lighthearted chat over coffee, where curiosity reigns and learning becomes a shared adventure.</p><p> </p><p>With their playful banter, relatable anecdotes, and a sprinkle of humor, E and G create a warm atmosphere that feels like sitting with friends. Whether you’re tuning in for the laughs, the insights, or just the cozy vibe, you’ll find that sometimes, the best conversations happen at the intersection of curiosity and love. Join us at the table!</p>",
        "id": 7034387,
        "author": "I Don't Know What You're Talking About"
    },
    {
        "title": "Audios Miguel Anxo Bastos",
        "url": "https://www.ivoox.com/feed_fg_f11348569_filtro_1.xml",
        "description": "Canal no oficial del economista libertario y anarcocapitalista gallego Miguel Anxo Bastos\n\n────────────────────────────────────────────────\n\nℹ️ Este programa forma parte de Free Cuban Podcasts : https://www.ivoox.com/escuchar-free-cuban-podcasts_nq_593331_1.html\n\nUn proyecto independiente y personal que nace con la intención de difundir las ideas de la libertad ℹ️\n\n🤝 Puedes ayudar a su continuidad a través de BIZUM: 692/163/601 🤝\n\n────────────────────────────────────────────────\n\n¡¡¡Muchas gracias!!!",
        "id": 7037666,
        "author": "Free Cuban"
    },
    {
        "title": "Oi, Let's Talk",
        "url": "https://feeds.buzzsprout.com/2417161.rss",
        "description": "<p><b>For the girlies that want more. </b><br>Fitness | Health | Business | Unfiltered<em> </em><br><em>Expect banter, education & organised chaos.  </em><br>HOSTS- @thekatemorris & @coachgemma <br><br></p>",
        "id": 7066008,
        "author": "Kate Morris & Gemma Mullins"
    },
    {
        "title": "SynapseLingo Apprendre l’allemand",
        "url": "https://synapselingo-apprendre-lallemand.podigee.io/feed/mp3",
        "description": "Bienvenue dans le podcast SynapseLingo Learn German ! Plongez dans un monde passionnant d’apprentissage des langues avec des textes d’apprentissage divertissants et des chansons entraînantes dans différentes combinaisons de langues. Chaque épisode vous offre un mélange unique d’éducation et de divertissement qui donnera des ailes à vos compétences linguistiques. Écoutez, apprenez et profitez de mélodies accrocheuses qui vous aideront à maîtriser la langue de manière ludique. Parfait pour les déplacements, dans la voiture ou à la maison, SynapseLingo rend l’apprentissage des langues amusant.",
        "id": 7072191,
        "author": "SynapseLingo"
    },
    {
        "title": "The Backyard Podcast",
        "url": "https://anchor.fm/s/eace422c/podcast/rss",
        "description": "Just a guy spilling verbal nonsense with friends. This is a raunchy but wholesome podcast",
        "id": 7144009,
        "author": "Nick"
    },
    {
        "title": "Le Français c'est facile ! avec Adrien",
        "url": "https://feed.ausha.co/KX2gVSmZXa67",
        "description": "Patreon : https://www.patreon.com/c/lefrancaiscestfacileavecadrien\nLe français c'est facile ! avec Adrien\nAvec une méthode ludique sur les expressions française de la vie de tous les jours, j'essaye de rendre l'apprentissage du français accessible à tous. Grâce à des explications claires et des exemples concrets, les règles du français, la prononciation et la compréhension deviennent plus facile. \nA chaque podcast, j'essaye de diviser l'émission en trois parties. En premier, je vous parle de tout et de rien, de la vie quotidienne en général. En second, j'explique une règle de français avec des exemples, cela concerne soit la grammaire, soit la conjugaison, la prononciation française ou encore les meilleurs méthodes pour apprendre. En troisième partie, j'aborde l'expression du jour. \nLes auditeurs ne se contentent pas d'apprendre, ils découvrent une nouvelle culture, s'immergent dans la richesse de la langue et prennent confiance en eux au fil des leçons. Avec chaque écoute de ce podcast, maîtriser le français devient une aventure passionnante et motivante.\nHébergé par Ausha. Visitez ausha.co/fr/politique-de-confidentialite pour plus d'informations.",
        "id": 7154573,
        "author": "Adrien"
    },
    {
        "title": "Raus hier! – Der Exit-Podcast von How to HOCHKULTUR",
        "url": "https://anchor.fm/s/1030bde1c/podcast/rss",
        "description": "Aukse & Anja sprechen mit Menschen, die Alternativen zum Staatsversagen leben: in Landwirtschaft, Medizin, Bildung, Geld und Gemeinschaft. Es geht um gesunde Böden, gesunde Menschen, gesundes Geld – und eine freie, dezentrale Zukunft. Jeden Sonntag eine neue Folge. Erst auf YouTube, dann überall als Podcast.\nRaus hier. Jetzt.",
        "id": 7275198,
        "author": "How to HOCHKULTUR"
    },
    {
        "title": "Bigfoot Society",
        "url": "https://www.spreaker.com/show/5828342/episodes/feed",
        "description": "Welcome to “Bigfoot Society,” the podcast where host Jeremiah Byron delves into the captivating world of Bigfoot encounters. Through intimate interviews, Jeremiah aims to empower witnesses by providing them with a platform to share their experiences. By doing so, he offers a sense of relief and control, allowing them to take ownership of their stories. Join us as we explore these extraordinary encounters, unveiling the mysteries surrounding Bigfoot and its impact on the lives of those who have encountered this elusive creature.<br /><br />If you have had a Bigfoot encounter please share it with us and start the conversation by sending an email to \"bigfootsociety@gmail.com\".",
        "id": 693729,
        "author": "Jeremiah Byron"
    },
    {
        "title": "The Skeptic Metaphysicians: Metaphysics, Spiritual Awakenings, Expanded Consciousness",
        "url": "https://www.spreaker.com/show/5652646/episodes/feed",
        "description": "<b>The Skeptic Metaphysicians</b><br />One Truth. Many Paths. Endless Curiosity. <br /><br />Hosted by real-life couple and cosmic co-adventurers Will & Karen, The Skeptic Metaphysicians is where open minds meet open hearts — and where deep metaphysical mysteries get unwrapped with humor, humanity, and a healthy dose of “wait…what?!”<br /> <br />Born from an existential breakdown (yep, the spiritual kind), the show dives headfirst into the wild world of spiritual awakenings, energy healing, consciousness expansion, near-death experiences, psychic phenomena, manifestation, mysticism… and beyond.<br /> <br />Each week, Will brings the wide-eyed curiosity of a seeker reawakened, while Karen balances the vibe with grounded intuition, thoughtful insights, and just the right amount of side-eye. Together, they create a safe space for exploring the woo without losing your grip on the real.<br /> <br />Whether you’re a full-on spiritual explorer or just metaphysical-curious, this show is your backstage pass to conversations with:<br /><ul><li>Mediums & mystics</li><li>Alien contactees</li><li>Scientists of consciousness</li><li>Energy healers & channelers</li><li>And everyday people with extraordinary stories </li></ul><b>Why listeners love it: </b><br />It’s smart, soulful, funny, and deeply validating. Like having a chat with your most spiritually woke friend… who still knows how to laugh at themselves. <br />⸻ <br />✨ It’s not about blind belief. It’s about brave exploration. Tune in. Wake up. And maybe — just maybe — remember who you really are.<br /><br />New episodes every Wednesday and bonus episodes throughout the week!",
        "id": 1382483,
        "author": "Metaphysics | Spiritual Awakenings | Expanding Consciousness | Spiritual Growth"
    },
    {
        "title": "Studia Rapido podcast",
        "url": "https://www.spreaker.com/show/6455185/episodes/feed",
        "description": "Studia Rapido è la tua risorsa online per apprendere in modo rapido e chiaro. Offriamo riassunti, appunti e approfondimenti su Storia, Letteratura, Arte, Filosofia e Scienze, pensati per studenti e appassionati di cultura. Il nostro podcast ti guida attraverso concetti complessi, rendendoli accessibili e interessanti. Unisciti a noi per scoprire il piacere di imparare, ovunque tu sia.",
        "id": 7145105,
        "author": "Studia Rapido"
    },
    {
        "title": "Dropship Downunder",
        "url": "https://media.rss.com/dropship-downunder/feed.xml",
        "description": "<p>Dropship Downunder is the podcast made for Australians who want to build successful dropshipping businesses. Hosted by Klint and Grant Parker, veterans in the Aussie eCommerce scene, we share actionable advice, industry secrets, and strategies for navigating the unique challenges of dropshipping in Australia. Tune in and take your dropshipping game to the next level.</p>",
        "id": 7169624,
        "author": "Klint & Grant Parker"
    },
    {
        "title": "Morning and Evening with Charles Spurgeon",
        "url": "http://toddadkins.com/category/morningevening/feed/",
        "description": "Over the last century, countless Christians have started and ended their day with Morning and Evening by Charles Spurgeon. The author’s command of the English language, Biblical wisdom, and practical guidance through life’s ups and downs remains timeless and relevant to the modern day. The elegance of his prose is further brought to life now in this podcast form while retaining the beautiful language of the original King James Version, as it was originally written. From time to time, you will also hear Spurgeon experts and additional resources to add further insight and commentary on this classic tome and its author. While Spurgeon published a plethora of sermons, articles and books, Morning and Evening remains his best loved and most published work. ClassicDevotionals.com is both pleased and privileged to be the first one to bring you a daily devotional reading of this timeless book in podcast form. We hope you enjoy it and are encouraged in your walk with Christ.",
        "id": 718218,
        "author": "ClassicDevotionals.com"
    },
    {
        "title": "Mogul Media AI Spotlight",
        "url": "https://feeds.transistor.fm/mogul-media-spotlight",
        "description": "A bright light on the day's most engaging curated & imagined articles. We feature the best of Mogul Media AI's daily output. Produced by <a href='https://digitaldan.me'>Daniel Aharonoff</a>",
        "id": 6369747,
        "author": "Daniel Aharonoff"
    },
    {
        "title": "Living Loaves of Bread",
        "url": "https://feeds.simplecast.com/YENtQNWg",
        "description": "Bible exploration",
        "id": 4864218,
        "author": "Psalm1151 Ministries"
    },
    {
        "title": "Questions d'islam",
        "url": "https://radiofrance-podcast.net/podcast09/rss_10073.xml",
        "description": "Emission consacrée à l'Islam Rendez-vous sur l'application Radio France pour découvrir tous les autres épisodes.",
        "id": 1387119,
        "author": "France Culture"
    },
    {
        "title": "דף היומי - הרב פנחס יוסף אקרב",
        "url": "https://feeds.transistor.fm/9e2daf49-8c10-4d66-8aa6-47ac38f2f841",
        "description": "gemara lessons in video from rabbi pinchas yosef akrav",
        "id": 7257086,
        "author": "הרב פנחס יוסף אקרב"
    },
    {
        "title": "Brick Breakers Podcast",
        "url": "https://anchor.fm/s/872dfc6c/podcast/rss",
        "description": "Brick Breakers” is the podcast where we break down the walls holding us back from becoming the best version of ourselves. From overcoming past traumas to navigating mental health struggles and life’s toughest challenges, each episode uncovers the strength and courage needed to move forward. Brick Breakers offers tools, hope, and inspiration to help you clear the path toward a life of growth, healing, and empowerment. Let’s break through together, one brick at a time.\n Social Media @brickbreakerspodcast",
        "id": 7023985,
        "author": "Brick Breakers Podcast"
    },
    {
        "title": "Podcast dell'Ordine Costantiniano",
        "url": "https://www.spreaker.com/show/6234697/episodes/feed",
        "description": "I Podcast del Sacro Militare Ordine Costantiniano di San Giorgio - Real Commissione per l'Italia",
        "id": 7043862,
        "author": "Real Commissione per l'Italia"
    },
    {
        "title": "BlackBarberShop.org Audio Blog",
        "url": "https://www.spreaker.com/show/6259113/episodes/feed",
        "description": "Welcome to the Black Barbershop Podcast Channel, where we bring you the latest insights and stories from the heart of the Black Barbershop experience. Hosted by the Black Barbershop website, this podcast channel transforms the rich content and unique perspectives of our community into engaging audio experiences. Each episode delves into the multifaceted world of Black-owned barbershops, exploring topics that range from the art and craft of barbering to the cultural and social significance of these iconic institutions. We share stories of entrepreneurship, community building, and the preservation of cultural heritage. The Black Barbershop Podcast Channel is dedicated to promoting education and awareness about the vital role that barbershops play in the African American community. Whether you’re a barber honing your craft, a client looking to understand the impact of these cultural hubs, or an enthusiast eager to learn more about the history and evolution of Black barbershops, our episodes provide valuable insights and inspiration. Tune in to explore topics such as the latest grooming trends, the art of barbering, community initiatives, and personal stories from barbers and patrons alike. Join us on this journey to celebrate and elevate the Black barbershop tradition, and stay connected with the Black Barbershop website for all your cultural and community interests.",
        "id": 7001497,
        "author": "Audio Blogs"
    },
    {
        "title": "Mondo Jazz",
        "url": "https://feeds.megaphone.fm/mondojazz",
        "description": "<p>This is a jazz world!</p>",
        "id": 185256,
        "author": "Ludovico Granvassu"
    },
    {
        "title": "Good Morning Mercati",
        "url": "https://www.spreaker.com/show/5981898/episodes/feed",
        "description": "Il podcast finanziario curato da Michele Seghizzi, Direttore Marketing & Relazioni Esterne di Banca Generali.",
        "id": 7042914,
        "author": "Michele Seghizzi"
    },
    {
        "title": "L'Instant Swimrun",
        "url": "https://feeds.acast.com/public/shows/65faf8571c46ed0017f9e190",
        "description": "<p>Un podcast dédié au swimrun ! On fera intervenir des invités de qualités, des athlètes, des spécialistes de l’entraînement, de la nutrition. On vous proposera aussi des contenus sur le matériel et comment s’organiser pour les courses.</p><br><p>Retrouvez nous sur Instagram : <a href=\"https://www.instagram.com/linstant_swimrun\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.instagram.com/linstant_swimrun</a></p><hr><p style='color:grey; font-size:0.75em;'> Hébergé par Acast. Visitez <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> pour plus d'informations.</p>",
        "id": 6843316,
        "author": "L'Instant Swimrun"
    },
    {
        "title": "Een Cursus in Wonderen Dagelijkse Les",
        "url": "https://www.spreaker.com/show/968686/episodes/feed",
        "description": "Er is een nieuwe Een Cursus in Wonderen Org App met deze en andere klassen. Ga naar https://eciw.app<br /><br /><br /><br />Welkom bij de dagelijkse les van een cursus in wonderen. Aan het begin van iedere dag nemen we de les van die dag door. De les en onderwerpen die worden besproken nodigen uit tot een ervaring voorbij waarneming en kunnen als hulp en ondersteuning worden gebruikt in je eigen pad ter verlichting.<br /><br />Je kunt iedere podcast hier beluisteren of via youtube, iTunes, Spotify, ECIW Dagelijkse Les android app of eencursusinwonderen.org. We doen ons uiterste best om dagelijks voor 9 uur een nieuwe dagelijkse les klas voor die dag beschikbaar te hebben.<br /><br />Deze app en podcast wordt mogelijk gemaakt door donaties van luisteraars zoals jij. Wil je ook mee helpen en een donatie geven, ga dan naar de contact pagina van de website https://eencursusinwonderen.org/doneer<br /><br />Dit is Een Cursus in Wonderen. Het is een verplichte cursus. Alleen het tijdstip waarop je hem doet staat je vrij. Vrije wil betekent niet dat jij het leerplan kunt vaststellen. Het betekent alleen dat je kunt kiezen wat je op een gegeven moment wilt doen.<br /><br />De cursus beoogt niet de betekenis van liefde te onderwijzen, want dat gaat wat onderwezen kan worden te boven. Hij beoogt echter wel de blokkades weg te nemen voor het bewustzijn van de aanwezigheid van liefde, die jouw natuurlijk erfgoed is. Het tegendeel van liefde is angst, maar wat allesomvattend is kan geen tegendeel hebben.<br /><br />Deze cursus kan daarom zeer eenvoudig aldus worden samengevat:<br />Niets werkelijks kan bedreigd worden.<br />Niets onwerkelijks bestaat.<br />Hierin ligt de vrede van God.<br /><br />Het doel van het werkboek is je geest systematisch te trainen in een andere waarneming van alles en iedereen in de wereld. De oefeningen zijn ontworpen om je te helpen de lessen te veralgemenen, zodat je gaat begrijpen dat ze elk evenzeer toepasbaar zijn op je waarneming van alles en iedereen.<br /><br />De overdracht van training verloopt bij ware waarneming niet op dezelfde manier als de overdracht van training in de wereld. Als ware waarneming is bereikt met betrekking tot enige persoon, situatie of gebeurtenis, dan staat vast dat ze totaal op alles en iedereen overgaat. Anderzijds maakt één uitzondering, die buiten ware waarneming wordt gehouden, haar verwezenlijking waar dan ook onmogelijk.<br /><br />De ware aard van ware waarneming is dat ze geen begrenzingen heeft.<br />Ze is het tegengestelde van de manier waarop je nu ziet.<br /><br />(Uit: Een Cursus in Wonderen uitgegeven door Uitgeverij Ankh-Hermes bv - Deventer)<br /><br />Alle herhalingen van de Dagelijkse Les klas nu ook op Youtube: https://www.youtube.com/c/hetlichtisgekomenpuntnl/playlists",
        "id": 895205,
        "author": "Een Cursus in Wonderen"
    },
    {
        "title": "Border Nights",
        "url": "https://www.spreaker.com/show/654467/episodes/feed",
        "description": "Mistero, informazione alternativa, crescita interiore, spiritualità e musica d'atmosfera nel podcast ufficiale del programma radiofonico in onda ogni settimana su WebRadioNetwork<br /><br />Diventa un supporter di questo podcast: <a href=\"https://www.spreaker.com/podcast/border-nights--654467/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/border-nights--654467/support</a>.",
        "id": 670611,
        "author": "Border Nights"
    },
    {
        "title": "Unipolar-Multipolar: Der Podcast für Geopolitik",
        "url": "https://anchor.fm/s/db63ef94/podcast/rss",
        "description": "Die Leitung ist schwach, doch ich kann sie gut empfangen. Die ehemalige Außenministerin im Exil: Dr. Karin Kneissl, Chefdiplomatin a.D. der Republik Österreich steht Rede und Antwort im neuen Podcast “Unipolar - Multipolar: Der Podcast für Geopolitik.\" In diesem Format werden Karin Kneissl und der Journalist Flavio von Witzleben jede Woche die Ereignisse auf dem geopolitischen Schachbrett genauer unter die Lupe nehmen.",
        "id": 6076933,
        "author": "Flavio von Witzleben"
    },
    {
        "title": "Vintage Video",
        "url": "https://vintagevideopodcast.com/feed/",
        "description": "On the Vintage Video Podcast, Patrick, Jesse, and Richard are rewatching and reviewing every major film release of the 1980's in chronological order for your amusement! Listen along as we analyze all the movies you love and spoil everything you haven't seen! Cheer us on through the decade or we will for sure quit!",
        "id": 490929,
        "author": "Vintage Video"
    },
    {
        "title": "In Pursuit of Balance",
        "url": "https://feeds.acast.com/public/shows/6500457ca3b26d00111346d5",
        "description": "Välkommen till In Pursuit of Balance med Anna och Valeria. I en värld där allt går snabbt, ställer vi oss den enkla men svåra frågan: <em>Hur hittar vi balans? </em>In Pursuit of Balance är podden där vi delar med oss av personliga och ärliga berättelser, fulla av både glädje och tårar, tillsammans med djupa samtal och öppna reflektioner. Med självhjälp och tankeväckande forskning som vägledning utforskar vi hur vi kan hitta balans i vår snabba och utmanande vardag, mitt i en värld som ständigt förändras. Vi är inte experter. Men vi är nyfikna, öppna och ärliga. Är du också på jakt efter balans? Då är du på rätt plats!<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 6893089,
        "author": "Anna & Valeria"
    },
    {
        "title": "kxtc Podcast",
        "url": "https://www.spreaker.com/show/1311383/episodes/feed",
        "description": "Podcast Généraliste",
        "id": 1521512,
        "author": "kxtc Podcast"
    },
    {
        "title": "Locked On MLB - Daily Podcast On Major League Baseball",
        "url": "https://feeds.simplecast.com/EzlTNH0T",
        "description": "Locked On MLB podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info from all around Major League Baseball. All the hits, runs and strikeouts. Host Paul Francis Sullivan, a comedian, TV producer and creator of the Sully Baseball Podcast, brings his humor and passion to our national pastime, as the Locked On MLB podcast provides your daily baseball fix with a unique spin that you won’t forget. From the jaw-dropping plays to the awe-inspiring performances that make each game a masterpiece, Locked On MLB takes you beyond the scoreboard for the inside scoops on the biggest stories from all over MLB. The Locked On MLB podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 644196,
        "author": "Locked On Podcast Network, Paul Francis Sullivan"
    },
    {
        "title": "Legado del Jab",
        "url": "https://www.spreaker.com/show/5971892/episodes/feed",
        "description": "El legado del jab, es un proyecto de divulgacion historica centrado en conocer la historia y cultura del boxeo en Chile y el Mundo.",
        "id": 6862359,
        "author": "Jorge Drouillas"
    },
    {
        "title": "Cabalá Media | mp4 #kab_spa",
        "url": "http://feeds.feedburner.com/kab-updates-spa-mp4",
        "description": "Kabbalah Media Updates: Video podcast in Spanish.\nBnei Baruch is the largest group of Kabbalists in Israel, sharing the wisdom of Kabbalah with the entire world. Study materials in over 32 languages are based on authentic Kabbalah texts that were passed down from generation to generation.\nBnei Baruch Kabbalah Education and Research Institute is an international movement of many thousands of students dedicated to publicly sharing the authentic wisdom of Kabbalah.\nBnei Baruch was established in 1991 by Rav Michael Laitman, PhD (Professor of Ontology and Theory of Knowledge, PhD in Philosophy and Kabbalah, and MSc in Medical Bio-Cybernetics), following the passing of his teacher, Rav Baruch Shalom HaLevi Ashlag (The Rabash).\nFor further information please visit websites kab.info, kabbalahmedia.info, telegram channels t.me/kab_heb, t.me/kab_rus, t.me/kab_eng.",
        "id": 50925,
        "author": "Bnei Baruch Kabbalah Education and Research Institute, Бней Барух – Ассоциация \"Каббала Ла-Ам\""
    },
    {
        "title": "Kabbalah Media | mp3 #kab_hun",
        "url": "http://feeds.feedburner.com/kab-updates-hun-mp3",
        "description": "Kabbalah Media Updates: Audio podcast in Hungarian.\nBnei Baruch is the largest group of Kabbalists in Israel, sharing the wisdom of Kabbalah with the entire world. Study materials in over 32 languages are based on authentic Kabbalah texts that were passed down from generation to generation.\nBnei Baruch Kabbalah Education and Research Institute is an international movement of many thousands of students dedicated to publicly sharing the authentic wisdom of Kabbalah.\nBnei Baruch was established in 1991 by Rav Michael Laitman, PhD (Professor of Ontology and Theory of Knowledge, PhD in Philosophy and Kabbalah, and MSc in Medical Bio-Cybernetics), following the passing of his teacher, Rav Baruch Shalom HaLevi Ashlag (The Rabash).\nFor further information please visit websites kab.info, kabbalahmedia.info, telegram channels t.me/kab_heb, t.me/kab_rus, t.me/kab_eng.",
        "id": 50929,
        "author": "Bnei Baruch Kabbalah Education and Research Institute, Бней Барух – Ассоциация \"Каббала Ла-Ам\""
    },
    {
        "title": "Kabbalah Media | mp3 #kab_bul",
        "url": "http://feeds.feedburner.com/kab-updates-bul-mp3",
        "description": "Kabbalah Media Updates: Audio podcast in Bulgarian.\nBnei Baruch is the largest group of Kabbalists in Israel, sharing the wisdom of Kabbalah with the entire world. Study materials in over 32 languages are based on authentic Kabbalah texts that were passed down from generation to generation.\nBnei Baruch Kabbalah Education and Research Institute is an international movement of many thousands of students dedicated to publicly sharing the authentic wisdom of Kabbalah.\nBnei Baruch was established in 1991 by Rav Michael Laitman, PhD (Professor of Ontology and Theory of Knowledge, PhD in Philosophy and Kabbalah, and MSc in Medical Bio-Cybernetics), following the passing of his teacher, Rav Baruch Shalom HaLevi Ashlag (The Rabash).\nFor further information please visit websites kab.info, kabbalahmedia.info, telegram channels t.me/kab_heb, t.me/kab_rus, t.me/kab_eng.",
        "id": 323314,
        "author": "Bnei Baruch Kabbalah Education and Research Institute, Бней Барух – Ассоциация \"Каббала Ла-Ам\""
    },
    {
        "title": "Kabbalah Media | mp4 #kab_bul",
        "url": "http://feeds.feedburner.com/kab-updates-bul-mp4",
        "description": "Kabbalah Media Updates: Video podcast in Bulgarian.\nBnei Baruch is the largest group of Kabbalists in Israel, sharing the wisdom of Kabbalah with the entire world. Study materials in over 32 languages are based on authentic Kabbalah texts that were passed down from generation to generation.\nBnei Baruch Kabbalah Education and Research Institute is an international movement of many thousands of students dedicated to publicly sharing the authentic wisdom of Kabbalah.\nBnei Baruch was established in 1991 by Rav Michael Laitman, PhD (Professor of Ontology and Theory of Knowledge, PhD in Philosophy and Kabbalah, and MSc in Medical Bio-Cybernetics), following the passing of his teacher, Rav Baruch Shalom HaLevi Ashlag (The Rabash).\nFor further information please visit websites kab.info, kabbalahmedia.info, telegram channels t.me/kab_heb, t.me/kab_rus, t.me/kab_eng.",
        "id": 551520,
        "author": "Bnei Baruch Kabbalah Education and Research Institute, Бней Барух – Ассоциация \"Каббала Ла-Ам\""
    },
    {
        "title": "Studying Kabbalah #kab_eng",
        "url": "http://feeds.feedburner.com/kab_en",
        "description": "Studying Kabbalah: A podcast in English. See also our telegram channel t.me/kab_eng.\nBnei Baruch is the largest group of Kabbalists in Israel, sharing the wisdom of Kabbalah with the entire world. Study materials in over 32 languages are based on authentic Kabbalah texts that were passed down from generation to generation.\nBnei Baruch Kabbalah Education and Research Institute is an international movement of many thousands of students dedicated to publicly sharing the authentic wisdom of Kabbalah.\nBnei Baruch was established in 1991 by Rav Michael Laitman, PhD (Professor of Ontology and Theory of Knowledge, PhD in Philosophy and Kabbalah, and MSc in Medical Bio-Cybernetics), following the passing of his teacher, Rav Baruch Shalom HaLevi Ashlag (The Rabash).\nFor further information please visit websites kab.info, kabbalahmedia.info, telegram channels t.me/kab_heb, t.me/kab_rus, t.me/kab_eng.",
        "id": 916839,
        "author": "Bnei Baruch Kabbalah Education and Research Institute, Бней Барух – Ассоциация \"Каббала Ла-Ам\""
    },
    {
        "title": "Indagini",
        "url": "https://feeds.megaphone.fm/IPS8860333488",
        "description": "Tutto quello che è successo dopo alcuni dei più noti casi di cronaca nera italiana. Una storia ogni mese, il primo del mese. Un podcast del Post, scritto e raccontato da Stefano Nazzi.",
        "id": 5283553,
        "author": "Il Post"
    },
    {
        "title": "Setting The Pace: A Pacers Podcast",
        "url": "https://feeds.simplecast.com/1zFV2hJ3",
        "description": "Setting The Pace is a Pacers Podcast with Alex Golden and Mike Facci. Brought to you by the Blue Wire Podcast Network.",
        "id": 768329,
        "author": "Blue Wire"
    },
    {
        "title": "2&200 podcast",
        "url": "https://anchor.fm/s/8b95534/podcast/rss",
        "description": "2&200 е български подкаст с водещи Цветомир Цанов и Орлин Милчев",
        "id": 906712,
        "author": "2&200 podcast"
    },
    {
        "title": "Pau Ninja",
        "url": "https://anchor.fm/s/98566448/podcast/rss",
        "description": "La psicología del multipotencial, los hábitos de los multiapasionados, las mentes de los ninjas de la vida que no se pueden casar con una sola pasión y buscan crecer en todas sus caras.",
        "id": 1042596,
        "author": "Pau Ninja"
    },
    {
        "title": "Kabbalah Media | mp4 #kab_ron",
        "url": "http://feeds.feedburner.com/kab-updates-ron-mp4",
        "description": "Kabbalah Media Updates: Video podcast in Romanian.\nBnei Baruch is the largest group of Kabbalists in Israel, sharing the wisdom of Kabbalah with the entire world. Study materials in over 32 languages are based on authentic Kabbalah texts that were passed down from generation to generation.\nBnei Baruch Kabbalah Education and Research Institute is an international movement of many thousands of students dedicated to publicly sharing the authentic wisdom of Kabbalah.\nBnei Baruch was established in 1991 by Rav Michael Laitman, PhD (Professor of Ontology and Theory of Knowledge, PhD in Philosophy and Kabbalah, and MSc in Medical Bio-Cybernetics), following the passing of his teacher, Rav Baruch Shalom HaLevi Ashlag (The Rabash).\nFor further information please visit websites kab.info, kabbalahmedia.info, telegram channels t.me/kab_heb, t.me/kab_rus, t.me/kab_eng.",
        "id": 50927,
        "author": "Bnei Baruch Kabbalah Education and Research Institute, Бней Барух – Ассоциация \"Каббала Ла-Ам\""
    },
    {
        "title": "DrReleford.com Audio Blog",
        "url": "https://www.spreaker.com/show/6309998/episodes/feed",
        "description": "Welcome to the Dr. Bill Releford Podcast Channel, your trusted source for expert advice and inspiring stories from the world of health and wellness. Presented by DrReleford.com, this podcast brings Dr. Releford’s passion for healthcare, community advocacy, and holistic wellness to life.  Each episode explores topics like limb preservation, diabetes prevention, and cutting-edge medical treatments, while highlighting empowering health stories. Whether you’re interested in personal wellness or health equity, our episodes offer valuable insights to enrich your journey.  The Dr. Bill Releford Podcast Channel is dedicated to educating listeners and raising awareness about the critical issues surrounding health, wellness, and the prevention of chronic diseases like diabetes. Whether you’re seeking expert medical advice, exploring holistic wellness strategies, or interested in community health advocacy, our episodes provide valuable knowledge and inspiration.  Join us as we delve into topics like limb preservation, proactive health care, and the latest in medical innovations. Stay connected to DrReleford.com for your ultimate guide to achieving optimal health and wellness.",
        "id": 7024267,
        "author": "Audio Blogs"
    },
    {
        "title": "El orden mundial en Julia en la onda",
        "url": "https://www.ondacero.es/rss/podcast/786474/podcast.xml",
        "description": "<![CDATA[Cada semana en Julia en la onda, los chicos de El Orden Mundial nos hablan sobre política y Relaciones Internacionales con el objetivo de comprender cómo funciona el mundo]]>",
        "id": 1171436,
        "author": "OndaCero"
    }
]