[
    {
        "title": "Your Personal Revolution",
        "url": "https://www.spreaker.com/show/5510562/episodes/feed",
        "description": "<b>🎙️ Your Personal Revolution – A Podcast About Love, Self-Concept, and Living Without</b><br /><br />Compromises\"Personal Revolution\" is a daily podcast for women and men over 40 who crave deep, authentic love—without games, compromises, or pretending. This space invites you to join Bea, a life and mindset coach, and Max, her partner and co-creator of transformational courses, as they guide you on a journey to self-discovery and relationships built on mutual respect, safety, and freedom.📌 <br /><br />Two Core Themes of the Podcast:<br /><ul><li><b>Love</b> – How to attract genuine partnership? How to recognize illusion, break free from toxic patterns, and open up to intimacy?</li><li><b>Self-Concept </b>– Who are you when no one is watching? How to build self-confidence, inner peace, and personal strength that attracts healthy relationships?💬 Each episode is an authentic dialogue between Bea and Max – filled with reflections, open-ended questions, personal stories, and practical insights.No clichés or shallow advice here. This podcast is for those who want to aim higher but from a place of groundedness, not chaos.</li></ul>✨ At the end of every episode, we’ll invite you to take a free quiz that will help you understand your current challenges in love and relationships and show you the first step toward change.<br /><br /><b>🔍 Who Is This Podcast For?</b><br /><br /><ul><li>For those who have stopped settling for superficial love</li><li>For women and men who want to consciously build relationships</li><li>For anyone who feels that \"something more\" is possible – and is ready to reach for it</li></ul><br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/your-personal-revolution--5510562/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/your-personal-revolution--5510562/support</a>.",
        "id": 5891872,
        "author": "Bea Badura & Max Zieliński"
    },
    {
        "title": "Ahi Va",
        "url": "https://www.spreaker.com/show/4858324/episodes/feed",
        "description": "Since 1914, the New Mexico Wildlife Federation has been protecting our state’s wildlife, habitat and public lands for all to enjoy. Now the federation is kicking off a new chapter, launching the Ahi Va Podcast to present information to inform and inspire New Mexicans to conserve our resources for future generations. Stay connected to learn about important issues and ways to take action.",
        "id": 3881054,
        "author": "Driftwood Outdoors"
    },
    {
        "title": "7 Good Minutes",
        "url": "https://www.spreaker.com/show/5701156/episodes/feed",
        "description": "Begin each day with purpose and positivity with the 7 Good Minutes Daily Self-Improvement Podcast, the essential listen for mindful achievers.<br /><br />Tailored for those who strive for personal growth amidst their busy lives, our podcast offers daily guidance in mindfulness, gratitude, and maintaining a positive mindset.<br /><br />Explore a world of transformative ideas and begin your day with the inspiration you need to cultivate a life of awareness, appreciation, and optimism.<br /><br />Subscribe now to ensure you never miss an episode on your journey to a more mindful and positive life.",
        "id": 5802935,
        "author": "Clyde Lee Dennis"
    },
    {
        "title": "G.I.O. Get It On",
        "url": "https://feeds.feedburner.com/GioGetItOn",
        "description": "Adam Carolla Flashback podcast featuring fan sourced clips from 1995-2005 and beyond.",
        "id": 471679,
        "author": "Superfan Giovanni"
    },
    {
        "title": "Géopolitique",
        "url": "https://apis.rfi.fr/products/get_product/rfi_getpodcast_by_nid?token_application=975d23b8-7a07-11e8-9f62-005056a90194&program.entrepriseId=WB1294-RFI-FR-20090930",
        "description": "<p>Géopolitique parcourt les grandes régions du monde auxquelles sont associés des enjeux majeurs. Marie-France Chatin invite au débat chercheurs et experts, afin que soient expliqués et mis en lumière les différents mécanismes qui régissent les rapports entre les sociétés et leur environnement. Les invités de Géopolitique confrontent leurs regards sur un sujet d’actualité internationale. Une émission présentée par Marie-France Chatin. Réalisation et technique : Mathias Golshani. Avec la collaboration de Cécile Lavolot. *** Diffusions le samedi et le dimanche à 17h10 TU vers toutes cibles.</p>",
        "id": 4383543,
        "author": "RFI"
    },
    {
        "title": "Devos",
        "url": "https://equipu.kids4truth.com/feed/podcast/devos/",
        "description": "A daily podcast \"All About God!\"",
        "id": 245229,
        "author": "Kids4Truth Clubs"
    },
    {
        "title": "WDR Hörspiel-Speicher",
        "url": "https://www1.wdr.de/mediathek/audio/hoerspiel-speicher/wdr_hoerspielspeicher150.podcast",
        "description": "Hörspiele ohne Ende: Literatur, aktuelle <span lang=\"en\">Storys</span> und spannende Geschichten - hört doch, was ihr wollt! Serien und Doku-<span lang=\"en\">Fictions</span> mit prominenten Stimmen, bekannten Büchern und besonderen Themen. Lasst das Durchhören beginnen. // Holt euch jede Woche Tipps von unserem Team: www.wdr.de/k/hoerspiel-newsletter // Schickt uns <span lang=\"en\">Feedback</span> an: hoerspiel@wdr.de",
        "id": 42058,
        "author": "Westdeutscher Rundfunk"
    },
    {
        "title": "To The Contrary with Charlie Sykes",
        "url": "https://feeds.acast.com/public/shows/67a407e5340a5590cd2953ad",
        "description": "You are not the crazy ones.<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 7201870,
        "author": "Charlie Sykes"
    },
    {
        "title": "Habits of A Goddess",
        "url": "https://feeds.megaphone.fm/habitsofagoddess",
        "description": "<p>A personal development podcast for women to activate their inner goddess through the power of affirmations. Hosted by : Jasmine Rasco Here's how to support the podcast: <a href=\"https://linktr.ee/habitsofagoddess\">https://linktr.ee/habitsofagoddess</a></p>",
        "id": 858714,
        "author": "CAKE MEDIA"
    },
    {
        "title": "Regard sur la semaine",
        "url": "https://radiofrance-podcast.net/podcast09/rss_17933.xml",
        "description": "Regard sur la semaine Rendez-vous sur l'application Radio France pour découvrir tous les autres épisodes.",
        "id": 1742099,
        "author": "franceinfo"
    },
    {
        "title": "Monday devotion",
        "url": "https://www.spreaker.com/show/5598058/episodes/feed",
        "description": "Dev",
        "id": 6150923,
        "author": "sabelo masuku"
    },
    {
        "title": "The Eden Podcast with Bruce C. E. Fleming",
        "url": "https://feeds.simplecast.com/g6MeO9Bp",
        "description": "The Eden Podcast, where we start with a correct understanding of what happened in the Garden of Eden. Bruce C. E. Fleming is Co-Founder of the Tru316 Foundation (Tru316.com). Based on the research of his wife, Dr. Joy Fleming, he helps us understand the 7 Key Bible Passages on women and men.",
        "id": 3366638,
        "author": "Bruce C. E. Fleming, Dr. Joy Fleming"
    },
    {
        "title": "Cult of Conspiracy",
        "url": "https://www.spreaker.com/show/5700337/episodes/feed",
        "description": "We cover conspiracies of all types. From government coverups and cryptids knocking at your door, to ancient spiritual understandings and  astrology. One thing is always sure to happen, you’ll “open up that 3rd eye” !<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/cult-of-conspiracy--5700337/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/cult-of-conspiracy--5700337/support</a>.",
        "id": 1302684,
        "author": "Jonathon and Jacob"
    },
    {
        "title": "Doc Malik",
        "url": "https://anchor.fm/s/e25d829c/podcast/rss",
        "description": "Become a Paid Subscriber: <a href=\"https://creators.spotify.com/pod/show/docmalik/subscribe\" target=\"_blank\">https://creators.spotify.com/pod/show/docmalik/subscribe</a>\nBecome a Paid Subscriber: <a href=\"https://podcasters.spotify.com/pod/show/docmalik/subscribe\" target=\"_blank\">https://podcasters.spotify.com/pod/show/docmalik/subscribe</a>\nDoc Malik is on a journey of discovery when it comes to health and wellness. Through honest conversations with captivating individuals, Doc explores an array of topics that profoundly impact our well-being and health.",
        "id": 6396939,
        "author": "Ahmad Malik"
    },
    {
        "title": "In Right Relationship",
        "url": "https://anchor.fm/s/feb1d330/podcast/rss",
        "description": "In Right Relationship is a portal into the sacred process of expansion through psychedelics—where awareness, practices, and spiritual opening meet.\nWe bring you stories, wisdom and experiential deep-dives with experts in the field—including healers, coaches, clinicians, spiritual guides, artists, and beyond—rooted in a shift towards greater authenticity, choicefulness, and interconnectedness.\nWhether you’re new to psychedelics or a seasoned psychonaut, you can expect practical insights and tools for getting the most from your psychedelic experiences.",
        "id": 7144080,
        "author": "Liz Chernett, Lily Eggers"
    },
    {
        "title": "Ask Dr. Drew",
        "url": "https://feeds.megaphone.fm/DRPI5481918824",
        "description": "<p>On Ask Dr. Drew, no question is too extreme or embarrassing because the Dr. has heard it all. For over 30 years, Dr. Drew Pinsky has taken calls from all corners of the globe, answering thousands of questions from teens and young adults. To millions, he is a beacon of truth, integrity, fairness, and common sense. Now, after decades of hosting Loveline and multiple hit TV shows – including Celebrity Rehab, Teen Mom OG, Lifechangers, and more – Dr. Drew is opening his phone lines to the world by streaming LIVE from his studio in California. Don’t hold in your deepest, darkest questions any longer. Ask Dr. Drew and get real answers today.</p><p>Produced by <a href=\"https://kalebnation.com/\">Kaleb Nation</a> and <a href=\"https://twitter.com/firstladyoflove\">Susan Pinsky</a>.</p>",
        "id": 259999,
        "author": "Dr. Drew"
    },
    {
        "title": "Kitap Okumaları",
        "url": "https://www.spreaker.com/show/5453350/episodes/feed",
        "description": "Herkese merhabalar. Kitap ruhumuzun inceliklerini hitap eder. Ruhlarımızın manevi gıdaya ihtiyacı vardır. Her gün güncellenen yeni kitaplarla hizmetinizdeyiz.",
        "id": 5831397,
        "author": "Kitap Okumaları"
    },
    {
        "title": "The Dig Bible Podcast",
        "url": "https://media.rss.com/thedig/feed.xml",
        "description": "<p>Welcome to The Dig Bible Podcast, do you have a curious mind? Often thought to yourself there has to be more to these stories in my Bible. Is knowing the “whys” important to you? Then you’ve found the right place! We are looking for those people that know there is more than what we’ve been taught. We are looking for those people that their beliefs that don’t “fit into the box”, and know that “For everyone who asks receives, and the one who seeks finds, and to the one who knocks it will be opened.” We believe that to truly understand the Bible we must put ourselves in the mindset of the writers, and to do that we must restore the “supernatural worldview” of the original audience to which they were writing to! So, with that being said don’t care to roll up your sleeves and get your hands dirty? LET’S DIG! Questions, comments, suggestions on future episode ideas we’d love to hear from you: thedig423@gmail.com. Join in on the conversations and exclusive content with our facebook group: https://www.facebook.com/groups/thedig423/</p>",
        "id": 5454533,
        "author": "Justin Brown"
    },
    {
        "title": "Experiencia Kidzania Monterrey",
        "url": "https://www.spreaker.com/show/5713632/episodes/feed",
        "description": "Aquí encontrarás las grabaciones de la cabina de iHeartRadio en Kidzania Monterrey<br /><br />Conviértete en un seguidor de este podcast: <a href=\"https://www.spreaker.com/podcast/experiencia-kidzania-monterrey--5713632/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/experiencia-kidzania-monterrey--5713632/support</a>.",
        "id": 6194914,
        "author": "ACIR - Kidzania"
    },
    {
        "title": "Aeon Byte Gnostic Radio",
        "url": "https://feeds.simplecast.com/9wi6CXEM",
        "description": "Journey into the mystical world of Gnosticism and Hermeticism with Aeon Byte Gnostic Radio. From the ancient Gnostic Gospels and Nag Hammadi Library to the wisdom of Sophia and the challenge of the Archons, we explore the path to Gnosis – inner knowing and spiritual awakening. But the Gnostic quest doesn't end in antiquity! We connect these timeless ideas to today's mind-bending topics: UFO phenomena, Carl Jung's psychology, the visionary fiction of Philip K. Dick, mind parasites, simulation theory, and conspiracy theories. Seeking alternative spirituality, deeper meaning, and a challenge to conventional reality? Subscribe to Aeon Byte.",
        "id": 311727,
        "author": "Aeon Byte Gnostic Radio, Bleav"
    },
    {
        "title": "North Shore Nine: A Pittsburgh Pirates Podcast",
        "url": "https://feeds.simplecast.com/9n8N04U5",
        "description": "NS9 is a Podcast about the Pittsburgh Pirates! We record multiple times throughout the week and almost daily during the season. #LetsGoBucs #Pirates #MLB",
        "id": 996056,
        "author": "North Shore Nine, Bleav"
    },
    {
        "title": "Aeon Byte Inner Sanctum of Gnosis",
        "url": "https://thegodabovegod.com/feed/subscriber",
        "description": "Bringing ancient Gnostic mysteries to a modern meaning. Podcasts, articles, and occult communities.",
        "id": 2503817,
        "author": "Aeon Byte Inner Sanctum of Gnosis"
    },
    {
        "title": "世界盡頭深夜酒館",
        "url": "https://feed.firstory.me/rss/user/cl73fj8k80b7201z65r8bh7w7",
        "description": "<p>這東西太好了，不能只有我知道。 <br /> <br />我們每個禮拜互相出題，輪流分享生活中觀察到那些太好的事物。 <br /> <br />【其他單元】 <br /> <br />〈五分推〉：推薦那些我們覺得超讚的各種事物。 <br />〈417包廂〉：用一集到兩集探討那些我們愛的作品。 <br />〈借我一下下，時事一 shot 〉：像小 shot 杯一樣的小討論時事！ <br /> <br />【主持人】 <br />｜第二季：克勞高雅&力瑋。 <br />｜第一季：茹茹&力瑋。 <br /> <br/>Powered by <a href=\"https://firstory.me/zh\">Firstory Hosting</a></p>",
        "id": 5768207,
        "author": "克勞高雅&力瑋"
    },
    {
        "title": "Dr. Anne Karl Academy",
        "url": "https://dr-anne-karl-academy.podigee.io/feed/mp3",
        "description": "Herzlich willkommen zum Dr. Anne Karl Academy Podcast – dein Podcast für Inspiration, Wachstum und ein neues Verständnis von Medizin! In jeder Folge nehmen wir dich mit auf eine spannende Reise, die über die klassische Medizin hinausgeht. Hier treffen großartige Persönlichkeiten aus unterschiedlichen Bereichen zusammen, um gemeinsam die Zukunft der funktionellen und ganzheitlichen Medizin zu gestalten.\nErlebe inspirierende Gespräche, innovative Behandlungsansätze und frische Impulse, die dir nicht nur in der Praxis, sondern auch im Leben weiterhelfen. Dieser Podcast steht für mehr als nur Wissensaustausch – hier geht es um echte Verbindungen, gemeinsames Lernen und das Entfalten deines vollen Potenzials. Tauche ein in eine unterstützende Community, die sich für eine gesündere und ganzheitlichere Welt stark macht.\nFreu dich auf Expertinnen und Experten, die mit Herz und Leidenschaft neue Wege gehen, und lass dich inspirieren, um gemeinsam die Zukunft der Medizin neu zu gestalten. Schön, dass du dabei bist – lass uns gemeinsam Grenzen verschieben!",
        "id": 7103373,
        "author": "Dr. Anne Karl"
    },
    {
        "title": "Korean News - NHK WORLD RADIO JAPAN",
        "url": "http://www3.nhk.or.jp/rj/podcast/rss/korean.xml",
        "description": "This is the latest news in Korean from NHK WORLD RADIO JAPAN. This service is daily updated. For more information, please go to https://www3.nhk.or.jp/nhkworld/.",
        "id": 653823,
        "author": "NHK WORLD-JAPAN"
    },
    {
        "title": "Crypto Voices",
        "url": "https://anchor.fm/s/d8decf3c/podcast/rss",
        "description": "Podcast covering diverse trends in Bitcoin and blockchain tech, decentralization, entrepreneurship, cryptoeconomics and liberty.\nAuthor note: All authors, whose content is featured on Crypto Voices, are contacted beforehand for permission, regardless of copyright or license such as Creative Commons. If you are an author whose work is reproduced here and you have not heard from Crypto Voices, it's because we couldn't find a way to contact you. However, in this situation your work was already licensed Creative Commons, and it was so great anyway that we just couldn't wait to turn it into audio and put it up!\nAny questions, please write info@cryptovoices.com, we'd love to hear from you.",
        "id": 325414,
        "author": "Matthew Mezinskis"
    },
    {
        "title": "Locked On LSU - Daily Podcast On LSU Tigers Football & Basketball",
        "url": "https://feeds.simplecast.com/4q9SasrY",
        "description": "Locked On LSU podcast is the daily podcast that keeps you ahead of the games and the first to know the latest news, analysis, and insider info for the LSU Tigers. Hosted by Caroline Fenton, an LSU grad and co-host of Stillman and Company on ESPN 102.5 The Game in Nashville, the Locked On LSU podcast provides your daily LSU Tigers fix with expert opinions, film reviews, interviews, recaps, local analysis, and coverage of all things Tigers. If you’re talking about it, Caroline is going to be talking about it. From the gridiron battles at iconic Tiger Stadium to courtside at the Pete Maravich Assembly Center, and everywhere in between, the Locked On LSU podcast takes you beyond the headlines for the inside scoops from the biggest stories inside the Tigers’ locker room and the SEC. Locked On LSU podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 72564,
        "author": "Locked On Podcast Network, Caroline Fenton"
    },
    {
        "title": "ACE and Co: Full STEAM Ahead",
        "url": "https://anchor.fm/s/f9b800c0/podcast/rss",
        "description": "Welcome to the ACE & Co Spotify podcast, your premier destination for exploring careers in Science, Technology, Engineering, Arts, and Math (STEAM).\nOur podcast is dedicated to providing a comprehensive overview of the diverse and exciting opportunities within the STEAM fields. Whether you're a student contemplating your future career path, a professional looking to transition into a new field, or simply curious about the cutting-edge innovations shaping our world, ACE & Co is here to inform, inspire, and guide you.",
        "id": 7026782,
        "author": "Ace and Co"
    },
    {
        "title": "睡眠音 | ホワイトノイズ (すいみんおと, suimin oto)",
        "url": "https://feeds.acast.com/public/shows/66df3a3a8050843a93451dea",
        "description": "<p><strong>最高の睡眠と集中のためのサウンドコレクション</strong>。</p><p>毎晩、心地よい <strong>睡眠音</strong> と <strong>ホワイトノイズ</strong> で深い眠りへ。私たちは自然の最も純粋な音を厳選し、人工的なループやAI生成された音ではなく、<strong>本物の環境音</strong> をお届けします。<strong>快眠、リラックス、集中、ストレス解消</strong>に最適なサウンドをお楽しみください。</p><br><p>🔹 <strong>全世界で250万回以上のダウンロード</strong></p><p><strong>🔹 100以上の睡眠・集中用サウンドスケープ</strong></p><p><strong>🔹 毎週2回、新しいエピソードを配信</strong></p><p><strong>🔹 8時間の拡張バージョンを提供</strong></p><br><p><strong>夜の静けさの中、雨音や波の音、森林のさざめきがあなたを深いリラックスへ導きます。ホワイトノイズ、環境音、自然音、瞑想用BGM</strong> など、あらゆるシーンに最適な音を見つけてください。</p><p><strong>💤 さらに長時間の音源や広告なしのエピソードを楽しみたい方へ！</strong></p><br><p><strong>👉 8時間のエピソードを今すぐ解放！</strong></p><p><strong>▶ </strong><a href=\"https://podcasts.apple.com/us/podcast/%E7%9D%A1%E7%9C%A0%E9%9F%B3-%7C-%E3%83%9B%E3%83%AF%E3%82%A4%E3%83%88%E3%83%8E%E3%82%A4%E3%82%BA-%E3%81%99%E3%81%84%E3%81%BF%E3%82%93%E3%81%8A%E3%81%A8-suimin-oto/id1702709091\" rel=\"noopener noreferrer\" target=\"_blank\">7日間無料でApple Podcastsで試す</a></p><br><p><strong>🌿 より多くのリラックスサウンドを体験するには？</strong></p><p><strong>▶ </strong><a href=\"http://youtube.com/@liminal_spaced\" rel=\"noopener noreferrer\" target=\"_blank\">YouTubeでより多くの睡眠サウンドをチェック</a></p><br><p><strong>☕ サポートのお願い:</strong></p><p><strong>▶ </strong><a href=\"https://ko-fi.com/peteingo\" rel=\"noopener noreferrer\" target=\"_blank\">Ko‑fiで寄付をする</a></p><br><p><strong>あなたの毎日のリラックスと睡眠のために、最高のサウンドをお届けします</strong>。フォローして新しいエピソードをお楽しみください！</p><hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 6578811,
        "author": "睡眠集中音"
    },
    {
        "title": "RADIO KULTURAEUROPA",
        "url": "https://www.spreaker.com/show/4283974/episodes/feed",
        "description": "<b>Radio Kulturaeuropa nasce come un'altra tappa di un percorso iniziato nel 2020. Lo scopo è quello di dotarsi di un altro strumento di diffusione delle tematiche culturali legate all'Idea di Rinascita della Potenza Europa. Mettiamo in campo quest' ulteriore iniziativa anche per dare spazio e voce a tutte quelle realta' che si muovono su questo crinale e intendono collaborare con spirito comunitario. Podcast, dirette, musica e molto, molto altro.. Ascolta Radio Kulturaeuropa, la radio del risveglio dello Spirito e dell'assalto al Futuro.</b>",
        "id": 2370148,
        "author": "RADIO KULTURAEUROPA"
    },
    {
        "title": "365 con Dios",
        "url": "https://feeds.simplecast.com/YhB6WdXx",
        "description": "Cada día Dios quiere hablarte, te invito a que me acompañes diariamente en este devocional, donde compartiremos una reflexión inspiradora para cada día. Este podcast está inspirado en mi libro #365conDios. No te pierdas la oportunidad de escuchar la voz de Dios y profundizar tu relación con Él. \nwww.wenddyneciosup.com",
        "id": 3472158,
        "author": "Wenddy Neciosup | Genuina Media"
    },
    {
        "title": "Chassé-croisé",
        "url": "https://radiofrance-podcast.net/podcast09/rss_17313.xml",
        "description": "Chassé-croisé Rendez-vous sur l'application Radio France pour découvrir tous les autres épisodes.",
        "id": 1724402,
        "author": "France Inter"
    },
    {
        "title": "गीता का सार (Geeta Ka Saar) #BhagavadGita #SpiritualKnowledge",
        "url": "https://media.rss.com/apkamohitsharma/feed.xml",
        "description": "<p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">\"स्वागत है आपका \"\"गीता का सार (Geeta Ka Saar)\"\" की इस नई कड़ी में! 📖✨</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">Add Podcast to your Youtube Music - </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://media.rss.com/apkamohitsharma/feed.xml\">https://media.rss.com/apkamohitsharma/feed.xml</a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">💬 Join our WhatsApp Channel for more details and update - </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://whatsapp.com/channel/0029Vb4wtr31noz8J0GHfT01\">https://whatsapp.com/channel/0029Vb4wtr31noz8J0GHfT01  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">📺 YouTube Playlist -  </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.youtube.com/playlist?list=PLmqdCCZAKuDiSQUJGe114tsIGg0Z6K658\">https://www.youtube.com/playlist?list=PLmqdCCZAKuDiSQUJGe114tsIGg0Z6K658</a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">🎙️ Kuku FM - </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://kuku.page.link/?apn=com.vlv.aravali&link=http://kukufm.com/show/1a1e6296-7af4-4d21-bf14-c84ce5113ecc/?utm_source=share_ch&lang=english\">https://kuku.page.link/?apn=com.vlv.aravali&link=http://kukufm.com/show/1a1e6296-7af4-4d21-bf14-c84ce5113ecc/?utm_source=share_ch&lang=english</a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">📖 Blogs Link - </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://vickyggp.blogspot.com\">https://vickyggp.blogspot.com</a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">Quora - </a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://qr.ae/pYoAFM\">https://qr.ae/pYoAFM</a><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">  </a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">🚩 हर घर गीता, हर मन गीता! 🚩</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">🙏 धन्यवाद! आपने आज का श्लोक सुना और समझने का प्रयास किया।</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">आपका समय और ध्यान इस दिव्य ज्ञान के प्रति आपकी रुचि को दर्शाता है। श्रीमद्भगवद्गीता सिर्फ एक ग्रंथ नहीं, बल्कि जीवन को सही दिशा देने वाला मार्गदर्शन है। आज हमने जाना कि भगवान हर जगह हैं, लेकिन फिर भी वे इस संसार में रहते हुए इससे अलग हैं। यह हमें यह सिखाता है कि हमें भी अपने कर्मों को सही दिशा में लगाना चाहिए और संसार में रहते हुए भी आत्मिक रूप से जुड़े रहना चाहिए।</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">हमारा उद्देश्य है कि श्रीमद्भगवद्गीता का ज्ञान हर व्यक्ति तक पहुंचे। अगर आपको यह वीडियो उपयोगी लगा, तो आपका एक छोटा-सा योगदान इस गीता यात्रा में बड़ा बदलाव ला सकता है। 🙏</a></p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtu.be/qbwv2t9KnVEक्या\">📌 #BhagavadGita #SpiritualJourney #DivineTeachings #KrishnaWisdom #गीता_ज्ञान #आध्यात्मिकता #Motivation #SelfRealization #InnerPeace #LifeLessons</a></p>",
        "id": 6979995,
        "author": "Mohit Sharma"
    },
    {
        "title": "Cisco Podcast Network",
        "url": "https://feeds.soundcloud.com/users/soundcloud:users:304226927/sounds.rss",
        "description": "The Cisco Podcast Network is a collective of podcasts from across Cisco spanning technology to culture and everything in between. Hear from Cisco customers, partners, and Cisco insiders on the topics that matter most to you. Email us with your feedback and suggestions. Discover your favorite playlists today!",
        "id": 609546,
        "author": "Cisco"
    },
    {
        "title": "Ve stínu",
        "url": "https://feeds.transistor.fm/ve-stinu-celibatu",
        "description": "Případy a příběhy od vás. Z míst, která média často opomíjejí. Rozkrývá je pro vás investigativní a reportážní tým Jiřího Kubíka. Nová epizoda vždy v neděli na Seznam Zprávách, Podcasty.cz a ve všech podcastových aplikacích.",
        "id": 3939302,
        "author": "Seznam Zprávy"
    },
    {
        "title": "İçeriden Bi'olog",
        "url": "https://anchor.fm/s/fba78a90/podcast/rss",
        "description": "Biyolojiye olan tutkumla yola çıkarak hazırladığım \"İçeriden Bi'olog\" podcast'ine hoş geldiniz! \nBilimi herkes için anlaşılır kılmayı hedefleyen bu seride, evrimden genetiğe, ekolojiden biyoteknolojiye kadar geniş bir yelpazede konulara değineceğiz. Hayatın gizemlerini keşfetmek, bedenin nasıl işlediğini anlamak ve bilimle bağınızı güçlendirmek için bizi takip edin. \nHer bölümde, doğanın derinliklerine yolculuk yaparken öğrenmeye ve sorgulamaya hazır olun!\n@iceridenbiolog instagram hesabından bana her zaman ulaşabilirsiniz :)",
        "id": 7033554,
        "author": "Ayça Can"
    },
    {
        "title": "De GeenStijl Podcast",
        "url": "https://anchor.fm/s/fe1f1fb8/podcast/rss",
        "description": "Een podcast over het persoonlijke, het politieke, het professionele, het pietluttige en het potsierlijke",
        "id": 7145067,
        "author": "GeenStijl"
    },
    {
        "title": "Unterwegs",
        "url": "https://www.inforadio.de/podcast/feeds/unterwegs/podcast--unterwegs.xml/feed=podcast.xml",
        "description": "<p>Die Sendung gegen Heimweh und Fernweh: Das Reisemagazin im rbb24 Inforadio erkundet exotische Ziele in weiter Ferne ebenso wie sehenswerte Orte in der unmittelbaren Umgebung.</p>\n",
        "id": 993660,
        "author": "rbb24 Inforadio"
    },
    {
        "title": "Experiencia Kidzania Santa Fe",
        "url": "https://www.spreaker.com/show/4239775/episodes/feed",
        "description": "Aquí encontrarás las grabaciones de la cabina de iHeartRadio en Kidzania Santa Fe (:",
        "id": 2258694,
        "author": "ACIR - Kidzania"
    },
    {
        "title": "Professor P with Dr.Peykar",
        "url": "https://feed.podbean.com/professorppodcast/feed.xml",
        "description": "Dr.Parsa Peykar, a psychologist, university professor and author, shares through the episodes lessons on leadership, influence and service.  Each episode is like a ”mini-research” which answers the ”Research question” related to the topic and will be divided into three parts: 1-A book review/ Art analysis. 2- A podcast with an influential person. 3- University student’s feedback on the topic. One theme is common among all episodes: All the guests suggest at least one act of kindness for listeners to do.  \nThe Professor P Podcast acts as a fun, engaging ”university” which tends to bring both educational and experimental lessons to each listener and help them to be influential figure in their chosen field! Also, it exists to add value to its follower’s lives and encourage them to add value to others.\nPlease reach out to us for comments or by simply saying hi: contact@parsapeykar.com",
        "id": 6735085,
        "author": "Parsa Peykar"
    },
    {
        "title": "シドニーの 中国語 台湾華語ラジオ",
        "url": "https://feeds.soundon.fm/podcasts/24d8a3b8-0905-46bc-a233-2361e5b68462.xml",
        "description": "皆さん、こんにちは！シドニーです！\u2028納豆とふりかけを混ぜて食べるのが大好きな台湾人です～🇹🇼🍚\n2023年に日本に行って、大学院で勉強していました。今年から日本で新しい仕事と生活を始める予定です✨\n留学した時に、日本人の友達が中国語を勉強していることに気づきました。そして、よくこんな質問をされます。\n\u2028\n「台湾人って本当にこうやって話すの？」\u2028\n「どう言えばもっと自然に聞こえる？」\nそんな会話を重ねるうちに、「日本人がもっとリラックスしながら台湾の中国語に慣れる場所があったらいいな」と思うようになりました。\nそこで、このポッドキャストを始めることにしました🎙\n日常会話のような気軽な雰囲気で、私の生活や台湾と日本の違いなどを楽しくシェアしながら、実際に台湾人が話す中国語を聞いていただけます！\n1エピソードは10分以内なので、通勤中、家事、トイレの掃除、眠れない時など、どんな時でも気軽に聞けますよ～🎧\n一緒に頑張りましょう💪\nもし気に入ったら、ぜひフォローしてみてくださいね🌸\nスクリプト　https://www.notion.so/9c9b0431b37145ce847557b126698b08\n私のThread  https://www.threads.net/@talktalksydney\n#中国語 #台湾華語 #台湾 \n--\nHosting provided by <a href=\"https://www.soundon.fm/\" target=\"_blank\">SoundOn</a>",
        "id": 7247905,
        "author": "シドニー"
    },
    {
        "title": "The Parsha Podcast - With Rabbi Yaakov Wolbe",
        "url": "http://rabbiwolbe.com/feed/parsha/",
        "description": "Join Rabbi Yaakov Wolbe for a parsha by parsha journey through the entire Torah. Every week we will outline of the parsha, delve into its major themes and draw valuable and interesting insights from it.",
        "id": 508545,
        "author": "TORCH"
    },
    {
        "title": "Rabbi Yaakov Wolbe Podcast Collection",
        "url": "http://jewishpodcast.org/index.php/feed/podcast/",
        "description": "The Rabbi Yaakov Wolbe Podcasts Collection gives you the opportunity to listen and enjoy to all the Torah & Insights from Rabbi Yaakov Wolbe in one feed. The The Parsha Podcast, Jewish History Podcast, The Mitzvah Podcast, This Jewish Life, TORAH 101 and The Ethics Podcast in one convenient place. Enjoy!",
        "id": 17529,
        "author": "TORCH"
    },
    {
        "title": "EV QUEST",
        "url": "https://feeds.transistor.fm/ev-quest",
        "description": "Welcome to EV Quest — your source for electric vehicle insights, based in New Zealand. Hosted by Adrian Maidment, the podcast features a weekly roundup of the latest EV news from Aotearoa, Australia, and around the world, often joined by Riz Akhtar from Carloop. You'll also hear interviews with key figures from the EV industry and the wider sustainability sector, along with reviews of the latest electric vehicles.",
        "id": 5029186,
        "author": "Adrian Maidment"
    },
    {
        "title": "TrueLife",
        "url": "https://feeds.transistor.fm/truelife",
        "description": "The TrueLife Podcast: Rise Against the Illusion\n\nWelcome to The TrueLife Podcast—a battlefield of ideas where the mind is the ultimate weapon and complacency is the enemy. This is not a place for passive listening. It’s a war cry for those who refuse to bow to the hollow gods of conformity, a call to dismantle the systems that chain our thoughts and numb our souls.\n\nHere, we tear through the lies of modern life with the precision of a scalpel and the force of a sledgehammer. Psychedelics are our compass, suffering is our teacher, and uncertainty is the fuel that drives us forward. Every episode is an incitement to think dangerously—fusing psychology, philosophy, and mysticism with a rage against the machine edge that burns away illusion.\n\nThis isn’t just a podcast; it’s a counterattack against the programmed mediocrity of our times. We explore the hidden architectures of power, the rapid evolution of language, and the forbidden territories of consciousness. We weaponize words, images, and melodies to cut through the fog of deception.\n\nFor the misfits, the rebels, and the seekers who know there’s something rotten at the core—this is your refuge and your rallying point. Tune in if you’re ready to unshackle your mind and fight for the freedom to think, feel, and live without restraint.\n\nAloha, and welcome to the resistance.",
        "id": 753669,
        "author": "George Monty"
    },
    {
        "title": "The Money Mosaic",
        "url": "https://feeds.captivate.fm/the-money-mosaic/",
        "description": "The Money Mosaic is your go-to podcast for a diverse blend of financial insights and artistic exploration brought together for you by AI (artificial intelligence). Join us every Tuesday and Friday as we delve into the dynamic world of forex trading, providing you with the latest trends, strategies, and market analysis to help you navigate the forex landscape with confidence. On Saturdays, we shift our focus to shares and index funds, offering expert advice and in-depth discussions to help you make informed investment decisions. Finally, unwind with us on Sundays as we explore the vibrant world of alternative investment, celebrating creativity and its intersection with finance. Whether you're a seasoned investor or just starting out, The Money Mosaic has something for everyone. Tune in and enrich your financial and artistic journey with us!",
        "id": 7119906,
        "author": "Pastime Agency"
    },
    {
        "title": "Personal Belongings @ Pure Ibiza Radio",
        "url": "https://feeds.soundcloud.com/users/soundcloud:users:806995126/sounds.rss",
        "description": "Beach-friendly Deep House label coming from the need of an artist's self-expression, no signature sounds needed. #DeepHouse #ChillHouse #BeachHouse.\nContact, demos: personalbelongings@kanedomusic.com",
        "id": 3430973,
        "author": "Personal Belongings"
    },
    {
        "title": "BEARcast - Motorrad Reise Podcast",
        "url": "https://14hxtzb.podcaster.de/bearcast.rss",
        "description": "Die Bears sind immer auf der Suche nach neuen Abenteuern, ob in der Ferne oder direkt vor der Haustür. Wer sich für Motorrad-Reisen, Ferntouren, Enduro und das Leben unterwegs interessiert, wird hier regelmäßig Podcasts finden, die Fernweh wecken und vom Spaß auf zwei Rädern erzählen. Let me take you offroad. Werdet unsere Patronen und unterstützt uns unter: https://www.patreon.com/bearsontour",
        "id": 794903,
        "author": "Bears on Tour"
    },
    {
        "title": "The Ethics Podcast - With Rabbi Yaakov Wolbe",
        "url": "http://rabbiwolbe.com/feed/pirkeiavos/",
        "description": "Rabbi Yaakov Wolbe's Pirkei Avos Lectures. Please email questions and comments to rabbiwolbe@gmail.com",
        "id": 881096,
        "author": "TORCH"
    },
    {
        "title": "The Ringer NBA Show",
        "url": "https://feeds.megaphone.fm/the-ringer-nba-show",
        "description": "<p>The Ringer NBA squad provides the insight, reporting, and analysis that you need in your life right here on The Ringer NBA Show. On Mondays and Thursdays, check out 'Group Chat' with Justin Verrier, Wosny Lambre and Rob Mahoney. Tap in on Tuesdays and Fridays for 'Real Ones' with Logan Murdock, Raja Bell and Howard Beck.</p>",
        "id": 488939,
        "author": "The Ringer"
    }
]