[
    {
        "title": "The Augarius Williams Show",
        "url": "https://www.spreaker.com/show/6106372/episodes/feed",
        "description": "On The Augarius Williams Show, Augarius will break down the biggest stories in sports, politics, and pop culture in his own unique and unapologetic way. Each week, he'll peel back the layers of the most riveting stories to keep you engaged and informed about what's truly going on in the world. No topic or story will be off limits and you'll never know what Augarius will be willing to share.",
        "id": 6828671,
        "author": "Augarius Williams",
        "language": "en"
    },
    {
        "title": "Behind the Bower",
        "url": "https://www.spreaker.com/show/6003144/episodes/feed",
        "description": "The official podcast from the Bower Center of the Arts.",
        "id": 6772044,
        "author": "Media Squatch",
        "language": "en"
    },
    {
        "title": "The True Crime Tapes",
        "url": "https://www.spreaker.com/show/5621851/episodes/feed",
        "description": "<br />The True Crime Tapes pulls you into the shadowy depths of the criminal underworld, where the line between justice and chaos is razor-thin. Each episode dissects the minds of history’s most infamous serial killers, unravels the inner workings of organized crime syndicates, and investigates baffling missing person cases that still haunt the public’s imagination. From the bloody reign of ruthless mob bosses to the chilling patterns of elusive predators, True Crime Time delivers gripping, deeply researched storytelling that leaves no stone unturned.<br /><br />With a relentless pursuit of truth, True Crime Time goes beyond the headlines, diving into the psychology, motives, and investigations behind the world’s most shocking crimes. You’ll hear firsthand accounts, expert analysis, and rare archival material that shed new light on cases both well-known and obscure. Whether it’s the brutality of cartel wars, the sinister precision of serial murderers, or the eerie last-known moments of vanished souls, this podcast brings you face-to-face with the darker side of human.<br /><br />Every week, True Crime Time takes you on a journey through the twisted corridors of crime, guided by immersive storytelling and chilling attention to detail. Expect heart-pounding narratives, intricate conspiracy threads, and unsettling truths that will leave you questioning everything you thought you knew. If you crave the rush of uncovering the darkest mysteries, brace yourself—because in this world, the truth is often stranger, and far more terrifying, than fiction.",
        "id": 5596626,
        "author": "Bobby Capucci",
        "language": "en"
    },
    {
        "title": "The Marie Forleo Podcast",
        "url": "https://themarieforleopodcast.libsyn.com/rss",
        "description": "Named by Oprah as a thought leader for the next generation and one of Inc.’s 500 fastest growing companies, Marie Forleo’s goal is to help you become the person you most want to be.  In this show, Marie and her guests share actionable strategies for greater happiness, success, motivation, creativity, productivity, love, health, contribution and fulfillment — often with a lot of laughs. From business, marketing and career advice, to tackling failure, disappointment and fear, to philanthropy and doing our part to make the world a more loving, just and equitable place — we cover it all. Get inspired, grow stronger, more confident and create a business and life you genuinely love. Have a question or topic you’d like to see covered on the show? Go to marieforleo.com/marietv.",
        "id": 743226,
        "author": "Marie Forleo",
        "language": "en"
    },
    {
        "title": "Recent Archives - Discerning Hearts Catholic Podcasts",
        "url": "https://www.discerninghearts.com/catholic-podcasts/category/recent/feed/",
        "description": "Fr. Timothy Gallagher, Dr. Anthony Lilles, Fr. Donald Haggerty, Fr. Mauritius Wilde O.S.B, Fr. Thomas McDermott O.P., Dr. Matthew Bunson, Dr. R. R. Reno, Deacon James Keating, Archbishop George Lucas, Msgr. John Esseeff and so many other Catholic Spiritual leaders and teachers/catechists offer the best teachings in the rich Catholic Spiritual/Discernment tradition.   From lives of the saints to the basics of Catholic Social teaching, from the Sacred Liturgy to prayer in everyday moments of our lives, we walk to together as we fulfill our call to \"be saints in the making\".  By the renewal of our minds, we form ourselves so that we \"may discern what is the will of God, what is good and pleasing and perfect.\" (Rom 12:2)",
        "id": 5721130,
        "author": "Discerning Hearts Catholic Podcasts",
        "language": "en-US"
    },
    {
        "title": "Preaching and Teaching from St. John Ev. Lutheran Church (Sherman Center), Random Lake, Wisconsin",
        "url": "https://anchor.fm/s/25c9700/podcast/rss",
        "description": "St. John Evangelical Lutheran Church & School (Sherman Center) is in Random Lake, Wisconsin, and is served by Rev. Christopher R. Gillespie. St. John Lutheran is God's place for Christians to gather around our Lord's Word and be enlightened by His gifts.\nWe are a congregation of the Lutheran Church—Missouri Synod (LCMS). We unconditionally subscribe to the Unaltered Augsburg Confession. St. John Lutheran School has been approved for accreditation through the accreditation process of the National Lutheran School Accreditation of the Lutheran Church - Missouri Synod.",
        "id": 428832,
        "author": "Rev. Christopher Gillespie",
        "language": "en"
    },
    {
        "title": "The Real News Podcast",
        "url": "https://www.spreaker.com/show/2952221/episodes/feed",
        "description": "Daily Reports, specials, and podcasts by The Real News Network (TRNN). TRNN makes media connecting you to the movements, people, and perspectives that are advancing the cause of a more just, equal, and livable planet. TRNN is a nonprofit media organization. We do not accept advertising revenue or corporate sponsorship.<br /><br /><a href=\"https://therealnews.com/sign-up\" target=\"_blank\" rel=\"noreferrer noopener\">Sign up for our newsletter at therealnews.com</a><br /><br /><a href=\"https://joinsubtext.com/trnn\" target=\"_blank\" rel=\"noreferrer noopener\">Text us at</a> <a href=\"https://tel\" target=\"_blank\" rel=\"noreferrer noopener\">(410) 431-0868</a><br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/the-real-news-podcast--2952221/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/the-real-news-podcast--2952221/support</a>.",
        "id": 1085016,
        "author": "The Real News Network",
        "language": "en"
    },
    {
        "title": "The Clay Travis and Buck Sexton Show",
        "url": "https://www.omnycontent.com/d/playlist/e73c998e-6e60-432f-8610-ae210140c5b1/57c236de-aec0-46c1-b141-ae3c00026d77/1776c4cc-50a1-410f-a2de-ae3c00026dfa/podcast.rss",
        "description": "The Clay Travis and Buck Sexton Show. Clay Travis and Buck Sexton tackle the biggest stories in news, politics and current events with intelligence and humor. From the border crisis, to the madness of cancel culture and far-left missteps, Clay and Buck guide listeners through the latest headlines and hot topics with fun and entertaining conversations and opinions.",
        "id": 465265,
        "author": "iHeartPodcasts",
        "language": "en-US"
    },
    {
        "title": "The C.L.I.M.B. with Johnny Dwinell and Brent Baxter",
        "url": "https://feeds.simplecast.com/GpOFVv_w",
        "description": "<p>Helping Singers, Songwriters, and Indie Artists Create Leverage In the Music Business. </p>",
        "id": 1105243,
        "author": "Johnny Dwinell and Brent Baxter",
        "language": "en-us"
    },
    {
        "title": "Global News Podcast",
        "url": "https://podcasts.files.bbci.co.uk/p02nq0gn.rss",
        "description": "<p>The breaking news you need to hear, as it happens. \n \nHear the most important global stories from the BBC, the most trusted name in international news. \n \nWith reporters on the ground in every country, we’re always where the story is. We bring you unparalleled access and exclusive updates that you won’t get anywhere else. </p><p>Listen for the latest headlines and current affairs from around the world. From Trump’s White House to Putin’s Kremlin, from the Ukraine War to the Israel-Gaza conflict. From Damascus to Delhi, from Silicon Valley to Singapore, from Washington DC to Wuhan. Politics, economics, climate, business, technology, health – we cover it all with expert analysis and insight.</p><p>Get the news that matters, delivered twice a day on weekdays and daily at weekends, plus special bonus episodes reacting to urgent breaking stories. Subscribe now and never miss a moment.</p><p>Also listen to The Happy Pod, every Saturday, for the best global good news.</p><p>Get in touch: globalpodcast@bbc.co.uk</p>",
        "id": 204504,
        "author": "BBC World Service",
        "language": "en"
    },
    {
        "title": "The CanesInSight Podcast",
        "url": "https://feeds.simplecast.com/WUKwAyCW",
        "description": "Podcast by CanesInSight.com",
        "id": 219197,
        "author": "CanesInSight.com",
        "language": "en"
    },
    {
        "title": "Financial Freedom Podcast with Dr. Christopher H. Loo, MD-PhD",
        "url": "https://anchor.fm/s/24b73288/podcast/rss",
        "description": "Bringing you stories of top entrepreneurs, savvy business owners, leading digital marketers, and trendsetters.\nWant to start your own financial literacy journey? \nFollow and leave at 5-star rating on Spotify: https://spoti.fi/2RwYnyG\nFollow and leave a 5-star rating on Apple: https://apple.co/3hOpyj6\nFollow our YouTube Podcast: https://www.youtube.com/@drchrisloomdphd \nSign up for our email list: https://financial-freedom-podcast-with-dr-loo.kit.com/\nTo inquire about applying as a guest, sponsoring, or hiring Dr. Loo to speak, visit our website: https://www.drchrisloomdphd.com",
        "id": 690760,
        "author": "Christopher H. Loo, MD-PhD",
        "language": "en"
    },
    {
        "title": "Dropping the Gloves",
        "url": "https://feeds.acast.com/public/shows/62a74791b944ff00114caf06",
        "description": "I'm John Scott, a retired NHL enforcer. Follow Dropping the Gloves for insights on the latest news around the league, interviews with NHL players, and a few jokes along the way.<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 925765,
        "author": "The Nation Network",
        "language": "en"
    },
    {
        "title": "The Exchange for Entrepreneurs™ Podcast",
        "url": "https://feeds.buzzsprout.com/271887.rss",
        "description": "<p>If you are an avid follower of financial markets, stocks, or anything entrepreneurial, then The Exchange for Entrepreneurs™ podcast is your source for must-listen conversations with business leaders and influencers in capital markets. Stay informed and connected to the brightest minds in finance and public markets and benefit from the professional insights offered by our esteemed guests.</p>",
        "id": 244059,
        "author": "CSE - Canadian Securities Exchange",
        "language": "en-us"
    },
    {
        "title": "Gateway Church's Podcast",
        "url": "https://gatewaypeople.com/rss/video.rss",
        "description": "<p>Welcome to Gateway Church's weekly podcast! We pray you are encouraged, inspired, and challenged to grow. Gateway Church is a Bible-based, evangelistic, Spirit-empowered church founded in 2000. For more information, visit gatewaypeople.com.</p>",
        "id": 313037,
        "author": "Gateway Church",
        "language": "en"
    },
    {
        "title": "Investing in Regenerative Agriculture and Food",
        "url": "https://feeds.buzzsprout.com/1154870.rss",
        "description": "<p>Investing in Regenerative Agriculture and Food podcast features the pioneers in the regenerative food and agriculture space to learn more on how to put our money to work to regenerate soil, people, local communities and ecosystems while making an appropriate and fair return. Hosted by Koen van Seijen.</p>",
        "id": 327782,
        "author": "Koen van Seijen",
        "language": "en"
    },
    {
        "title": "The Daily Signal",
        "url": "https://feeds.megaphone.fm/thedailysignal",
        "description": "<p>Your go-to source for original reporting, engaging interviews, and unique coverage of the day’s top stories.</p>",
        "id": 329416,
        "author": "The Daily Signal",
        "language": "en"
    },
    {
        "title": "The Grave Talks | Haunted, Paranormal & Supernatural",
        "url": "https://audioboom.com/channels/4943119.rss",
        "description": "",
        "id": 490257,
        "author": "Ghost Stores, Haunted, Paranormal & Supernatural Stories",
        "language": "en"
    },
    {
        "title": "True Crime Today | Daily True Crime News & Interviews",
        "url": "https://audioboom.com/channels/5001260.rss",
        "description": "",
        "id": 568948,
        "author": "Real Story Media",
        "language": "en"
    },
    {
        "title": "Learn English with Coffee Break English",
        "url": "https://rss.acast.com/coffeebreakenglish",
        "description": "<p>Coffee Break English is a podcast which will help you learn English in regular 15-minute episodes, perfect for your coffee break! Find out more about Coffee Break English at <a href=\"https://radiolingua.com/coffeebreakenglish/\" rel=\"noopener noreferrer\" target=\"_blank\">https://coffeebreaklanguages.com/coffeebreakenglish/</a> .</p><br><p>Coffee Break English can help you improve your English with short lessons - the perfect time to enjoy a cup of coffee while learning. The course is presented in slow English which is easy to understand. Don’t worry if you don’t understand every word, it’s more important to get the general meaning. Season one is at A2 level. This course is for you if you learnt some English at school or if you want to review the basics. Coffee Break English can help you improve your accuracy and understanding of English, to prepare you for many situations like using English at work, visiting an English-speaking country, taking exams, or talking with English-speaking friends. In each episode of the audio lessons, one of our colleagues from an English-speaking country tells us about an aspect of life or culture in their country. In season one, we hear from our friends in the UK, the USA, Canada, and Australia, helping you understand lots of different accents and varieties of English. </p><br><p>Mark and Josie guide you through the text, explaining the language and helping you understand it better. Each text focuses on a specific language point, including tenses, prepositions, phrasal verbs, and much more. </p><br><p>In addition to the main audio lesson, the course contains lesson notes, which explain the language in the lesson in more detail and provide a transcript of the text; practice exercises; a video version of the lesson; bonus audio episodes; and vocabulary lists in many different languages. Find out more at <a href=\"https://coffeebreakacademy.com\" rel=\"noopener noreferrer\" target=\"_blank\">https://coffeebreakacademy.com</a>.</p><hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 578799,
        "author": "Coffee Break Languages",
        "language": "en"
    },
    {
        "title": "Locked On Dolphins - Daily Podcast On The Miami Dolphins",
        "url": "https://feeds.simplecast.com/f8EFrtWR",
        "description": "Locked On Dolphins podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Miami Dolphins and the National Football League. Hosted by Kyle Crabbs, the Locked On Dolphins podcast provides your daily Dolphins fix with expert, local analysis, and the most in-depth analysis, commentary and coverage of all aspects of the Dolphins franchise. The Locked On Dolphins podcast takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Dolphins locker room and all over the NFL. The Locked On Dolphins podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 761575,
        "author": "Kyle Crabbs, Locked On Podcast Network",
        "language": "en"
    },
    {
        "title": "Real Ghost Stories Online",
        "url": "https://audioboom.com/channels/4567086.rss",
        "description": "",
        "id": 1059526,
        "author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
        "language": "en"
    },
    {
        "title": "Talk of Champions",
        "url": "https://feeds.redcircle.com/a915b990-157d-4d0c-8024-10e60770a4b8",
        "description": "All Ole Miss sports (mostly football, football recruiting, basketball and baseball), all the time. Welcome to the Talk of Champions podcast network.",
        "id": 1115369,
        "author": "OMSpirit",
        "language": "en"
    },
    {
        "title": "Tax Relief with Logan Allec, CPA",
        "url": "https://feeds.buzzsprout.com/775577.rss",
        "description": "<p>Do you owe back taxes to the IRS or your state government or have unfiled tax returns? Then this is the podcast for you! Every Monday, Wednesday, and Friday, Logan Allec, CPA — owner of A+ BBB-accredited tax resolution firm Choice Tax Relief — explains exactly how to get tax relief for your back tax debt. Would you like a FREE tax relief consultation with Logan's company, Choice Tax Relief? Schedule your consultation now by calling 866-8000-TAX!</p>",
        "id": 1201298,
        "author": "Logan Allec",
        "language": "en-us"
    },
    {
        "title": "Confident Sober Women",
        "url": "https://feeds.buzzsprout.com/1416319.rss",
        "description": "<p>Join Shelby John, sober since July 1, 2002, for empowering conversations on the Confident Sober Women podcast with women who've found joy and confidence in their alcohol and drug-free lives. <br><br>This show is a rally cry for empathetic, resilient, and wisdom-seeking women dedicated to building a life you don't want to escape from after that crucial first year of a sober lifestyle.<br><br></p><p>Discover how to:<br><br></p><p>·        Build unshakable confidence in your sober life</p><p>·        Break free from societal drinking norms</p><p>·        Overcome the shame cycle and emotional numbing</p><p>·        Resist the glamorized, over-hyped social influences around alcohol</p><p>·        Create a pure and joyful life beyond recovery<br><br></p><p>Hear inspiring stories and practical advice on:<br><br></p><p>·        Healing trauma</p><p>·        Mindful parenting in recovery</p><p>·        Optimizing physical and mental health</p><p>·        Building a new, empowered identity</p><p>·        Transforming your life beyond substance abuse recovery<br><br></p><p>We dive deep into questions like \"Who am I now?\" and \"How do I pursue my heart's desires?\", taking the intimidation out of sobriety and showcasing how to thrive in long-term recovery. This is truly a space for women supporting women in this modern recovery era.<br><br></p><p>New episodes every Tuesday. Subscribe now for weekly inspiration on your journey to becoming one of the happiest sober women, free from the cool crowd's pressure to drink. <br><br>Please leave a review if you love the show, it helps us on the mission to make the Confident Sober Women community a household name.</p>",
        "id": 3370969,
        "author": "Shelby",
        "language": "en-us"
    },
    {
        "title": "Talk Now Cry Later",
        "url": "https://feeds.buzzsprout.com/1631791.rss",
        "description": "<p>Recovery Podcast</p>",
        "id": 3484463,
        "author": "Andrew H. & Malachy C.",
        "language": "en-us"
    },
    {
        "title": "Sexual Health For Men",
        "url": "https://feeds.captivate.fm/sexual-health-for-men/",
        "description": "Our podcast is dedicated to fostering open, honest, and transformative conversations about sexual health, aiming to bring the topic out of the shadows and into the mainstream. We are on a mission to empower men and women toward sexual independence, breaking down stigmas and taboos that have long held us back as a society.\nParticulary men think that sexual performance issues can be helped by medication or are irreversible. They are often left to find answers on their own, but unfortunately, most of what is out there is inaccurate, misleading, and sometimes harmful. Join the Men's Sexual Health Podcast to hear from a medical doctor with 25 years of experience and a focus on medication-free solutions.",
        "id": 4315451,
        "author": "Dr. Anne Truong",
        "language": "en"
    },
    {
        "title": "The Bridge to China",
        "url": "https://feeds.acast.com/public/shows/61e8f890f7f6ef001303ed77",
        "description": "Our hosts, from the US and China, discuss what unites us. Using enlightening stories and brilliant guests from all walks of life, we join hands in laughter, building bridges across our cultural world. This is The Bridge to China.<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 4605491,
        "author": "Acorn Studio",
        "language": "en"
    },
    {
        "title": "Social Media for B2B Growth: LinkedIn Strategies and Tips",
        "url": "https://feeds.captivate.fm/social-media-for-b2b-growth/",
        "description": "Ready to dominate LinkedIn and lead your industry? The Social Media for B2B Growth Podcast is your go-to resource for B2B marketers and business owners who want to turn LinkedIn into a powerful tool for growth. \nHosted by Michelle J Raymond, a LinkedIn expert and strategist, this podcast explores the strategies that can transform your business from invisible to influential on LinkedIn.\nEach week, Michelle brings actionable insights, real-world examples, and expert guests to help you:\n• Master LinkedIn Social Selling: Drive sales and scale your network with proven techniques tailored for B2B success.\n• Build a Thriving LinkedIn Community: Learn how to create an active, engaged audience around your brand.\n• Boost Your Business & Personal Brand: Get expert advice on positioning yourself as a leader in your industry.\n• Create Content That Converts: Unlock the secrets to producing LinkedIn content that grabs attention and drives results.\n• Activate Employee Advocacy: Empower your team to represent your business and amplify your reach on LinkedIn.\nThis podcast isn’t just talk – it’s packed with actionable tips you can implement immediately to grow your business and get ahead of your competition. \nWhether you're just getting started or looking to fine-tune your LinkedIn strategy, tune in and start leading your industry.",
        "id": 4763684,
        "author": "Michelle J Raymond - LinkedIn Expert",
        "language": "en"
    },
    {
        "title": "NLS Language Learning Podcast",
        "url": "https://feeds.buzzsprout.com/2085024.rss",
        "description": "<p>The <b>Learn Languages Podcast</b> is brought to you by <b>NLS Norwegian Language School in Oslo</b>. We provide engaging and practical lessons in <b>Norwegian, English, French, Chinese, Spanish, German, Italian, Japanese, Korean, Arabic, Russian</b>, and more.<br><br></p><p>Whether you're looking to improve your language skills through <b>everyday language learning, summer courses, intensive programs, or exam preparation</b>, our podcast is here to support you on your journey.</p><p>Tune in anytime, anywhere, and expand your language abilities with us! 🌍🎧</p><p> <br>Visit our website www.nlsnorwegian.no and sign up for Language Classes!</p>",
        "id": 5817805,
        "author": "NLS Norwegian Language School",
        "language": "en-us"
    },
    {
        "title": "Lead with Less",
        "url": "https://app.kajabi.com/podcasts/2147511255/feed",
        "description": "Lead with Less is THE podcast for People Leaders.\n\nHosted by Tash Pieterse, Certified People Leadership Coach, Business Owner, and mother.\n\nLead with Less is a podcast for people leaders who want to learn the skills they need to lead in way that people actually want to follow. \n\nWith over 13+ years experience in Human Resources, leading her own teams, running her own business, and being a mother, Tash brings all of that experience and knowledge to the podcast so you can get everything you need to become a leader focused on adding value, making an impact, and empowering the people around you.\n\nThis is the perfect spot if you're an established professional, new to leadership, business owner, or executive and want to Lead with Less overwhelm, confusion, and struggle so you can become a Leader people actually want to follow.",
        "id": 6286294,
        "author": "Tash Pieterse",
        "language": "en-nz"
    }
]