[
    {
        "title": "Studying Kabbalah #kab_eng",
        "url": "http://feeds.feedburner.com/kab_en",
        "description": "Studying Kabbalah: A podcast in English. See also our telegram channel t.me/kab_eng.\nBnei Baruch is the largest group of Kabbalists in Israel, sharing the wisdom of Kabbalah with the entire world. Study materials in over 32 languages are based on authentic Kabbalah texts that were passed down from generation to generation.\nBnei Baruch Kabbalah Education and Research Institute is an international movement of many thousands of students dedicated to publicly sharing the authentic wisdom of Kabbalah.\nBnei Baruch was established in 1991 by Rav Michael Laitman, PhD (Professor of Ontology and Theory of Knowledge, PhD in Philosophy and Kabbalah, and MSc in Medical Bio-Cybernetics), following the passing of his teacher, Rav Baruch Shalom HaLevi Ashlag (The Rabash).\nFor further information please visit websites kab.info, kabbalahmedia.info, telegram channels t.me/kab_heb, t.me/kab_rus, t.me/kab_eng.",
        "id": 916839,
        "author": "Bnei Baruch Kabbalah Education and Research Institute, Бней Барух – Ассоциация \"Каббала Ла-Ам\""
    },
    {
        "title": "Indagini",
        "url": "https://feeds.megaphone.fm/IPS8860333488",
        "description": "Tutto quello che è successo dopo alcuni dei più noti casi di cronaca nera italiana. Una storia ogni mese, il primo del mese. Un podcast del Post, scritto e raccontato da Stefano Nazzi.",
        "id": 5283553,
        "author": "Il Post"
    },
    {
        "title": "Setting The Pace: A Pacers Podcast",
        "url": "https://feeds.simplecast.com/1zFV2hJ3",
        "description": "Setting The Pace is a Pacers Podcast with Alex Golden and Mike Facci. Brought to you by the Blue Wire Podcast Network.",
        "id": 768329,
        "author": "Blue Wire"
    },
    {
        "title": "2&200 podcast",
        "url": "https://anchor.fm/s/8b95534/podcast/rss",
        "description": "2&200 е български подкаст с водещи Цветомир Цанов и Орлин Милчев",
        "id": 906712,
        "author": "2&200 podcast"
    },
    {
        "title": "Pau Ninja",
        "url": "https://anchor.fm/s/98566448/podcast/rss",
        "description": "La psicología del multipotencial, los hábitos de los multiapasionados, las mentes de los ninjas de la vida que no se pueden casar con una sola pasión y buscan crecer en todas sus caras.",
        "id": 1042596,
        "author": "Pau Ninja"
    },
    {
        "title": "Kabbalah Media | mp4 #kab_ron",
        "url": "http://feeds.feedburner.com/kab-updates-ron-mp4",
        "description": "Kabbalah Media Updates: Video podcast in Romanian.\nBnei Baruch is the largest group of Kabbalists in Israel, sharing the wisdom of Kabbalah with the entire world. Study materials in over 32 languages are based on authentic Kabbalah texts that were passed down from generation to generation.\nBnei Baruch Kabbalah Education and Research Institute is an international movement of many thousands of students dedicated to publicly sharing the authentic wisdom of Kabbalah.\nBnei Baruch was established in 1991 by Rav Michael Laitman, PhD (Professor of Ontology and Theory of Knowledge, PhD in Philosophy and Kabbalah, and MSc in Medical Bio-Cybernetics), following the passing of his teacher, Rav Baruch Shalom HaLevi Ashlag (The Rabash).\nFor further information please visit websites kab.info, kabbalahmedia.info, telegram channels t.me/kab_heb, t.me/kab_rus, t.me/kab_eng.",
        "id": 50927,
        "author": "Bnei Baruch Kabbalah Education and Research Institute, Бней Барух – Ассоциация \"Каббала Ла-Ам\""
    },
    {
        "title": "DrReleford.com Audio Blog",
        "url": "https://www.spreaker.com/show/6309998/episodes/feed",
        "description": "Welcome to the Dr. Bill Releford Podcast Channel, your trusted source for expert advice and inspiring stories from the world of health and wellness. Presented by DrReleford.com, this podcast brings Dr. Releford’s passion for healthcare, community advocacy, and holistic wellness to life.  Each episode explores topics like limb preservation, diabetes prevention, and cutting-edge medical treatments, while highlighting empowering health stories. Whether you’re interested in personal wellness or health equity, our episodes offer valuable insights to enrich your journey.  The Dr. Bill Releford Podcast Channel is dedicated to educating listeners and raising awareness about the critical issues surrounding health, wellness, and the prevention of chronic diseases like diabetes. Whether you’re seeking expert medical advice, exploring holistic wellness strategies, or interested in community health advocacy, our episodes provide valuable knowledge and inspiration.  Join us as we delve into topics like limb preservation, proactive health care, and the latest in medical innovations. Stay connected to DrReleford.com for your ultimate guide to achieving optimal health and wellness.",
        "id": 7024267,
        "author": "Audio Blogs"
    },
    {
        "title": "El orden mundial en Julia en la onda",
        "url": "https://www.ondacero.es/rss/podcast/786474/podcast.xml",
        "description": "<![CDATA[Cada semana en Julia en la onda, los chicos de El Orden Mundial nos hablan sobre política y Relaciones Internacionales con el objetivo de comprender cómo funciona el mundo]]>",
        "id": 1171436,
        "author": "OndaCero"
    },
    {
        "title": "Coach8 教练吧（播客）",
        "url": "https://feeds.simplecast.com/bWsFUvFv",
        "description": "欢迎收听Coach8播客频道。Coach8会在这里将以往的播客内容全部都发布在这个平台，我们相信：人人都可以成为自己生活的大师！所以我们开设了《教练会谈室》《教练的一千零一夜》《鏻品会》《铁林想聊》等。这些栏目有些是月更新，有些是周更新，所以关于更新可以访问：JL8.cn 查询。",
        "id": 6925474,
        "author": "Coach8"
    },
    {
        "title": "Luces en el Horizonte",
        "url": "https://www.ivoox.com/feed_fg_f146734_filtro_1.xml",
        "description": "Luces en el Horizonte. Podcast en el que encontrarás mucho cine, misterio, historia, libros y mucho más. Eso sí, siempre lo vemos todo desde el punto de vista fan con un gran y particular sentido del humor. ¡Enrúchate!",
        "id": 1006056,
        "author": "Luces en el Horizonte"
    },
    {
        "title": "Daily News Brief",
        "url": "https://feeds.soundcloud.com/users/soundcloud:users:299903955/sounds.rss",
        "description": "A summary of today's impactful news stories from around the world hand-picked by our staff at TRT World.",
        "id": 971245,
        "author": "TRT World"
    },
    {
        "title": "icqpodcast's Amateur / Ham Radio Podcast",
        "url": "https://icqpodcast.libsyn.com/rss",
        "description": "The premier podcast for Amateur Radio / Ham Radio users. News, views, features, upcoming events and Amateur / Ham Radio training. ICQ Podcast is a podcast for you and including you",
        "id": 1068584,
        "author": "ICQ Podcast"
    },
    {
        "title": "Between Two Beers Podcast",
        "url": "https://feeds.acast.com/public/shows/6775cb68499663105e17ae63",
        "description": "<p>Good questions. Great guests. Few beers... Steve and Seamus like asking good questions. And they love good answers. After over 20 years of friendship, they bought a microphone and started a podcast, allowing them to sit with, and learn from, the most interesting people they can access.</p><p>From Kiwi legend Marc Ellis, to media personalities Jeremy Wells and Paddy Gower, Rugby coach extraordinaire Wayne Smith, sexologist Morgan Penn, and Olympian Dame Lisa Carrington... Between Two Beers has produced countless hours of incredible stories, career highs, lows and moments of raw vulnerability. And it’s only the beginning.</p><p>Acast</p><hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 792534,
        "author": "Steven Holloway & Seamus Marten"
    },
    {
        "title": "Motorsport Republica",
        "url": "https://media.rss.com/motorsportrepublica/feed.xml",
        "description": "<p>Join Tom & James to discuss F1, MotoGP and all things motorsport every week in the most fun way possible!</p><p>WEBSITE:</p><p><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://www.motorsportrepublica.com\">www.motorsportrepublica.com</a></p><p>SOCIALS:</p><p>Instagram: Motorsportrepublica</p><p>TikTok: Motorsportrepublica</p><p>Facebook: Motorsport Republica</p>",
        "id": 6383398,
        "author": "Motorsport Republica"
    },
    {
        "title": "L'HOROSCOPE DU JOUR",
        "url": "https://feed.ausha.co/BDmK7T8wa1nG",
        "description": "👉 Démarrez la journée avec notre horoscope, toujours bienveillant, et améliorez votre quotidien !\n😃 Une rencontre inattendue dans la journée ? Un coup de pouce du destin ? Un changement amoureux ? Une opportunité professionnelle ? Financière ? Un bon moment en famille en perspective ? \n🔔 Découvrez ce que vous réservent les astres avec l'horoscope de Pascal, médium à Firminy, signe par signe : bélier, taureau, gémeaux, cancer, lion, vierge, balance, scorpion, sagittaire, capricorne, verseau et poissons.\n 🔈 Ecoutez nous en direct sur activradio.com (https://www.activradio.com/)\nHébergé par Ausha. Visitez ausha.co/fr/politique-de-confidentialite pour plus d'informations.",
        "id": 1235911,
        "author": "ACTIV RADIO"
    },
    {
        "title": "My Worst Date",
        "url": "https://feeds.megaphone.fm/RAMMEDIASERVICESLLC4873659524",
        "description": "<p>Ever been on a crazy bad date? You're not alone! Join hosts and best friends Keegan Winfield, Christina Conner, and Cassi Young-Paxton as they dish about pop culture, relationships, true crime and share stories from listeners and their past of the worst dating disasters.</p>",
        "id": 11780,
        "author": "My Worst Date Podcast LLC"
    },
    {
        "title": "And That's Why We Drink",
        "url": "https://feeds.megaphone.fm/QCD7868197207",
        "description": "<p>Murder and the paranormal finally meet! Grab your wine and milkshakes and join us every Sunday for some chilling ghost stories and downright terrifying true crime stories. The world's a scary place. And that's why we drink!</p>",
        "id": 55247,
        "author": "Christine Schiefer, Em Schulz"
    },
    {
        "title": "Greg Laurie Podcast",
        "url": "https://www.omnycontent.com/d/playlist/f55c2a52-ae2b-46a8-a563-ab9600c95ab0/9a2c91ec-eb96-4683-b389-aba401706c30/c8cc661c-0136-4e17-8bd4-aba401706c3e/podcast.rss",
        "description": "Greg Laurie delivers compelling, practical insights on faith, culture, and current events—with an emphasis on the saving power of the gospel message. He is the founding pastor of Harvest Christian Fellowship, main speaker of the Harvest Crusades, and host of the daily program, A New Beginning. For over 40 years, Pastor Greg and Harvest Ministries have been committed to knowing God and making Him known. Learn more at https://harvest.org/.",
        "id": 170451,
        "author": "Greg Laurie"
    },
    {
        "title": "Psychologen beim Frühstück",
        "url": "https://therathiel.podigee.io/feed/mp3",
        "description": "Psychologen beim Frühstück belauschen, wie sie über die Themen reden, die sie gerade beschäftigen: Von der \"Psychologie des Lügens\", über \"Energievampire\" und das Streitthema \"Ordnung\" bis hin zur \"Macht des Vergebens\". Immer persönlich, immer menschlich aber mit psychologischen Erklärungsversuchen, warum wir uns wie verhalten.\nUnsere Zuhörer lieben es, mit uns auf den Ohren zusammen zu frühstücken:\n\"Danke für die Sendung !\n Ich habe ein neues Hobby am Sonntagmorgen: Bügeln und Eure Sendung hören. Beides sehr erbaulich :)\"(Alwin)\n\"Ich muss mal hier was los werden.Euro Radio Sendung ist der voll Hammer.\n Es gibt mir so viel Kraft für die Woche um das Leben zu bestehen\" (Christian)\n\"Hach...Ihr seid immer wieder ein Genuß\" (Jens)\n\"Vielen Dank. Ein sehr schönes und interessantes Thema zum Start und eine tolle Idee. Ihre Formate bringen einen immer weiter und es man lernt eine ganze Menge dazu.\"(Tiger11969)\n...und wer uns nicht nur hören sondern auch sehen will, schaltet jeden Mittwoch ab 19.00 \"TheraThiel\" auf YouTube ein.\nUnd natürlich freue wir uns auf viele Kommentare und Bewertungen. Klickt dazu mal hier: http://getpodcast.reviews/id/1392433517",
        "id": 178811,
        "author": "Annika Lohstroh, Michael Thiel"
    },
    {
        "title": "Escape Your Limits & LIFTS",
        "url": "https://escapefitness.libsyn.com/rss",
        "description": "ESCAPE YOUR LIMITS:\nInside the minds of fitness industry influencers.\nFind out what drives, fuels and motivates the leaders in health and fitness. Each episode of Escape Your Limits reveals the mental, physical and emotional ingredients involved in standing out above everybody else. Discover why successful people keep going when most people stop, and what keeps them going day after day. It’s not about shortcuts for dreamers; these people prove that constant hard work fueled by the right frame of mind is what makes dreams a reality. Join Matthew Januszek, co-founder of Escape Fitness, as he delves into the mindset of leadership and success.\nLIFTS:\nEvery week, our intrepid hosts Matthew Januszek of Escape Fitness and Mo Iqbal of SweatWorks will discuss the breaking fitness industry news, providing their own perspective on the headlines whilst provoking thoughts and conversations. All delivered in a quick-fix, approximately 30-minute podcast.",
        "id": 227437,
        "author": "Matthew Januszek"
    },
    {
        "title": "Wholesale Hotline",
        "url": "https://feeds.podcastics.com/podcastics/podcasts/rss/4135_620d2e142fba5fb6d042cff05104a2f3.rss",
        "description": "<p>Wholesale Hotline is the only real estate podcast where hosts Brent Daniels, Jamil Damji, and Pace Morby talk all things wholesaling, conversions of sellers, creative financing, deposition, and so much more! In each episode, they tackle real-life situations with creative solutions, break everything down into simple steps you can take immediately to boost your business, get more contracts signed, and how to do more deals! Join us, 5PM MST Mondays nights on YouTube, as we open up for calls, GET REAL, solve problems, overcome challenges, and achieve breakthroughs in their business!</p>\n",
        "id": 288132,
        "author": "Wholesale Hotline"
    },
    {
        "title": "Enterprising Investor",
        "url": "https://take15audio.libsyn.com/rss",
        "description": "Formerly Guiding Assets, Enterprising Investor is the flagship podcast of CFA Institute and the definitive program for the investment management industry.  As stewards of the investment industry, Enterprising Investor will feature intimate conversations with some of the most influential people from the world of finance about the topics that matter most to investment professionals.",
        "id": 310351,
        "author": "CFA Institute"
    },
    {
        "title": "ABP - World English Bible - Blended Mix - January Start",
        "url": "https://audiobiblepodcast.com/podcasts/podcast.cgi?name=web&sched=blended&start=1/1/2009",
        "description": "Listen through the World English Bible in a year. Each daily episode contains chapters from the Old Testament, Psalms and Proverbs, and the New Testament. Narration is by David Williams of audiotreasure.com. To create a custom listening schedule please visit audiobiblepodcast.com.",
        "id": 311232,
        "author": "audiobiblepodcast.com"
    },
    {
        "title": "You Are Forgiven Radio",
        "url": "https://youareforgiven.libsyn.com/rss",
        "description": "You Are Forgiven! These words—and the fact they describe—are at the very heart of the Christian faith.",
        "id": 326392,
        "author": "1517 Podcasts"
    },
    {
        "title": "Lebe glücklich mit Linda Giese – Dein Podcast für deine Seele.",
        "url": "https://lebegluecklich.libsyn.com/rss",
        "description": "Dieser Podcast richtet sich an dich, wenn du mehr willst vom Leben.\u2028\nDu bist Schöpfer deiner Realität und du trägst längst, jeglichen Erfolg in dir.\nModerne Spiritualität ermöglicht uns all das zu erreichen, was wir uns vorstellen können.\u2028\nHier bekommst du regelmäßig Inspirationen, Lösungswege, Motivation und Know-how. Gemeinsam, begeben wir uns auf die spannende Entdeckungsreise, wie du es erreichst, ganz nach deinen persönlichen Vorstellungen und Wünschen, erfolgreich zu leben.\nWir interviewen faszinierende Menschen und erfahren, wie sie es geschafft haben, genau dieses zu erreichen.\u2028\n\u2028\nDu erfährst:\n• Wie du Krisen meisterst.\n• Wie du schwierige Lebenssituationen in Kraft und Selbstvertrauen umwandelst.\n• Wie du Erfolg, Freiheit, Gesundheit und Liebe in deinem Leben verwirklichst.\n• Wie du selbstbestimmt und ganzheitlich glücklich lebst.\n• Wie du erfolgreich dein authentisches Business aufbaust. \u2028\nVon und mit Linda Giese, dein spiritueller Coach für ein erfülltes Leben",
        "id": 332626,
        "author": "Linda Giese"
    },
    {
        "title": "YousefShows Podcast",
        "url": "https://feeds.buzzsprout.com/1048852.rss",
        "description": "Let's talk about Sport, Luxury & Classic Cars & Motorbikes in a different way.!دعونا نتحدث عن السيارات الرياضية والفخمة والكلاسيكية والدراجات النارية, بطريقة مختلفة.",
        "id": 414907,
        "author": "Yousef Algahtani"
    },
    {
        "title": "Optimal Work Daily - Career, Productivity and Entrepreneurship",
        "url": "https://anchor.fm/s/393d9c38/podcast/rss",
        "description": "<p>Optimal Work Daily, presented by the experienced narrator Dan, is a podcast that focuses on enhancing productivity, creativity, and work-life balance. Dan provides clear and engaging narration of thought-provoking articles from leading experts in the fields of work, career development, productivity, and entrepreneurship.</p><p>Optimal Work Daily is an ideal resource for professionals, entrepreneurs, and anyone looking to maximize their potential in the workplace. The podcast's diverse range of topics, from time management strategies to fostering creativity, provides valuable insights for enhancing performance and achieving career satisfaction, making it a must-listen as you strive to excel in your professional life.</p><p>Whether you're aiming to advance your career, boost productivity, or delve into entrepreneurship, Optimal Work Daily offers practical advice and inspiration. Each episode focuses on work, career, productivity, and entrepreneurship, providing you with the tools needed to thrive professionally. Dan's engaging narration and the podcast's insightful content make it an essential daily listen for those dedicated to career growth and success.</p><p>This podcast is designed for those passionate about work, career, productivity, and entrepreneurship. It’s your go-to source for practical advice on enhancing your work performance, advancing your career, and exploring entrepreneurship. Each episode offers actionable steps to foster productivity and professional growth, emphasizing the importance of work, career, productivity, and entrepreneurship in achieving your goals.</p><p>Listen now, and become an OLD friend--your optimal life awaits...</p>",
        "id": 433985,
        "author": "Optimal Living Daily | Dan W."
    },
    {
        "title": "The Bible Recap",
        "url": "https://feed.podbean.com/thebiblerecap/feed.xml",
        "description": "The Bible Recap",
        "id": 520167,
        "author": "Tara-Leigh Cobble"
    },
    {
        "title": "De Nieuwe Wereld",
        "url": "https://anchor.fm/s/8746c30/podcast/rss",
        "description": "De Nieuwe Wereld TV is een platform dat mensen uit verschillende disciplines bij elkaar brengt om na te denken over grote veranderingen die op komst zijn door een combinatie van snelle technologische ontwikkelingen en globalisering. Steun ons op https://petjeaf.com/denieuwewereld.\nDNW TV is een initiatief van Ad Verbrugge, in samenwerking met Marlies Dekkers, Jelle van Baardewijk en Willem de Witte.",
        "id": 723065,
        "author": "De Nieuwe Wereld"
    },
    {
        "title": "The Daily Beans",
        "url": "https://feeds.simplecast.com/bOogzwqU",
        "description": "The Daily Beans is a women-owned and operated progressive news podcast for your morning commute brought to you by the Webby award-winning host of Mueller, She Wrote, Allison Gill, and comedian/fund-raiser/activist Dana Goldberg. Get your social justice and political news with just the right amount of snark.",
        "id": 743758,
        "author": "MSW Media"
    },
    {
        "title": "BirdNote Daily",
        "url": "https://feeds.simplecast.com/OB7SrYSf",
        "description": "Escape the daily grind and immerse yourself in the natural world. Rich in imagery, sound, and information, BirdNote inspires you to notice the world around you.",
        "id": 756399,
        "author": "BirdNote"
    },
    {
        "title": "Travis Makes Money",
        "url": "https://rss.pdrl.fm/d318d2/feeds.redcircle.com/f144ccb1-3cc8-4eeb-bc09-0ad7b688b800",
        "description": "<p>You can't save your way to your dream life anymore. The truth is, you’re gonna need to learn to make more money. The Travis Makes Money Podcast is not your typical personal finance show. Rather than shaming you for buying a Starbucks coffee or pressuring you to become a billionaire, we focus on empowering you to make more money so you can enjoy life today while preparing for your future. You don’t have to cut back so much that you miss out on the present, and you don’t need to become the next Jeff Bezos either. Hosted by veteran podcaster Travis Chappell, each daily episode features interviews with regular people just like you – yes, you – who have learned how to make more money in unique and unconventional ways. From turning side hustles into an extra six figures to building massive business empires, these conversations dive into the mindset shifts, hard-earned lessons, and simple strategies that helped these individuals succeed. With over 1,000 podcast episodes under his belt, Travis has developed a unique ability to pull out inspiring stories and practical advice you can apply to your own financial journey that you just won’t hear anywhere else. Whether you’re looking for strategies on side hustles, skill building, investing, building generational wealth, or just motivation to take your next steps, this podcast is your resource. Tune in daily for insights, actionable tips, and inspiration from some of the most successful and interesting money-makers on the planet.</p>",
        "id": 756579,
        "author": "Travis Chappell"
    },
    {
        "title": "We Met At Acme",
        "url": "https://rss.art19.com/wmaa",
        "description": "<p>We Met At Acme is the OG dating podcast and a lifestyle tool for the next generation of adults. In each episode, you'll learn about attachment styles, rules and guidelines to follow when dating, red flags, the importance of therapy, and more. With host Lindsey Metselaar you’ll hear from dating experts, licensed professionals, celebrities, and influencers all sharing their dating experiences or dating insights. Most importantly, you'll improve your confidence, self-worth, and overall outlook towards dating - you'll laugh a little along the way and learn not to take yourself too seriously.</p>",
        "id": 756604,
        "author": "Dear Media, Lindsey Metselaar"
    },
    {
        "title": "Ask Ralph: Financially Confident Christian",
        "url": "https://feeds.captivate.fm/ask-ralph-podcast/",
        "description": "Money isn’t just about numbers — it’s about confidence, stewardship, and faith. If you've ever felt stuck in the cycle of financial shame, you're not alone — and you don't have to stay there.\nWelcome to Financially Confident Christian, where we blend Biblical wisdom, practical financial strategies, and daily encouragement to help you break free, build lasting confidence, and honor God with your resources. Hosted by Ralph Estep Jr., a seasoned financial coach with a heart for ministry, each episode offers real-world steps you can take today — no complicated jargon, no judgment — just real hope and real help.\nWhether you're climbing out of debt, learning to budget with purpose, or dreaming of financial freedom, this is your place to start. One step. One decision. One prayer at a time.\nYour story isn’t defined by your past. It's shaped by your next faithful step. Let’s walk this journey together.",
        "id": 773313,
        "author": "Ralph V. Estep, Jr."
    },
    {
        "title": "The CPG Guys",
        "url": "https://feeds.buzzsprout.com/1146830.rss",
        "description": "<p>CPG & FMCG eCommerce industry icon Sri Rajagopalan & consumer loyalty guru Peter V.S. Bond explore how brands and retailers understand and engage with consumers in-store, online and everywhere in between. http://cpgguys.com </p>",
        "id": 824162,
        "author": "Peter V.S. Bond & Sri Rajagopalan"
    },
    {
        "title": "True Crimecast",
        "url": "https://feeds.simplecast.com/SMmD1_19",
        "description": "True Crimecast is a podcast that adds a unique perspective to the true crime genre. John and Jamie dig into new cases and revisit old ones to try to get to the truth. Each episode takes on a different case and the hosts share both details and theories about what really happened.",
        "id": 835508,
        "author": "Stove Leg Media"
    },
    {
        "title": "What Next: TBD | Tech, power, and the future",
        "url": "https://feeds.megaphone.fm/ifthen",
        "description": "<p>Every Friday and Sunday, Slate’s popular daily news podcast What Next brings you TBD, a clear-eyed look into the future. From fake news to fake meat, algorithms to augmented reality, Lizzie O’Leary is your guide to the tech industry and the world it’s creating for us to live in.</p>",
        "id": 930486,
        "author": "Slate Podcasts"
    },
    {
        "title": "Slate Business",
        "url": "https://feeds.megaphone.fm/SLT6408289565",
        "description": "<p>Get the latest from Slate Money and the entire Slate network's takes on the latest in the world of business and business news.</p>",
        "id": 972753,
        "author": "Slate Podcasts"
    },
    {
        "title": "Brad & Will Made a Tech Pod.",
        "url": "https://feeds.simplecast.com/qKIEAGzn",
        "description": "Each Sunday, Brad Shoemaker and Will Smith discuss a new technology topic. Come for the long-form conversations about virtual reality, space travel, electric cars, refresh rates, and a whole lot more. \nSupport the pod on Patreon: http://patreon.com/techpod",
        "id": 983632,
        "author": "Brad Shoemaker, Will Smith"
    },
    {
        "title": "Small Changes Big Shifts",
        "url": "https://smallchanges.libsyn.com/rss",
        "description": "The Small Changes Big Shifts podcast is your weekly dose of wellness encouragement. It’s the small changes that stick and ultimately compound to create big shifts in our holistic well-being. Dr. Michelle Robin and her renowned guests will share wisdom, knowledge, real life stories and practical tips to inspire and inform you as you move forward on your journey to a life of wellness.",
        "id": 991719,
        "author": "Dr. Michelle Robin"
    },
    {
        "title": "The Caving Podcast",
        "url": "https://cavingpodcast.podomatic.com/rss2.xml",
        "description": "A podcast about caves and cave exploration, hosted by Matt Pelsor of the Central Indiana Grotto of the NSS.",
        "id": 1109345,
        "author": "Matt Pelsor"
    },
    {
        "title": "Panorama",
        "url": "https://100komma7.lu/show/105/rss",
        "description": "National an international Noriichten",
        "id": 1125133,
        "author": "radio 100,7"
    },
    {
        "title": "Perfect Guru",
        "url": "https://feeds.captivate.fm/perfect-guru/",
        "description": "Qi Gong - das ist mehr als nur Blümchenwiese und ewiges Lächeln. Corno teilt mit Dir seinen tiefen Einblick ins Leben und die echte Gedankenwelt eines Meisters für Gesundheit und Spiritualität.\nNimm mit ihm zusammen die rosarote Brille ab.  Genieße den Ritt zu mehr Gesundheit und innerem Gleichgewicht - mit einer gesunden Portion Qi Gong*.\n*Qi Gong: Gesundheits- und Entspannungtechniken aus der Traditionellen Chinesischen Medizin (TCM). Auf gut deutsch: Die Kunst mit dem Leben umzugehen.",
        "id": 1332777,
        "author": "Corno"
    },
    {
        "title": "Create Your Now ~ Your Best Selfie",
        "url": "https://www.spreaker.com/show/1326309/episodes/feed",
        "description": "Create Your Now brings moms, mompreneurs, and entrepreneurs tools and strategies to become their best selfie in areas of lifestyle, business, spirituality, nutrition, fitness, parenting, relationships, motherhood, mindset and balanced daily living. We promise according to our hopes; And perform according to our fears! This 7-day a week podcast will empower and encourage you to rediscover, rejuvenate and renew who you are in mind, body, and spirit. Topics include healthy living, work life balance, weight loss, exercise videos, overcoming adversity, burnout, inspiration, motivation, cooking and recipes, mind mapping, goal setting, marriage difficulties, Christian values and so much more. Let's train for life and love your journey. Be Present. Be Incredible. Be YOU!!!<br /><br />For complete episodes, visit CreateYourNow.com or <a href=\"http://bit.ly/CYNpod\" rel=\"noopener\">http://bit.ly/CYNpod</a>",
        "id": 1569396,
        "author": "Kristianne Wargo"
    },
    {
        "title": "Een Beetje Nederlands",
        "url": "https://anchor.fm/s/48d96938/podcast/rss",
        "description": "Podcast voor iedereen die beter Nederlands wil leren luisteren! Afleveringen over allerlei onderwerpen in helder en duidelijk gesproken Nederlands. Iedere aflevering heeft een transcriptie om mee te lezen. Leer met deze podcast 'Een Beetje Nederlands'.\n[en] Learn Dutch with the 'Een Beetje Nederlands' podcast! Episodes in clear and easy Dutch, about a wide range of subjects. Each episode comes with a free transcript to read along with. Learn a little Dutch with 'Een Beetje Nederlands'!\nhttps://www.eenbeetjenederlands.nl",
        "id": 2240751,
        "author": "Robin van der Markt"
    },
    {
        "title": "Listen To Sleep - Quiet Bedtime Stories & Meditations",
        "url": "https://feeds.acast.com/public/shows/listentosleep",
        "description": "Fall asleep to quiet stories and meditations read from a cozy mountain cabin. For just $4.99/month, supporters get the weekly bedtime stories and meditations ad-free, a day earlier. Access over 400 sleepy episodes, including nature sounds and classic audiobooks like Winnie the Pooh. Join us at <a href=\"https://www.listentosleep.com/support/\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.listentosleep.com/support/</a> for a better night's sleep. 💜<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 3033738,
        "author": "Erik Ireland"
    },
    {
        "title": "Follow Your Dream - Music And Much More!",
        "url": "https://feeds.simplecast.com/u9PHxVpK",
        "description": "Robert's award winning Follow Your Dream Podcast is ranked in the Top 1% of all podcasts with listeners in 200 countries! Each episode is like taking a World Tour!\nRobert is a professional musician who followed his youthful music dream later in life and became a Rock Star after he turned 60! Since then he has released 13 acclaimed albums including a Billboard #1, has millions of video views and streams, and has performed at festivals and concerts around the world. He also started this podcast and wrote an Amazon #1 Best Selling book. All since turning 60! \nRobert is living proof that you’re never too old, and it’s never too late, to follow your dream! \nThis podcast will inspire and motivate you to pursue and succeed at your dream, whatever it is. It features solo shows and engaging, fun interviews with amazing guests - famous musicians, actors, authors, photographers, filmmakers and others. All of whom followed their dream to success!\nSo get entertained, inspired and motivated by the Follow Your Dream Podcast!",
        "id": 3624619,
        "author": "Robert Miller"
    },
    {
        "title": "華視三國演議",
        "url": "https://feeds.soundon.fm/podcasts/5e3912ee-9927-4c38-a363-1cd1686f6bb1.xml",
        "description": "聽見局勢♟掌握時事\n華視隆重推出『三國演議』，由國際政經專家「汪浩」主持、來賓日本產經新聞台北支局長「矢板明夫」共同討論，一起跳脫傳統政論談話節目的框架屬性，深度講評最新國際政經重大事件。\n高品質的對談♟邀您一起入座\n📺CH12 華視主頻//週一二 早上6點\n📺CH52 華視新聞資訊台//週六日 晚上9點 週日一 凌晨2點\n📱Youtube頻道//週六日 下午3點首映\n粉絲專頁： https://www.facebook.com/cts3scompany\nAPPLE Podcast： https://pse.is/3Talks_AP\nGoogle Podcast： https://pse.is/3Talks_GP\n--\nHosting provided by <a href=\"https://www.soundon.fm/\" target=\"_blank\">SoundOn</a>",
        "id": 4200717,
        "author": "華視新聞"
    },
    {
        "title": "Pe José Antonio's Podcast",
        "url": "https://feeds.buzzsprout.com/1862467.rss",
        "description": "<p>Minuto de Reflexão</p>",
        "id": 4363363,
        "author": "Pe José Antonio"
    },
    {
        "title": "Christmas Everyday Club",
        "url": "https://feeds.buzzsprout.com/1867146.rss",
        "description": "<p>Hello and welcome to the Christmas Everyday Club podcast. <br><br>I am Jay, a single, geeky, dad of two amazing boys that loves Christmas and everything about it.<br><br>I created the Christmas Everyday Club brand across all platforms for Christmas lovers like me to enjoy and be part of the community.<br><br>On here, the Podcast, I will be talking and reviewing Christmas movies, I will be telling stories, jokes, riddles, playing games, doing quizzes and more. <br><br>So if you love Christmas, then I hope you will enjoy this podcast too. <br><br>Subscribe and come and say hi. </p>",
        "id": 4370344,
        "author": "Jay Roberts"
    }
]