{
  "podcast": "108.9 The Hawk with Jason Gore and Geoff Garlock",
  "episode_id": 41351005517,
  "episode_title": "How To Own The 90's",
  "audio_url": "https://sphinx.acast.com/p/open/s/683fc7e2f711091cf43b8603/e/68a2ae6226699148a737e466/media.mp3",
  "duration_seconds": 3144.046,
  "text": " It's run down  It's falling to the ground. It's the 108.9 the Hawk Beach House all summer long  Yeah, all the DJs are living there together  But only one of them gets to use the pool  The 108.9 the Hawk Beach House all summer long on 108.9 the Hawk  Well, that's right smooth up in yeah bullet boys and if you're here and that you know  we're going into the eight o'clock hour, 758 on one o' eight point nine. The  hop. Jeff and with show. What do we want to hop? Beep,  Charles. We're hot. I'm not wearing any hard pants. It's just soft. These are my  boxers. I'm walking around in it. I mean, probably my little wisps are dangling.  If you know what I mean, they're Jeff. I think you're talking about your  testicles. Jason, did you catch that? Did you catch it? Yeah, no, I did. I  did. These are producer now. Remember, here's our pretty, of course, I remember.  Remember what's actually got your scottie in the last episode. Scotty, you, you, you blew  it. You, we tried to give you more of a role. Oh, he's not listening, Jeff. Oh, he's not. There's  no way he's listening. This is for all the Scotty's in the world. Oh, if it's for all the  Scotty's in the world, Scotty's, can do blew it. You threw down too many samples.  Wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait, wait  is we don't piss off wisp.  Thank you.  But what I do have to say, too, Jayce.  Wait, wait, wait, no, I gotta say, I gotta say,  Jeff, we do have some sponsors coming in.  That Jeff Rant there is, of course,  brought to you by Risky Jake's asshole.  He's a bitch.  S-O-Risky, Jayce.  Oh, it's party, it's way.  If it's party o'clock somewhere,  you know it's party o'clock down at Risky Jake's asshole.  It's the only bar open all the time in Valverde  Holy shit, does it smell like it head on down there risky jakes asshole sponsors of the Jeff and Wiz show go ahead  Whatever your bullshit. You were gonna say throw the delay Jason now  I'm just thinking about risk is that it's like he can be they can be open 24 hours a day 24 hours  Every day is a week lately. You're not supposed to be able to do that as far but here's the thing about risky jakes asshole Jeff  They are on the border of  of Valverde, of course.  And Nalten, you know that town on the other side.  And Nalten's got no laws.  Not anything goes in Nalten.  No, Nalten.  In Nalten is what they say in God.  And it's not the point of that.  The sign went to come in.  They're accent.  It's just like, where are you from?  And they're Nalten.  Nalten.  They're like one of those towns  where the people brought over the old English accent  and they just kept it.  They didn't like weed itself out through natural selection.  When the movie The Witch came out and we all were like, what the hell are they saying?  I was like, greed.  Was this filmed in Nolten?  Nolten?  Number one hit in Nolten.  Oh, always in Nolten.  They all got it.  They didn't need subtitles.  They were just like, get it.  Love it.  Give me more of it.  And that's Nolten for you.  That's Nolten.  And Nolten is the home of the Ston's Cryum.  And if you like eating Ston's Cryum, you're only going to get it one town in America.  And that's nothin' but they are endangered.  So if you pronounce that in Valverdeum,  is that sponge crab?  Sponge crab?  Oh, I love a good soft-shelled sponge crab.  That's all that's in the old Valverdeum though.  You have to go the crib?  Gotta go the crib?  Crib?  Soft-shelled?  Soft?  No, it's not Irish.  It's not Scottish, whatever you were just trying to do.  Oh no, that was, that was, that was Nalton West.  Oh, okay, Jason, say it in a, uh,  they're there today, please.  Pretty sure it's sponge crab.  Yep, he's right.  He's right. Good to be.  I got sponge crab.  Kids, and,  you know, he does.  Honestly, down truly.  We're on their day underneath the beach house.  We're on the beach house deck that is just slanting so much more every single day,  but there's a big hole in it, and that's where keg stand lives.  24 seven. He's like our own risky Jake's asshole right there.  You know what I mean, you know, I gotta say in the seven o'clock hour when we brought in the 1984 Crystal Light aerobics champions  Oh show off their winning routine. Oh, I did not help the slant  It did. It's house. You know what I mean?  You know what it what he means and I do and I do and I do I do have to say  Yeah, we played that at the beginning of every 8 a.m. hour right here  I'm javin with show  Rem through the jungle. Rem through the jungle to your job. Because your late your job starts at eight  It's hated your already late. Yes  Well, you're late the jungle he means he means the front door. Yeah going right past Alice the reception. Hey Alice good to see you  She looks at her watch she goes. I know what's going on then she picks up her phone  She calls the boss and he's like, oh my goodness here. And then the boss is like,  More dick money office!  And then you go into the big old boss's office and he's like,  Martin is sitting down.  It feels like you don't take advertising seriously, Martin.  And he's like, well, I was, I got here.  Morton sounds exactly like me.  That's, that's, that's, that's, that's,  And he's holding these coosie balls.  I really like taking it seriously.  Why is Morton, it's, it's Martin making fun of this?  This is just rude.  What did it, it did?  And then I call the boss and I'm like hey fire Morton go ahead and cut him loose and it's like I've got bad news  For you Morton  He's like oh who's on the phone that fucker wish Terrelington?  Cozy ball Cozy ball shakes it in the air and then more and it's like wait a second  Are you just is you my boss?  But are you Conan O'Brien doing your old time before?  And it just gets confused everyone then they have a good laugh, but then he's  It's such a confusing thing.  But we're having a good all time, eight o'clock hour here on the Jeff and Wiz Show.  So, ram through your jungle and turn on the radio and make sure you listen to it's right  here on the air.  And we've got a good reminder by the way.  What's that?  One of our other sponsors, Regal King Doh.  Regal King Doh.  Or it was probably late to his job because he was his hand head of Berkeley from  How much his phone got hot playing regal kingdom,  but he was so excited because he saw  the new sponsors of regal kingdom, bullet boys.  Oh, all of CCR.  What?  Conan O'Brien.  Come on.  And his boss.  And they were just like, really,  you're paying my boss to be one of the sponsors  of regal kingdom, one of the greatest iOS games  where dumb little king pushes around jewels.  Yeah. Maybe?  And then he solves a murder, but then you have to hide under a table from him as the king,  as he's looking for you down the hall.  Gonna give that a clown horn.  And you gotta remember that always underneath the commercials now is always the voiceover  of Isabelle Rosalini, who is always telling you, could I, what is that?  Maybe not, it may not match gameplay.  And the images don't look anything like regal, because when you actually play.  We play a clip from the commercial with that Isabella Rosalini on top of it. Go ahead fire  It which is may not match  Gameplay Regal kingdom the only game where you get to be the king right Isabella  You might not get to be king, but what do you get to get Isabella?  It's unknown until you play the game. What about you?  Kiana Reeves. Whoa. I didn't realize this was just gonna be a copy of Angry Birds.  What about you? Jimmy Fallon.  Whoa. Hey, whoa. His fantastic man. Oh, how it hurts. Oh, my other finger.  Regal kingdom. The only game where you get to be king and play any game you want.  Wow, thank you for playing that Jason. I love hearing that, especially I love the part where the phone burns Jimmy  Jim I was a kimble, but that's a whole other spot.  Uh, oh, Kimbles got it.  Kimbles goes on for 40 minutes.  Oh, four years old YouTube video.  It's insane.  It's crazy that they left in Jimmy Fallon almost losing  his other figure, almost losing it.  It's crazy.  It's like about it.  And if you research that, that's an  the craziest thing to research.  Go right ahead and hop down that hole.  It's time for weather.  It's time for weather on what we point nine the hawk.  Well done here at Verde Bay.  We are sweating our nuts off.  Literally, I've got a bag of walnuts over there  that I was carrying on my belt.  And they just went right off.  It's right off in Andrew Zimmern,  who was here in the seven o'clock hour  from bizarre foods.  You should get those away from me  because that's the one food he does not like his walnuts.  I will only eat shit walnuts.  And those aren't real walnuts.  That's that shit.  We're like, oh my God, 70.  70.  Ah, you know what?  We gotta do it.  What do I say football?  You say game football football  Many given sports field should be squares directly to your radio  That's a candle in the wind it's sports time on what a weight point nine the hawk  Ringing a dupe. Let's got the sports  Is this guy Steve Temple pilots with one away point nine the hot sports?  I hope you like rugby  I'm not so sure about it.  Never really watched it.  Seems a bit too dangerous.  You consider all the brain issues that American football players deal with every single  day.  Wearing helmets.  Some of them can't even count to three anymore.  Some of them scream in the night.  Dear, when we'll all of our stone make another movie about us.  Well that wouldn't be as good as JMK.  Well the greatest thumps of all time.  Your natural born killer is more like natural born rugby.  But rugby.  Who felt there they sprouts take on the  Liverpool Mercy Man.  Now there they rugby stadium today.  In baseball,  there are five players.  Toronto Blue Jays.  live from whatever they do they play in is do the Toronto we have all the action  for you right here at one o' we point nine the hawk and of course don't forget  replay of the spring game they'll be able to ask all's play playing with  themselves start a field play with themselves we play it on the air this Saturday  You didn't get to hear it four months ago  Good game  bunch of engines and with themselves  That's it  Steve Temple pilots you want sports you got sports from Steve Temple pilots a one away point nine the hot sports  No, he's  time  Jason  What are we to I support guy? This is the second time he's done sports and he has ended it with a gunshot  He comes in the first time he's live from the studio. He's gone  He was on the beach and now we're in the beach here in rickshays everywhere, too  Yeah, and this time he comes in his left arm  It's just gone at the at the elbow down wait. You saw him. Yes. I  Saw him when I came in this morning. He was hanging out  He was hanging out the beach house and outside of the way we were we were be beep beep  Back up back up back up. He was here  at the beach house and then he drives his ass  Back up spring scene highway  Yeah, to the one-way point nine the hot studio. It's the rockin' real RV  To do the sports that is then pumped down here  What?  It's no sets and I even said to him.  I said, why don't you just hang around?  And he said something about how it was too hot.  And he felt more comfortable being in the studio and they said, with my guns.  And I said, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa,  whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa,  whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa,  I think that's going.  I also know where we should be going and how we should get there.  If you want to know where you should be going on the roads right now, there's one man  that can do it.  Our own art spot!  What a week.9 the Hawk traffic with ArtSpart.  All right.  Now he's in my car.  He's got a Mohawk.  I'm going to drive down here.  I've got 26 seconds to get this guy down to the camp.  See?  Crazy taxi.  joining us on my Twitch. Thank you for joining me. Thank you. Oh, hey, uh, modern lover  323. Thank you for the subscription. Okay, I got a stop. Okay, pick someone up here at the  tower records. Art. Um, wow. What was that? What was that? What was that? Art, it's  with this and just a good and go  did you subscribe?  Well, thank you to the West Tarleton and to  Jeff the Angry Man.  I'm very lucky we're subscribing to our Twitch points channel.  We did not subscribe art.  Could you please subscribe  to see the next day.  Wait a second.  Your screen name is 6969 at Horndog.  It's 6969 at Horndog.  I got a focus here.  I got it if I'm gonna get through into acts  Kakes did I'm gonna get these person I got 39 seconds  It's like driving down mother lub on land on the way over to  Googammit drive you're heading up to  Mount Hatfield tonight for the firework show  To the music of  Ants Mageter I was hoping I would I was looking at the  Scrip here and I was hoping that it was  Bad religion, but it's not.  It's not.  You know, Jeff, I'm becoming very big, bad religion fan.  Emerson's brilliant.  That's, you know, maybe I'm becoming a punk.  Maybe you might be a big fan.  You know, you do have a favorite bad religion song  or is it just crazy tacky, tacky, sour cream?  It's been from crazy, taxing.  Oh, it's my favorite bad religion song.  Of course.  Do they do other songs, Jeff?  Oh, they have many, many, many records.  I couldn't name a single one.  Can you name one, Jeff?  Can you name another bad religion song that isn't  the only one I can think of as the one that I just call  Song and Tony Hawk.  Oh, no, I can tell you one.  Hey, are we good?  Are we okay?  I can tell you every single bad religion song.  And I believe you're referring to do what you want  from the album, No Control by Bad Religion,  one of the seminal albums by this band,  a pop punk luminary that bridge the gap between LA punk  and OC pop punk, the Epitaph world, the Fat Records world.  This is Greg Lemon's sour.  I heard the call of a deep musical knowledge  and I needed to bring out.  And now I have to go back into my hole.  Oh, geez.  Well, that was a crazy thrill.  I got a combo of lemon on that.  I got to stop at the mark.  518 game time.  But also, 518 is the official speed over by La Zanya Junction  right now, 518 miles per hour.  I got them. I didn't stand up to that. I don't know what's happening with the Valverde roads department  but they're trying something over there and you should stay away. Hog Street pretty clear and  That's a crazy through. I'm our spark on what a way point nine the  With birds funeral flowers with birds funeral flowers  Well, I mean, I guess we actually got some traffic that time even though that's the most that we've gotten  I'm thinking about making a change. I'm thinking about making a change. You know, I  Will say I'm a little I'm a little worried about our various speeds though now that we have Joe Walsh  Sammy Hagar running the Department of  Department of streets and motors just making them up as they go  It's like I can't drive 55. I got to drive five 18. What the hell are we doing?  I don't know you're not on the TikTok much, but you are on the Instagram reels every now and then check  You can watch those reels where it's like  You know they've got a bump in the middle of the road and it's a computer-generated bus heading for the bump and they're like  20 miles per hour and it goes it shows the shows the bus going over the bump  And it's like it makes it hooray 40 miles per hour  Little little harder 100 miles per hour. Oh my god  It's flying in the air. They take it up to like 500 miles per hour. This thing is shredding itself through the street signs  You know people try to tell us that social media is stupid and that's destroying our brains  But how do we be saying that with that we're just wrong?  That's just that we're learning things there. I mean before that did you know what it would happen to a bus  If it went 500 miles per hour. I had no idea, but now I do  You know you can do with that knowledge  There's nothing literally I can do with that knowledge.  That's why I was asking because I'm realizing as I'm speaking.  I don't know what I would do with this knowledge.  Knowledge is such a tough, tough, tough thing, Jeff.  Because sometimes you feel smart.  Sometimes you feel like a goddamn fool in the rain.  If you know what I mean, oh baby.  Whoa, I'm former damn.  Shetlin creamies, meaning effort to completely undermine my cattle.  I'm announcing here, I'm the number 10 radio station in all of Valverde.  People don't even listen to it anymore.  And I am selling Shetlin creamies.  You get it?  I'm immortal now.  So I want to spend more time on things that Barbara Dan wants to do.  my podcast, Skin of Max and Jeez, where I just talk about soft core pornography.  You want saw on the channel, Cinemax in the 90s, and the best flavors of Jeez around.  Players you can get right here at Shandlin Creamery's.  Colby, Vardee, Monterey Jack.  I want to focus on those things.  And I don't want my cattle to end up owning the Creamery.  It's a real f***ing dude to the cattle.  So we're taking real offers at Shuttling Creamery's.  Oh man, I know this station is fast.  The hog.  Ahhh, they've been salute to the big ass women in our lives.  We salute you, my queens.  It is queen from the Jazz Out 1978, and fat bottom girls.  You know I was in the studio, they're making mad  My true Switzerland and then down there  And Brian May looks at me. He's like I think I'm gonna make a he's not Liverpool  Lee and Jason I fuck that one up. I  Good middle spin, uh, he's more Brian May's more in here. That's right. And he says to me  You know, wisp  I'm thinking about making  And anthem.  I mean, you guys, you fuckers are, did he?  You got, we will rock you.  Right, God.  You got, we are the big ass champions.  And then he told me that that was a rewrite.  And they stuck it to, we are the champions.  And then he said, you're right on the right path about big asses.  Interesting.  He's like, I'm gonna write a song called Big John Korman.  Like, Big John Korman.  I don't know where which which is the what how it doesn't flow. I'm like have you thought about  hmm  fat  To look a lock in  Bottomed so we know where you're talking about  And then I said  asses oh  Fatter masses. It's me rockin world go  Oh, ref get on your ass and ride  They took that they ran with it. It was a hit from the Jazz album Jeff and wits a surprising big hit  I gotta say surprisingly huge hit a beauty of queen  They they keep you on your toes when they were a band. Yeah, they were just like here's an epic song  Here's a song about orcs  Here's a song about just being champions  Here's a song about Flash Gordon and then they're also like here's a song about cars and how I want to fuck them  And then here's a song about just big asses and then 1989 rolls around and they're like  Well, and you says if fuck enscares you I was at the studio when they were recording that and they basically took mics around  Well, I was trying to take a shit my god my short studios  They had it had so many bathrooms in that place. I had to go to each one. There were 42 bathrooms and I get to like the 36 bathroom  And I'm like there's no fucking way  Freddie or Roger's gonna find me in this toilet. No God, no. And I sit down and I'm like finally  All I've been eating sauce is sausage and I'm ready to let it go  I start to grunt and I start to release and I hear  And then I clench.  Oh, I clench and I'm not able to do it three more days.  They're in the studio.  I'm so sorry.  I'm so sorry.  And I'm like, thank God they're doing the miracle.  I can go over to bathroom number 42.  As soon as I open the door,  I'm the invisible.  Jesus Christ.  Oh, that was a real.  That was a real deacon.  Preecable.  That was a new version of his.  Oh my god, you know, I wish they had done more of the universal monsters.  Queen Queen.  What? Oh, I didn't even have them.  All of them.  I'm the wolf man.  Me?  I am the creature from the black dog.  Go.  Fantastic.  I mean, the steel monster.  Make them.  And then when they started doing that, that dark universe, one of the greatest cinematic universes  that totally fell apart. No, no, no, no, no, no, no, no, you back up. Back up. You're correct.  The best cinematic universe was the, that mummy. Oh, my God. Mummy was something like,  look, I love me some Brendan Frigie. Oh, they love me. Good, oh, Frigie. You get to  Scorpio and King in there and he's got that weird computer generated eye. Oh, yeah. You know,  and I'm just gonna-  Special effects that definitely hold up.  I am on board.  It's like, am I watching Miss the movie?  There you go.  There you go.  TikTok.  Hey, Joe, for you.  We're bringing in all the people to the 108.9  the Hock podcast with references.  Come on in for Miss.  Come on in for jokes about  being visible man from the Queen album, the Miracle.  Hey, man, I held off on talking about the invisible  bear being on the soundtrack to Hollow Man's.  I can't think it.  What a different creepier version that movie would have been.  Well, it is the time of the show for me to talk about my favorite movie of all time.  Ladies and gentlemen, it's time to talk about  Hollow Man.  Hollow Man.  He's Hollow.  He's Hollow.  Now first up, Jason and Jeff are my, is this the one where they have to like put like tape  around him so they don't lose Hollow Man.  I don't remember because I've always...  I've never actually watched this Paul Verhoeven version from 2000.  Are you okay?  So Kevin Bacon's in it.  He's the Hollow Man.  He's the Hollow Man and he's like, oop, I'm invisible.  You know what I should do?  That's what you're saying.  I should touch Elizabeth Shoe's bullet.  There were...  And he's like, I got ya.  Hollow Man was just a pervert.  We're just getting that on Tony's side.  They're homeless version was just like, you know what I think would happen?  It gets a little perverted.  Oh, and Paul Verhoeven is suddenly like,  when my vision for Hollow Man is that he's a full-on pivot?  And Elizabeth, she was like, I don't think I want to do it, Paul.  I don't think I want to do it.  Well, there you go. That's the same.  Favorite movie. Hollow Man.  Fantastic director that sometimes makes missteps.  We all make missteps like sometimes we find ourselves with an empty chalice of wine  Oh, that's the first time I've asked you Jason so fill that shit up if you don't mind I could use a little  What am I gonna get this morning? Is it a merlot?  It's gonna be a cab town  Nope more penal greasio, please stinky penis wine. I alone will drink that chalice  I let my Pinot greasie o' falls to the floor  My feeling Pinot greasie o' curr-mer-kin  Like oh my rat tails in my mouth. I can't think that's the thing every ten spot  We haven't said that every ten spotter. We can't bottle comes with the little rat tail on it  It's like it's like the little worm in the tequila bottle and every time we mention the rat tail in the bottle  We got to play the laughter  Live wine. When you're talking it, co-opchips wine, live wine. Live wine. Live wine.  That's probably what happened on the set of Hollow Man.  Verhoeve got a little too hooked on the live wine. Live wine. Live wine.  And every idea, I got a little little crazier.  And Kevin Bacon's like, gunna get a boobie.  That was the original tagline for Hollow Man.  Hey, big truck is on location.  Let's go ahead and send the signal down to him.  All right, in my eye.  Chuck, you are on the air.  When we go down in the hawk, the Jeff and Jason show buddy in a long time.  What?  I don't got nothing in this goddamn meteorite here.  Jason, I got plenty.  I got nothing but they're talking hollow man. Am I not delay? How delay am I?  Well, too too to them man, they're gonna use that kind of language this morning down here  God Jason big trucks choking and he thinks we're out of 25 years delay come on. Can we get him back?  Okay, all right. There you are. Oh, hey  Hey Jeff, the angry man, Garlock.  How, what do you angry about today, boy?  I gotta say I'm not angry cause I'm talking to you,  big truck, I'm happy to hear your voice.  Now where are you at?  Your remote location right now.  Where are you?  I'm driving around.  I'm over here at John Cougar summer camp.  It's open, it's open house at John Cougar summer camp.  Now you, Jeff, you wanna camp?  That is all wages.  Oh, milling camp.  all the time. Where you stay in a goddamn  pink house, not air-conditioned by the way, that is something I mentioned to Mr.  Melon over there. Mr. Coogie, Coogie Melon's over there a little while ago and  he just laughed man, he's like I ain't paying for that man. I pay for the  the chili dogs you get to suck down for over there at the at the  I can't team.  He's like, I ain't gonna pay for it to be cold out here.  But have you ever thought like, man,  I'm a grown ass adult who really loves the scarecrow album  from John Cougar, Melon Camp.  I wish there was a camp for me  and you live in the Valverde vicinity  or you're traveling to it.  Maybe you're living in Northern.  I'll come on out here, man.  And you get in and you sign up  And then you live here basically for a while and uh,  Wait, so big truck. So this open house just means you can just start.  It's just the anger man, garlic cheese.  Hi, Jim. You getting angry about anything today?  I'm so Jason. Are we on a delay?  Did you get kicked in the head by a mule big truck?  We just had this discussion.  I can't really say much because I got kicked in the head by a mule man.  John Cougar summer camp.  I got that'll uh Johnny Cougs over here  Brod out his meal. He's like, you know  It's a summer is a summer camera and bring that out the meal  That's my impression. You motherfucker. You know I'm on you know I'm right on the money  He brings out this damn meal. It kicks me first thing it does and I I am just in a loop  Luke I  Can't get out, but hey if you find yourself as an adult  that really loves the John Cougar mill and camp album.  Okay, no, Jason, you're thinking that we gotta cut the favor.  Let's go try and cut that.  My God, and you know what, maybe send the one away point nine,  the Hawk medical team over it.  No, no, no, no.  We need them for here,  cause anything could happen.  Oh my God, actually, I said that and I can see 40 people  have heat stroke right outside.  And then 40 more people are getting hit in the head with beams.  So the house that keep falling, they're falling,  they're falling, they are falling.  Hey Jeff, do you like the group right said Fred?  I just got into them recently.  Oh my God, what are the best?  One of the best bands, well guess what?  We got them coming up next on one away point nine,  the Hock, we gotta take a break,  pay some bills and here's a song about Jagan.  It's 38 special on 108.9.  The Hawk.  Seriously, what do you think they were talking about holding?  Fabulous.  Heroes, grinders, subs, hogies, whatever you call a sandwich, if you're eating it's  little sandwiches, say, I'll take a little.  Hi, I'm Hank Slittle, owner of Slittle sandwiches, Valverde's newest sandwich shop.  You know when I wanted to start selling sandwiches in Valverde, I realized that we didn't  have a regional name for them.  Everyone just called them sandwiches.  So I decided and honor of my father who passed away two years ago.  To call it the Sliddle.  And I'm not gonna lie, until I was selling it in Sandwich form I never realized how gross  my last name was.  Even though it's spelled with an SCH, people think my sandwiches sound like human excrement.  I was just trying to help myself, Valverde.  Yes, I probably should have remembered how much school yard bullies would give me grief for  my last name.  But honestly, I was in grief for the loss of my father, and I put all my energy and money  into this shop, in between signage, starting the LLC, not to mention all that guerrilla  marketing to get recognition for the name Sliddle, and then as soon as it was done, I was  like, oh, oh, and now I sell a regional sandwich name.  Quite frankly sounds like poop. And I can't turn back now!  But they don't taste like poop, I can guarantee you that. So come on in! We have the freshest meats,  the freshest bread, the tastiest vegetables. Not to mention or secret sauce if you want to make your  slittle wet. Nuh-nuh! Just saying that out loud. Now I hear it and... no, I'm sorry dad. So just come on  I'll make your great sandwich. Trust me, it'll taste great and it won't taste like a  s***. I got it man. SLEETLE. No, no, I'm doing it.  This is Ricochet on Daddy from the band Huge Lori. You're listening to 108.9 The Hot.  Oh and I attribute to one of my best friends in the entire world, Mick Ralph's.  guitar, songwriter of that.  passed away recently, very, very sad.  No jokes about it.  No jokes, any of you.  I see it on your fucking faces.  Where you're like, I'm about to make a joke.  All these, all these, all these,  all these, all these, all these,  all these, all these, all these,  all these, all these, all these, all these,  all these, all these, all these, all these,  all these, all these, all these, all these, all these,  all these, all these, all these, all these, all these,  all these, all these, all these, all these, all these,  all these, all these, all these, all these, all these,  all these, all these, all these, all these, all these, all these,  all these, all these, all these, all these, all these, all these,  you. Oh, they want to do. Hey, I teased it before the, uh, the, uh, the break there when  we had to pay some bills and pay some commercials. We didn't, they, they didn't pay  them. They paid us. I can't. I hope we're not paid. I get kicked in the mule. Did you, did  you get kicked in the mule? Oh, my goodness. I have no idea. Sometimes I got kicked in the  I'm you okay?  Okay.  Well, what was it?  6969 at hog wispy.  6969 at horn dog at the back house.  Well, here they.  My God.  What's this?  That's farmer Dan.  That is not.  Right said Fred.  Jason Jason, we got it on our schedule here that right said Fred is coming in.  People are chamfer.  Oh, God.  Farmer Dan.  I'm former Dan Jesus Christ former owner of  Shetland creameries  I sold it  Got all the money and  But a lot of rights to a lot of 90s bands  I get to perform now  Wait wait wait hold on forward  We need to look at this.  Give me me magnet.  be the bank of these means they can powder.  I bought them.  So you're telling it so you don't  know longer.  You no longer own Chetling creamies.  No.  How much money did you get for it?  Monsanto gave me $43 billion.  Oh my god, Monsanto makes it a good, good, better.  Great, Jenner.  If you try their best.  It's just a twitch Colby.  Not your twitch art.  That's not what it does.  I got hold on now. I'm now realize it's this affects your podcast  What are my dad no, I'm still you can still do copies get a max even with  All of the rights to shutland creamers going to Monsanto what just because I don't  Don't own cheese place. I can't talk about how much I love eating cheese  while watching  Relatively horny movies on  I mean Monsanto does have that on a test network.  They don't own my brains and they own skin a max.  They don't own my feelings, but they do own most of the Shannon tweed catalog.  They don't own my ability to fucking lay it down like this.  2 sexy for my farm 2 sexy for my farm my farm it hurts  I'm 2 sexy for a party 2 sexy for a party New York in Japan  Okay, I am not really anything like the original  That doesn't matter to sexy for your keys to sexy for your keys the way of disco dancing  A model you know what I mean  Do a little turn on the kiddo  I don't look over them there  Kill up  Turn  Kill up  Okay, go ahead. I'm listening to this song all weekend long  I'm like, I think this is my anthem. I think it's the greatest song ever heard.  And I can't see that.  The roster coming up couldn't believe we were getting right said for him.  This is right.  I can't wait to see those potentially two skinheads come up here on our slanted.  Definitely in their later days getting politics matching with skinheads.  I'm not done. I'm not done.  Put up.  Put up.  I'm a farmer.  You know what I mean?  And I used to make cheese for you.  in my farm  in my farm  yeah  I  made  cheeses for you  but then i will push  out of my  business by the cattle that wanted me  done  then the made to deal with my son  tell and got me out of the place and i'm  two six e four  month  two six e four  month  two six e four  month  oh okay  he's  oh my god  so now you're just  don't ring them  that you're lying  over here  through the 90s  This is bands that you own.  I don't need, I want to know what other bands he purchased.  This is exactly what I want to hold.  He is out cold.  He didn't even get to the poor pussycat part.  He did it.  He did it.  Can you bring it up for me at least?  Poor pussy.  Poor pussycat.  See, thank you.  Thank you.  Thank you very much.  Thank you for having that.  So far my dad.  So, okay, so just sit just to recap.  He can't beat me back up.  Monsanto now owns your farm.  The Creamery is owned by them.  You sound possibly like you're not psyched about this deal that you made, but you then used all the money to buy various 90s bands.  It's still unclear if also Monsanto owns Cinemax and even the concept of podcasting they have a podcast deal with the seamless network.  It's a real gra...  Yeah, when I say seamless I mean smartless of course and seamless because I live together  See bliss and smartless you would eat with Jason Bates even tonight  What's not something that makes you bad because he's bad for but  What a bird and seen in the documentary?  It's like sounds like this is gonna be a million eighty million listens, but so you own right-side Fred  What other bands did you buy in this?  This unclear idea of why you decide, and maybe you'll explain to us why you decide to go  for obscure knowledge.  I know that maybe since everyone knew me for what I did before, then maybe you could  know me for something now that's hip.  as hippies of artie cheeses.  And I thought, what's more hip than bands from 30 years ago?  I'm culture is cyclical and I think they're probably his sum.  I'm not sure what the rice said Fred was the way to go first off, but...  But the rice still were 500 groups.  500.  They're all me now. I'm their lawn mower man.  They're all contained in me.  Hit it!  me I'm born and give me a sound show me where to look and tell me is that Jesus  is that Jesus there give me some nug and give me a plate maybe don't throw me out of  my fellow oh god his car my god see I died knew this to you but also remind me  Is this collective soul that you bought?  The black flag is soul and ball is all.  You did a black flag.  It's all okay.  Yeah.  I bought them all.  So I'm just going to say, and maybe through the tears  you can answer.  Do you own Days of the New?  Own them.  Do you own?  President of the United States of America.  What's fucking beaches with that question?  Because I got them.  Because I paid $43 billion for them.  Oh, my God.  Those were them alone.  No, it was a package deal.  Oh, who came in that package, deal?  Tramp lies.  Oh, the eels.  Eels.  New radical.  No.  Filter.  The supposeball heroes of hypocrisy.  Five punch, fart, bag, or whatever they're called.  I didn't have bothered them.  I think I know their five-figure death punch.  And I love them.  Gangstand, of course.  That makes me say.  Yeah. Yeah. Yeah. Okay. My God. So what is your plan with these 500 beds from the 90s and kind  of sub into the two? No, it's if we're going with five finger deathpot. Yeah. I really love  to hear this story too, but I'm going to be over here taking a shit. Hold on. Finally, he's  taking the shit. Yep. Going to go into bathroom number 14 at the one away point nine, the  beach house and I sit down on the toilet Mike still on and  I didn't know too much too much money Mike you just got peekaboo  I hold thing Jeff is that  shetland cream reason was my heart and soul yeah and then when my cattle made a  packed  Monsanto  Well, they had me hogtied  Oh, no bar number four  That's what there was no there were no  There were no way out man  They just pushed the big old  sack coins gold coins equaling  $43 billion really  They paid you in gold coins.  Little man, little little sweaty sweaty man named Doc McGee comes out.  Oh boy, he's late.  I got a deal for you.  I'm like, only shit.  You're Doug McGee.  Of course Doc McGee world famous manager.  Motley crew, I believe.  Kiss.  And the bad super group from the MTV show super group.  That's how I know him.  I'm like, holy shit, man, I'm in a-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  The manager of-  to you.  And second follow-up question did you get one last piece of Colby Jack before you got  one last piece they shut it in my mouth.  But here's the hitch, Jeff.  Give me the hitch.  And I'm not talking the movie, sorry, Will Smith.  I have to keep on performing or a little bomb inside my head goes off.  Oh my goodness.  So I can't stop performing.  So somehow in this Monsanto and Doc McGee have set you up in a crank style Jason Statham  movie.  It's like cranked three.  Don't forget it.  It's like this is gonna be exactly like cranked three and I'm like whatever God from  the show super group.  Do it.  Go tell it to Jason Bottom.  He put his head right up my butt.  Oh my God.  I'm puppin' in the little bum right into my head and now I have to do this.  And they're the worst versions!  Everybody dance now!  This doesn't sound like you're rich in a woe!  Everybody cheese now, and they said you could put as much cheese stuff  in fact, into the songs.  That's the matter, make the little bomb in my head.  Happy!  Give me the music!  I gotta do this!  Everybody dance now!  Oh my god, and you forgot to say cheese!  got to say cheese, is there Bob going on?  I got to get cheese in.  Yeah, cheese.  Yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah.  Say cheese.  Cheese, everybody, cheese now.  And then you do in these songs, Jeff, and you're like,  where do they even start singing?  Here is the dome, back with the bass.  The jam is live in effect, and there are two waves, cheese.  On the mic was the dope rhyme, jumped in the rhythm, jump,  to the rhythm jump and I'm here to combine me to lyrics to make you shake your pants.  Take your hands. Come on, dance. I can't. I can't do it.  I'm so worried. I'm gonna just say it.  I'm just gonna say it, barber, dad. I think this was a bad deal.  If there's one thing I've learned from the crank movies is that nobody gets out alive except for Jason Statham.  And no offense to you. You are no Jason Statham. I'm not gonna do it  reviews  Oh my goodness  Did we shit my god did we just see?  Farmer Dan basically have an aneurysm from a little bomb that was placed in his brain by Doc McGee and Monsanto  He's not saying cheese. I was walking over here from the bathroom by the way John Deacon from Queen is in there  And I still he's been in there all summer. I've all clogged up  I am all clogged up in here. So what happened is far more dead Dan  Farmer, Dan is tonight  I think it came by a meal definitely  forward.  Or did John D.  He'll take you in the head.  I have no while you were in the stall.  Yes.  So you were gone while you were stuck with John D.  Can doing a, a redo of Mark Harmon summer school.  Stuck in the bathroom.  There he goes.  The kids go to take.  No, tick tick tick.  Summer school.  And yes, farmer to get to to summarize.  Farmer Dan is dead because he didn't say cheese enough in all the 90s bands.  over 500 that he bought because Monsanto and Doc McGee were laundering money in a box drug deal  and put a bomb into his brain by shoving.  Doc McGee's hand up his ass.  Just, you know, classic story.  Classic story.  Just another simple, simple, simple Jeff and Wiz show right here from your Monday.  I'll wait for you.  I'll wait for you.  Please, you would absolutely know what you're wondering about the hell gate.  I'm not wondering if Monsanto and Doc McGee could continue controlling.  I'm not gonna mention the fact that we already know  Farmer Dan is immortal. So this is not gonna face him. He's gonna be back it up  I gotta feel it because you get unless he got high lander'd in his head is completely blown off. Oh my god  I hope that's not it. Hey, no matter what we do know that big truck  It was kicked it by mule. So we also again once we get to all those influencers  We probably again should send the medical team over that's they are busy as hell that's true  We got some TikTok's finest influencers coming on in the nine o'clock hour.  We got a big, big butt Joey coming over here.  Dance is with one shoe is coming over here.  They're going to do that one shoe dance that they do so well.  Lanny, who's made entire career out of having gray hair is going to show up and just  talk to us about having gray hair.  We got a guy called Pork Pork.  He's going to show us what everyone's eating right now in the Valverde Valley.  It's going to be great.  We'll keep on listening right here on the podcast version of 1.08.9 The Hot Because Bitch.  You ain't seen nothing yet.  Pork pork, what are we talking spaghetti?  We talking pizzas.  Now you'll tell me later.  I'm a hawk.  Shit.  1.08.9 The Hot With Jason Gore and Jeff Garlock.  A comedy podcast about a fictional classic rock radio station.  and see new episodes every Monday. Subscribe on YouTube.  Apple Podcasts.  Spotify.  Pocket Cast.  Overcast.  And wherever you get your podcasts.  Support the show by going to patreon.com  slash 108.9 The Hawk.  Get video and audio episodes one week early.  Bonus shows.  And so much more.  Get that merch by going to our website at 108.9 The Hawk.com.  And if you like what you heard in this episode,  You can check out a ton of 108.9 mAh episodes on our website at 108.9mAh.com or wherever you  get your podcasts.  A comedy podcast about a fictional classic rock radio station.  108.9mAh with Jason Boor and Jeff Garlock.",
  "created_at": 1755528827
}