{
  "podcast": "2 Guys 1 Screen",
  "episode_id": 41356008023,
  "episode_title": "EP. 66 BONUS Texas Chainsaw Massacre (1974)",
  "audio_url": "https://redirect.zencastr.com/r/episode/68a2b112e8ba9aefd9a8ca9e/size/122372678/audio-files/66b395cfb5a6f51ec3cb88c1/989126d2-6863-4fa8-9b53-6635b860c3bf.mp3",
  "duration_seconds": 5098.789,
  "text": " How the shtik like that dude!  Have you seen my dick? I'm been looking for it.  Sir, I'm gonna rub one out right here on your counter.  We cut to Mike who delivers meat on his bicycle.  I'm rinsing your girl out, bud.  That's how I identify the dodeca-neadrome.  Hello, my name is Nick. I have Shaft here.  scrubbing the pot which is what I call when I jerk myself off. We're just joking.  Hi everything's jokes. Two girls one cup? No. Two guys one screen? Yes.  Hello and welcome to episode 66 of the two guys one screen podcast AKA the  Hemroid homies AKA the Poe Town Boys. My name is Nick and I'm joined by my  lovely co-host Gert. Hey and we are in my fucking take.  No, we're not.  I mean, I've never been.  You've been.  I've been and it's fuck, it's bum fuck.  I'm called the respect Texas is bum fuck.  I mean, this movie portrays that perfectly, huh?  Yeah, you really, I mean,  bunch of them.  First, I went to Texas was right before COVID happened.  And my sister picked me up from the airport  and she lived in whatever place at that time.  And she's like, oh, the navigation's taking me a weird way.  And I was like, you fucking, yeah, it is cause if you're on a fucking road, it was wild.  It was just like nothing.  It was just tall grass and like a random house, no driveway.  Another random house, just like fucking crazy.  But they got buckies.  Shout the buckies, I have a buckies hat.  Never been.  I want to be.  I want to be a Barbie girl.  Um, if that Barbie girl is Nargo Robbie and I'm laying pipe, then yeah.  Yeah.  I'm not going to rob you not in this film.  I don't know if she was a lot.  I was important yet.  I mean, I would say it's for sure it's safe to say pre-pubescent.  It's pre-9-11 for sure.  I'm going to go rape me.  I mean, she was born in the 90s.  Showing 35?  Wow.  She looks phenomenal.  I mean, not that 35 is very old.  Who's your spouse?  Tom accurately shouted Tom accurately you're a lucky son of a bitch.  Yo, all the kid kind of is a piece of the beard on.  the beard on. Oh yeah. Well let me do this math real quick. 1974 minus 1967. Wow I  did math wrong. I figured how old big length was? No, uh, Crispin Wall was seven  years old when this movie came out. Seven years old. Probably had no CT yet. I'd hope not.  Not no head damage unless his parents were thrown down the stairs. Which is possible.  We're very bad at this on this podcast,  but we start talking and we are doing  the Texas Chainsaw Massacre today.  Yeah.  That's why we're doing it and you're probably wondering  well you didn't say that last week.  Yeah, we fucking didn't because we decided  off the rip to do this because this takes place  on August 18th and 1973.  And it's coming out on August 18th, 2025.  The 52nd anniversary.  Also the theaters are putting it back out.  Yeah. Yeah. So we're doing it.  But and technically we'll get dark night on Friday.  Technically, the movie came out in October 1974.  It takes place in August of 73, but it came out in October 74.  So they were like, oh, tragedy? Let's make a movie.  I mean, it's not a real tragedy. Why not?  What do you mean? It's not based on a true story.  I thought you were saying, yeah, I'm a fucking idiot.  Sorry.  I mean, it's loosely, leather face himself is loosely based on ed gain.  Who they mentioned in House of a Thousand Corps is shout out to Ed.  Yeah.  But they said he was a cannibal in that movie and he wasn't.  He just skint, he like grabbed grave skinned people and like wore them.  Yeah.  Yeah.  That was the skin head, right?  probably was. No, he loved his model. Like he wanted to fuck his mom. That's wrong. That is wrong.  Yeah, you shouldn't want to fuck your mom. No, unless your mom's a piece, but yeah,  if your mom's a mom, it's what it is. Yeah, your mom's a remogger Robbie, we get it. Right.  Uh, I guess we should do a, so follow us on Instagram. Two guys, one screen pod, send any  comments, concerns, movie requests to two guys, one screen pod at gmail.com. Follow us on  on letter box individually,  follow us on TikTok, YouTube,  send us a voicemail,  508, fist us, 508, dip tip.  Leave the comment.  That's a motorcycle outside.  Oh, fun.  Perfect morning.  There you go.  You relax?  Yeah, leave us a comment, leave us a like.  So listen to our other podcast.  Yeah, you want it?  I'll give it to you.  It's our physical media collection pod.  It's gonna come out eventually, like,  constipated shit.  It's gonna come out.  Random thought, cause it would involve me going to Boston again.  Okay, now game.  November.  Do you know where the house of blues is?  In Boston?  Yeah.  Yeah, I'm pretty sure I know where it is.  Well, Avatar is playing there in November,  and the tickets are only $55 for four.  but no one's a month for you.  I did see those tickies and I would be game and villain.  Yeah, $55 for floor stop.  Big big.  No, they're not big.  And that's right here.  They're probably big for a crawl like international.  Oh, and Sweden for sure.  Yeah.  For the big for them.  Box Swedish fish.  We love you.  I tried to put that come button all the time ago.  It just never worked.  Come.  Yeah.  Which wasn't clean.  It's unfortunate.  It is unfortunate.  But Avatar, fan of the pod, they are a fan of the pods.  This movie, Texas Chainsaw Massacre,  as we've said four times, came out in 1974.  You got that pre-crispin wah, pre-911.  It's directed by the one and only, Tob Hooper.  You got to Tob.  You and I actually watched Texas Chainsaw II together.  Yeah, movies.  It was fucking horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  You're horrible.  you say everybody just taking shots at me no I came up to an half no I showed mark an  autumn too and they're like well that was pretty pretty boring like your life is boring  alright it's movies great I mean mark is not a good indication of a movie's good or not  he has no this fuck you talking right but he also makes sing ones a lot that was also  two I also wrote for the funhouse my review there's honestly some good parts is film I  I did write that.  I'll take that.  So I can acknowledge it.  Jeff gave it a two and a half too.  The fuck Jeff, what's Jeff?  No?  Jeff, okay.  Yeah.  Films at home, which is no longer that.  Do you think you change it  because that's kind of a gay name?  Probably.  You want to go watch some films?  Jeff, we love you.  Yeah, being, I don't even speak to you.  Oh, I decide your DM's a while ago.  It's true when I first moved here.  And you took me on.  So you have to put me on a bull moose. So I have nothing but respect for that man. I mean it's getting the bag  I'm proud of him. Do you own this movie body bags or no? I do  I thought those John Carpenter though. It may either both credit as directors. Okay  Either way, he's a director. Tobe  And but it's just fun to say toad because silently. Yeah, it's very fun to say toad  We have here's your cast Marilyn Burns plays Sally. I don't think this is a question  Let it hype the fuck down.  We got Alan Danzinger.  Whoa.  Oh, wow.  He plays Jerry.  Yikes to Bob Jerry.  Jerry's the guy with the glasses, right?  That was Jerry.  Kirk's the guy that's like young gravy.  Jerry's the guy Jerry.  Jerry, they keep begging to drive.  I never really got a good shot of his face,  but I probably, I'm not fucking him.  Nice, kind of got that weird hair that's like,  It's almost like a perm.  Bro's got a perm or something.  What kind of perm?  But everybody in this movie's also wearing bell bottoms?  Yeah.  And it's only good for women.  Yeah.  Fashion sense in 1974 is a little mid.  Sorry.  Yeah, it's fair.  So he's just gonna be a...  He ain't fucking it.  He ain't fucking it.  We got Paul A. Partain who plays the vegetable Franklin.  Yeah.  I mean, literally they call him invalid.  I was like like in the first opening crawl. Oh, do they yeah, they call him invalid and I'm like, you know what?  That's what we're gonna call them now  In valid they're not retarded they're invalid. Yeah, like yeah, I mean, that's almost worse, right?  You're invalid in life, bro. Yeah, you're invalid your vote doesn't count not the voting matters, but right. Yeah  He I mean, he's probably the most annoying character in the movie I would say  Yeah, his his death is also probably the best. So that's what I'm asking about that whichever question about later  William Vale man has no picture, but this is young gravy. Yeah, yeah young gravy in the flesh in the flesh  I would probably dig young gravy down, but not this guy this guy's climate skip  Yeah, cuz I was looking at his teeth and they were a little I thought they were like black for a minute  I don't know. Just wasn't it  He ain't fucking it  He ain't fucking it.  Next we got Terry McMen who plays Pam.  She could fucking Pam could fucking get it.  Yeah, yeah.  Yeah, I might have a question.  What the fuck is going on here?  Okay.  So Edwin Neal plays the hitchhiker.  Correct.  Now.  I was watching this movie and my phone was not in reach and I wanted to look up the cast list and Ed  Wanniel has a name on Google like his character has a name and it's Sawyer  That's that's the family's last name. Oh  Yeah, there's great and Sawyer is the that's the dad. That's daddy. Oh, he really just fucking hitchhiker. Yeah  Sorry to burst your bubble. No, I'm just fucking retarded sometimes  But it's always before I really got big until like you know  Cast and all that I always thought that chop top in  Texas chainsaw 2  Was the hitchhiker who was played by Bill Mosley and they're not the same character  And that really burst my bubble  He's also known what we call the American nightmare. You think that's Cody Rhodes  It probably is right. Oh, look at the fucking cast and this fucking thing  an examination of nature of 1967's horror films.  The involved artist.  It's fucking cool.  George Romero, Chanel Carpenter, Tom Savini,  David Croninver, Wes Craven, Tobe.  I'm out of breath already.  And then a bunch of irrelevant people.  You keep going down, Jim Lee Curtis is here.  Ron Cheney?  What? I thought he was dead.  Nick Castle?  Yeah, Nick Castle, Michael Myers himself.  He's came out in 2000, so yeah.  Anyways, Boris Carlisle, Martin Luther King,  Are Luther King Jr.?  It's probably clips of him in the movie.  RFK?  RFK or JFK?  R, not J.  R.  R.  Alright, next person I would cat.  Well, we're not fucking, I don't think we're fucking any of the Sawyer family.  That's for sure.  He ain't fucking it.  He ain't fucking it.  We got Gunner Hansen who plays the leather face.  I was old man like the old man.  Not fucking what's his name.  That's his dad.  That's his dad.  Dad is old man.  Yeah.  But his name is Drayton or no.  Like not in this one.  But later.  Later.  Because I need to know name for the scene by scene.  That's why I was that.  That's why I'm like.  It's called the old man.  No.  It's gonna get called Drayton because I wrote Drayton.  It's fine.  Or gas station attendant.  I was also what I wrote.  Dad, chef?  They call him chef?  Yes, chef.  You know them but a bitch hog.  Yeah.  We got John Duggan who plays the grandfather, not the godfather.  Like the wrestler or the movie.  Shadowed to the wrestler though.  Yeah, right?  Yeah, that guy's a legend.  He's got them hoes.  Yeah, he does got them hoes.  I don't think we need to shout anybody else here.  That's correct.  But I have no pictures.  So this franchise has, there's one good movie.  And it's this one.  Did you did it remake was good?  The remake, yeah.  I also like, so they did a legacy sequel  before a legacy sequel.  Mm.  They did Texas Chainsaw 3D in 2013.  I saw it in theaters with my father.  Shout out to it.  It was under age.  Tell me, like it here?  Yeah.  That's true.  I'm gonna use the word shit.  It was kidding.  Yeah.  but they did a legacy sequel and that movie is pretty  okay, but then they retconned it with the like,  was it Netflix Hulu or whatever?  I'm you in 2022.  Gonna wreck my cock on your ass.  I'm hoping I'm trying.  I don't know.  Can't get it up.  It's a problem.  But this is the only movie that's worth a damn  pretty much in the series.  And that's fine because it's a fucking classic for a reason.  Oh yeah it is. I mean we're recording today.  Should we say that? Yeah.  We're starting recordings today for horror months.  Get fucking ready.  And the recording study or this movie in house with thousand corpses.  And this back to back you can so obviously see the inspiration.  Oh yeah.  Like that. It's like so obvious.  Rob Zombie was a big fan.  1974 goddamn classic, which is this film.  If you're new to this podcast, we do a scene by scene.  So if you haven't seen the movie, go watch it or don't.  And you got to really bring yourself in.  Like 1974, there was really nothing out there like this.  Like this was pre-slasher, pre-halloween.  Like pre all of them.  You know?  So, bro, I'm telling you in 2025,  Where we send this podcast all the time that not much works and like we're desensitized this movie still disturbs me  Yeah for sure so sure acts  Oh my god the third act still holds up as movie was made fucking  50 years ago. Yeah very uncomfortable movie. Yeah for sure so like that's the good the great thing  They always say like less is more  You don't really see anything in this movie really no blood or  or gore or anything.  You might kinda want it.  Yeah, but I think that makes it scarier.  That's what I was gonna ask you though.  Like when Franklin gets murdered  on the remake they don't fucking show that,  the remake?  The remake's glorious shit.  Okay, that was 2003, like we're way past that.  No, I know, I'm just saying,  like I didn't know they were gonna intentionally keep it not.  Oh no.  Or they would show the gore.  I would have loved his friend to get fucking split open.  Yeah, you see his like blood splatter onto Leatherface, but he likes it.  No!  Alright.  We'll get into that.  We will.  Alright, so the Texas Chainsaw Massacre, the film opens with a scroll which Dreyel so kindly  has the words to that and will dictate it to you.  I got it for you.  This film which you're about to see is an account of the tragedy which we fell a group of  five youths, in particular, Sally Hardesty and her invalid brother, Franklin. We like youths.  Not all. I'm just kidding. It is all the more tragic in that they were young, but had they  lived very, very long lives. They could not be expected nor would they have wished to see  as much of the mad and macabre as they were to see that day. For them, an idyllic summer  afternoon drive became a nightmare. The events of that day were led to the discovery of one of  the most bizarre crimes in the annals of American history. The Texas Chainsaw Massacre.  Hey, great. There's some camera flashes and we just see like a dead  dead person's hand and a shoe. This is a full-up fucking top. The camera flashes in every single  Texas Chainsaw movie. That exact sound. There's pulled the same clip.  I liked it.  Yeah, it's spoo for this movie. I liked it for the side one.  You know how to make it. Try and make it.  Goodie-y!  I'm just gonna let that one just leave the infinity turn already now.  Yeah.  Oops.  After that we get two bodies that are like kind of strapped together and they're like,  is this guy like straddling the grave or how are they fucking on or is that the cross?  like what how are they attached to this fucking grave? They're fucking dead. That's yeah, I mean, you know,  they just fucking skewered them on there. Yeah, I mean, I think you're led to kind of believe that  it was the race. The radio is talking about grave robbers too. That's something to keep in the back of your mind.  Just keep it back there because a character in this movie likes it.  Yeah, I like that.  He might be in a necrophilia.  Who knows, maybe he's fucking it.  He can be, but just remember, Billie ain't,  he ain't fucking it.  He ain't fucking it.  All right.  Janice, there's the credits.  I'll be honest, I fast forward through the credits.  And it was just like a fucking red, like pulsing screen.  It was like, yeah, whatever.  It's not like the Spider-Man 2 credits.  1974 low bunch super low budget. I don't know if you could tell here it put that bow. Yeah, of course  Yeah, I mean it takes place basically in one house  Yeah, it takes place on the side of the road a house and a gas station right yeah  After the credits we see a dead armadillo  this group of people pulls over and it's probably Kirk or Jerry. I don't fucking know one of them gets out of the van  to  Open the side door and put some planks out because Franklin who is a vegetable he was cursing a wheelchair  Chill and wheelchair  He has to get out because he's take a piss and he pees in a bucket. I don't know why you pea  He can't I guess you pee in your lap  Yeah, I thought the same thing. I'm like oh, I guess he just like piss on himself  So that's not good. Do you think you got it up?  Though you were fucking erect you could like shoot it over your like morning warrior like stand further back from the total  It's like a sprinkler at that point.  You know what I'm saying?  Yeah.  Yeah.  Or just pissing the fucking Kirk's mouth  to save, you know what I mean?  Electricity?  I don't know.  Oh.  Why is he pissing a can though?  Pissing a bottle?  I don't know.  Yeah.  You think he dump it and then just bring it back with them?  Not so good.  No, I don't know if that fucking matters, but probably.  Yeah.  I'm never peed in a bottle or a can,  but I have jerked off into a can.  Right.  But I've also never peed in a bottle  I've never jerked off into a can proud of that one. Yeah, my dick's  Actually is bigger to not kid couldn't fit in a water bottle to say that. I don't think that average person can  Just the head but that's all you need just the tip my head is fucking huge  Yeah, but just a hole in the hole. Yeah, you know hold a whole action  You're good just to like where you where you want to sound yourself. That's where I would you have to fit it in there  Right exactly that's a cat  He's gonna come crazy right now.  Yeah, he jumped up on the cabinet.  And really, Twix is right here just chilling like that.  I'm just like,  something.  Subtext.  There she is.  Hey, Twix.  Anyways, so I don't really get this part, but I guess I've tracked her to her passes by and  like causes a gust of wind.  I thought he honked the horning, got scared.  Well, it knocked over Kirk too.  Yeah, but Kirk?  Yeah, it's true.  Maybe reread and have his fucking break on now  He didn't have his break on for sure  And you think he just tumbled down the hill and then like peed on himself too  He had to have right. Yeah. It's got it. It's got to be it's gotta be peed right  It's gotta be peed  It's gotta be had to find a way to put it in there, right? Yeah  Somehow just gonna stay. Yeah, just like rape had to find a way to put it in there  Wow, that's fucking terrible. Yeah, like that. I can keep that there. It's fine. We'll see in the end. I get soft in the edit.  Yeah, soft in the A on that one. Yeah.  Yeah.  But it's soft in the argument. I'm not one.  But it's cool because 1974 they really have stunned actors on a low budget. So homeboys  literally fallen down his cliff. You could have done a cliff.  It's cool as the vegetables go down a cliff. Yeah, you could have died in the movie would have been over. Yeah. Yeah. Yeah  so  the next cut they're driving and  Pam is talking about fucking horoscope which nothing pissing you off more than someone who fucking falls over some bullshit  Oh  Saturn's in retrograde like I don't fucking care. I don't even know what the fuck that means  If I couldn't tell you either, but it's probably bullshit. I think I don't know if I sat on this podcast or not  But I used to work with this guy who is now a day them, which is fine. You can be a day them. Sure  We respect everybody  He was like I bet I can guess your horoscope and I was like  Why is him fucking matter? He's like, let me guess it and I was like, okay?  And he's like, are you a Libra and I was like, yeah, he's like, oh my god, I fucking got  I go no matter fucking leaver you idiot and I walked away  What are you? I'm a Capricorn. Oh, I'm fucking your acknowledge it. I'm an Aquarius. Yeah, you are you are a queer. That's for sure. Right. I was gonna say I  Worked out  If you're an Aquarius or a queer or a Capricorn hit us up. Yeah, let us know we acknowledge all of them  We do but we just respect you a little bit less if you believe in horoscopes. Yeah, and even more actually god  I was gonna say I actually respect you more people even God in horoscopes. I think it's true  Yeah, yeah, well actually we might actually have to admit that we respect horoscopes more than God because at least horoscopes are based on planets  Which is somewhat scientific  That's very true  What are we gonna do?  I'm on team horoscopes. You're on team horoscopes. Fuck god  Yeah, right. Um, that's the other movie that has that God is not real or God is dead sign. It's not this one great  Anyways, so Sally wants to go make your grandpa's tomb has been untouched because of these grave robbers  And they go and it's got like grabbed by the fucking arms of your cum with a meat-acoustic your grandfather and then they know cares  different times I guess  Um, he's like, Hey, man, I hope I don't hope you don't mind. I'm stealing your girl for a second. I'm gonna go fuck her in the graveyard  Yeah, right on come on. We're grandpa grave. Oh, yeah  And her grandfather's grave was fine and they cut their back in the van again and there's a bad  MML you could answer just tell me some of the podcast  Jake you're on the two guys one screen podcast. Hello, Jakob  I was gonna try and name the movie you sent me a snap of.  All right, guess it.  With this, the second one.  You can read a snapchat.  Congratulations.  It's not the name of the movie.  Also, I don't think it's a mischief.  Yeah.  Hey, man, I thought maybe that was the name.  No.  But she had the capture spalding.  Yeah.  Hey, great.  You say goodbye?  Yeah, he did.  Cut over.  Our local G. ladies and gentlemen.  local. Yeah. I mean, the relative. He's closest to you to me. Yeah. I don't know. You're the  Jew that I know is my uncle. Seems closer than Jake is to me. Yeah. I meant location wise, but  all right. Jason Jersey. Oh, closer. Okay. I think Jake's jig's little is the closest Jew to me  that I know of relative to location.  Oh, yeah.  I thought you were like close to me emotionally.  No, but no,  you've been able to break the walls down yet.  The most walls.  So Jake.  Yeah, Jake has broken down every wall.  Jake now has less hair than Chris Jericho.  That's not a competition.  Are you talking about Chris Jericho now?  Because that means balding too.  He got the longer to cover it up.  Exactly.  Smart.  Jeez, I got a hippie ponytail and and Jericho's got a better beard. Sorry and Jericho's got a looking Jericho's got a great bod  Jericho's a good go you are not around now  Yeah, he's  working not  so they're passing this fucking slaughterhouse and  Franklin was all about this fucking slaughterhouse and how they used to kill the sludge hammer now that he's a gun and  And they stopped to pick up this hitchhiker who is,  I wrote a fucking drug addict.  I mean, why would you stop to pick this guy up?  Well, yeah, they even say it.  They're like, oh, hitchhiker,  we should pick that guy up, right?  Yeah, no, this is back in a time where I guess it was normal.  This is, but this is like one of the movies that like set up like,  hey, in a horror movies, which make bad decisions.  It's true.  And then everyone would follow him.  It was like, we're gonna also do this.  Modern times we technically have hitchhiking but it's monitored like uber  We also have hitchhiking I mean I've seen people on the street  Like thumbs up like hey pick me up. I would never fucking do that fuck no. Absolutely not  So he says that this drug addict guy hitchhiker says that his family  That his family worked at slaughterhouse and me has always been in his family man's fucking caring meat  I mean killing me and I mean this guy's this guy's you know super reery, but so he's so he's probably packing  You think this dude's slinging dick actually honest. Yeah, I don't hate that he probably slinging dick  I mean leather faces for sure that's a big boy  Yeah  And boy cuz he's only 20 in this movie. I guess he's probably carrying some meat. I don't look at him and think big cock  But he probably had a big cock. Yeah  Let us know what you think.  And the pitch-eye grid is not like the fact  they're using the guns now for cattle  because it's put people out of jobs.  But he saw us have pictures.  They show them of all the cows he murdered.  They're just in his pocket.  I don't even think he murdered them.  I think he snuck in there and took pictures.  Didn't one of them was in the background?  One of them were my making that up.  Selfie in 1974, the first one,  he definitely was not in.  And the second one, it was a cow like on a table.  I thought there was a person standing behind it.  Oh, could you wait?  No, I don't know.  I could be wrong.  You don't really get to see good image of the pictures.  I would agree with that.  And then he talks about how to make head cheese.  You ever have it?  No, but I know it's still a thing.  Yeah, I Google it, Boris had sells it.  Yeah, I mean, if you're into that kind of thing.  No, it's like the remnants of their heads.  Yeah, they just boil it.  I'm good, dog.  Yeah, but I do like dick cheese.  Yeah.  And you can like, give me head while I'm eating cheese.  Like, that's the oil.  Oh, my God.  Well, Franklin likes head cheese too.  Head cheese is probably also what you can,  you could just call a dick cheese head cheese  because that cheese grows in your head.  That's true. That's true.  But that's not all you know.  That's for all you motherfuckers that's still got hoodies  on your cocks.  Yeah.  That's not edible though.  I mean you could see anything's edible if you try. That's true. So I mean some they argue head cheese probably shouldn't be a  Yeah, I mean I would if I know what it was I'd be like this kind of weird. I'm even trying this  I mean nowadays it's probably like really like preserved and like safe  Yeah, but bet there's like French fucks like you know. Oh my head cheese  I'm not even a  Presued head cheat why they could have done them  Yeah, they're just fucking eating head shell or stroking a guy off that has that cheese right while the  Who's this fucking mommy?  The s-car go over there, so I keep thinking it's a mommy to same fucking lady. You ever have s-car go?  Actually, I have not hmm. I don't know  I don't think I'm interested in it. Snails are one of my most hated creatures on the planet  So yeah, definitely not but you're definitely trying to slurp up Sally's snail trail right thousand percent. Yeah, just fucking to look it off the ground  Yeah  I want to make that a sound one  Man when he's going after all that NDA's oh  So for some reason they picked this guy, I guess Franklin is playing with his pocket knife paws  but but I guess he probably just pulled it out. Whoa.  Oh, the defend himself probably because this guy looks like.  No, because you know earlier he was like picking under his nails with it.  Mmm. Well, he's fucking idiot for just holding a knife out and this junkie just takes a knife right out of his hand.  Uh, and he starts gashing his own palm, which is.  I mean, it's not something a normal person of sound mind would do.  I don't know if I've ever sounded myself or intentionally cut myself.  I don't know why you think I don't know if I've done it.  I think you should know.  No, I've definitely never sounded myself.  She's like, oh, there was that one time I can't tell if I was a dream or not.  There was a chartered last going in my pee hole.  Yeah, I've definitely never done that.  But I don't know if I've actually, if I've ever purposely cut myself.  I expect your palm is gnarly.  I feel like there's something major in there, right?  He's gotta be tain.  You can't.  You can't fucking wrap that nice though.  Where'd the fucking button go?  Why did a fade off like that?  I don't know.  Give us a button, dammit.  That's gotta be, that's gotta be tain.  Thank you.  Thank you, Vince.  But you can't like, you saw it.  You can't wrap that nice.  So it stitched it.  You can stitch it and flick it.  I don't know.  You'd have to glow it.  You'd have to fucking snap it shut.  Yeah.  People get their palms tattooed.  That's gotta hurt.  I mean, anything on the hand as far as tattoos  concern is crazy to me.  We're crazy.  This lady that I work with and granted,  like you have to use your hands in the kitchen.  So they're gonna get worn down or if you're a hooker.  But she got a butterfly right here in the crevice  of like where your thumb and your index finger are.  That is a nice spot.  You have a, why would you not in the kitchen?  Not if you're using your hands a lot  because it's gonna fade over time.  that skin's gonna get worn the fluff down.  And then she got a fucking, right above the tit,  just says her name.  Why y'all getting your names tattooing your buys?  You don't fucking know your name?  Her own name?  It, what is she?  Hispanic?  That's why.  Aah, yeah.  It's sad.  Well, that's actually her name, no bullshit.  No bullshit bro, I just wanna say  what's the point where we have a typical Hispanic law name.  I also did work with this guy who had his whole name,  like full government name tattooed down his arm  and he had like waves crash behind it.  Are you?  What are you doing?  What do we do?  See that?  I'm all four tattoos get whatever you want.  That's fucking dumb.  Yeah.  I mean, your whole, I would ask him like most the time  because I always soft medists.  It's like, oh, it's like some kind of like oceanic,  like partial seaman I got finished.  And then one day I actually looked at it  and it fucking just said his name.  I was like, what the fuck is this for?  I was like, do you have so many fake green cards?  That's you can remember you were a man.  Oh, he was Hispanic too.  Not at all.  Yeah, I mean, the people I work with are not white.  I guess.  Yeah, I guess.  I don't got like Germans or fucking  against waves on a dark person is crazy.  Well, the problem is also like, it's a problem.  It's not a problem.  It's not a problem.  Probably the dark people getting tattoos  is the high criminal.  I can't fucking see him.  Oh, probably a crew.  Oh.  So this man fucking cuts his palm and he just laughs about it and gives Franklin his knife  back and then he has another knife at the readiness sock.  It's like one of those old school razors to like shave reviews.  Yeah.  It's a nice one.  I'd be scared.  He shows it to young gravy's like, hey, put that shit back, bro.  Okay, put that shit back in the trunk while I fuck your mom.  Then he decides to just take a photo of him  and it's like one of those old fashioned photos  that's like a Polaroid, but it's bigger.  Yeah, like, yeah.  Yeah, Polar drone.  And he's like, oh, you guys need to drop me  off my house, live right over there.  And he's like, you can commit for dinner.  And then he's like, I want $2 for the picture I just took.  And like, why would we pay you for a photo we didn't ask for?  Right. Uh, and it is not going to pay him. So he lays out some like foil and fucking like powder. Yeah, like lights is fucking picture on fire.  So obviously I don't want to fucking fire in their van and apparently cutting your own palm open isn't weird enough to get kicked out of the van, but lying the picture on fire was last strong. They're like, okay, right.  The fuck that's also cuts Franklin. Correct. They're freaking out about the fucking fire. He fucking cuts Franklin's arm. Yeah. Like that would be  All that cut was I mean I got it's 1974 not that bad no  He should went down his arm further  He should have started like an album fucking drag that shit well they probably ran out of Heinz ketchup  That's fair  Let me look at the budget while you keep going so they're all like Jerry pull over  Jerry, Jerry stop gluice  Jerry, please  and they cut  He cuts Franklens on like you said, and after they all like kind of recuperate fucking  Pam has talked about horoscopes again how Franklens isn't looking so hot, but like fucking you have courts  It's not because that should just flexes to whatever you need to be  So the budget is not 100% but it was less than a hundred thousand  okay  they  Stop at a gas station  and they asked the attendant who was like the old man where the old Franklin house is and  And to be fair, this guy, I mean I know he's fucking unhinged.  Right, he did tell him like you don't wanna be going there.  I don't know if he's leaving.  Like, he's a bad guy, but he's like the least bad out of all of them.  Yeah, I guess. I mean he did have a doctor girl.  That's pretty bad. I mean I guess...  I kinda wanna say like, leather face is the least mean,  cause he doesn't know any better.  Special dee?  He's fucking unhinged bro, kid's unhinged.  Yeah, but he's just doing what his dad tells him, right?  Do you think he killed those like as each person enter the house?  He just fucking killed them.  There was no one there being like,  hey, go kill them.  He just got it.  They got it.  Like you said,  like you said, he retarded.  We don't know.  Right.  Yeah.  You don't know.  He's just doing shit.  He's probably just protecting his house and uh oh.  But he was texting it with a chainsaw.  But here's the thing.  He's a fucking mohoming human,  but he does recognize his family.  Right.  He's a,  yeah.  You know,  he's got that going for him.  He tries to talk.  He kind of does like, he's maybe he's Italian  because he's talking and screaming at some of his hands.  He's trying, licking his lips.  So I mean, all I'm saying is this old man  does warn them, but you probably shouldn't be going over there  because you're gonna get eaten.  Yeah, bad shit to learn.  And frankly, like my father owns it,  which I don't know what happened to Franklin's father,  but he definitely had not been this building for a long ass time.  And the old man offers them barbecue.  you have barbecue inside and they pick some up and I were led to believe they eat it.  Yeah, I'm pretty sure it's human. Yeah, it's human for sure. No, it's definitely human.  Yeah, it's firm. It's fucking human. Then there's a next scene of driving the car and Franklin  asked Kirk if he would cut himself like that like the hitchhiker did. The Kirk was like,  fucking, no, you're fucking, where are you feelings? You want to cut your hair off?  Are you cut vertically horizontally for attention results?  Yeah, vertically for results.  I think I'll lay in the bathtub.  Fuck yeah.  We're just doing toaster.  It's easy.  So I didn't read the scene by scene right,  but I pick up the barbecue and Sally notices  the blood on the outside of the van.  Next thing they pull up to.  I mean, a weird symbol on the van.  to Franklin's house.  And they made a funny joke that looks like Bella  logos he's birthplace, which, hey, respect your elders.  You know what I mean?  Right.  But by elders, that movie was only like what?  30 years before?  Yeah, but they're your elders.  Damn, you think Dracula was already a classic in 74?  Probably, right?  I would say it's gotta be.  It's gotta be awesome.  It's gotta be true.  Yeah.  Dracula?  Yeah.  I mean, I know it's a classic.  It is now for sure.  I mean, yeah.  Well, what, what mean?  We call the Incredibles a classic, right?  Oh, God, that was 20 years ago.  20 years ago.  Yeah, yeah, I mean, like just,  certain movies are our classics.  I don't know if you're already.  I think over some people like criticisms today  are like an instant classic.  You see it's a fucking three star. Well like get out is like a horror classic now  Well, you know, we'll be a classic yeah modern horror classic  We'll be look back at as a classic yeah and hereditary or the most recent ones I think goes  Yeah, that's  Yeah, I mean I think some people I think we both don't agree with this but some people would say nope  Yeah, I don't like that movie not now you took it's fine. Move me to find movies. It's not a masterpiece  Yeah, I mean and also you're also you have it's in the movie, but I don't agree with it people are gonna say centers  Mm-hmm like ten years. I'm like yes centers with that fun movie. I yeah, fortunately  Spoiler alert over on that shelf you bought it. Yeah, I bought a  kid dude  Yeah, watch the max first. Well, you bought a 4k. I did that in Thunderbolts  You bought thunderbolts? Yeah, I still look or what no  I don't have Disney plus anymore fuckers going on anymore  Okay, she wants the floor and pews tits which by on in that movie because it's Disney. Yeah, it's PG 13  Yeah, well cuz I didn't want to only buy one thing  Because I bought honestly, that's fair. I'm not gonna spoil it. I guess I'll spoil it anyway. I bought the ace Ventura 4k steel book  Well, that I knew was gonna that was a steal. Yeah  They had a steal. I was okay. Sorry, but I saw that a Walmart. I'm like fuck am I so get this and  And I was just staring at him like  Whatever fuck it you're gonna fucking sell that back and fucking do once maybe I don't know maybe I'll watch  Want to open tomorrow? I'll probably I'll be honest thunderbolts probably not getting watched  Yeah, I  Unless we do the MC you you're not gonna watch it. Yeah, sinner's for sure I need to watch  I  Gave it a three and a half I just think the four and a half five star movies is just kind of a grass  I mean, it's probably like to get out and nope thing, right?  It's about black people and horror.  So, instant classic.  Black Panther, instant five out of five instant classic.  Yeah, I, I, can't I mean?  I don't know how to say my thoughts out.  It sounded like a racist.  So I'm just not either.  So I just said it.  Yeah, I'm just, well, I'm just not gonna say,  because it's just like, yeah.  Anyways, back is where it has only white people in it.  So, that's true.  No, black guy at the very end.  Truck truck driver is a black. Yeah, and it has like fucking black mumb on his truck, too  You look like you just buried out of like some black exploitation movie  yeah  So they leave Franklin by the car to clean the blood off of it and  He's like staring at it thinking that means something and then he can't find his knife  We cut to a Kirk and I really hear his noises  I think it's just the girls laughing, but they laugh for like way too fucking long. Yeah. They're in this abandoned house  Just for no fucking reason just to hang out. I guess yeah, they're not documenting anything  They're not like they were like fucking cameras cuz even like Sally's like oh I slept here when I was a kid  I slept around. What do you got fucking big gulp?  You went to 7-11. I don't know where she went, but you got big gold. They go don't have me 7-11's in your hair  Got a big girl cup  I feel like a big girl. I feel like that was my goat milk. Yeah  I don't know I store that bitch's bush and then gave she gave me big gulp  Gllup, Gllup  So Kirk walks in this fucking room and in a corner. There's only just it's just spiders. There's like day long legs or what I  I don't know they were fucking terrifying if you saw that if you saw that many spiders  I'm running right I'm out. I'm not on trial. I want  Also, why am I not building like that anyways?  Yeah, I think I was in one one one  Probably cut that name, but  Fuck that kid if you're listening. He wanted if he wanted my help filming a music video  I always really about saying let's hear something a music video why you did abandoned building  I mean, that's what it was.  And it was literally, go ahead.  It was like low key almost on school grounds,  back in the woods, way back in the woods,  there was an abandoned house.  Like, not, okay, I know what you're talking about.  I'm being retarded.  Sorry.  So I had the video come out like shit.  I never fucking watched it.  Did you like hold the camera for him?  Yeah, right, it's getting bars.  Yeah, I didn't want to be in there. I'm like, yo, this is just trash. This is literally illegal.  Yeah, I did it. That's why I did it. I did it. Yeah.  That's probably the worst thing I've ever done in my life.  illegal.  Franklin is trying to call for the group, but they're not coming down to them.  Finally, they come down and Kirk and Pam want to go swimming.  And Frank was like, yeah, just down that way a little bit  because Frankly and used to live there, I guess.  Sounds like we could've fallen around it.  Down the trail between the mons of the old water hole.  I can't move my legs.  How am I gonna get my legs up?  I'll never get touched by a woman again.  I can't feel when I have to poop.  I wonder if you're, bro, I'm thinking, right?  If you're paralyzed from like the waist down,  you don't have feelings.  How do you feel when you have to take a shit?  You've made such a drops.  Oh my God.  Like how do you know you had to take a piss?  No, I feel like you would feel your stomach churned,  and no, your stomach, you probably still have feelings.  But you can, you, yeah, but most of the time,  when I have to poop, I feel it like in my anus, you know?  That's true.  Oh, so you're thinking you can't fly your anus out.  Right.  Yeah.  Well, can any cappy will not get erections?  I don't know.  That's blood flow.  Right.  Which, they still have blood flow.  Yeah, because like if blood didn't flow their legs,  they would just like fucking harden and fucking die.  Oh, yeah.  Yeah, they would just like have blood flow.  So it's literally just the feeling.  But also we're not doctors.  So we probably don't know what the fuck we're talking about.  Should we call my sister?  Yo.  Should we?  No.  If somebody starts getting tired.  If somebody starts getting tired.  Yeah, should we not work?  That's fine.  You're lying on the show guys once you read the podcast.  I mean if she's at work she won't, she will answer the phone.  Yeah.  What she do nowadays?  She's at, she's at ER nurse.  Oh nice.  That's, that's, that's, which is where this fucking movie takes place.  Hey!  That's actually a really good job.  Yeah, she's doing well.  She's doing good.  I don't know where this is.  What town is this in?  I know a town she works and what, I was like, what the fuck why she's in that?  She's just fucking me.  Oh yeah, she's at work, she's on the answer.  All right.  Anyways, if for some God forsaken region  in this podcast, let us know.  Or if you're a fan and you know some of medical stuff.  Or if you're dick can't get up  cause you're paralyzed cause you're a paralyzed.  You're a  If someone fucking, who got paralyzed in WWE?  If you've got Stone Cold, you know?  I was gonna say Owen Harper, he's dead.  He's dead.  I mean, he did it to Stone Cold.  Yeah, he did do it Stone Cold, you're right.  Oh, hit.  Oh, hit.  No pussy, libina, guy.  Nice.  No.  Yeah, he got me.  Steve, Steve Austin's packing for sure.  No doubt he's packing.  Yeah.  So they go to look for this fucking swimming hole  and Jay and Sally are still in the upstairs.  And then Franklin turns around and finds  like a weird pile of bones slash feathers, skull,  something else.  Teef, teeth.  And he calls for Sally, and then it cuts,  and Kirk and Pam can't find something whole.  God, there's dried up.  It dry up.  And I guess they get lost.  I don't know, I just don't get why you're walking  to the fucking back with the text is like that.  This is kind of suspect to me.  Cause they need gas cause homeboy didn't have gas.  So they see the building.  How we didn't have any gas?  No.  I don't remember that.  Okay.  That's why they walked to the Sawyer house  because Dick Wodg, young gravy fine,  like here's the generators.  He hears generators and he's like,  gas!  It's gotta be gas, right?  That's gotta be gas.  It's gotta be kidding!  Came like fire.  This is gonna become a very annoying bit  Now that I have that button,  I'm just gonna fucking use it whenever I need to use it.  Can you play a good leather face?  I would agree with that.  Stay tuned for a CNOE overview.  Sorry.  I mean, you're gonna buy a time that actually comes out.  You're gonna forget we even said it.  It's right to you.  Yeah.  Anyways, it's probably game.  It's probably game.  Yeah, so impressive.  They get lost and they find like a barn.  It looked like a barn that had like cars,  which I'm guessing these are cars  because the families killing people  and just storing their cars in this area.  Because dad's got a trip.  And Kirk's like a generator.  That means gas.  It's like that one sponge bob thing I can reference.  It's a rock, but it's a generator.  Right. This is probably where the,  this probably we're dead by daylight  got the inspiration for generators.  I don't know what dead by daylight even means.  That's a game.  It's like a horror game,  but like games don't got it.  but like a bunch of horror people are in it.  Like Jason, not Jason, Freddie, Chuckie, scream.  It's cute.  So is this house near this barn?  Yeah.  They knocked on their barn.  It's fucking wild.  They knock on this goddamn door and no one answers.  And then Kirk's like, I'm just gonna go inside.  It did be fair and Pam's not for it.  That's true, but she,  but he also finds like a molar just sitting on the porch.  Just picks it up and then gives it to Pam. It is funny just different time  If I saw the tooth, I'm running that's already a bad sign. I'll my fucking tooth. I'm out  That's your pride  Yeah, you got that crack yeah, I'm just bit of crack rot  Cracked run before you  Oh, a crack rock.  They sitting there like, yeah, this is a fuck or two.  Two.  Hey, don't crack.  Oh, crack.  Oh, crack.  I smoked this shit.  You weren't.  Yeah.  You got that enamel, bro.  Let me pass that in.  You have a smoke that fucking enamel.  Um, so he just walks in.  Your opens.  He just walks in.  It's like a bones hanging up and shit, which I thought of a conversation we had at  at some point about how like certain people like your brother like the fucking boiled bones and hang on the wall.  So I guess this is not weird but for me it'd be weird.  No it's me it'd be weird to walk into somebody's home but well yeah but it's also weird in this scenario because it's human bones as opposed to like you know.  Yeah but you like the shot when the door opens and you just see like straight down the hallway and the door shifts.  Those bones I couldn't tell they were like human or an animal.  No, because if someone mounts a deer skull on the wall, you can clearly tell it's a deer skull.  You don't fuck them out a deer skull.  That's what it's called, bro. You can throw it in deer.  Yeah, bro. Give that 8 pointer, right in my fucking gooch.  Fuck my gooch.  So, Kirk goes in.  You know that step that we're still stuck on Kirk going inside, but you know, I go ahead.  You know that scene you were just talking about?  The red wall with all the bones. Yeah, I remember I have that as a door cover  It's scared you that one time. I don't remember it, but sure. Oh, you're like, yeah  Whether you're gonna fucking penny wise thing you had, but yeah, you're like, yeah, leather face is gonna be staring at me on my I'm like, yeah  Was that in Jersey or was that was here Jersey? Yeah, I don't remember it though. Okay, you're probably too drunk  Okay  No, no, that's it.  Is it stinking right?  I mean, you fucking drunk.  I should say, tell you puked my track.  That's because I puked, I puked in your ex's bowl.  So fuck her in that bowl.  Yeah, fuck that bowl.  Yeah.  It's only because I was drinking beers  that you didn't like, which I thought you were  because it was pumpkin flavored.  Yeah.  Because you love pumpkin flavor shit, but.  Yeah.  Oh, so spicy season bitch.  Yeah, spooky season beer that you didn't fucking like.  And then you bought those fucking little cheap fucking bottle of liquor and I took one and I just shot it.  Oh yeah.  It doesn't good.  Yeah.  And not just like, why would I drink liquor after beer? You don't do that.  Not just other way.  You're in the clear.  Yeah.  Son of a bitch.  All right.  Either way.  So he's in the fuck a hallway.  And there's bone tang on the walls we said.  And the subtitle said pig squealing.  That was the noise.  Was a pig squeal.  I'm pretty sure his leather face.  I'm just telling you, I'm just telling you the subtitles on my screen.  That's what it's that's what it said.  Hey, maybe when they made this Blu-ray they had it sent out to a third party to do the subtitles  for it and they just wrote pigs going there.  Fuckin wrong.  It was a human.  And he's like going in through an ex doorway and he trips and like Lou bumps framed a  I love your face who decides to bash his head with a fucking mallet and hammer.  Yeah, probably.  That's like a goat jump scare, right? It's an OG jump scare.  I mean, I definitely didn't see it coming because there's no, there's no like  had a soundtrack. No, no music.  And then there's like this little metal door because he bashes his head in.  And it's like this kill is so like visceral because the guy's like sitting  like like he's shaking. Yeah. You need drags him in this metal door slam shot. And then  pams like Kirk. Cause she's sitting on her. She's sitting on one of those like swing chairs.  Yeah. And I'd say outside the house. Yeah. I'll say a very iconic shot when the camera  follows her underneath the, it goes underneath the swing and follows her ass. They  They had other ass shots when they were getting the Coca-Cola that went about the machine  at the gas station.  Just like, you're straight fucking ass.  This is a very famous shot.  So she goes inside and I think that because the door is open, the room is like illuminated.  And then the door wants to close because it was dark and she like stumbles through some  curtains that unveil a room that's like full of just bones, feathers and there's one  chicken in a cage. Yeah. Yeah. Yeah. And they have like this skeleton setup decorating a couch,  like just human bones, like accenting the shape of a couch. That's what Ed Gein would do.  You made like lamp shades out of like human skin lamp shades. All right. This fucking thing.  Oh yeah. They were skulls. What are you doing? You psycho?  So she's like fucking nauseated by this and she starts like not crying,  Like oh, I've been like oh my god. And then she gets chased by  Leatherface and she like just makes it out the front door. But gets fucking snatched  And I remember she gets skewer on this hook or would she just like clip by her clothes?  I thought she uh, she skewered  Think so? Yeah, she didn't sell it very well  1974 it was also no because no no no because Sally sells the fuck out of her performance  This girl doesn't do shit  I mean I want it to be skewered because that's more brutal but it would probably go through her now  Right but right on the budget  Yeah, I don't know by the way, she gets put on this fucking meat book  It's not your bag meat-hooky guy because my conch is kind of curved. Is it?  No, I just was trying to be funny. It's not really cool. It's like that. It does lean. Oh  Yeah, my leads to less. Yeah, mine right now is leaning to the right  just ahead. Mine's actually kind of curved right now.  That's kind of smushed because I'm fat.  Fair. We come back to Franklin, Jay and Sally  and they're like waiting and Jay's like I'm fucking sick of it and he's gonna go out.  He goes out looking for him and Franklin thinks that this  blood and the van means something and it's like a symbol  and he's still concerned they've lost his knife.  And this is just where Franklin's just kind of bitchy and kind of complains a lot  But he does keep for warging a Sally and she's like Franklin I'm fucking tired, bro  so jay's looking for for fucking Kirk and  He kind of walks in same trailer rives at the same house from before  And he enters this room where Kirk was I missed it. Oh  And he got oh hey, we talked about the fucking meat hook and then I skipped it. Yeah, I completely skipped it  But she's on that fucking meat skewer and then leather face turned the fucking chains on and I  I'm assuming it's a decapitation.  Yeah, it kind of turns his head.  Yeah, mama he.  Yeah, ball head black head mama hit mama.  Hey, go with no Friday 13th episode.  Fuck punk in boy.  You're on that.  Fucking head pumpkin boy.  Head out of boy.  So Kirk does the exact same thing.  He knocks a door.  And then he enters and finds his room where Kirk was just murdered.  But nobody's jerking it.  No one's in there.  And there's some knocking on the chest freezer.  And he opens in his lady pops out.  But as she pops out, little face pops in,  saw the fucker out.  And he shoves the lady back in the freezer.  We cut in its nighttime and Franklin Sally are still waiting.  I thought the lady was Pam. No?  No, cuz she's not on the hook anymore. She didn't I also thought that but she didn't look like Pam to me  But I'm also retarded so I don't I don't know that's what I have in my notes  I'll just you know I mean it would make sense because you don't know what happens to Pam. Mm-hmm  It's gotta be Pam  It's gotta be I had the button in a minute. I just want to see if there is  Yeah, I guess it's Pam. Yeah, right?  Skyby Pam  So, so I want to go looking for him in Franklin's like no, and they start calling for Jerry.  Jerry?  He ain't coming.  Jerry?  Jerry.  And Franklin wants to take the car and go to the gas station so he wheels around to the other  side of the car to haunt the horn and realizes that either Kirk or Jay or whoever took  the keys, probably Jerry because Jerry was driving the car.  Yay, fucking was.  So it sounds like I'm going looking for him. You need to fucking flash like and Franklin refuses  It's just like fighting for the flashlight still can't get it out of his hands  And so I'm going without it and Franklin's like I'll go with you now  I'm decided to go with you and  I'm fucking pushing you. Yeah, but towards the end of that scene. She like turns around and grabs him and pushes him in the very next scene  She's fucking they're just churning through this goddamn like slop  You're just a fucking slap land.  It's not a cornfield, but big cornfield vibes.  And there's no clowns in it.  No, I don't know.  I don't know.  Some shows are yet.  I do want to watch it.  Where they run into leather face who  God's Franklin with a chainsaw.  Texas chainsaw, massacre.  Right, but we only see one person get killed by a chainsaw.  I guess two if you count Kirk.  Yeah.  Yeah.  So is this seen in the remake?  Is it, it's a glorious fucker now?  It's not like a shot for shot remake.  That's good.  Yeah.  Does the guy in the fucking way if you're getting gutted  though or what?  I don't think there's a guy in a wheelchair.  Oh, that's fucking ableist.  Yeah, good.  It hinders the character.  Sally goes running for a fucking life.  And she's like in the woods.  And then she comes, I think what they were trying to show here,  She gets kind of lost in the woods and he gets turned around and then ended in front of this house  The house the house because she's like I got a guy out of the wood. I don't want poison ivy on my clown  I want to get  I want my plan  I want my bean agravert like Elizabeth. Yeah, cuz she flick her shit. I want it itch my shit. She flicked her shit too much  Yeah, I don't want to get fucking snatched like an evil dead  Yeah, fuck my I'm fine fuck my much my fucking tree  fucking tree.  Not it!  Oh, that ain't your tree, I just the con!  Oh, my God!  That's a quad dick!  That's a quad dick!  Crazy!  Yeah, that, yeah, that he's a big dick.  Yeah, that's a compliment.  That wasn't racist.  Great.  So she runs in this house, closes the front door and runs upstairs.  Let me see, let her face start chains on the front door, which is gonna come back to  buy him in the fucking ace.  And she runs upstairs and finds two...  I mean, I wrote dead people, but I guess one of them's not dead.  Grandpa, live for real for real.  He alive and she sees them and obviously freaks her out.  She runs back downstairs, but this point,  Leatherface is broken back into the house.  That means he's coming out from within the house.  He's in house. All he had to do is open the door.  He's a fucking mohomean, yoyman.  And instead of opening the door, he just fucking takes on it down.  It's not trespassing because you live there.  Right.  And there's no one there to shoot you and say, get off my lawn.  Right. But your in Texas, that would happen.  That's that sad reality. Yeah.  Uh, so she gets chased and I cannot emphasize enough how much this lady runs this  movie and how much she screams and the screaming really solves the movie.  Yeah, she sounds terrified.  I don't want to say this, but she kind of killed me with her fucking back.  Yeah.  A little bit.  I mean, do you think I mean, do you think?  No, I mean, I like the war behind like the soldier family.  But if you have a bad actress here, it's not going to be as scary as it is.  I would agree with that.  I mean, how long they spent like in the next act of like with her just strapped to  chair.  I mean, torturing her.  Yeah.  I mean, that like I don't if you had a bad actress, it wouldn't have sold.  I don't know.  I think that's why some of the song always come off as like, yeah, that's whatever because like.  Oh, oh god.  Yeah.  Oh, it's like that guy Novakane.  He can't show anything.  Just like, oh, oh, it hurts.  Yeah.  Same thing.  Go listen to our Novakane review or Dell.  It's good.  Move.  All right.  And nobody came.  We talked about no white way longer than that than fucking.  Okay, Novakane.  Novakane doesn't get.  Yeah.  Good.  So she runs this gas station, the old man is there and she's a call of fucking police right now. Also, if I run to a gas station, freak the fuck out and there's an old man grabbing my entire face.  Like he's like this to her. Like he's probably like, probably like, oh, he's like fucking scooter.  right yeah and I like  Rey Mysterio fucking believe  I thought that was real  fuck like kill Rey Mysterio  like he's got to be dead  yeah it was gotta be dead  that kills your eyes me as a kid  I was like he's dead  hey I get it I mean that was  like yeah proper fucking yeah  like I thought any I thought Eddie was  actually Dominic's dad. Wait, hold on a second stop. Is Dominic related to right or not? Yeah,  it's his son. Okay, good. That's not a fake thing. No, it's not. Okay. But they have like a  custody of a bad old thing. Yeah, right. I could see his being a bit. Okay. All right, good.  So he's trying to come around but she's fucking hysterical and he's like, I'm going to get my truck.  And he mentioned.  Children something like that am I making that up?  He definitely said something like that.  And I was like, what are you talking about?  Cause.  But they don't have a phone.  How do you know how to phone in a gas station?  Well, I guess we know what.  What is that before?  They also he wouldn't need to call him.  No, because you're going to eat them.  Right.  And this is where it confirms our selling human barbecue,  because she looks over at this fire pit.  And it has like a full chest piece.  Yeah, I mean you're sitting there.  Yeah.  You know, you go to KFC, get the four piece.  You go to this place, you get the chess piece.  Yeah.  Yeah.  It's true.  Yeah.  So he can return with a truck and he comes out holding  the burlap sack in a rope.  And this is like terrifying.  Actually.  And she starts like breaking down.  She's like, you can't show next to that.  Yeah.  Yeah.  So she grabs a knife and this was kind of silly.  He beat her with a broom.  He does just grab a fucking broom.  Oh, shit out of her.  Yeah.  But he does, you look the fucking stick to choke her out.  Oh, yeah.  After it breaks in a different way.  Yeah.  Yeah.  He's not like sticking to a stick down and throwing.  He's like taking this fucking broom and like  just broke her up.  Like splinter stick.  Yeah.  It's big splinter.  Yeah.  And then he had them tying her up.  He fucking flips her over.  He was getting off to this.  You can't tell me he wasn't.  He was.  But then he like kind of, he did like the whole police thing,  right?  Put your hands behind your back.  Yeah.  Let me get my dick on your ass and then the entire hands up.  Right.  He was into it. He was definitely into it.  And he ties her up. He sticks her cloth or mouth.  I don't even laugh at that much.  She's trying to wear a road.  He fucking gags her. It's all right.  He just can't get shit. You know, it just went wrong.  It's just like that. What was the, what's the king?  Could you see it more at time?  What was the king constraining during that she wanted?  And when they were in the bedroom?  Oh, well, you don't like, got me and like, don't say no.  Oh, it was like right me. You just fucking do it in a while.  What fucking do you want to just rape me?  And he's like, ah, oh no, no, no, no, no, no, no, no.  Yeah, by the way, on the topic of strange  drawing really quickly, that movie weapons is out.  And because like this recording is coming out sooner,  weapons is a good fucking movie,  but to all you fucking that are dismissing strange  drawing because of the narrative structure.  Oh, it's so obvious, but then you like weapons.  Shut the fuck up.  Really, literally shut your fucking whore mouths.  It's the same shit.  It's the same exact fucking shit.  It's not played out the same way,  but the way they're like,  this is the story from so and so's perspective.  And then this is like,  God, I don't wanna fucking hear it.  Because then it's like,  they do chapter four,  which brings you to chapter two or whatever.  And then, they do all that kind of shit.  And then in weapons, it's almost the same thing.  And people are like, oh, weapons is so great.  Yeah, well, strange jollings is also fucking great.  And fuck you.  Hey, movies are all subjective. So it doesn't really fucking matter if you were offended by what I just said or not.  I should be offended by what I just said. Yeah. I mean, I'm also not, you know, not opposed to sucking strange darling's dick.  Fucking love that movie. We fucking great. You're all fucking rock. They're saying, they're saying weapons is better.  People, I'm saying weapons is a good movie. I gave weapons of four. I gave strange line that could four and a half. Yeah.  They're just comparing them. They're just  What I'm saying is people leave weapon giving weapons like a five star or a four and a half rating because of the structure and then you  Right they applaud it in the in their reviews and then you look at their reviews for strange darling and it's like a three or two and a half  It's like bro, come on like what are you doing cuz also?  spoiler alert weapons is not a horror movie. I'm gonna fuck what anybody says  No, I don't even care if you go see it. You tell me to horrible. I don't even fuck. It's not okay  There's two little tiny scary parts and that's okay. That's it  That's it. But also shout out bended long really good performance like really good performance nice  I was very impressed without your main bitch. You hate that bitch. Who's my main bitch? Oh, they're from wolf man  Yeah, no, she was fine. I thought she was fine. I think I think it was bad in the movie  I just use a piece  But then they want I thought was like I was more impressed with anybody else  Anyways, I digress  It's a good movie  Chest piece gets fake raped not great so then get raped at all  He puts her in her is fucking truck and he and they're driving back to the house and  He's like fucking hitting her with a stick  He's just funny because like hey chill out. He's just fucking beating the shit over the stick  And like that's not gonna come or down bro  And then he pulls up to the driveway and the hitchhiker is outside  And he says that  Old man gets out of the car and he's pissed because the hitchhiker almost got caught  He's just beating him with the fucking same provision be people of rooms. He was at the cemetery  So I'm led to believe that he's the one grave robbing  Yeah. He's also mad that the Haytech got this brother AKA leather face alone and he asked him to  help him drag Sally into the house and she just this whole time she's just screaming.  Yeah. Like whether the rest of the movies. The rest of the movies, she's just essentially  you're screaming the whole time. But like good screen. Not good. No, it's sound. It's  sell it.  Yeah.  She's a good seller.  Um, so the old man comes inside and he sees the fucking front door, be as much shit out of  their face.  This is my favorite line.  Look what your brother did to the door.  Be the shadow of him.  Any show, uh, live face shows in the freezer to make sure that there's a body in there  and no one got away or whatever.  Um, and then the hitchhiker takes off Sally's fucking bag.  Any ties to this chair and she's where she isn't just fucking again bloody  Myrtle murder should have given back shots.  Hey yo.  Not from this guy.  Never mind.  The old man sends the hitchhiker to get grandpa and he tells Sally making dinner and  the hitchhiker ass, leather face to help him carry grandpa down the stairs.  The two him carry this fucking old ass man and they're fucking rocking chair down the  stairs.  They cut Sally's finger and like rib a suck on it.  Yes, suck that shit.  They're fucking on it.  He's like, yeah.  And she passes out.  And then this scene, I didn't choose between five years.  This scene is what I remember most from the whole movie.  It's so fucking hard.  Yeah.  This is when Leatherface makes his very famous appearance as the pretty lady is.  It's called.  She wakes up and there's just a chicken in front of her as well as like you it's like the POV of the table and  The three of the guys sitting there's like bones and shit everywhere  And grandpa's right next to her and she starts screaming and then they start screaming too  And the lamp  The lamp or the shane of the word we're gonna call is a fucking hay  Yes, skin hay  That's fine kill skinheads. Yeah, sure. Yeah, we're for quality  She begs for her life and then  The hitchhiker calls the old man just the cook and he's like shut you fucking bitch hog  Are you bitch hog?  Okay, I'm the next girl I fuck this slapper over fuck  She's into it I take my juice you bitch. Yeah  Based on bitch ass  The fucking turkey based her out  and  Seminate you the old man doesn't like killing but sometimes just got to do it  It's just what has to be done. Hey, you know, I like doing it, but I like doing it  And then my next note is screaming it's just screaming for a while. Yeah, but like  For long enough to make you feel uncomfortable. Yeah, yeah, it's a very uncomfortable scene this whole time. Yeah, just screaming  I remember there's no music at all. No nothing she's just screaming  The old man tells the little face not to torture her and then the hay tiger calls him a  fucking cook again and then he wants to fucking swing on him.  But then they decide to let grandpa kill Sally because grandpa was the most prolific.  He was the best West.  Yeah.  He was the fucking Tom Brady of killing and slinging dick too.  Yeah, I'm sure back in his day.  The hay-tucker cuts are free and drags are towards fucking grandpa.  She's just screaming for a fucking life.  And they put her hair over a picnic basket.  Okay, Yogi.  This part's kinda funny though.  It's like, it's like you can't do it.  You guys are so fucking like inbred retarded that you didn't think you were gonna fucking  work.  Yeah, I was gonna work.  I mean, grandpa, all this shit, he can't move.  He can't.  He can't fucking hold a goddamn hammer.  I can't permanently grasp it.  He could not.  So he just keeps dropping the hammer.  And then a lot of Facebook wants to help him.  And they kind of get in one strike, kind of.  They show a little blood.  Yeah.  And then the head chuckers like, let me do it.  And Sally's able to break free.  And she runs and chips out this fucking window.  This is a second window she jambed out of.  I was just about to say she's a-  going to say she jumped that other window somewhere and I didn't write down.  Yeah, when she first got on the house, when Leatherface was chasing her, but she jumped  out a second story window that time, snapped her fucking leg.  Uh, and she's running and running and running.  She's for his company.  Uh, and Sawyer and Leatherface Chaser, this scene was scary because she's trying to run  for her life and, uh, home boy, I said Sawyer, that's not right, but the hitchhiker is  like just kind of jalicking behind her and like letting her fucking run.  Yeah, like playing with her hair and shit.  Yeah.  And he's trying to, he's like about the stabber and then he gets fucking hit by like a  16 wheeler.  And it's like really knocking.  Yeah, it's the nominee.  But the effect wasn't great.  It was clear like a dummy.  Yeah.  I didn't hate it.  Okay.  Yeah.  So Sally, the trucker run into the car and then get out of the car on the other side.  And they're trying to evade little to face.  And I found this funny, they just,  those are wrench at lev face.  Yeah, like that falls over.  Falls over the chain saw falls on his leg  and cuts his leg open.  Like gashes his leg a little bit.  It should have gashed it fucking more,  but I think he went.  He went.  Oh!  Yeah, okay.  Yeah, he's retarded.  Uh-oh.  There's another passing by truck that like pulls over  and Sally gets in and the not mean is just left behind.  Fuck him.  Yeah, and she's in the back of the truck and they drive off and she's like screaming and it slowly turns into like kind of a maniacal laugh of like I got away  And I'm gonna live and leather face does his famous chainsaw dance  I thought this dog was not leash, but it does have a leash and there is a owner walking it  It's fucking thrown his chainsaw around  Swork going around  And that is the end of the Texas chainsaw massacre number one. Oh no does oh g  This is the OG. Yeah.  This is a movie that when I I had watched like I said during the pandemic and I didn't watch for the first time  Yeah, and I was like I'm never gonna watch me again because I was disturbed, but also  I hadn't seen shit. I mean think about how many movies I've watched since  2020 that's true. I've seen inside now more than once. I've seen a Serbian film twice  Yeah, terrifying like favorite franchise. Yeah, I've seen the sadness. Yeah  Just like I've seen all good now. Yeah, but also to be honest with you  I don't want to watch this movie like I'm not looking forward to watching it again because the third act is that  fucking menacing and disturbing. Yeah, and it's like that's where like, you know, the whole  Inspiration from this movie comes from it was really like one of the first to like do that  We're like if you if you watch like if you just walk into a random theater in 1974 you know nothing about it  You could think this is like fucking real footage, you know  Yeah, well, I thought it was a fucking true story tomorrow  I'm a fucking idiot. That's a moment. You know they tell you it is at the beginning  But also also I just like how many movies do you watch even today with how desensitized we are  That you're like that's gonna fucking stick with me for a long time  the one I just watched.  Yeah, and it's like that and like a Serbian film.  And like for me, it would be funny games.  As far as disturbing.  I can't, and then like, I mean, there's only one other one,  but it's because the whole genre bothers me.  It's like, I spit in your grave because  rape and rape like really doesn't.  I don't like that.  It doesn't.  You're supposed to not.  Yeah, I mean, we're never gonna cover a rape revenge movie  on this podcast, I don't think.  Maybe it's just not, I mean, I get that it fits our humor,  But that's how much we don't actually like it.  Right.  Just not.  And most of them don't have any redeeming qualities.  No.  I mean, the remake of Ice Betting your Grave,  that kills the end, you could argue are cool.  But it's essentially like a Saw movie.  Yeah, that's not good.  No.  Also, they just, as far as that movie is concerned,  they just go in on her for so fucking long,  that it's like, yeah.  Yeah.  You've got raped.  Like, we just move out the storyline here.  It just like goes way too far.  Yeah.  And like last half of the left for me is just a bad movie.  I just don't like it.  It's uncomfortable on top of being a bad movie.  Not like you're doing that.  Yeah.  You know, I also just thought of that would probably  serve me for a while is that scene in Pink flamingos.  I mean, I say that scene.  There's like several scenes.  Yeah, which one?  I mean, fucking homie getting mama head.  Oh, that was fucking insane.  And his mama.  And then the other scene I would say is the guy  flaring his asshole. Yeah, those both just like, yeah,  her eating shit at the end didn't really bother me as much.  No, because also like, that was like a thing where like we all  like people knew that was going to happen to. Yeah. Like you  could hurt the movie or whatever. Right. And then we had seen  so much at that point when she ate the shit I was like, okay,  I get it. What else could you do? Like just what it is, you  give oral sex on a criteria on blue rig. Like, yeah, you get  Yeah, incest. I mean it's not actually incest but in the storyline it's incest. Yeah, she's sucking her son's cock  That's what it's taking a lot. I wrote that in my American guinea pig review  I'm like I'm getting too far. How the fuck did you even get to that? I don't know man  Yeah, you go nuts and fucking I mean obviously it was fake but under films put it out on Blu-ray  It's the same people that put out Serbian film so I was like I'll check it out  So yeah, check out our one year anniversary on a Serbian film.  That's what the mystery movie is.  You didn't listen to it yet.  Rough listen.  Trigger a little bit.  Rough listen, but honestly a good recording on our end.  Sure.  Then we did a good job.  If I didn't say it, I was tempted to drop this  to a four and a half because I do feel like  there's a low-bend the notes, kind of a fucking drag.  But I'm gonna keep it at five stars.  This is an iconic movie.  This is the most important thing for the rest of my life  as far as like, horrifying.  Like I can go watch any fucking movie  and go to say, you can be fine.  This movie's like fucking wild to me.  Yes, this is a goat.  Go for it. It did all time.  It stands the test of time, which has a lot.  It's a five star for me as well.  One of the greatest horror movies ever made,  and that's just fact.  That's just something where I'm not gonna change my rating  from when I first got letterbox  and just marked movies.  I was right about this one.  Yeah.  That'd be settled to a...  So, follow us on Instagram to guys one screen pod.  Send any comments, concerns, move your request to two guys one screen pod at gmail.com.  Follow us on letterbox individually.  Follow us on YouTube.  TikTok.  Give us a voicemail.  508.  FISTUS.  508.  DIP, tip.  6 minute.  Leave us a comment.  You got a missed call on the voicemail.  There was no voicemail left.  Wow.  Leave a like.  And uh, go listen to our physical media podcast. Yeah, you want it. Fuck. I want it. My give it to you.  Fuckin' give it to you.  Haha.  Uh, like I kind of started to say at the beginning of the episode, Dark Knights,  supposed to come out tomorrow.  I...  Uh, we're gonna give you Dark Knight on Friday.  Yeah, cause this was...  That's what it's gonna be.  You know, the whole section is on day.  We kind of had to do it.  It was a perfect time.  It was like the candy man episode. We just decided to do candy man cuz  Tony Todd died alright  Candy man's not a great move  The man not great but shut the not means that's true  So dark night on Friday and get ready good one. I  Mean this is an all-time episode. It's an all-timer  and then  next week we wrap up our  like next Tuesday we wrap up our franchise on pirates.  Thank God.  Deadman tell no tales and did that get kind of  well at the end?  It did, that and no one right?  Yeah, right.  I gotta actually still edit that.  But either way, until next week we will see you guys.  Toodles, fuck you, Mark.  Big king!",
  "created_at": 1755546220
}