{
  "podcast": "Call Me Back - with Dan Senor",
  "episode_id": 41351002431,
  "episode_title": "Will Israel Take Gaza City? - with Nadav Eyal",
  "audio_url": "https://cdn.simplecast.com/audio/95ea4d0c-35c7-4ac7-a410-7d9f02ee3ded/episodes/c5c297a2-de6b-4d3d-b05d-ad7e10450c10/audio/8db78dba-aa20-4182-b99e-12cc9ab572fe/default_tc.mp3?aid=rss_feed&feed=5gzMlOG1",
  "duration_seconds": 3897.096,
  "model": {
    "name": "tiny.en",
    "device": "cpu",
    "compute_type": "int8"
  },
  "text": " You're listening to an art media podcast.  What really happened is that Israel paid a very heavy price for an incredibly stupid  and to some extent cruel mistake it made back in March.  And Hamas was using it.  And now the question is will military pressure lead to a deal or will it lead to more criticism  of Israel that could actually lead to lose the war?  kill the hostages or will it push Hamas again to the negotiating table?  And I have, and this is the good news I'm going to end with,  the last 48 hours we're seeing assessments in Israel by intelligence sources  and by others that there is movement as to a deal.  It's 4 p.m. on Sunday, August 17th here in New York City.  It's 11 p.m. on Sunday, August 17th in Israel,  where Israelis end the day of mass protests and a nationwide strike against the government's  decision to expand the Gaza war by conquering Gaza city.  About one million Israelis participated in the strike, which was organized by the October  Council, which represents most families of hostages as well as fallen IDF soldiers.  While this sounds like a large number, and it did include hundreds of local authorities,  businesses, universities and other organizations, it failed to shut down Israel's economy.  But by the evening, demonstrations across the country, but mainly in Tel Aviv reached what  the organizers estimated to be one of the largest demonstrations in Israel's history.  Nearly 500,000 people gathered in hostage square in Tel Aviv for mass rally tonight demanding  the government reach a deal.  Again, that is according to the organizers of these rallies and strikes.  At the same time, the IDF is preparing to execute the government's decision to take over  Gaza City, despite many concerns from within the IDF about the plan.  Israel announced Sunday that it will resume the supply of tents and shelter equipment ahead  of its plan to evacuate the roughly 1 million Palestinians living in Gaza City.  Meanwhile Hamas negotiators in Cairo signaled this week that they are willing to back down  from demands that led to the collapse of the negotiations.  Israeli officials responded that the government will not go for another partial hostage  deal and will only consider for going the Gaza City takeover if Hamas agrees to all Israeli  demands for ending the war.  Also I want to take a moment to acknowledge that this Tuesday, August 19th, which is the  25th of Av in the Hebrew calendar, the family of Hirsch Goldberg Poland will commemorate  his first yard site, which is the Oscarra or first annual memorial of his passing, along with  five other hostages. It is hard to believe it has already been one year. Joining us today to  discuss Israel's plans for the Gaza City takeover and whether the operation could be thwarted by  another hostage deal is Arc Media contributor and senior analyst at Iriot Ahranot Nadavayo.  This is coming back.  Let's have a good to see you.  Good to see you again, Dan.  And you know, you just mentioned here, Scott bit pollen and I was reminded by all levy.  All levy was of course a hostel Jim self.  And when he returned back from his captivity, he told John and Rachel, the parents of  hearish, how on day 52, if I remember correctly, he knew the exact day.  called Pauline quoted the sentence to him that I think originates with Victor Frankl's book  after the Holocaust. He who has a why can bear with any how and or levy said how the sentence  he thinks kept him alive through captivity the sentence that hearish told him and he actually  has a tattoo on his arm with that sentence. Yeah and Rachel told me that they had heard,  I think I have this right that this became a line that other hostages inspired by this conversation  that you're describing that her shad other hostages then as this commandment if you will,  the Victor Franco commandment that hersh quoted became a line that they all used,  many of the hostages used with one another to just keep reminding themselves how to mentally  and emotionally get through their captivity. In many respects, they say it helped keep them saying.  Yeah, absolutely. And this goes to the demonstrations and the day of protest that we're seeing today in  Israel with people demanding to get a deal to make this the first priority. I'm not going to present  this as something that isn't discussed within the Israeli society. It's not a consensus anymore.  There is criticism coming from the government from some other postage families, not the majority  to you of them as to these demonstrations. But what they're saying is this is the number  one priority and it should be prioritized right now.  Yeah. Agena is important to acknowledge what the criticisms coming from some among the  hostage families and your point may very well be the minority is that right now when it  seems that Israel is headed for a hostage deal, the protests, you know, can strengthen  a mass is negotiating position. I'm not saying this is my view. I'm just saying this is  this is some of the rhetoric you're hearing.  Yeah, the Prime Minister Netanyahu basically said that this morning in Israel.  Okay, Nadav, before we dive into the topic of our conversation today,  can you tell us about the news you broke over the weekend about China's plan to rebuild Iran's missile capabilities?  Yeah, so basically, first element is that the reconstruction of the nuclear program has somewhat been sidelined by the Iranian regime.  This goes to the discussion as to what extent of damages that they suffer at the attack made by Israel and United States.  And the answer is that the damage is so substantial then that they have basically sidelined the idea of rebuilding their nuclear program at this point.  And now they have other issues at hand that are critical for them.  And I think first and foremost is building their error defenses.  And it was already published that they're negotiating with China to get some sorts of error defenses that are equivalent of the S 400.  The Russians S 400.  And I think that the reason that they're turning to the Chinese is because the Russians will not supply them some of these weapons,  which is a very interesting development as of itself.  Well, can we just say one moment, just a minute on the importance of the S 400s,  because those are the kinds of air defenses that Iran was so dependent on that Israel had basically  between April of 24, October of 24, the volley back and forth between Israel and Iran and then obviously  June of 25, when you add all of those up, these air defenses were largely wiped out, which is when  we talk so loosely that Israel has complete air superiority over Iran. It was because these systems  had been taken out, right? The Iranians had some sort of triad's made with the S 400 Russians S 400,  but they didn't have a formal agreement with Russians to supply it.  And massively they had mainly the S-300 which has a decreased capability.  It doesn't really matter because now they're negotiating with the Chinese as to their  air defenses. Now, what the Iranians understand is what Israel and the  Sir Wright in the beginning, and it was trying to send that message back  in its own attack, which was very specific. October of 2024,  after the Iranians attacked Israel, I remind our listeners that Israel had a very direct  attack to a specific site. And we talked about this on this program that this was sending a message  to the Iranian regime that we can take your air defenses out if we want to. And Israel actually  took out a lot of its air defenses of the Iranians air defenses. Well, they didn't get the memo.  And what Israel did during the war in June of 25 is basically take out all the air defenses,  all the important air defenses of the Iranians. And they became completely naked to any Israeli  attack from the air. It'll be natural to deduct that this is the first thing for them to rebuild.  What I've added during the weekend is that it's not about the air defenses alone.  It's to an extent mostly about the abilities of the Iranians to have ballistic missile  capability and to scale it up massively using the Chinese.  And the intelligence services in the West are very worried because of the relationship  between Beijing and Tehran becoming closer and closer.  And people who have heard, for instance, the speech is made by the Trump administration,  only by the Israelis know that what Israel understood in the Trump administration and the  sort of the search point is that those ballistic missiles completely conventional are as a  big threat strategically speaking to the state of Israel's existence as the nuclear program,  simply because Israel is such a small country. Now, if the Chinese indeed are going to somehow,  There are two ways to do this. You can supply ready-made ballistic missiles and launchers,  or you can start building them in Iran. But whatever method they're going to do,  if they are going to allow the Iranians to re-acquire their ability and expand it in scale,  that's going to be a big issue for Israel and potentially for the Europeans and for the United States.  Now secondly, Israel has sent messages to Beijing.  And a senior Israeli source, I spoke with, an official told me that Beijing has not confirmed  to Jerusalem, that it is indeed going to do that.  And that the intentions of Beijing be made unclear, but this could have strategic repercussions  mainly because, as you know, for the United States, specifically the Trump administration,  China is indeed the main strategic rival.  And Jerusalem is sending a warning sign here  to China to the extent that, you know,  the small Israel can warn China to say,  we know that you're considering this,  that you might be signing these agreements.  Please don't do that.  What does this show you about what Iran  learned from its war with Israel?  Well, first of all, it says that the Iranians are there.  I'll just give you another example  to what extent they are there.  They just sent an emissary to Lebanon to meet all the sites in Lebanon.  He was humiliated and Lebanon.  I'm talking about Ali Larry Gianni,  who's the secretary of their National Security Council.  He was humiliated by the president,  the prime minister, lectured by them,  not to intervene.  I've left it out.  I've left it out.  Yeah.  Lectured by them not to intervene with Lebanese issues,  which is something unheard of,  like two years ago, a few years ago,  because they were running the show in Lebanon.  Well, no longer for them.  It was not heard of a year ago.  Yeah.  He was basically told, go back home.  At the same time, let me say something  that people don't understand.  Iran, after the war in Lebanon,  diverted a billion dollars,  a billion dollars to the reconstruction in Lebanon  and to paying families of Hezbollah in Lebanon.  And the response of getting from the Lebanese system is,  we don't want you to be part of the Lebanese scene,  but this gives you an impression to your question  that the Iranians are very much intended right now  to start and reconstruct their national and regional security.  And they're not done.  And people who know Iran, experts of Iran have always said,  when you have this regime there,  they're not gonna rethink, regroup and say,  let's focus on Iranian economy.  We just lost $100 billion in this fantasy  about a wall of fire around Israel?  No, no, no.  They want their regional cloud.  They believe it's important for their regional security  as the only Shia state in the world.  And because of that, they're gonna rebuild.  And this is what they're beginning to do.  If that door in Moscow remains closed right now,  I remind our listeners that President Putin  has basically said, hey, why won't you enrich your uranium  somewhere else?  Which is basically the Trump administration position.  I think this is the only issue in which  President Putin has adopted the Trump administration  position as to the enrichment of Iranian uranium.  At the same time that Dorne Moscow closes, we're going to try and open the door with the Chinese.  But this is becoming more interesting in the sense of how the superpowers can get sucked into the  conflict in the Middle East. And also, we all know that one of the reasons that the Biden administration  wanted to go through making the relationship with Saudi Arabia more robust is fearing more Chinese  influence in the Middle East. Okay. Let's turn to Gaza. What's the latest you can tell us in  in terms of the idea of plans for going in  take over Gaza City.  So in the next 24 hours, I expect that the idea of chiefs  of staff are going to have a session.  And in that session to start looking at confirming  their tactical operational program to capture Gaza City.  That's an incredibly complex operational assignment.  And let me quote one, Israeli general.  Gaza is the most complex problem that the IDF has faced since its inception in 1948.  You have a very dense populated area.  You have an entrenched terror army that has become during the war, a guerrilla organization,  very much supported by the local population in a very dense and condensed area.  And a guerrilla army that uses this population to protect it rather than the other way around.  Of course, Hamas, definitely, I don't think anyone thinks differently.  I never heard any pushback from when I go on international media and say, Hamas doesn't  care about the local population.  Even Israel's fiercest critics don't go, no, they do care about, that's just demonizing.  Nobody says that they don't care about the local population and you have hostages there  and you have the international community.  According to international law, you are supposed to enable the transfer of aid and food  to the local population during the war.  And the idea of the state of Israel have said that they are committed to enabling aid going  into Gaza.  And all of these factors together make Gaza such a complex problem.  Now, you know, this statement, just look at the last two years then, we had this arch-enemy  called Iran, Israel basically crashed their abilities in 12 days. We had the arch-enemy  called Hezbollah, Israel crashed their abilities about a year, a year and a few months.  Israel is still trying to get over the Gaza problem. And I know speaking with my American  friends, many, many people are asking me, you know, what is Israel trying to do in Gaza?  They feel extremely frustrated and they have no good answers right now. And even that  plan that we're going to discuss about taking or capturing somehow guys a city. The way that the  idea of his planning it is going to be so careful, we're not going to wake up after 10 days and say,  wow, you know, nobody thinks in the idea that Hamas is going to surrender their bunkers and we see  hundreds of armed men go out and surrendering the hostages. There is no scenario that I know of  right now in the IDF, that's things that this is going to go to that. Or that you have an  operation, a brilliant operation that will lead to that.  Okay. So I want to talk about the differences between how the IDF would recommend approaching  this Gaza city operation and how the security cabinet wanted the idea of to approach this  operation and what they settled on before I do. One argument that could be made is that if  Gaza city is like the Berlin of Hamas's Germany or the Moscow of Hamas's Russia,  But, you know, up to this point has been untouched.  And if Hamas was sensing that pressure was mounting on Israel and not mounting on Hamas  over the last month or two with the quote unquote food, the mass starvation charges against  Israel, the recognition of the Palestinian state by all these governments or statements  that they will recognize the Palestinian state by all these governments in Europe, there's  just all this pressure mounting on Israel that sort of had Israel on its back foot.  And Hamas wouldn't negotiate.  could argue that Israel saying we're going into Gaza city, this stronghold of Hamas that has  been untouched up to this point. And we will take it in that, in and of itself will bring  Hamas back to the table. I mean, that regardless of what you think of the military viability  of the plans, which we'll get into, there is a negotiation impact here as it relates to  hostage negotiations.  Absolutely. If Hamas really believes that you're going to take Gaza city and also then  The question remains, let's say Israel Tatsa,  all the problems that we're going to discuss  are going to be sold and Israel is going to do that,  even brilliantly in a way that local population  is to some extent protected, that the casualty rate  is lower than the idea of expected and so forth.  OK, and then what Hamas exists in the central camps  of the Gaza Strip that places like Nousirah to Viral Balah.  exists in the humanitarian areas like the Mwasi and other areas.  So, you know, what's the distress there? The answer is that in order to conduct this kind of  an operation in Gaza city, you need to lead to the evacuation of 1.2 million people. Just in order  not to hurt too many people in the process. One thing about Gaza city that people don't understand is  This first of all, that a lot of the Gaza population has basically fled into Gaza city.  So now it's about 1.2 million people living in that city.  These are apartment buildings with sometimes three or four or five floors.  It's a heavily populated urban area.  Think about troops going into this area.  Think about tanks rolling into these areas.  Now, some parts of Gaza city were taken right at the beginning of the war.  the square in Gaza city was taken right in the beginning of the war turned out that they had  a massive bunker of Hamas underneath. There are hospitals there with bunkers of Hamas.  But that's, I think, the first element there for the IDF is to try and understand how  it leads to the evacuation of the civilians so that there won't be massive, massive civilian  casualties when the IDF goes in.  And for the idea, and I need to underline this, they're very much against this plan.  The preparing the plan, and they're going to do it because they're the army and the government  makes the call and the cabinet make the decision.  But I've never heard so much resistance within the defense officials and the army to the  plan because they're saying, you know, we're not sure we can evacuate the same number of  people as we did with Rafa.  It's a completely different situation than a year ago.  the international pressure. One of the things that they're fearing then is that they'll begin  the operation as planned. And then someone, maybe in the US, maybe the White House,  we'll pick up the phone and say stop it. And then it'll be better not to begin the operation,  than to have it stopped by the US at the certain moment. Now I have as far as we know right now,  the US is giving full support to the Netanyahu cabinet with this decision. And President Trump  personally and we heard what President Trump said. I'm not analyzing here. He said,  remember October 7th, he was reacting to these issues, but President Trump also said this  week that he thinks that journalists should go into Gaza and see for themselves. So it  can change. And this is one of the things that worries the idea. Another thing that worries  the idea is and they were warned by the chief attorney of the idea that this evacuation  is only supposed to save lives of the civilian local population.  It's not an expulsion.  And it cannot be used for immigration or forced immigration  or expulsion of Palestinians or to push them out  of the Gaza Strip altogether.  What was once called the Gazan Riviera Vision  or the Benvera Smartrich dream.  If you use this to that, it's a war crime.  And the chief attorney of the Israeli army has told the chiefs of staff,  you can do that in that case.  You can, you can lead to the evacuation of the local population.  If you guarantee their return after the operation is over,  and you can only do that in order to have less casualties, civilian casualties there.  And considering the international atmosphere as to Israel,  but can I just say back to somebody who said about President Trump, I mean,  One thing that's he's been consistent about, especially in the last few weeks is,  Israel do what Israel is going to do in Gaza.  And he's not signaled a red light.  He's not signaled even a yellow light.  I'm not saying he's flashing a green light, but he's certainly not in any way  signaling that he's going to stand in the way of what the government is deciding to do.  I mean, he's been consistent on that. Yeah.  He's been consistent, but he's also been consistent on wanting to end the war down,  right. And getting those such as back wanting to end the war.  Well, I actually think I'm not in the man's head, but if you're right that he says both  of those things and he and his mind, those two may be connected that the more aggressive  Israel is in Gaza, the greater likelihood that Hamas comes back to the table, the greater  likelihood that you have a path to ending the war, whereas where Israel is now nothing is  happening.  Meaning Hamas is not coming to the negotiating table.  There's no sign that Hamas is being, you know, is kind of about to break entirely.  And so it's like the worst of all worlds.  So yes, you may want to suffer intending.  God said you may want the war to wind down and maybe the way to do it is actually to crank  up the level of aggressiveness and the intensity of the war fighting in places that Israel  hasn't fought before rather than the other.  I'm not saying, by the way, he's right or the government is right.  I'm just saying, I'm not sure those two positions that Trump articulates are irreconcilable.  The answer is to what aim is ready.  Defense officials didn't say don't do anything, right?  the IDF had planned and suggested to the cabinet  was basically not to occupy Gaza City,  but to pressure militarily and do more of the same.  I didn't hear from people in the army  that thought that this is gonna be extremely effective, okay?  But they were thinking that this could also be a disaster.  A disaster internationally, and of course it could lead  to the deaths of the hostages and the chief of staff  in the cabinet meeting in a very direct confrontation with the political level.  It's a close cabinet meeting. So he's saying his opinion, that's his job.  He said, okay, if this is the case, if this is what you want,  take out the goal of getting the hostages back from the goals of the war.  If this is what you want, don't say it's a goal of the war. And let me tell you,  Dan, why? Because if you're telling the army, there are two goals for this war,  getting the hostages back, making sure that Hamas doesn't control Gaza.  If these are the goals of the war, it's not just a statement.  It's not a PR statement. That's an order.  And if you're in the army right now and you're planning an operational plan,  you need to keep these two goals together alive.  And what the chief of staff was saying, I can't capture Gaza  the way that you're talking about capturing Gaza City  and keep the goals that you yourself have ordered me to keep.  You can't bluff about these issues. He was to an extent calling the bluff.  And that's just one example of the confrontation between the idea. Also, you need to enlist now  dozens of thousands at least of more reserve soldiers. And the idea is now after, you know,  it's the longest war ever fought in Israel's history. We're seeing post-Trauma in its peak.  we're seeing loads of units that are having trouble getting reserve soldiers to report all the  time. And because of that, the idea was pushing and still pushing very hard. If you can get a deal  now, get that deal and we'll finish the job with Hamas later. One of the arguments made by the  idea as to the hostages areas, you, the cabinet, said there are two goals. One goal, we need to get  right now, that's the hostages because they're going to die because they are being starved in Gaza.  Yeah. If you want images of forced starvation and starvation is a tool of war, you can look at the  images of Israeli hostages being held by Hamas. So the argument there is one element is an element that  is very, very short lived and that is getting the hostages back. Another element which is taking  out Hamas, there's going to be a struggle of many, many years. Even if we do capture Gaza  city, we do clear Gaza city. Still, you know, you're going to have Hamas and you'll need  to have a strategic plan for many years to come. And that's the argument. Now, operationally  speaking, what was chosen by the cabinet at the end was a sort of emerge between the  approaches. But it's going to be a slow process. And I just spoke with the defense  official and he told me, you know what, you know, at the end, the difference between what the  idea of his saying and the government is saying is not that large. But we're going to get the  international criticism as though we decided the most extreme option that was discussed in a  PR notices of cabinet ministers or their interviews. And then the idea of we need to answer  and we need to react to that.  And we both need to quote the sentence,  it's a Hebrew sentence or a Jewish sentence,  to get chased out of the town  and eat the stinking fish, both of those, right?  I think it's probably a translate from Yiddish.  You know, so, and the idea says it's always the case,  you know, we're not gonna do this.  And we are gonna get criticized  as though we are doing this altogether.  But Nadaab, that is a metaphor for every phase and every stage and every development of this  war, which is that whatever caution Israel uses, whatever caution the IDF demonstrates  or exercises, Israel is still criticized for the worst characterization or worst scenario  that could have happened relative to what it's actually doing.  Yeah, that's true.  But in that cabinet meeting, that's another story.  He don't say the foreign answer, who by the way just returned to the likud after many years  and was accepted very enthusiastically in the likud.  Had a speech and that speech wasn't published too much because he didn't have these interviews  like the far right ministers trying to push the idea, yeah now let's be aggressive.  No, his speech was completely different.  He told the Israeli cabinet, look, whatever you're gonna get from this operation or this  War in general in Gaza, it doesn't equal the level of strategic and diplomatic damages  that we're incurring right now around the world. We are just after this huge strategic  success of the war against Iran. And we are being sucked to the black hole called Gaza.  And when he was speaking unlike other parts in the cabinet, very adversarial,  still, in other words, people keep shouting at each other.  But when Gidon's house spoke, even the far right ministers, nobody interrupted it.  And he was saying there is no way to compare between the damages of the lasting of the war  to Israel's position in the long term.  I think many people feel that.  By the way, many people I speak with in the US, in Europe, and talking about supporters  of Israel, about from the Jewish community and not from the Jewish community, are saying  that.  And I'm asking, on the other hand, and I'm going to present the other side of this.  you don't need to push back then. I was getting ready to push back and I appreciate you.  No, no, I want to present this because on the other hand, one could ask if Hamas enjoys the idea  of we convince the world that there is an intentional starvation of the population.  I don't think that there is an intentional starvation of the population.  I think there is hunger, at least there was hunger in Gaza. The facts that I know of are not  that the Israeli government wanted to have starvation of the Ghazan population. In its decision  between March and May 19, I think it wanted to pressure Hamas, but not go. And I think that was a  huge mistake. And I spoke about this on your show. I think they were playing with fire, humanitarian,  fire. And I think it caught fire both in terms of international media, but also in real terms.  I don't think the entire thing is fabricated. I think there is a human-time crisis in Gaza.  We were going to do a separate episode on this, but I agree with you as one would expect in any  combat war environment that there's a humanitarian crisis to some degree.  And obviously, for what you said at the beginning of this conversation where you described how  difficult war fighting in this Gaza, and that it's one of, if not the most dense  area population-dense areas in the world. That's at war. You would expect that to be the case.  But this idea that there is no mass starvation.  You mentioned COGAT.  So the coordination of government activities in the territories.  That's what COGAT is, which is like the military arm that deals with a whole range of military  issues of the IDF in the territories.  But according to COGAT, there were 66 deaths from the beginning of the war through June  of 25 due to starvation or malnutrition.  And then according to Hamas in July of 25, that number skyrocketed to 133 deaths.  And in the past, Hamas had provided the identities of those who died or the  Gaza and Health Ministry, provide the identities. And when Kogat said, well, where are  the identities? Now, you said the number skyrocketed in no time to 133 deaths  the Gaza and Health Ministry. And Hamas would not provide the identity. So  Kogat on its own went and tried to figure out the identities through news  reports or social media posts. And they only found a few deaths. And all or most  of those deaths according to Colgate were of people who had pre-existing conditions, genetic  disease, ailments. So it's not to say there's no food crisis challenges in Gaza. You  know, again, I don't want to sound like my hands are covering my eyes. There's no real  problem. Of course there's a problem. But this whole craze we've been subjected to over  the last few weeks, I at least am skeptical of and I know you've been speaking to military  resources about this too. Yeah, I have. And and this really military is now started investing  some of its prime intelligence, eight to hundred into looking at hunger and Gaza. First of all,  I should say, you know, why now we've been fighting this war for two years. The humanitarian  issue was always an issue. I'm much less forgiving in a sense than you are. I think that Israel's  decision to stop all aid and food, including baby formulas to Gaza on March 2nd that passed  underneath the radar. And I myself didn't write about enough.  But I just if you're going to say that in the dove, it's important to also say that during  the ceasefire, according to Israel, according to UN bodies, Israel had allowed something  like over six times the level of aid into Gaza that local population needed at that time.  It wasn't like they thought they were just turning off the spigot and suddenly,  God's would be depleted of aid.  There was a sense that there was a stockpiling of aid because they turbocharged a level of aid  that would last many months past the period of the season.  I don't think we should suggest that there is a just shutting shut down aid and there was overnight,  there was no aid.  I think it was terribly stupid and to some extent cruel idea and here's why,  because after almost two years of war, if you stop all aid and food to two million people during  war time and you don't tell them when the aid and the food are going to renew,  you don't need to be a humanitarian expert. You need to understand basically to be in your first  course in economy to understand that the prices of food are going to skyrocket maybe exponentially  because each day the passes you have less food and therefore the prices of  commodities are going to appreciate as you go by. But keep in mind six months of  aid was pumped in during the year but trying to assess how much people will eat.  You know if Israel wants to take control of the humanitarian issue in Gaza and  says I'm responsible for everything it's not the UN you know we're  I'm not working with the UN, I'm responsible.  Started to do that with the GHF,  but what happened is that just factually speaking,  poor families in Gaza, not only poor families in Gaza,  started paying obscene amounts of money  for one kilogram of flour.  In some parts of Gaza.  In some parts, in enclaves,  not in any charge, it's a Gaza strip.  I wanna emphasize that.  So this is an important point,  because again, there's this narrative out there  that it was all of Gaza,  and it was in even Kogat says,  it was in certain areas prices went up.  Absolutely.  And then if someone pays like $25 to $35 for a kilogram of flour and he has five miles  in his household that need to be fed, these are the prices of hunger.  This is something that people don't understand about hunger.  Hunger is always a matter of money.  People who have more money will buy food even if there's scarcity.  And this population is not being working.  There is no economy.  So to do that was irresponsible and it was because of pressure coming from far right ministers  and because of an idea that you presented that if the minutes open, first of all my approach  here is new angst.  So if the protocols of the government open, you won't see like the defense minister  is primarily saying, oh, we want them starved because it's the other way around because  Netanyahu is saying in public announcements, when he opens up on May 19, he says, we can't  have this war if the population starve. He understood this concept. By the way, this is  the concept of the Biden administration. They told this to the Israelis that right at the  beginning, if you want to find this war, you want to make sure that there is enough food  in class. Okay. You and I talked about this the other day. We can get into a whole discussion  about this. But I think it's just important to contrast with your describing with the way  This crisis was being reported in international press.  Oh, of course.  You're not gonna make me defend, you know, the New York Times photo editor.  Not just a photo editor, the headline,  Washington Post July 24th,  mass starvation stocks,  Gaza's deaths from hunger rise.  I mean, it's just, this was a flurry of headlines in virtually every  publication in the West.  So what you're describing very clinically, which I, you know,  appreciate and quibble with here and there, but is not what was projected to the  world as to what was happening. Yeah, by the way, one good example to that was the idea that  people are fainting and you know, medical staff is fainting because of lack of food. First of all,  as far as my sources are telling me, and I'm not using kogat idea of sources to that,  there is no shortage of food in medical installations still operating in the Gaza Strip.  someone actually showed me the process in which this develops.  And first you see this on Hamas channels.  Medical staff is fainting.  Then you see it on some unra groups.  Like a telegram channel?  Yeah, yeah.  Like Hamas channels are producing this.  Then you see this being echoed.  And producing what?  Making these messages.  The idea that medical staff is fainting,  then you see it being echoed on UN aid group affiliated of Palestinians in Gaza.  Then you see this finding its way to the international press.  Then you find it at the New York Times.  Again, as a journalist, I didn't check the sources of that story on the New York Times.  So maybe they did, you know, corroborate this.  They saw people, they saw pictures of medical staff.  But you know what?  There is something in this type of conversation that is minimizing what's really happening  in Gaza.  And I don't want to minimize this.  I think there is a terrible humanitarian crisis.  Why did the Israeli press start reporting about hunger in Gaza?  Because the sources of Israeli reporters reporting on Palestinian issues, speaking Arabic,  These are the most experienced people.  The talk with Palestinian sources in the Gaza Strip, they started talking with their sources  that are usually enemies of Hamas.  Speaking fluent Hebrew.  And they talked with them and they started reporting on price in the Saudi saying I'm hungry.  My kids are hungry too and I've lost weight and we're eating once a day.  And that means that you might have a problem of hunger and in certain cases you had.  Now flower was probably solved, you know, I'm ending with the good news because we're  seeing now sacks of flower left unattended.  But do you want to turn in prices is still there?  But let me just say humanitarian crisis is there.  We can debate the severity of the food crisis.  But again, to me it's tragic and a completely unforced error that Israel allowed this narrative  to lock in.  I mean, even this weekend, Nick Kristoff in the New York Times has a piece about Gaza.  talks about the killing of an estimated 18,000 children and the starvation. I'm quoting  here, the starvation of a population, the starvation of a population. This is this weekend.  Even as you say things are getting better, he hyperlinks, so I clicked on the hyperlink.  And what does it take you to? The July 24th, New York Times article that says, godsens are dying,  which has now been discredited. So we may say things are getting better. We may say things  were never as bad as they were reported, but unfortunately this line about Israel and  a forced starvation on Palestinians is sticking. And this is a huge, huge problem.  But the problem wasn't only PR. The problem is that if you're saying, I'm not going to allow  food to go into Gaza, you know, naturally after Israel sent in six months worth of food.  Again, we can debate the management of it. But yes, okay. So I'm now turning to the  casino who's an expert in messaging. And I'm serious now, okay. The Israeli government  would turn to you and would say, look, we've decided to stop all food and aid into Gaza,  beginning on March 2nd, because Hamas doesn't agree to our terms to end the war.  This is basically what Israel's cabinet said.  Now you message this down in a way that it won't be starving the population.  Israel does not explain its policies, many of which I think are sensible, obviously, but  I think they do themselves enormous damage, but not explain the policy.  If they had said what we now know, which is when they put the freeze on aid in, it was just  after they had flooded Gaza with six months of aid.  They should have been messaging that to the Palestinian population.  You have six months of aid.  They should have been messaging that to the international community, but they don't do very  much messaging to the international community, which is a subject for another day.  But I'm not saying that the policy was right or wrong.  I do think it could have been contextualized.  And that said, Nadav, that doesn't absolve reporters  from not just relying on Hamas telegram channels.  Okay, there's six months worth of food in Gaza.  Let's say this is the case and they would have said that.  So what's the reason to stop the aid?  Yeah.  What did they expect would happen?  You know, this was an announcement made  if by the cabinet, I think by the prime minister,  why would you substantively do that?  if it is not to pressure Hamas.  And if you are pressuring Hamas through usage of food,  you will be accused in starving the population.  And I'm saying this to myself as a journalist  because I should have called you up then,  when this decision was made.  And I should have said, hey, then,  I think that this will just made an incredibly stupid  and potentially dangerous human-attourily speaking,  decision that's discussed.  And I didn't.  And I have to tell you, you know, I keep thinking about that  because I think that this is the type of terrible mistakes  that are made through terrible wars  of the sort that we are fighting specifically  when you're fighting this kind of enemy like Hamas.  And this is always the danger that Hamas  is gonna drag you down and to quote Gidelsar,  the Israeli Foreign Minister a week ago,  to drag you down to the black hole.  And I would say the black moral hole  the Gaza Strip. Okay, so let's take the ante. You don't start our position. Imagine in two or three  weeks from now, we're doing an episode in the dove on a new hostage deal. Will we say, will you  say, you know, the military pressure that Israel cranked up against Hamas and Gaza city,  Hamas's Berliner Moscow, the thought of losing it and losing control of it completely terrified  Hamas and they went back to the table and they realized despite all this pressure on Israel  internationally that we've experienced over the last few weeks, which Hamas thought gave them  enormous momentum to the point that they could walk away from talks on July 24th. Suddenly,  they ran back to talks because they realized they overplayed their hand. And Israel didn't care  was not worried about the pressure and was going to go take Gaza City regardless. And Hamas came  back to the table and got a deal. Will we say, will you say, you know what, this whole build up about  the operation to Gaza City served a useful purpose in bringing Hamas back to the table?  Yeah, absolutely. I will say that I am saying this today.  You know, I don't see myself as an expert for warfare or negotiating with Hamas.  What I see myself as someone who speaks with these people and what I'm hearing is constantly  the same thing from the people who want to get the hostages back. They're saying you can do this  without having some pressure on Hamas on the military level. And the problem is now, if they're honest,  is that this pressure could also lead to the deaths of hostages.  But if you will have no pressure, they're going to drag the negotiations forever,  like they did with Guidad Chali and the rest. Now, this is what I'm hearing from the professionals  there. What I'm hearing from the hostage families, and I want to give this some airtime,  is what are you talking about? And the war, get an agreement with Hamas.  Anyway, you're negotiating a ceasefire with Hamas. And then fight Hamas in another day. And this  position is not a fringe position. That's the position of the Israeli public. I just published  a JPPI poll on my column this Friday. And we keep asking more and more extreme questions. They are  asking extreme questions in their phrasing saying Hamas would remain in Gaza.  Nadav, so what is the poll say when you ask the question, if Israel does a final deal and ends  the war gets all the hostages back, again, assuming all this can happen so easily. I'm skeptical,  but let's just say it does. Hamas agrees to end the war. All the hostages return, and Israel has to  fight Hamas another day in the future. What is the polling show on that? Let's just take the JPPI poll.  So it shows that there is a majority within the Israeli public. I can pull out the numbers,  the latest numbers. Yeah, pull it up. Pull it up. I'm quoting the question from the JPP I.  Paul, the Jewish people policy institute, which is a nonprofit organization nonpartisan. Yeah.  So what's the right thing to do in Gaza? And I'm quoting, I'm translating as I go by from Hebrew.  So, you know, if you see descriptions, sees between this and English, it's because I'm translating  from Hebrew to try and get an agreement and returning the hostages. Even if this means that the goal  of deposing Hamas from the governance of Gaza has not been achieved 54% of the Israeli public.  To continue the war until all the goals that were said were achieved, meaning no Hamas governance in Gaza and all the hostages come back home, 37%.  Don't know 9% and by the way, do you support or object delivering humanitarian aid to Gaza?  The entire population supports 53%  Oppose 32% don't know 15%.  That's a JPPI poll. What was that last number? The majority number?  54% try and get an agreement on returning the hostages even if it means  that the goal of deposing Hamas from the governance in the Gaza Strip is not a cheap.  54%.  Yeah. You hear in that number a majority mathematically correct.  I hear in that almost one of every two Israelis is opposed to that.  But they were asked about the other auction is 37% then.  The other camp is much weaker than it's not like 50 50.  Okay. Bring it down to 37%.  So say almost four in every 10 Israelis.  And that's the entire population.  I'll add another argument.  And that is that if you measure how is it in the Jewish population in Israel, it's about 5050.  Right.  So I hear all the time from my friends, you included that the overwhelming majority of Israelis  want the word and even if it means Hamas stays in power, the overwhelming majority of  Israelis want the word and even if it means having to fight Hamas again.  And I'm just saying, you're right that it's a majority, but it's not overwhelming, which  Which means Israeli society is actually deeply divided on this question.  Mika Goodman made the point recently on our podcast that Israel is about to go into Gaza  city with this very intense operation while Israeli society is so divided on this question.  And his point was very hard for Israel to do what it's about to do when it's army is  exhausted when there's international backlash, like at volume level 11 against Israel and  Israeli society.  So divided that the great wars and the major military successes in Israeli history have been  when Israelis are united.  And I get that and we can debate that.  But the corollary to that is also true, making a decision to end the war, a defensive  war against an enemy that executed upon an existential threat against Israel and to leave  that entity in power, Hamas, and hope that you're going to be able to fight them again,  maybe, maybe not. Sounds eerily familiar in the past when Israel said, don't worry, if  Hamas is a problem, we'll go deal with them. And do that when a huge chunk of the population  is saying, we're not on board with that either. It's also dangerous. In other words, I  could make the mica argument. It sounds like it's your argument that you can't go do  this major military operation, but the country's so divided. That's a big decision to  to make with the country so divided.  It's also a big decision to effectively  keep Hamas in power while the country so divided on that too.  There's a huge swath of the population  that is not okay with that.  I agree.  It's a very mixed opinion and that's true.  I do think that the difference in the examples  that you just gave is that these really public  gave the government the time together  with all the supporters of Israel around the world,  including the Jewish community in America,  to get to some sort of resolution of the Gaza conflict.  Because the cost of the war to Israel is until now assessed as 330 billion  checkers. And it's a small country.  That's the reason, by the way, why modern nations lose or win wars.  And this comes together with our other elements.  For instance, the hostel element that really limits the IDF operation in Gaza.  This is something that I think people don't understand.  If I would have shown you the map of Gaza today,  where the IDF is operating,  where it isn't operating,  it aligns where you have hostages.  And again, this is because of the orders of the government,  not because the IDF is obsessed about the hostages,  but because it's the government that said,  you have two goals here.  So the IDF is trying somehow to win the war against Hamas,  while having hostages.  And the argument isn't, let's just let it go. Hamas is going to control Gaza, they're going to  rebuild. No, presenting this as a binary, I think is the mistake. The argument is sophisticated  argument that you hear right-wingers like Bennett pitching. And of course, he's a position,  he wants to be the prime minister and everything. What he's saying is, let's get the hostages back.  Let's get a deal and we're going to fight them another day and this is going to be a long war and it's  going to be a long struggle to get them not really in control of the Gaza Strip. Now all the  agreements today and we have had this conversation all the understanding in the region today,  Egypt, the UAE, even Qatar is that Hamas is not going to formally control the Gaza Strip.  The argument against this is the prime minister is saying I want Hamas also to this arm  and to the entire Gaza Strip to be completely demilitarized. I really don't  know how you can reach that in an agreement. The only way you can reach that is  with a full occupation of the Gaza Strip including having a soldier in every  street clearing every house and all the rest. So you're making a demand that even  if Hamas agrees to they're gonna cheat, they're gonna lie and it's never gonna be  met by an agreement. It doesn't make much sense and also the question is do  you agree with the SAR assessment, the Foreign Minister's assessment that whatever you're  going to get in Gaza, strategically is less important than the damages you incur right  now internationally. And what I sense from you from what you're saying is that you don't  agree. You think that we can still get something in Gaza that will be more important than  the continued damages. I have friends and friends of family that are being called up right  now for this operation. So the idea that soldiers are going to keep fighting and dying in  Gaza to me is it's unfathomable actually. I also think that those who have this abstract  notion and it feels very abstract to me of how we just end the war, how Israel just ends  the war and ends the war and brings all the hostages back and somehow Hamas's control of  Gaza ends in that process too. And oh, by the way, Hamas is disarmed in Gaza. And then  there'll be a nuisance in the future and Israel will have a basis upon which to return  and take them out. I just don't think it's going to be that simple. Hamas is smarter  than that, whatever conditions for an end to the war that they agree to are obviously  going to have this exact scenario in mind that Israel is going to try to come back to Gaza.  And I think the international community that will not want Israel to fight Hamas again in  the future under any circumstances will contribute to creating conditions that make it very  hard for Israel to take action against Hamas again.  So in that sense, Nadav, I'm sympathetic to the many Israelis reflected in that J.P.P.  I poll and not saying I agree with them on every issue.  You know, I'm just saying, but the general sentiment, I do understand that sense, like  this war was started.  We need to finish it to the extent that we can finish it and we're not going back.  We're not going to fight Hamas again.  We're not going back into Gaza again, meaning not only will we not have the will for it,  the world will not let us do it.  So this is it.  This is our shot.  I understand that sentiment.  And what I guess I'm more frustrated by is not whether or not I agree with that sentiment  or not, because I understand there's some holes in that side's argument too.  I'm just struck by the monolithic ubiquitous press coverage coming out of Israel, at least  in the English language press coverage coming out of Israel.  That presents one side of this debate as the only side that is reflective of where these  really public is.  That's what frustrates me, actually.  And I don't think that reflects reality.  I agree.  It's always the case when you have an absolute majority.  And in Israel today, you have an absolute majority that prioritizes getting the hostages  back home.  And we started with very vague questions.  There was a lot of criticism against pollsters that they were not asking the right questions.  Now they're asking the most extreme questions that are tilted the other way.  You know, because Bennett isn't saying, and we're going to allow Hamas to be there.  That's not the plan. That's not what the idea is saying.  Look down. I started speaking about the IDF and the defense officials position  that you need to end with Gaza and advance to the north and to Hezbollah.  When on your show, it's about February 2024.  Now, since then, many, many things have happened in Gaza.  They were essential.  Like taking care of the tunnels, killing Yahya Sinwar, maybe going into Rafa.  But again, you need to see this on both sides.  Israel's founding fathers always understood, you know, Ben Gurion said, Umm Shmoom, U.N.  is nothing, right?  But he never thought that.  He never acted like that.  That was for domestic consumption.  Israeli politicians have dragged the cool aid and they now really believe that they can  go on with some sort of disconnect with what's happening abroad. And I think that the Jewish  community everywhere sees this. And I'll give you one example that's going to shock you.  Okay. I spoke with local politicians somewhere in Europe and he told me and I hope, you  know, it was just something he said, but I'm going to quote it. He said, if it goes like  this, and this is not a person who's against Israel, you see demands. So in every town  big city in Europe, you know, there's a Holocaust memorial, right? They're going to have  Holocaust memorials for the Palestinians in Gaza. It's just a matter of politics. You have  the constituency there, right? You know, and we spoke about this trap on your show about  how the Palestinians are seeing this and we are advancing quickly to unilateral recognition  of Palestinian state. I know. So if someone who's a right winger like Gidun-Sao who voted  against the disengagement in Gaza in 2005, unlike Prime Minister Netanyahu at the time,  nobody can doubt his allegiance to Elitesh Leib, or Bennett who also is more to the right  the Netanyahu are saying we're bleeding right now.  In China, actually speaking, internally speaking, maybe it should be considered.  Now, after saying that, I need to be, I try to be honest about these issues.  I can see the argument saying, if we stop now, you know,  considering the damage and the criticism against Israel,  you'll never be able to renew it even if Hamas rebuilds.  Because there is going to be such coverage of what Israel did in Gaza.  But that's the kind of argument or the slippery slope argument of someone who goes into the casino and loses a thousand bucks and then say, I've already lost the thousand bucks.  And I lost my home. So maybe I should take a mortgage and lose the rest.  You need to be rational about this. I'll give you one example.  The government kept on saying, we're not going to sign a full pledge deal to end the war with getting all the hostages back up.  We're not going to do that because Hamas is not going to agree to our terms.  And this is the reason we have a phase deal, a wheat cough kind of deal.  It's going to be like two sections of a deal, two phases.  Right. Now the government is saying we're not willing to consider a phase deal and more.  So what do you account for that change, by the way?  That the government is now saying they'll only go to final deal?  First of all, I don't know if I should believe it.  Secondly, the deal that was signed that Israel decided, you know, when it decided to resume the war and it decided to resume the war,  The deal that it signed was a deal to end the war to begin with. It was never only an  intern deal, right? It had two phases. So I don't understand the statement to begin with.  It sounds like, and this is what Netanyahu critics would say, this is just an  excuse to extend the war. Now he said, I want to have only a phase deal. Now he's saying,  I want to have a full deal.  But Nadav, I think you and I both agree based on our respective sources that  that the Netanyahu government or not any of himself wants to deal.  He wanted to deal.  He was ready to do a deal in July.  Something's happened here where he's...  I think he wants to deal.  I think I've said that on the show.  And this is, by the way,  this is in opposition to many of my friends  who are demonstrating right now  as we are speaking in the street.  First of all, I don't think Netanyahu wants the war  to last in eternity.  I don't think it serves them.  I think what serves him is to win the war to the extent that he can sell to the Israeli  public that the threat isn't there anymore.  And the threat is going to be there.  But as a politician, I think getting the hostages back is as interest.  I think after the Iran war was a prime political interest to get a hostage deal.  What really happened is that Israel paid a very heavy price for an incredibly stupid and  to some extent cruel mistake.  It made back in March.  And Hamas was using it.  Now the question is will military pressure now lead to a deal or will it lead to more criticism  of Israel that could actually lead to lose the war? Will it kill the hostages and lead  Israel to lose the war not only internationally but actually or will it push Hamas again to the  negotiating table? And I have and this is the good news I'm going to end with the last 48 hours  we're seeing assessments in Israel by intelligence sources and by others that there is movement  as to a deal. And that Hamas is now softening its demands coming back to the table.  I don't know if it's softening its demand or Israel that by the way,  Israel took back its delegation from Qatar at the time. But I don't know who's softening right now,  but it seems that the mediator is in all the rest. And maybe this also has something to do  with the administration. And here's an important message. If we want to have a deal, we need to have  a constant pressure of the administration to get that deep of which administration of the  American administration. That's essential. If we didn't have Steve with cough coming to Jerusalem  and to Qatar, but pressuring at the time of the time of the year, we wouldn't have the previous  thing. I think everybody can agree on that. If we didn't have with, of pressuring Hamas, we wouldn't  have that Dean, if we didn't have Bill Burns who doesn't get enough credit, actually  manufactured that Dean that was, you know, pushed beyond the, the online by the Trump administration,  we wouldn't have a Dean. And Brett McGurk, Brett McGurk deserves some credit. And Brett McGurk,  and we need, we need that to happen. And that's, that's crucial now for Israel and for Israel's  allies, you know, to be assisted by the United States. But in the death, we often talk as though  Hamas doesn't have agency. I mean, look at this conversation. We had like 95% of this conversation,  which is though Hamas doesn't get a vote, our conversation right now. So what is Hamas doing?  Anticipating this military operation into Gaza city and preparing for it. First of all, Hamas,  according to the assessments in the idea, has been preparing to the idea of invading Gaza city.  And why we are speaking, there is a chief of staff meeting and in the room, material is  has been presented as to how Hamas has been preparing itself.  Secondly, there is within Hamas a discussion,  an argument between Hamas in Gaza,  led now by a man called Hadad,  who's the regiment commander,  or the battalion commander of Gaza city,  that was one of the people who were preparing October 7th.  The last one, the high echelon of Hamas  that is still alive in the preparation of October 7th,  still alive. And he's now preparing the defense of Gaza city. And he was pushing Hamas and  Qatar in other places. People like Halilah Hayah and others, not to agree to a deal, which  is amazing. If you think about this, because it's Hadad who's in Gaza, seeing hunger,  seeing the humanitarian crisis. And he's not the man who's saying, yeah, we need to get an  agreement. He's the man who's saying, don't get an agreement too quickly because we're  standing because Hamas really doesn't care about the local population. It's really a monstrous  genocide organization. This is what it is. It's absolutely the case that Hamas was making different  demands. Hamas was distancing itself from understandings that were already made in the negotiations.  And they did that because they saw that suddenly their international campaign is working.  And that's one of the reasons that we still do not have a deal.  All right, Nadav, we are going to leave it there.  We are going to pick up later this week,  because you and I are doing an episode.  You're made in voyage on inside Call Me Back.  So after every time you appear as you referenced earlier,  I get these irate listeners,  then they send me these very hysterical comments  about something you said.  And now's their opportunity to submit their questions.  and they can act, you will actually have to face their questions rather than just fetching  to me, which is what they do.  I'm tired of being fetched at on your behalf, so you can now submit your questions to  Nadav, because we are going to have a very informal, perhaps heated, perhaps not.  We'll see how it goes.  Conversation later this week.  So if you're not already a subscriber, please go to arkmedia.org.  That's ARKmedia.org to subscribe.  And I guess I said, Nadav, I'll see you later in the week.  Okay, it was a pleasure.  Thank you so much, Dan.  Thank you.  That's our show for today.  If you value the Call Me Back podcast and you want to support our mission, please subscribe  to our weekly members-only show inside Call Me Back.  Inside Call Me Back is where Nadav Aala meets Segal and I respond to challenging questions  from listeners and have the conversations that typically occur after the cameras stop rolling.  The comic back will come out every week as an extension of the Thursday episode.  To subscribe, please follow the link in the show notes or you can go to arkmedia.org.  That's ARKmedia.org.  Comic back is produced and edited by Elan Benatar.  Arkmedia's executive producer is a Dom James Levin already.  Sound and video editing by Martin Wiergo and Marianne Kalis Burgos are director of operations  Mya Rakoff.  Research by Gabe Silverstein.  music was composed by Yuval Semo. Until next time, I'm your host, Dan Sino.",
  "created_at": 1755531173
}