" If you are feeling weird or if something is feeling off, go to the doctors.  I go, hey, to be like seven or eight years down the line and they're like,  yeah, you're pretty much cooked.  The sad part is I didn't get to have a farewell tour.  It's a gluten.  I wanted to do like a farewell tour.  Oh, what a bet on the tour.  Oh, freshly glazed don't out from Looney because I used to get it every Saturday.  This is a ton of changes.  This is such a net positive.  It's unreal.  That's the easiest drink I've ever had in a drink.  It's like warm salt water, but they fill it with electrolytes.  One day, I'm like, oh, my throat starts like closing up.  No lie.  I'm like, what the fuck is happening?  I'm like, well, should I be dead by then if I keep waiting?  March and I told you September.  Yes.  What the heck.  I was eating gluten and it was stopping my body from absorbing the iron in the nutrients.  I also found that I get into national parts for free.  Oh, what?  In the world.  So you're definitely going to be laughing.  That's for sure.  Well, I'm going to lose this monitor.  There's no doubt about the...  Well, I sent you the outline, so I mean, you know what we're going over, right?  Yeah.  It's just, how do I prep?  I did that prep for this.  What would you have done if you could have prepped?  What would you have wanted to do?  Think of how I'm going to answer the questions.  The same a test.  I know.  You're telling a story that you lived.  It's in there.  I know what it's like.  If you think about a prior, like, you just...  I don't think it would make things better.  It's probably what.  Yeah, because you'd be like, oh, this is what I said when I thought about it.  We're not saying that now, you know, that won't make any sense.  If I wouldn't make it any better.  Probably would not.  I'm just scared.  You don't need to be.  Why?  But it's not unusual.  We do sponsor, like, with Death Ron here.  And my, he has already cracked his whole...  I hope I'm already...  She was so excited about that.  That, like, with Death.  It's actually pretty good.  Yeah, it's good, isn't it?  That's what I'm saying.  I say all the time, but it's smooth.  Yeah.  It actually is.  I've been drinking my...  Essentially, an alkaline water.  It's probably not doing anything.  Well, you know, alkalinity is interesting.  You know, that's one of those mechanisms that's very tightly regulated.  Yeah.  So it's hard to influence it because it's so important that it just doesn't move around that much.  You know, your body knows what it's doing.  Exactly.  So I probably should just drink regular water.  I don't know who knows.  It could be doing something long term, but...  It's only to drink a grass or roof looks.  It's fine.  I hope.  I have no idea.  I have no comment on that.  My...  What were you born again?  July 26.  94.  94.  July 26.  That's like the...  A month after I graduated high school.  Yeah.  Most of it that...  Come on up on 31.  You're going to be 31.  Yeah.  Oh, this month.  Yeah.  Yeah.  Was 30 half-human, silly.  Yeah.  What about it?  Yeah.  Just all the things that was going on health-wise.  Yeah, you were dealing with the silly at that time, right?  Yeah.  When did you like...  When did you figure it out?  When was that?  How long ago?  Well, everything started happening the month of July.  Oh, really?  So it's been about a year.  Almost a year, yeah.  All right.  Let's not get ahead.  We'll get into that.  I was so 39.  My, he all stood in here.  We're going to be talking about silly act.  I'm interested in not, you know, silly act disease.  I'm like, okay, yeah, it's a disease.  I didn't know that it was an actual disease.  I thought that...  Because people have gluten intolerance.  And, you know, that can give you a little brain fog.  It can mess up your digestion.  Whatever, you've got a gluten intolerance.  No big deal.  And I just thought like silly act was just an extension of that.  I mean, it's a high or up on the spectrum or whatever,  farther along in the spectrum.  But it's actually into a disease state.  Yeah.  Right?  I had no idea.  It's a legit thing.  It is a legit thing.  And I thought, well, you know, I didn't know it.  So I'm like, let me do a little history.  I thought that's what I would do.  I'll read, I got a little history for us today.  So that'll be fun.  But I'll line a topic today.  Mahi, so you know.  Okay, so I know.  Yeah, she didn't get to practice.  I did not practice.  That's what she kept saying.  I'm not practicing.  I'm not practicing.  I don't know how you'd prep for your own story.  Whatever.  You could have wrote it down, you know.  Yeah, but I didn't want to bring a note like in here.  Yeah.  Yeah.  What's happening?  It'd be clunky.  It'd be weird.  If you totally clunky, then nobody would like that.  I'll line a topic today.  We're going to go.  We're going to do a little silly act history.  I've got to read off some, I've got some Google AI.  We're going to read that off.  We're going to go into your background first.  Basic stuff.  Where'd you go up and all that?  That we're going to go discover in the silly act.  And I want to hear about that process of like, you know,  the symptoms and all that stuff.  And what was the day of like?  And I know you spent like, well, I'm getting ahead of myself.  How's life different now?  Okay.  Right.  So pretty basic.  And I think I see this out there, right?  It's like, who are you?  What's your background?  What was the day of and the process like figuring this thing out?  And then, you know, what's life like now?  So no big deal.  We'll be done in two minutes.  Close, and I'm kidding.  Close out.  Close out.  I'm going to close it out.  My hands are like so heavy.  Yeah, it's warm in here too.  I don't know.  That's good.  That's good.  That's good.  Oh, yeah.  Also, if you guys don't know, if you're familiar with  Jackal Hyde.  Yeah, I feel like I've seen you wear it a few times.  Yeah, yeah.  Yeah.  They're a local Livonia apparel company.  Oh, really?  And so I figured, you know what?  I might as well sponsor them too.  Yeah.  So I've been buying.  Should have sent me the link.  I would bought a t-shirt.  Dang, anything of that?  Dang.  You know what?  I should do is give you a shirt.  Yeah.  Dang.  So these guys are based out of Livonia.  Again, I say this, I've been saying this past couple of podcasts, but they're like, they're  more extreme fitness apparel, right?  So power lifters, Olympic lifters, crossfitters, you know, strongman at type.  It's not like, you know, yoga and soup and all that stuff.  You're not gonna see someone.  Yeah, you're not gonna see Jackal Hyde at the Pilates studio  on the reformer.  Hey, you did stuff on that Pilates.  Yeah, you know, I wouldn't feel it.  It sounds like I made the right call.  Yeah, you did.  Nothing personal.  This I've done Pilates.  You know, I worked a lifetime for 10 years.  And they would periodically would make you go  and do all the stuff that they offer.  Yeah.  So you have to go to the yoga, you have to do the Pilates,  you have to do the group of in this class.  You have to do all these things.  And so I don't know.  I just didn't like the Pilates like just blasting my stomach  for an hour.  I think they were just too strong for it.  Oh, yeah.  It wasn't really that intense.  Well, do you say it was like it was really entry level  what they did with your guys?  Yeah, it was.  Like really entry level.  Yeah.  Now I'll turn up the resistance on hers.  Did she?  Yeah.  You guys had fun though, right?  Yeah, the group was fun.  Yeah, for sure.  So you ready for some silly a case?  We do know silly a history.  I do.  I do.  You do.  Do you know it like this?  Yeah, most of it.  Oh, check that out.  I had to look up on it.  Yeah, for sure.  I'm a researcher.  Yeah, you dug in when you found out.  I had to.  I'm like, hey, you slept as diagnosis on me.  I got to figure out what it is.  What's going on?  Did you Google AI?  What did you do?  Well, well, I did Google at first.  And then I run like bunch of articles.  Weird thing.  I went to acupuncture.  It was in one of the articles.  I acupuncture too.  So I was reading about that.  Some other doctors did some research on it.  I have to talk about that.  I want to acupuncture day.  What I think is doing.  Apparently you can try to reverse it, but I don't know.  Huh.  Actually.  Yeah.  We can maybe chat about that.  I mean, I know.  Why now, let's see.  I've heard of being able to reverse some autoimmune.  Yeah.  I feel like disorders with some stuff.  Yeah.  Which can make some sense.  It's hard to change something once body gets into a disease state.  But I mean, the good thing for you is like, even if you can't or you're not able to,  it's an easy fix.  Yeah.  Stop being gluten.  That's the number one thing.  You know what I mean?  So stop being gluten.  You're good to go.  So let's cover a little silly.  A history for people listening that might not know.  Google AI says celiac disease was first recognized as a distinct ailment in the late 19th century.  Samuel G.  G.  A British pediatrician provided a clinical description in 1888.  However, the understanding of the disease and its triggers has evolved significantly over time with key advancements occurring in the 20th century.  And then it's got a cool timeline here.  Ancient times.  I can't say this guy's name for the life of me.  The Greek physician.  Are tas of Capricornia?  No.  How do you say that girl right there?  Capidocia?  Yeah, maybe see a.  Capidocia?  Okay.  Okay.  The Greek physician or radius of Capidocia described a condition similar to celiac disease in the second century AD.  Yeah.  That's crazy.  Crazy.  No, it doesn't say nothing about a banana.  Oh, you didn't get that one.  No, you have to fill that in, David Attica.  So I mean, that's crazy to think that one.  How did the act as Google AI pick that up?  Yeah.  Like it just searched the entire internet and found that.  And then oh, this is relevant in total.  It's getting scary.  1888 Samuel G.  N.  London described the condition in children, noting the link to chronic indigestion and wasting.  1924 Sydney Haas, an American pediatrician identified  carbohydrates is a key dietary factor.  So things are starting to get narrowed down.  1930s William Dicky, the ICKE, a Dutch pediatrician observed that children with celiac  disease improved when wheat was removed from their diet.  1950s and 60s further research identified gluten as the specific component in wheat that  triggers the disease and the connection between celiac disease and autoimmune disorders began  to be explored.  A couple more timelines here.  1970 and 1990 celiac disease was increasingly recognized as an autoimmune disease and the association  with other autoimmune conditions like type 1 diabetics became more widely accepted.  And lastly, 2003 beyond celiac and organization dedicated to celiac disease awareness was founded.  So that's the history.  Now what's what's this banana?  They're trying to figure out like what kind of triggered it.  And I guess they found out it was wheat, but one of the doctors made patients go on like  a banana diet, like eating bananas like three to four times a day, but they discovered like  there's no nutritional value.  That's all they were eating.  All day.  Oh my goodness.  What was this?  Oh my god.  I think that was like the 1800s.  Oh way back.  And then they thought like, okay, let's eat the bananas and then in a few months or like  maybe a year or so we'll reintroduce wheat.  The symptoms subsided, but the minute they ate gluten again came back.  So.  That's the wrong button.  That's it too.  Glued.  There it is.  That's the one looking for.  The banana diet.  So eating bananas breakfast, lunch, dinner, snack.  They thought, oh, it's cured.  Yeah, there was no cure for it.  You just took away eating the gluten, but the minute they were introduced in the back,  the symptoms came back.  So that was a big clue.  Yeah.  I guess prior to that, they were thinking, what the heck were they thinking?  Because we understand exactly what's going on.  The gluten and the food is causing the trigger, but they didn't know that.  So what's he thinking with just bananas?  Why would he think they cured it?  Yeah.  I mean, it didn't do anything.  Yeah, obviously from our perspective, hindsight is 2020.  Interesting.  That wasn't on there.  No, really?  Google AI dropped them all.  Banana.  What are you going to do?  Banana.  Banana.  Banana.  Banana.  I'm gonna do it.  Anyways, don't do it. It doesn't work.  Doesn't work.  All right. Where'd you grow up, girl?  So I grew up in Westland, Michigan.  That's why I grew up.  I went to...  That's right.  Yeah.  When you went to Siri Heights?  Yeah, I was on Siri Heights.  Oh, my God.  My parents are still there.  That's crazy.  I went to Pearl Dewey, PD Graham.  Is that what that stood for?  Yeah, yeah.  I never knew that.  Wait.  Hey, I just always called a PD Graham.  I didn't know it actually stood for anything.  Pearl Dewey.  Who's Pearl Dewey?  You don't know either.  That's as far as you know, huh?  Let's go, PD Graham.  That's our elementary school.  Yeah, yeah.  I rode by the other day and I was like Pearl Dewey.  My goal was, who's that?  I'm like, PD Graham.  I never knew it was called that.  Yes, it's Pearl Dewey.  Did you know that between the P and the D,  somebody spray painted a U-1 time?  What?  It was a pod Graham.  That was awesome.  That's awesome.  I love that school.  It was a great elementary.  It's a great experience there.  You guys don't know my,  he's a teacher.  Yeah.  What grades are you teaching or grade two seconds?  So you're an elementary school teacher.  So from your perspective, PD Graham  is a great elementary school.  It's a fabulous.  I love that school.  What about it?  Teachers are great.  Curriculum that we were being taught.  Great.  Just overall, like learning environment.  Kids were good.  Good neighborhood.  Parent.  We had a lot of parent volunteers,  a lot of field trips.  It was just like an overall like very good experience.  Was that your first teaching job?  No.  My first teaching job was actually at Hamilton  in Westland, another grade school.  But in my opinion, PD Graham's the best.  PD Graham takes the cake.  Yeah.  Even when I was a kid, it was great.  That's, yeah.  I mean, what do I know as a kid?  Yeah.  I had a good experience.  Yeah.  Actually got held back and first grade.  It does account.  It doesn't count.  I don't know why because my memory is a lot better than it was,  but it wasn't great.  So they hung me back the first year.  But I had just kind of got it the last month or two.  Yeah.  And so when I came into the first grade again,  I was like excelling me,  and now was advanced.  Yeah.  And so I caught up by third grade though.  It doesn't matter.  And if you can held back and like cake,  I feel like K through K through two, really.  really?  Yeah.  Because I really know the difference.  It starts to get tricky and weird when you get like,  oh for sure.  Or it's because I'm doing like,  Yeah, because there's way more where what just happened.  Yeah, exactly.  Yeah, I was just like, yeah, whatever.  I was going to crack a jug of my heart.  I've been scarred my entire life.  But I'm not.  It didn't bother me at all.  It didn't bother you.  It didn't bother me at all.  Actually, I don't know if this is just because this is my brain  did, but the kind of people that moved on, I actually  like the people, the new people that I was with better.  Oh, yeah, yeah.  You know, I just remember that.  Like, yeah, this is like a cooler group of people.  Like, I remember seeing those people always a year ahead  of me, what I never really did like you.  It was a better group.  It was a better group.  I'd better one back.  We were vibing better for sure.  For some years.  I'm like, yeah, I'm not really vibing with this group.  Totally.  I was just doing that for sure.  For sure.  For personalities clash.  And it's just like some kids don't get on board.  It's just, it's all a jug of each year's different.  Every year's different.  Yeah, yeah, yeah, yeah.  One of the years, I almost took me out.  That's why I don't teach summer schooling more.  Well, you're was that.  Oh, that was two years ago.  That was a rough year.  What those kids don't listen.  It was a rough.  I had 18 16 boys.  What does that mean?  That doesn't mean anything.  When I was in, when I was in, it was like 28 to 32 kids in a class.  What does it now?  So I had 25 total 16 boys.  I think eight girls.  It was just like, it wasn't, the kids weren't bad.  Like the, the group of kids were not bad.  It was just boys being boys.  And it's like, I don't mind that at all.  Like I let kids be kids.  That group was just like, every day they wanted to like jump off the chairs.  Or like we do a go new.  I got someone kicking someone during the go new.  Someone trying to grow a chair.  Yeah.  What's that mean?  Brain break.  Kids go crazy.  They can break.  Oh, they just get to go crazy.  They get to go crazy.  And then you expect them to go back to normal.  I mean, it makes sense.  Yeah.  And then they would just get like, puck while they're gonna go to it.  That's it, man.  Only the boys though.  And I'm like, hey, man.  That's what boys did.  So it was a rough year that year.  Mm.  Go noodle.  And it was just, it was just a rough.  They were a really good group though.  Yeah.  I enjoyed that group.  It was just a lot of energy.  Yeah.  Yeah.  Yeah.  Yeah.  Yeah.  Yeah.  That makes sense.  So school teacher, you grown up, you know,  common questions.  I like to ask you, did you play sports growing up?  I did.  I ran track and volleyball.  What you run on track, you short along this.  Short.  You were short.  How short?  Like 200.  200.  Oh, I did it up until 10th grade.  So how many years would you say?  I did all through middle school.  So six, seven, eight, nine, 10.  So five.  Five years straight, run it fast.  Yeah.  I only like, just short distance.  Yeah.  You know, were you good?  Yeah.  That's like pretty decent.  Middle of the pack.  Yeah.  Middle of the pack.  You remember your times under 200 meter run?  No.  I wish I didn't remember those.  I had to be like, I don't even know what,  30 seconds, 40 seconds.  It wasn't, it wasn't that long.  Yeah.  Yeah.  I remember running it like as fast as I could with the baton,  like handing it on.  The relay.  Yeah.  Yeah.  Yeah.  That's got to be fun though.  I don't know why I stopped.  Should have kept going.  Yeah.  You never know.  You know, so you did track anything else?  Volleyball.  Volleyball was like three years.  And then I was like, all right.  I don't know.  I just kind of just stopped.  You bump in or spike in?  Oh, I did the bump.  And then the last year I learned the spike.  The spike is tricky.  Yeah.  It's a lot of time.  It's tricky.  You're going to hit it like hard over there.  As you could.  Yeah.  Plates the same Volleyball a year.  I don't remember one of that one.  What was that?  A whole summer after, wasn't after I graduated.  It was after I graduated.  When we and this kid, Ryan Baker shot out,  we got really good.  We played every day.  And I remember these kids that were in college came.  It was two on two, Sam volleyball at the Westland.  You know, they get that little recreation area?  Oh, yeah, yeah, yeah.  Yeah, they're the hit Sam volleyball course.  We're up to every day to beat these guys.  I never forget that.  Like, you just beat some college players.  Probably so good.  You know, I never played Sam volleyball.  It's a blast.  It's so good for your feet and calves too.  Like just movement is incredible.  All right.  So you, you ran track, you played volleyball, anything else?  No, I did cheer for a little bit.  Oh, yeah.  Yeah.  And I was like, all right.  You good on that?  Yeah, I was good.  I was good with cheer.  And I was like, all right, I think I reached my threshold on this.  With sports in general.  Honestly, I don't know why I stopped sports.  No real reason.  Just kind of was like, maybe you were getting tired  and you hadn't had celiac was already kicking in.  Who knows?  And we got to get into that.  Could have been.  Could have been.  Could have been.  When you were still, you know, it would have been 10 years ago.  10ish.  Yeah.  OK, so what was your food environment like growing up?  Oh, OK, food.  I've always done a very like, picky eater, very lots of fruit,  lots of vegetables.  I could go days without meat, honestly, even though it  doesn't really like bother me.  Not really a big red meat eater.  Always like chicken, turkey, not a really a seafood eater.  And this was your household growing up.  My dad's fruits, vegetables, meats, proteins.  Yeah, my mom and dad are across the board.  They eat like fruit, veggies, all red meat.  So you were.  It was just meat.  I was like, yeah, really over.  But there wasn't chips.  There wasn't pop.  There wasn't donuts.  Yeah, there was.  There were sweets.  No pop, though.  We weren't.  We weren't pop either.  We weren't allowed to drink pop.  Yeah, milk.  Yeah, it was milk.  Milker or I was not even juice, really.  It was like milk or water.  Yeah, we didn't do juice either.  It was milk or water.  And it was never water.  It was like grab the gallon of milk, kind of disgusting.  It would straight out the gallon.  Just straight to the dawn.  It's pow.  I am like to this day.  I'm playing my dad.  I pulled my neck and when I was like eight years.  You're not about the gallon.  You made me get the milk and I'm about the fridge  and it like, oh, my arm down.  I went to school.  Went to school, could not turn my neck  and to go home and a neck brace.  I think we're in the hard to see room.  Yeah.  What'd they do?  Just put the brace on.  You tell your girls.  I'm pulled the muscle.  I was pissed because I had to miss a gym for like a week  and a half.  A week.  Yeah.  Apparently my dad literally goes, I didn't have it.  I'm like, it really happened.  It's been heaven.  They all milk weighs seven pounds.  It killed by that.  That's too bad.  Probably never drank milk again after that.  I did roll it a bit and then I switched to all my milk.  When you move out of your parents home?  Oh, I left when I was 26.  OK.  Honestly, I could have stayed there forever.  I love my mom and then.  Yeah.  A row of us was like, it's kind of about.  Yeah.  How old were you when you remember out?  It was in college or?  High school.  Really?  Yeah.  So we met in.  Ooh, I was 11th grade.  He was 12th grade.  Oh.  Yeah.  Where'd you guys go to high school?  Going.  You went down going.  I don't want to remember this.  Yeah.  Yeah.  What did you have?  And where'd you go to middle schools?  Stevenson?  Stevenson.  Oh my god.  Yeah.  Yeah.  Yeah.  Oh, it's crazy.  What a small world.  What did you say?  And so Ralph did the same track with CPD Gram?  No, Ralph went to Elliott and then he went to Marshall, which is close now.  Oh, Marshall, I remember that.  Yeah.  And then he went to Glenn.  Was Marshall in the volume?  No, it was in Westland.  Like right in the middle of Wayne Road and right in the middle of Wayne Road.  You know where?  What is it, Bob?  Stevenson's Alpha Palmer.  Yeah.  I was like, that Wayne Westland, like Credit Union.  There's like a Tim Hortons by an away from you.  I think I know where that is.  Yeah.  That's where he was at.  Yeah.  Lindons popping him.  I don't think that's it.  Okay.  So you guys met in high school.  You move out 26.  So you joined the gym shortly after moving out of your parents home.  No kidding.  Man, wow.  So how long you remember the gym now?  Five years.  Five years strong.  Getting Jack.  Yeah.  Super fit.  This is the first yard, but like Jack.  Yeah.  Yeah, no, it's crazy.  That's it.  How much weight have you lost since the celiac?  Oh, I would say roughly around maybe like 10 to 11 pounds.  Maybe 12.  Wow.  Might be pushing 12.  I'm trying to stay linear on this, this, like, story we're going through.  But if I could want to jump ahead and I'll be outcomes, you know, that's crazy.  Yeah, you look Jack now.  I just leaned out.  Totally.  I really like it though.  We'll get into that.  We could talk about like maybe some, you know, how to stop that.  Now this is something where you cross with it's tiring.  That's the thing, right?  You do cross fit and it's like three, two, one go and you go as fast as you can to get  tired and then you hang on.  That's what most people do.  And I learned to pace over the years, but that's mostly like they go and they're tired  within a minute.  They already breathe in really heavy in a minute.  Yeah.  And then they just hang on.  So did you feel like it was just hard from the beginning or did you feel like it was hard  and then you started to really slow down?  Okay.  Because, you know what I'm saying?  Like the first like, I would say first like three to four minutes it feels fine.  After that.  This is prior to the silly.  I'm thinking.  Okay.  I'm like, I'm getting cooked after like four minutes.  Yeah.  Yeah.  Like I'm like gasping for air.  Yeah.  Trying to figure out what the hell is happening.  I remember like there was a box jump workout and I was just like, come on.  Let's go.  These box jumps.  I'm sorry.  Give me a break.  Just keep going.  Yeah.  Like, like, you just get.  I'm going to.  Yeah.  I'm going to.  Yeah.  I'm going to.  Yeah.  I'm going to.  Yeah.  I'm going to.  Yeah.  Yeah.  I'm going to.  Yeah.  Yeah.  Yeah.  Yeah.  Yeah.  You're just making excuses for whatever.  So you just use it for air.  Dying.  Dying.  Yeah.  So you were tired right away.  You don't remember a time where like, hey, I feel pretty good.  And then it started to dip.  For the most time, I would come out.  I feel fine telling you once it hits like four or five minutes,  I'm like, yeah, I remember.  Like what's happening?  Super tired.  Yeah, I'm like, I cannot breathe.  And then if it's a hot day, I literally couldn't ever.  So when do you think the celiac was kicking in?  When do you think you probably have you thought about that?  It's probably always been there.  No lie.  Since you were a kid, do you remember like always having problems  with a complete?  Yeah.  I would not.  OK, weird thing is never had any GI symptoms.  Never had any stomach aches.  Never was like, oh, buckle over.  Yeah.  No vomiting.  Nothing.  I'm just eating, just like going through like.  But I would remember like if we're outside playing,  I'm like, I can't breathe.  But I'm like, I'm just a kid.  I'm just, no one can breathe.  The kid I'm just running.  I'm just running.  Yeah, yeah, yeah.  Not even about it.  But then like, as I got older cross-fitters  the thing that I was like, I literally  can't not breathe.  So I'm like trying to work on things, trying to pace.  Like what's happening?  But then once they told me I had it,  I started like putting it together.  A light bulb could like.  Yeah.  Holy shit.  It's probably been here in my whole life.  Never even knew it.  Because you're just, all these memories were popping in.  I was tired at this time.  I was tired at this time.  I was tired at this time.  Or I would have like headaches.  I'm like, I don't have a headache.  Like what's happening?  I'm drinking water.  I'm laying down.  I'm eating.  And then I literally clicked and I'm like, holy shit.  So you think all the way back from like six and seven  or eight and nine years old?  It's been there.  Yeah, I think it's just been there and been like dormant.  Just residing.  And something happened.  It flipped the switch.  So, but you think it was affecting you back then.  So, but it got worse, you're saying.  Well, I think, you know, what probably happened is,  you know, cross-fits and tents.  You were spending a ton of energy,  you're spending a lot of tissue.  And you were using up that little iron  that you were able to absorb.  And then it just started hitting you.  And my diet also changed from when I was a kid.  Like I told you I would eat weed or like I would eat gluten.  I would eat pasta, but never a daily basis.  It was never like consistent.  Like I would eat it.  But then when me and Ralph got our own place,  I started eating bread a lot more.  And I'm like, all right.  And I told him, I was like, I was like,  I'm not gonna feel weird off this bread.  And I'm like, ah, I'll be all right.  I'll be all right.  And then one day it wasn't all right.  Yeah, so what happened?  What happened that day?  It was like two instances.  So the first one, I had a tuna sandwich for lunch.  Normal.  And then like later that day, I was like,  oh, I have a stomach ache.  So I'm just saying I'm like, it's probably a tuna, you know.  Yeah, yeah, yeah.  And then the next day.  Yeah, it's love weird.  Then the next day I was like, okay, I had tacos.  Like I've made tacos.  I'm like, it's kind of a bag combination.  Two-and-a-tock-a-thats.  Yeah, weird combination.  So I woke up in the middle of the night.  And I'm like, oh, like literally a stomach is like hurting.  This is not like a normal stomach ache.  Like it's hurting like up top.  Never has never happened before.  It's like right up here.  And I go to the bathroom, I'm like, okay,  I feel nauseous.  My hair is something's going on.  So I throw up everywhere.  Mm-hmm.  And I call my mom and dad.  I'm like, well, Ralph calls him.  He's like, bye, he's throwing up something's going on.  My dad's like, what would you eat?  So I tell him what I ate.  And I'm like, he's like, give up a fever.  He's like, maybe it's COVID.  Cause I was the time like during COVID.  It was like starting to fade away.  And I'm like, no, I don't have COVID.  Like I just feel really, really weird.  Like real weird.  There was a lot of pain.  Yeah, it was like a lot of pain.  I had like a slight fever.  Like a low grade fever.  So I like, drinks in P.D.a. like late day.  I mean, mostly we're to thought food poisoning.  You weren't thinking that.  By mind was thinking food poisoning.  Yeah, yeah, yeah, yeah.  No.  So like, I kind of went away after like a day and a half.  It took me like two days to recover.  And then I felt fine.  So then like some months went by.  Mm-hmm.  We went down to see our uncle in Texas.  And he, for the longest I had stopped eating pork.  I was just like weirding out about pork.  Just like really cared for.  Like, yeah, yeah.  Yeah, yeah.  My mom and dad are like big pork.  It was like me and my brother were like,  it was kind of weirded me out.  So I go out of my uncles.  This is like how it all started.  Go out on my uncles and I'm like, all right.  He has pork bacon.  I don't want to be rude.  He makes breakfast.  I'm like, oh shit, I guess I have to eat it.  I'm just thinking of like whatever.  So I eat it and then I come back home.  From Texas.  From Texas.  And I'm like on this like pork kick.  And I'm like eating pork bacon every single day.  Really?  Breakfast, like in breakfast, the oranges, on croissants, muffin.  And then one day, I'm like, oh, I throat starts like closing up.  No lie.  I'm like, what the fuck is happening?  What is happening right now?  The first of my stomach, now my throat starts like, it's burning.  I'm like, what?  So I kind of like let it go away.  It kind of like fades away.  How long did that last though?  How long was it burning like that?  Oh my god.  It would go away.  I thought I was catching a cold.  So I took some cough medicine, went to the doctor's.  I checked my throat.  They're like, that's the straw.  We don't see anything.  So then I'm like, all right, I keep eating whatever.  I still kind of like eating the pork or whatever.  Eating the bread.  It gets like tighter and tighter.  So now I'm like, just eating.  This is over days or hours.  Like a couple of weeks to like months.  Really?  Yeah, just started like progressively getting worse.  So then I'm like struggling to drink water.  Like I literally would wake up or I'm.  I can't drink water.  Like I'm literally like focusing, like telling my mind,  like, okay, drink this water.  Oh my God.  So I tell rough, I'm like, something's off.  I gotta go to the doctor's.  So I go to my doctor, and she's like,  oh, we think that's acid reflux.  And I'm like, oh, okay, like, why, though,  I've never had this before.  And I'm like, I'm not eating anything out of the ordinary.  Like, bacon, you shouldn't like make my throat close up  or like bread or whatever.  It's like, oh, okay, we just think it's acid reflux.  So they give me like some over the counter,  like Pepsi to take.  Yeah, Pepsi helps it.  Then a couple months later,  no way.  Stemtic cake is back again.  And I'm like, what is happening?  Something's just off.  I know I did.  You weren't telling me anything.  No, you're just coming in working out.  Yeah, I'm just working out.  I'm just trying to work out.  I'm just trying to work out.  Yeah, just push through.  I'm like, let me just change out some things.  Just keep pushing through.  So my dad's like, you need to go see a GI doctor  and see what's going on.  So I'm like, all right.  So I call the doctors.  They're like, well, we can't get you in until September.  Well, when is this, is this August?  No, it was like, okay.  So the timeline was the stomachache happened.  Then I went down to Texas that we went in like July.  And then like the month, the fall in winter went by.  So I went back and like March.  So I called my doctor.  I'm like, hey, I need to get in there.  So almost like a year goes by.  Yeah.  So I'm like, all right, I need to get in.  I throw, I'm having issues with my throat.  I'm kind of having like upset stomachs or stomach aches.  So then like, we can't get you until September.  I'm like, well, should I be dead by then  if I keep waiting?  So they're like, oh, go see your piece.  This is March and they told you September.  Yes.  What the heck?  U of M or fell to be the greatest.  I mean, wait.  So I go to.  We love you, I'm just a great house.  We love you.  And it was awesome.  I'm going to tease this.  So I go and I go see my primary care.  And they're like, all right, I get my blood work drawn.  She's like, let's check your thyroid.  Let's just check your CBC.  So they ran the panel.  And then oddly, my OBGYN calls.  Like a couple weeks later, exactly.  Not my primary camera OBGYN calls.  She's like, hey.  I'm like, yeah, she's like, all your other labs came back  right, but do you know your hemoglobin's at six?  And I'm like, what are you talking about?  She's like, it's at six.  Like it's dangerously low.  You could have a heart attack.  You need to go to the emergency room.  And I'm like, what are you talking about?  Where should it be?  It should be at 15.  Okay.  So I'm at six.  So I'm like, below the threshold.  12.  Why is the OBGYN call me?  I have no idea.  And I was like, what do you mean?  That's the greatest mystery of all this.  That lady saved my life.  If it wasn't for her, I probably did somewhere.  So she called.  So I'm panicking now.  So I call my mom and dad.  I'm like, hey, they say I need to go get like a blood  transfusion or iron infusion.  My dad's like, OK, well, maybe you should go and check it out  because you said your throat was bothering you.  So I'm like, yeah, yeah, yeah, right.  Let's just go.  So I told her off.  I'm like, hey, I sit down and I'm like, seriously,  I think I need to go to the doctors.  He's like, wow, I'm like, well, we do.  I am called.  She said he may go with seriously well.  So he's like, shit, let's go tonight.  And I'm like, ah, we can wait till the morning.  So we go to the next morning.  Oh my God.  We go to the next morning and drive down to you of them.  I'm waiting there.  Murderousing room's like at max capacity.  I'm like, Jesus, I'm never getting out of here.  So they do.  Are you feeling fine at this point?  Like, I feel fine.  Everything's good.  No stomach pain.  No throat feels fine.  I'm eating a bagel that morning.  Oh, yeah, of course you are.  I had a crema weed.  No, my stomach's totally, yeah.  Creamer weed and then a bagel.  Hell yeah.  I'm supposed to go.  Me and mom, I'm like, I think we can be out of here by five  to make it to the gym.  So that's all right.  That he's like, this is a Saturday.  This is a Friday?  Yeah, yeah, yeah, yeah.  It's like, we ain't making it.  So I'm like, damn it.  It's so, I'm waiting there and I'm waiting.  And then I finally go on the back.  And they're like, all right, we rang your vitals.  They took like EKG, all that stuff.  So I'm waiting.  I'm like, all right, cool.  I think I'm gonna get this iron infusion.  I'm gonna go.  Well, one of the doctors comes back and she's like, yeah,  we can't let you go home.  And I'm like, what do you mean?  I can't go home.  She's like, yeah, your hemoglobin's so low.  We think you might have an ulcer.  And I'm like, I feel fine.  I'm like, what do you mean?  They think you might be bleeding from somewhere and turning on.  Oh my God.  I'm like, I feel fine.  So then another doctor comes to know.  I'm like, panic.  I'm like, panic.  And Ralph's like, just calm down, calm down.  Yeah, remember it was an ordeal for you guys.  So Ralph was like, I'm stressing stress.  And I'm like, well, I feel fine.  What do you mean?  And another doctor comes and she's like,  we need you to do a prep.  And I was like, well, is this something I can like,  schedule with my doctor?  And I'm like, prep for what?  And she's like, a colonoscopy.  And I'm like, for what?  And she's like, we need to see if you're bleeding internally.  I'm like, okay, can I have a second to like,  think about this?  What's this?  So again, I call my mom and dad.  And they're like, okay, just do it.  Just fidget, just double check.  So then they come back and they're like,  we're actually gonna do a double, like a double exam or whatever.  And I'm like, well, what's the other one?  And they're like, and doscopy.  And I'm like, what?  And they're like, we're gonna take.  So go on to both of us.  Yes, she's.  And I'm like, okay.  And this is still what Friday?  This is Friday.  This is Friday night.  So then Ralph's like, I gotta go home and get the dog  and let him out and take fear of fear.  It's like, I gotta get clothes.  I still gotta respond to the lyrics.  So they're like, you can.  do it with your primary care but do probably have to wait like four to five months so we would  rather you just do it now. So I'm like all right, like come back with like this giant milk jug.  It's called go lightly. Anyone ever had a colonoscopy? You know what happens. Go lightly.  That's great. The nastiest drink I've ever had to drink. It's like warm salt water but they fill it  with electrolytes. So you're not like losing stuff in between. It was bad. So then  an experience is bad which we don't need to get into that. No exactly. That's what I'm like if you  know what happened. Yeah. It was bad. When you know you know you know. You know you know. So I end up  staying there for like three days. They gave me both procedures and I had to get the blood transfusion  and then the iron infusion and then I was able to go home by Monday. So it was kind of rough but I  didn't. They took biopsies and everything. Yeah. Everything's good to go. There's no internal  internal bleeding. Yeah. No internal bleeding. Everything's good to go. So they're like you need to take  your iron pills so they can make this super high dose of iron. They had to take four times a week. So  I started taking that and then I got my biopsies back two weeks later and I had a point with my GI  and they went over it and they're like yeah. Well I remember the before they told me to  say like they asked me when I was at the hospital. They were like you know you're so young or so  healthy. Like we don't really see anything physically wrong. Like does anyone in your family have  sickle cell or have as anyone ever been tested for celiac and I was like well I don't know what  that is. I know what sickle cell is but I don't know what celiac is and they explained it and I'm like no  no one has that in my family. So they just like ran a panel and then two weeks later after I got  out of the hospital I had my appointment and they were like yeah based on the biopsies we see celiac  and I was like wait what? Wow. And I was like what do you mean? And they're like well your biopsies  showed like celiacs brew and then... I guess it's part of the disease. Some type of  a brew. That's what it's called. Yeah celiacs brew. And then there's something you know what it looks like?  S-P-R-U-E. Where's young Jamie? When he's young Jamie? My he died on the note. Did you listen to  Rogan? Okay well maybe you've Rogan-Faz. We need young Jamie to look this up but we say that.  So they ex-brew. I could not mind doing it. S-P-R-U. Yep. I'll cover it in the next podcast. Yeah.  So anyway so they say you got silly you got the sprues going on whatever the heck that is.  And there was something else that was tied to it. So they said that I have something called  lymphatic gastritis. And I said well what's that? And they're like it's either tied to  celiac or H.Pylori and you test it negative for H.Pylori. And I'm like the de-ide doctor's going  in depth of it and I'm like holy shit so I have it. And I'm like... I got the silly egg. This guy's  talking and I'm like he just left the diagnosis of me. I don't even know what this is right now.  Yeah you can't hear what he's saying. My mind was like... Yeah right. They just said you have a  disease. You don't even know what silly I did. I know what it is. Wow. So you're... I'm the level you  think it's like cancer level. What do you think it's a decent? I'm like... My mind instantly went  cancer. Like I can't see what's happening. I'm like what's happening? What's happening? So they're  like yeah it's an intolerance to gluten and they're like well you tested they gave me it. I actually  took a blood test for it and it came back negative. And I said well my blood test came back negative  and they're like yeah that can happen. But you have something that we call asymptomatic celiac. And I'm  what is that? So I had to say no symptoms, no GI distress, no discomfort but the main  sign was incredibly low iron. So essentially like I was eating gluten and it was stopping my body  from absorbing the iron and the nutrients. Yeah I should look into why and how it's doing that  mechanistically. Yeah that's interesting. I'm imagining that the silly egg test that you did that  came back negative is probably searching for some sort of immune antibody that means it's being  activated because you're asymptomatic. Yeah so it's like it's interesting that you still get  affected though. Yeah anyways. It's honestly when I was reading and researching I'm like I think it's  probably been here my whole life because there's no other reason why my iron would be incredibly low.  You know I mean like if I'm eating the right way I'm exercising why is my iron so low?  Yeah I mean you're eating some red meat right? Yeah even as a kid. You're taking a molting? Yeah I  take a few sub like multivot, I take a multivitamin and I take the zine, the vitamin D.  I'm like loaded up on my supplements and I'm listening. I want to look up we need a new  young Jamie for sure. I want to look up why and how is the silly egg blocking the iron absorption?  Yeah it's like I don't know it does something and it's just not allowing it to absorb.  Yeah so strange. Now I remember like I started thinking back and I'm like I kind of remember as a  kid when my mom was like you need to take these iron pills and I'm like no they're nasty. I hate I  hate it the way  they taste them like, oh, I don't want to take this.  We chewing them on.  They're like, she literally was like, chew them because I  couldn't like, swab.  You weren't chewing them.  And I was like, this is nasty.  So not only think back to it, I'm like, it probably was  there the whole time.  Yeah, yeah, yeah.  But never it never came out.  And apparently, and I asked my GI doctor and said, hey,  like why now?  And he said, sometimes it just comes out in your, like, I guess  the timeframe was roughly like in your 30s.  Oh, yeah.  Yeah.  And your 30s are like, if you're stressed or if like, you  have a dramatic change in your body, something kind of  just flips the switch in and just turns on.  Yeah, well, you could see like you're, you know, when  you're young, your tolerance against nutrient  deficiency is way stronger.  Your metabolism is just way more adaptable and it just can  muscle through without something.  So when you get into your 30s or whatever, doing cross fit,  training hard, you know, probably trying to lose a little  weight, right?  You may be wearing a dick calorie deficit on all the sudden,  like it just, it's too much.  It was just, it just flipped.  Flip the switch, pal.  So you got the silly egg.  And then what do they do?  And they get you to, hey, here's what you got here's these  papers, go home, take these iron pills.  They gave me the iron pills.  And then the GI goes, well, you know, you do get a tax break  because you're like, yes, I'm like, what is this?  I talk about.  Well, it's like you get a tax break because of gluten-free food  because it's so expensive.  Well, I can't out of here.  And I'm like, what are you talking about right now?  You would know this right now.  You're just told me I can't do that.  Are you making this up as a joke?  You literally told me that.  What kind of tax break?  Oh, what did he, he said it.  I literally cannot remember.  Well, like you get like a 250, like credit or something.  Something.  Yeah, something you, like you show, you show your receipts  or you send it into something and they give you a break  on your taxes every year.  You got that in there.  And I'm like, out of all things, you're telling me I get a tax  break.  Like that's going to make me feel better.  Yeah.  You're like, oh, dang.  I'm glad I got this.  That I can't do anymore.  My brain's going to, who's the politician that is wasting  our tax?  I was getting that in place.  Why?  I don't know.  Anyways, you know, definitely.  I also found that I get into national parks for free.  What in the world?  Or what?  Because it's so, like, the disability.  Oh, my God.  So, hey, my next trip to the grand can, you'll be free.  Why?  I mean, I guess I'm happy for you.  I guess all I really want to eat is the burger.  Yeah, yeah.  You just want to eat that bun.  You just want to eat that bun.  You just want to eat that bun.  So how long was the pro, you know, so you've had two major  changes that right?  You got, you probably taken iron regularly.  You were doing a fusions, weren't you?  Yeah, I got one infusion.  It actually hurt like hell too.  Oh, yeah.  Yeah, yeah.  It's like really weird going through your body.  It feels like it's like pinching you.  Oh, put it through your arm, right?  Yeah, yeah.  Ivy.  And it just kind of drips in.  And then I got the blood transfusion.  Uh-huh.  That was like cold going in.  It's strange.  That's weird.  Strange.  And then so you're now you're like, all right, so you got to take some pills and you got  to change your diet.  You get to pay you and you're don't eat these things.  And you cut them all out.  You were cold turkey.  What happened there?  You know, like maybe I can still eat this.  No, like I instantly cut it off instantly because they were like, you know, it probably  won't happen.  But if you continue to eat gluten, you put yourself at risk to get like stomach cancer.  So essentially, if you continue eating it, it destroys your villy.  So you have everyone has villy that look like this.  When you continue to eat gluten, if you have celiac, your villy becomes flat.  So then your body essentially can't protect anything that goes through.  So it's like you're damaging your insides.  Yeah, gotcha.  So you just, and essentially like you stop absorbing all the nutrients.  All these like weird things that start to happen.  And then you're going to like be at risk to get like thyroid is hyperthyroidism.  Like all these like weird things start to come with it if you continue to eat it.  One thing I did, so I just stopped it like cold turkey.  That was scary.  Yeah.  Yeah, yeah.  The whole experience was just dramatic enough for me to be like, all right, that's it.  Yeah.  I have hard to have to, I didn't get to have a farewell tour.  It's a gluten.  I wanted to do like a farewell tour.  What would have been on the tour?  Oh, all the foods that I can't eat anymore.  What's the top of this?  Donuts or?  Oh, freshly glazed donut from loony.  Because I used to get it every Saturday.  They're pressing.  I can't have anymore.  All right, pause in the action.  What happens if you pause it?  What's that?  Like, still flow back together?  I'm going to send it off and Nathan, the editor, he's going to edit it up.  Yeah, yeah, yeah, yeah.  Okay, that's it.  Yeah, multiple times I'm like, shit, Nathan, I screwed this whole thing.  I'll give him a, you know, just kind of regroup and then get going again.  He just cuts it out or I'll burp into the thing and he cuts it out.  He's going to capricut all this and maybe.  You can leave this in, Nathan, it's totally fine.  All right, what were we saying?  My farewell tour.  That I didn't get to get.  That's right.  We had a little technical dipping switch.  We lost some lighting back there.  We had to get that straightened out.  Farewell tour.  What's number one on the farewell tour?  The glazed donut from loony.  From loony.  No kidding.  Did you grow beaten loonies?  No, I actually never had it until I joined the gym and I was always a Dom's bakery.  my inner in Ipsy. I am you. So good. So then one day I was like, oh, let's stop at this  donut place right here. And loony is delicious. Yeah, loony is pretty amazing. So good.  I didn't get to have that last donut. Yeah, loony been around for its local donut shop.  And they've been around for years. I don't remember how long but it kind of went down  and somebody bought it. I don't remember if it was this. Yeah, I don't remember if it was  the sun or the kid of the owners or something like that and then just turned the whole thing  back around. So it's back to like slamming again. It's loony's good. So loony glaze donut  would have been on there. I would have probably been like crispy cream, but that's fine.  Oh, crispy cream donut's boy. Oh my god. They're good. But loony is like loony's up there, man.  What else would have been on the tour? So we eat at Vizzie's pizza, another local pizza  place. Always get like the thin crust pepperoni pineapple. I know some people hate pineapple  in pizza. Some people love hate for people. I love it. I'm not sure. I didn't have that  on my farewell tour. So that would be second. A good pretzel. Oh, soft pretzel. So good.  One of my favorite foods. Oh my god. I can't have it. Mustard or cheese. Cheers. Mustard.  You have to do the hot. Mustard. Well, my mustard people like my dancing mustard. I'm like,  exactly. That knows what's up. No, no, you got to do hot cheese. So that would be on there.  Okay, man. A good brioche bun. Yeah. For the burger. And I love croissants.  Mmm. Fresh croissant. Yeah. I don't need croissants for y'all often, but they're pretty good.  No. No. They're so good. And I was a kid. I remember when I was a kid, every was put in like tuna  on a croissant. People were doing that. Yeah. Like a tuna sandwich with a croissant. That's the one  that made my stomach hurt. Is that right? Dang, croissant. Because that was my farewell tour. Exactly.  It's like, yeah, you better get some of this. Take that. And last, last I swear, I would have to  go back to get a chick fillet space chicken sandwich. People love chick fillet. I haven't had it  twice. I just need like, I just need like one week of a farewell tour.  Yeah. Well, that's right. Yeah. You know, I do that. Now, you went off,  Galuten 100%. Have you had a little bit in a rock do or any experience with that?  One time, what we read do was I had I had that she ordered that  Mediterranean. I remember that. And she didn't know that it had those little noodles in there.  from her, telly noodles. Yeah. So I and I'm like, do or you sure there's no gluten in there.  You sure. She's like, no, I promise. I promise. Hours later, no bullshit. I was like, oh, I was at  home like, I'm like, it's hurting. I'm like, what's happening? And then like two days later,  do it was like, I forgot to tell you I'm so sorry. It had gluten in it. And that's when it  like kind of clicked. And I was like, I absolutely have it because I never removed it to see  if I would ever feel bad. If I ate it again, yeah, I was like the first time I removed it and then  accidentally ate it placebo effect. Yeah. Yeah. You know, you think it's gonna affect you. So  it does. You had no idea. And then bam. And then there there it was. And it's like, oh, my God, it just  it kind of clicked. Yeah. Where are they enough? I used to have like,  my right knee would get really like tight or sore. And I'm like, I'm just from lifting at the gym.  Like, maybe I should take it easy. The minute I stop eating gluten, I need pain in one  of the way. Really? Yeah. Apparently it causes like inflammation in your joints. Yeah, for sure.  Never. You're gonna get systemic inflammation. My knee is not bothering me anymore.  That's good. Yeah. And that goes in from info. And I'm saying inflammatory levels down.  Yes, it did. Well, that's good. What's life like now?  It's been kind of rough because I had to like rearrange and change my whole diet. So  that's a process. It's in kind of rough with that. It's in kind of rough mentally because I don't  think anyone pays attention to how much like food is a big factor into like your daily, like  hanging out with friends, like work. You don't really have to think about what you're eating. But  the minute you have to think about it, like, oh, my God, I gotta read the label. It starts to become  like mentally exhausting. Yeah, at first. Yeah, you're gonna get adapted to it. You get adapted to  it. But at first it's like, oh, okay, what restaurant can I go to? Yeah. I gotta make sure that  they're not frying this in the same front. I gotta make sure that this sauce doesn't have glue in  it. Yeah. So at first it was very rough. Trying to think me and Ralph, we haven't.  We've been out to eat in a while because I'm kind of like scared to like try it. So we've been  cooking a lot at home. I was gonna try it over the summer. You're gonna try some glue  over the summer. No, no, no, like eating at a restaurant. Oh, I see. Yeah. Because I've been like so  scared. Like, oh, I don't want to get sick. Yeah. I hate stomach eggs. I hate like being sick.  Yeah. I understand. So you really haven't been eating out. We've been cooking. And then I did that  like whole 30 thing. Oh, yeah. Yeah. I think that's how I ended up like leaning out of bed because I  cut out literally everything and like started from scratch. Like, so what did you do before that?  You just like, all right, I'm just gonna avoid gluten. Yeah. Yeah. And then you came across whole 30.  And you're like, why did you think whole 30 would be a better movement just what you were doing?  What did I do to make me do a whole 30? Oh, something was still bothering my stomach even after  I removed gluten. Oh, something was kind of like.  I don't know if it was the removal of gluten.  It might like,  gut by almost like time-  Give me a job to do that.  Put it back.  But something was still bothering my stomach.  So I said, well, forget it.  I'm just gonna go straight from scratch.  So I literally took everything away.  Process, foods, chocolate, coffee, dairy.  Soy.  Soy.  So it removed it all.  Oats, because that's another thing I have to be careful with too.  Like, wheat and wheat grows next to oats or something like that.  Oh, yeah.  That's what it is.  So like five percent of people that have celiac  also have a reaction to oats.  So I took oats away.  I haven't added those back yet.  I'm kind of scared.  I can't eat it all for nothing.  Really?  No.  It was like three years ago.  You know, because I just get in a habit eating one of me.  And I'm like, man, I want to get some different carbohydrates.  So I'm like, oh my god.  Oatmeal.  Duh.  So I buy a big thing.  Oatmeal.  I have a big bowl one day.  I'm like, awesome man.  Oatmeal.  Have a bowl again.  So good.  Have a bowl again.  Next day.  I feel a little different today.  Third day destroyed me.  Like brain fog was sitting on the couch just lethargic.  Like, oh my god.  I feel terrible.  It's the oatmeal's out.  Yeah, I can't do oatmeal.  Yeah, I'm like nervous.  I don't know.  I'm scared.  Yeah.  I might have been able to do it.  Hey, once every two weeks or once a week.  But like the three days in a row.  And to me, I'm like, yeah.  I'm like, what's going on with that?  Oatmeal's tasty.  These are some butter and butter.  It's so good.  It's so good.  I wish there was a cream of wheat.  That's actually my favorite.  That doesn't have gluten.  Can't even have that anymore.  I tried cream of rice.  And I was like, what is this?  It's not that.  Not even the same.  That's not the same.  Not even the same.  It's an imposter for this.  It's gonna stop.  Insult the cream of wheat.  It's disgusting.  Yes, I did the whole 30.  Took everything away.  And slowly started to reintroduce things.  The whole 30 was actually very hard.  It's very hard.  And they put that rule in place.  If you mess up, start over.  Yes, very hard.  And then it made me had it created.  So I'm like half an app.  I kind of regret doing it, but then I kind of don't regret.  One, I like how I leaned down a little bit.  But I regret it slightly because it made me create  or have this phobia or fear of food.  So where I'm like looking at things like,  I try to add back corn.  Corn is so simple, but it's a grain that's like hard to digest.  Some people, yeah, for sure.  So I made corn like two weeks ago.  And I'm staring at the plate of corn.  What's it gonna do to me?  What's it gonna do to me?  And I'm like, this is bad.  I never would have looked at food this way  if I didn't do this whole 30.  Yeah.  That it kind of created like a little bit of imbalance.  Yeah.  You'll find yourself back just to a good place.  Exactly.  So I'm trying to get out of that mindset.  Yeah, yeah.  Whole 30 was tough in a while.  Very tough.  Is it 30 days or 40 days?  It's 30 days, but I ended up doing it for 90.  Straight?  90 days.  Without a hitch.  No, just straight.  And Ruff was like, Ruff's like, you're insane.  He was like, he's just saying.  He's just saying.  He's gonna stop.  He's gonna stop.  He's gonna stop.  He's like, you gotta give it up.  And I'm like, I gotta ride it out of the seat.  What's happening?  I gotta see how my body's gonna change.  And I wrote it up.  And I'm like, maybe I should have pulled back a little bit.  Maybe a little sooner.  What was the first food he introduced?  The first food I introduced back.  What was it?  It wasn't dairy.  It took me a while for dairy.  I just started last week.  What was it?  Oh my God, what was it?  It wasn't corn.  No, I think it was corn.  I think it was corn.  Because I was already eating potatoes, sweet potatoes.  Mm-hmm.  No, it was broccoli.  Oh.  And it made my stomach hurt.  Yeah.  And I was like, great.  It blew my stomach up.  Yeah.  And what just happened?  Yeah, it blew it up like like,  like, like, distended.  Yeah, yeah.  Because I guess it's like, what is it?  A coniferous veggie?  I used to know what I don't pay attention anymore.  Coniferous?  Yeah.  And that's not good at their first.  It's something else.  Young Jamie.  Um,  It needs you in here.  Green beans.  I did elimination diet years ago.  And then first food I introduced was green beans.  Absolutely decimated me.  Unbelievable.  And they're like, it's supposed to be healthy for you.  Oh, yeah.  It's a, it's, it's,  well, it's that mindset of all vegetables are benign.  And, but not a lent is the word.  Right.  All vegetables are good for you.  And the money that you'd like.  No.  No.  No.  Even water, too much water is bad for you.  Right.  You can't just have as much as anything as you'd like.  It's not going to be good.  No.  And so there's plenty of vegetables that people have  sensitivities too for sure.  Yeah.  And I'm slowly rediscovering that.  Yeah.  Yeah.  Yeah.  So you just got to figure it out how your system operates.  Don't make blanket statements for,  make a really eat the way you want them to eat.  Exactly.  And I kind of got looped into that where they're like,  do the carnivore diet.  No, or it's like, no, veg is just straightening me.  And I'm like, that can't be right.  Make a good shot.  Yeah.  And I think, other ones like the elemental diet.  What's that one?  I think that one's like liquid.  Like, straighten it.  Like, why?  Straighten it's just liquid.  Yeah.  So like readjust your gut biome.  Oh yeah, sure.  Because they know what it's doing.  It's not all about this.  Like this.  And they,  I'll say this, the gut biome legit, 100%.  We got biofilms all over us.  Our eyes, our skin, our ears, everywhere.  You know, especially the gut.  There's a whole ecosystem down there.  But we don't understand it.  And if anybody acts like, oh, this diet's going to do this  for your gut biome, they don't, people don't know.  They don't know.  We're figuring it out.  And we'll probably have it pretty pretty.  and 20 years.  Yeah.  But that is a long process of really getting things  dialed in, the experiments and all that stuff  and you're in the funding and all that.  It's tricky.  But it's legit, no doubt about it.  What were we saying something about that?  Oh yeah, liquid diet, the carnivore.  I'll say about the carnivore.  Fine, you can go carnivore, but we're omnivores.  That's just fact.  Yeah.  It's just a fact.  I don't think it can be good to just eat.  I mean, meat is good, but you need something else in there.  Meat's the most nutrient density.  Yeah.  We don't have to plant it.  OK, great.  And you need some veggies in there.  I don't know what's feeding your gut microbiome  because meat ain't doing it.  No.  And he's doing it.  He needs some greens.  And there's always going to be outliers that  can last a long time.  I mean, diet is such a personal thing.  Yeah, that's what I was, that's the thing I've discovered.  It's like you can't say something that's  going to work for everyone because everyone is different.  You're going to get it.  Everyone is so different.  You know, we're all going to, but we  you know, the basics are going to stay the same for everybody.  What are the basics?  The basics are you need energy.  Yep.  You got to eat others.  You're going to die.  You need nutrients.  You need macronutrients and micronutrients.  Now, however you choose to get those,  you want to go vegan.  You want to go vegetarian.  You want to go carnivore.  You want to eat a balanced, you know, vegetable meat,  diet, whatever you want to do, you can do that.  You can do it.  But you got to make sure you get in enough nutrients  to feed your metabolism.  You have to.  Yeah.  That's 100%.  Yeah.  I agree with that.  Yeah.  So yeah, I don't eat green beans.  You don't eat, you don't eat broccoli.  I'm going to try and add it back in.  Broccoli is disgusting.  Let's be honest.  What?  What?  I hate it.  One time I was eating broccoli because I was smashing broccoli.  And how did this go?  I posted it on Instagram or Facebook.  And it looked like, oh, yeah, that's what it was.  It looked like, you know how the broccoli's got the little broccoli  head thing.  Yeah.  Well, it looked like there was some big ones that just kind of  got cooked off more in the broccoli.  And I'm eating the broccoli.  And I'm like, man, he's, he's looking a little different.  So I look a little closer.  What's in it?  They were little bugs.  No.  Swear to God.  They were like the size of a small tick.  Looked like a tick.  There was tons of them.  I just thought the broccoli was breaking up.  So I had, I don't know how much I had eaten at that point.  But some of them were moving.  I couldn't believe it.  I'm like, what is going on with that?  Took a picture and I zoom in, got little legs.  I'm like, wow, I don't think the world.  I never.  So after that, you were done.  I mean, I was already on my way out with broccoli.  I was already kind of like this stuff.  It stinks like this terrible smelling when you cook it.  It does.  Yeah.  So I was already on my way out.  That was just the, that was the camera.  That was a straw.  Bro, the camera's back.  It was gone.  Bugs, am I?  It was disgusting.  It was disgusting.  So you reintroduce broccoli, you reintroduce the foods, corn.  Now you don't do corn.  I can do corn.  So you can digest corn.  I can digest corn.  Oh, good.  Yeah, yeah.  Yeah, yeah.  I can do corn.  I'll be in no problem.  Corn is fine.  I reintroduced dairy.  But I did like aged, like aged cheddar cheese.  Oh, okay.  Because it's like, you said there's like a week ago.  Yeah.  And then you're good to go, huh?  Yeah.  I chose aged like Asian hard cheeses because there's like very  little lactose in it.  Oh, good.  Just easier to digest if you have taken it away.  Yeah, yeah, yeah.  I added that back in.  Yesterday I had a little piece of dark chocolate, which is delicious.  It was delicious.  Although it's kind of nervous because the brand I got, you know,  that brand hue, like it's like in that.  Sounds familiar.  Yeah.  Let back to human.  Oh, okay.  Yeah.  Someone said that there's metals in that.  And I was kind of skeptical.  Oh, man.  But it was actually delicious.  People say, I'll kind of stuff this.  I don't know if they were lying or not.  Yeah, I don't know.  But it was actually, it was very good.  Maybe that is hating on Hugh and I was going to put some  fake news out there, you know.  Oh, just trying to enjoy that piece of chocolate.  And then I was like, wow, I didn't really need to see that.  Yeah.  This is interesting.  The thing about the plants and the attack that came on  plants was the polyphenols, the plant chemicals, right?  Hey, listen, plants can't run.  And they had to build defenses to keep from being eaten.  If they designed themselves to be eaten, they wouldn't be here.  Yeah.  Evolution would have, they would just got eaten and they would  pull it out of the evolutionary process, right?  But they'd build defense mechanisms to not be eaten.  Polyphenols plant chemicals.  You don't eat trees.  You don't eat bushes.  There's way more plants you don't eat compared to the plants that you do.  Yeah.  So interesting thing about chocolate.  What's wrong?  What makes the chocolate more chocolate dark chocolate versus  like, or what's it called?  No chocolate.  Is the concentration of the plant chemicals, the polyphenols.  That's why it gets bitter.  That's why, you know, people like it's strong.  Yeah.  So dark chocolate, especially if you have a sensitivity to it,  actually isn't healthier because you're getting a higher  concentration of the plant chemicals.  So what should I be eating?  I mean, if you're going to eat it, I can't really do much chocolate.  Really?  Yeah, I can buy you a little bit, like, I guess I eat the  milk chocolate all the time on the Snickers bar.  Maybe that's why it bothers me sometimes a little bit.  But I cannot do dark chocolate.  Right.  A great test if something is bothering you.  If you eat it and you feel in your stomach, all the 400 grams of potato,  five ounces of beef, a tablespoon of butter, some eggs, good to go.  Don't feel anything.  Take a small bit of dark chocolate, feel it,  all literally feel it.  And top of my stomach, and I'll feel it move its way down.  All through my stomach.  And I'm like, yeah, I shouldn't eat that.  That fast?  Yeah, me as soon as it gets on my stomach, I'm feeling it.  So that's a good indicator.  Like, you're feeling your stomach after eating.  I don't mean like a full or something in there.  But no, you're feeling something.  Well, I don't think it's an ingredient.  It probably doesn't agree to exactly.  the Snickers as a mother.  Now Snickers isn't great.  If I eat a Snickers by itself,  I can steal that my stomach for sure,  but I'm always weighing that against,  well, I still have to get in enough energy.  I don't want to be tired tomorrow.  I want to be able to get my work on it.  I've got 18 things I'm going to do tomorrow, right?  And it's like, all right, well, if I'm not getting  in enough calories to sustain my energy levels,  well, I'm going to get tired.  So I'm always weighing it against that.  It's very rapidly digested,  because it's already digested,  basically.  All that processing is really just breaking it down  so it digests faster.  That's why the carbohydrate's  filling to the high glycemic thing for a long time.  Back in the summer, I've been like 15, 20 years ago,  everybody was,  carbohydrate started to get labeled as like,  so in the brown rice and the white rice thing came out.  And the brown rice was deemed to be better  because it was absorbed slower  and the white rice would be absorbed faster.  White potato, sweet potato, right?  White potato, oh, it's going to get absorbed faster.  It's already, it's in a finer state, if you will.  But none of that stuff really panned out.  And so the measurement was,  we'll give you 75 grams of this  and we'll see how much of ratio blood sugar, popcorn,  really raise people's blood sugar  because think about popcorn, right?  It's, it's not in a kernel anymore.  You've taken the carbohydrate and expanded its surface area.  And now the enzymes in your stomach  can act on that surface area more  because there's more of it, right?  Corn, popcorn.  And so you would absorb it quicker  and it would raise your blood sugar higher.  But that was all done with carbohydrates by themselves.  They didn't do it with, oh, a steak and some salad  and some fat, right?  That's gonna totally change the absorption rate  of the food you're treating.  So you don't even hear about glycemic in it.  You haven't even heard of that,  glycemic in it next?  A little bit.  Yeah, people don't even talk about it anymore  because it like,  you kind of just like, they use that.  Yeah, everybody's excited about it.  We figured out.  Kind of, it fades out.  Yeah.  And it just faded away.  So, you know, your diets changed drastically.  You reintroduced some things.  You lost 15 pounds.  No, I think, I think the max like 12, 12 pounds.  12 pounds.  And the max had to be like 12.  It's pretty significant without effort, right?  All right, you weren't trying to lose weight.  No, I think it was the straight diet change.  For sure, for sure.  Like taking away the processed food.  Yeah, you lost a lot of calories.  You also lowered your inflammation levels,  which is gonna help, you know, your workouts have been.  Way better.  Crazy better by the way.  Night and day.  Yeah, like, like, like, we're running.  Like, and I'm doing a workout with Mahi in the group.  And I'm like, why is Mahi in front of me?  What's going on here?  Like your energy levels double.  I'm like, literally not even on the floor  after the workout.  Nope.  Moving on to those box shelves, moving on to stepovers.  Really?  All because my iron was that low.  Yeah.  It was no oxygen flowing through.  Yeah.  Yeah.  I always think like, what if I can have a heart tag in there?  Yeah, your heart was working.  It was working so hard.  So hard.  Everything was your cells were working so hard.  Everything was just like hindered, which...  Never thought about it.  It's probably cause the net positive adaptation  but whatever, just no.  Like I would walk the dog and I was like,  I don't know.  But then I would just like, that's kind of warm outside.  Like I always have a coat on.  You'd explain it the way.  Yeah, yeah, never put it together.  Mm-hmm.  My iron was crazy.  Now what happens when you walk the dog now?  Nothing.  You just stick out running.  I'm just walking.  Just walking.  Let's go to head.  You can walk and keep walking.  We had that workout Saturday.  That running workout.  And I was thinking, we were partnered up  and I was running around Ralph.  And I was like, Sky's breathing too hard,  right?  I'm not even that big of a workout.  So you're iron low?  So all of you.  He called me and he was like, I need to take my CDC.  I'm like, I mean, yeah, you could.  Go ahead.  I'm like, why are you breathing that hard?  How many for me?  I'm like, hey.  Have you noticed any changes in your mindset  or your well-being or anything like that?  Mm.  Like what do you mean?  It's a harder thing to notice, I think.  Because we lived through our brain, right?  We're so it's like, am I happier than I was?  Do I fall into it as many negative states as I used to?  Is it easier for my to remember and think,  do I have a better time when I'm out?  I mean, it's harder to notice those things,  especially if you want pain and tension to them before.  I will say, I feel like body was like physically  like working out and eating better.  I feel like I feel better overall.  Like, in a sense, I'm happy that this did happen  because then I would never,  like I would hate to be like seven or eight years down the line  and they're like, yeah, you're pretty much cooked.  Like there's nothing.  Like you can't revert or you can't fix it  or something far worse has happened.  Yeah, well, the autoimmune progression  can continue to go to your thyroid in other places,  but for sure.  So I'm happy in a sense that it happened now  that way I can get my mindset adapted to it.  Like, okay, this is a big change.  Like, let me figure this out now before I have kids  or going down that line.  So I will say I'm happy that it did happen.  Not happy how it happened,  but I'm happy that it did happen  because it made me more aware of like my body.  I will say I did feel like some form of grief or loss,  like with the gluten, like being attached to it.  just having to change a whole overall mindset of like,  man, I gotta look at food differently now.  Or not.  A lot of can't happen.  Yeah, yeah.  I gotta be extremely careful with what I eat  or like who's cooking something or like for example,  when we had the barbecue for MIRF,  I swear I asked Omar like 50 times like,  okay, what did you put in this P-cam bar?  And he's like, I swear it's just butter stuck right,  I'm like, I'm sure.  And then I go to K, I'm like,  what did you put in the bar?  Like, so that like that kind of in itself,  kind of takes a toll on me,  but eventually it'll probably phase out.  So I did have a little bit of grief for that.  I feel like overall I do feel better.  Yeah.  I look, yeah, I feel like I will say more happier.  I'm happier that I can work out better.  I'm like, push myself.  Yeah, your experience working out is just better for sure.  Yeah.  And I will say letting go of eating  the way that I was eating before,  kind of like let me go of like having like brain fog or like,  cause now I'm like more clear like in more sharp.  Like I don't know, it's just weird.  You don't realize it until it's gone.  I'm like, oh, I kind of feel better today.  Like it's just normal.  Yeah.  And then you go back to eat something like,  hey, I noticed that that,  that didn't really agree with me.  Like I feel weird after that.  Yeah.  So yeah, you can see, you have a contrast now.  Yeah.  You remember what you used to feel like  and I'll experience, especially when you eat something  that affects you.  Yeah.  And your brain just goes,  exactly.  And I even think that that was even happening,  but then once I removed it, I'm like, oh yeah.  Like I'm like so alert right now.  Yeah, totally right.  Yeah, I'm like, I could keep going.  Like I'm just going to mile a minute.  Yeah.  I'm happy for that.  But I will say I was sad the way that I had to go.  Going down.  Yeah.  Doing gluten-part ways.  It was sad.  I mean, I just needed that farewell tour.  Yeah, it would have been helpful.  It would have been helpful.  I was like, did the weekend like,  gluten-cronicles.  Like, it's recording myself.  Like, you're a stay-worn.  Yeah.  Yeah.  You could have logged it.  I could have logged that.  I think you would have went well.  I think so too.  Let's close it out.  Is there anything you'd like to add?  Mm.  OK, I was seriously like to add.  If you are feeling weird, or if something is feeling off,  go to the doctors.  Yeah.  I swear, go get a check.  Go get a check.  I wish I would have kind of got a check out before.  The real, do you go to your, your guest or not?  Yeah.  What are the guest or not?  I'll just, guestrologists.  Or your OB-GYN.  I don't know.  I'll talk a few times.  So now.  That was funny.  So now.  That was funny.  You just like rolled around with my joke.  And like, oh, it's going to be good.  You just like, oh, I didn't realize it.  Yeah.  So I go to my primary and then I'm set up with my G.I.  I guess I have to see him every, every year or something.  Oh, yeah.  Every few months now.  Weird.  They got me set up with like a full dietation and everything  to help me transition away from gluten.  So I actually have an appointment with him this fall to double check.  But you're, you're, you're on the new path.  You're getting it done.  I'm getting it done.  I mean, you go 90 days and a whole 30 without a hitch that's  impressive.  Okay.  But that it's, that's kind of psychotic.  It's out there.  It's definitely out there.  Oh, that was tough.  I literally got to give it up.  You were having a hard time stop.  Yeah.  I'm so far.  Yeah.  So far.  And I'm like, how do I, how do I get off the strain?  Exactly.  Yeah.  You got to break there.  I'm going to eat something.  That's not on the list.  Yeah.  That's when it came not in like like staring at the Hugh chocolate  bar.  Like Ralph's like, you're going to do it.  I'm like, I think I'm going to do it.  There we go.  I'm like, it's just, he's like chocolate didn't take you out.  Yeah.  Exactly.  I'm like, I know.  I know.  I know.  So.  Yeah.  Just don't just don't reintroduce the mood.  No.  No.  I'm done with that.  Yeah.  Yeah.  Just go get your, yeah.  Check out.  Yeah.  Why not?  If you feel entirely breathing when you walk in the dog,  go on the steps.  Go get checked out.  Go get checked out.  One of those online tests.  I don't know.  I don't know.  That'd be convenient.  Yeah.  It would be.  Next episode, we're going to talk about, I'm going to talk about  fascia, fascia, however you want to say it, I'm saying  fascia, but it's fascia.  It's crazy.  You're going to, you're going to blow your mind.  Next episode on the fascia system.  This is going to be big in the next three to five years.  It's going to be everywhere.  All right.  What else we got?  Help us grow.  Do you know anybody who this episode could help?  Yeah.  If you do, if you do share with them, share with them.  It might turn their life around, get their inflammatory levels  down, get their head cleared out, lose the weight they've been  trying to lose, get the fitness they've been trying to get.  I mean, these are a ton.  This is a ton of changes.  This is such a net positive.  It's unreal.  Yes.  Because even if you have some kind of autoimmune disease, it  doesn't stop you.  Like just, you just keep going.  Just figure out a plan, put the plan together and keep going  forward.  Yep.  That's right.  Build your life.  Like and subscribe on Apple, Spotify and YouTube.  And as always, if you have any questions, you can email me at  Dennis.  No.  Dennis.fenrich.com.  I don't even know what it is now.  Dennis at DennisFenrich.com.  I usually have a written down.  I didn't write it down.  Is that what it is?  Wait, maybe.  You think you got it somewhere?  You don't know where.  I probably know why.  Who would have that anywhere?  I don't know.  It's got to be easier way.  Let me see.  I was trying to help you out.  Let me see.  Dennis at Dennis fenders dot com at them 95% sure that's what it is. No, I know  Yeah, of course you don't I don't even know what it cares you do if you care  I'm care. All right guys care about you. Glad you're out there. Thanks for listening  Yeah, thanks for hearing my story a good story all right, Mikey. Thanks for coming appreciate it. You're welcome  I had a great time good good. All right guys. We'll see you. Bye bye  You"