{
  "podcast": "Everyday Orthodox",
  "episode_id": 41350493285,
  "episode_title": "Meet Corina Hall!",
  "audio_url": "https://media.ancientfaith.com/everydayorthodox/eo_2025-08-17.mp3",
  "duration_seconds": 3866.684,
  "model": {
    "name": "tiny.en",
    "device": "cpu",
    "compute_type": "int8"
  },
  "text": " It is Sunday, August 17th, 2025, and we're live on ancient faith radio.  You're listening to Everyday Orthodox.  Everyday Orthodox.  I'm your host, Elisa Beale, and Titch Davis.  And we get together here on Sunday nights to meet everyday Orthodox Christians.  And that's right, we're just building up church unity one person at a time.  And tonight I'm excited to introduce you to Karina.  Karina, I should actually say your last name and I don't have it written down Karina,  what's your last name? Quick. I'm like, panic. I'm like, ah, Karina Hall. I'm introducing  you to Karina Hall. Karina is the wife of Richard. She's the mother to seven grown  children, grandmother to three very lucky women. She was a licensed midwife, published  author, speaker and advocate. So I think you're going to find this really interesting.  recently published a book. It's called The Chicken with a Red Feather.  And it portrays the true story of her family's journey with Huntington's disease.  And she loves people, coffee, travel, and going to church.  And she goes to church at one of my favorite parishes.  So, that's true. She's at Christ the Savior. I've been, I've been Harrisburg, which  is just a really great parish full of neat people. But, and as is evidenced by the fact  that I'm just parading them all through.  But okay, Karina, welcome to the program.  I thank you for having me.  So delighted that you've come on the show.  It's really good, and I'm excited to hear about your book  and to talk about Huntington's disease.  And I feel like maybe raise a little awareness while we're at it.  So I think that'll be a good thing.  But mostly we just want to get to know you.  So tell me, start from the beginning.  Where does your story start?  Where were you born?  So I was born in paradise, California.  I was gonna say California,  because I'm from Northern California.  I'm like, we have a paradise, California.  Oh, no kidding.  I was born in paradise, California.  Oh, 1969.  So I made 50s or so.  Right in the heyday of the exciting hippie action  in Northern California.  Yeah.  I bet paradise was hippie central, frankly, at that time.  I was a skateboarder.  Oh, there you go.  I mean, yeah, yeah, but like very modern for that. Yeah. Well, we're a little too young to really be hippies  It's more our parents generation that we're crazy  We had our own version of it. I guess that slacker version of it  I'm saying yeah, I think I was trying to be more punk rock and then later became more like peaceful hippie  But California girl  for an erased.  Very nice. Very nice. All right.  So, so what was your family like?  Were you an only child with her a bunch of siblings?  What was the situation?  So I am the middle of three siblings.  I have two brothers and older brother, younger brother.  I'm the only girl.  So that made for, I liked it.  I liked being the girl.  That's a great thing.  I love that. I want to date today.  But that wasn't so great.  We're very close in age.  We both grew up in Northern California.  And I too am the middle with older and younger brothers.  And it really just meant in our family  that they had to do all the hard things.  And I got to do the really easy things.  Like you guys go out and like till the ground  and your sister will make sandwiches.  Yeah, yeah, I had all like the indoor floors.  For sure.  I didn't have to take up the trash.  Mm-hmm.  But I did do a lot of tours,  because maybe in my generation anyway,  in your generation, we just worked more, I think.  And I see now.  I try to get my kids to work and I do put them to work, but it's just different.  There's just also maybe not as much work to be done.  I don't know what it is, but it's very different.  Yeah.  Okay.  So you're growing up with your brothers.  You said you're a little punk rock, a little piece of neck as well.  And a little punk rock skater.  I love that.  I love that.  It's true.  That's so funny.  So what is that?  Like, what should I picture when I picture you as a punk rock skater at like 14 or something?  black clothes, dyed red hair, really short bangs with a Santa Cruz skateboard t-shirt on and  indeed. Yeah. That's awesome. Keep holding my own. That's so great. The first Reading California  Street style and I forget what your 1985. That's so cool. That's great. Okay. So when you were  skateboarding, that would be mostly guys, right? Like where you want pretty rare as a girl.  So not only did you have two brothers, but you were skateboarding with all the boys.  Yeah. And how was that? I mean, was it fun? Could you or like the girl and you got some  attention or was it painful? Because you were the girl and you didn't fit in.  I loved the guys because there was no drama. Nice. And so I really enjoyed hanging out with  the guys and I was going along real well and I loved the sport of skateboarding. So I was very  I dropped in the ramp and did some freestyle and street style.  And yeah, I was just like your California like sporty,  but yet, punky kind of girl.  But yeah, I love that.  I love that.  I have a friend kind of like that too.  She was from Half Moon Bay though.  So you guys probably didn't compete.  Oh, yeah.  But she was like the only girl in the crowd, but it was fine.  She was ran around that great time.  No, it's beautiful.  It's pretty easy.  There are no drama, I'm a no drama mama.  So I appreciated the voice for sure.  that works out. It works out very well. Alright, so as you're getting into high school, what  were you envisioning? Like, where you think in, I'm going to go pro, but you really couldn't  back then right before the X games, they didn't really have, right? It was really like  Tony Hawk and all those guys that got it going, I guess. But so what were you thinking  you would do with yourself?  I think I, at one point, I think I was hoping to go to a call like a SUSE Street, a  Susan, Pacific, I think it was.  Yeah.  I loved the serve.  I love to serve.  I love to body serve.  So we go to Santa Cruz, periodically and do that.  I was definitely not living a Christian life at all.  At that point, I was raised in a messianic,  some of the Adventist home.  So I was quite, quite rebellious.  What is a messianic, Seventh Day Adventist?  So Seventh Day Adventist, but more focus on the gospel  and less on Ellen White, who's like their profit.  Oh, yeah.  So I grew up about 15 minutes from Ellen White's house.  And so like, in your Anguin, California,  she was like down the hill in maybe on Bill or somewhere,  no other way, Calistoga more.  But she is a huge figure.  Like she really looms large in that region for seven days.  Yeah, but we have Adventist Health Systems,  which is a huge medical system that is all over  the West Coast. I don't know about here about shirts here too, but so I went to  Avenue schools, Avenue stalkers, Adventist Dennis, Avenue Hospital,  Avenue's chiropractors, five generations, seven,  the Adventist.  Well, and so were you guys vegetarian?  Yes. Yeah. Yeah. Cause we have seen as an Orthodox  Christian is not as exciting for me. Right.  As fast as seen as an Orthodox Christian, if I just looked at it as food,  It would be nothing new.  It would be my life.  It's almost just on the beach.  It's definitely be like,  powerful about it because it doesn't feel  like I'm missing something.  Does that make sense?  I feel like I'm doing what I've always done.  Yeah, absolutely.  Well, and it's almost,  but if you are eating meat on the alternate days,  those days in a weird reverse way have meaning, right?  It's like a feasting day,  a normal day versus a feasting day.  Right. So yeah, so no no pants when I was a kid only dresses. No jewelry of any kind. No nail polish.  Yeah.  No, anything nothing on the Sabbath, but like walks in nature. No right.  You bike. Like on the Sabbath was Saturday. Notably, not Sunday.  I mean, actually in Christianity, the Sabbath is Saturday. Right. We just go to church on Sunday.  We have Holy Saturday. Right.  Right. Yeah. I mean, you just don't go to liturgy that day. That's not liturgy day necessarily. Oh, it might be if you want to.  I mean, there were definitely some like some things in  Adventism that I obviously had to like work myself out of Adventism kind of come into  what real like Christianity looks like outside of that system because it's so defined and separate.  But I'm really grateful for my upbringing.  I'm really healthy.  And we had a very tight community my whole life.  Like I saw churches that knew generation after generation after generation after generation  after generation after generation.  That were the same people.  So there's kind of a beauty in that, you know?  But it's very rebellious from that.  Like very...  It's a tough culture, right?  Because for those who are not as familiar, I don't think a lot of people are really familiar  with seven day adventism.  It's a healthy culture.  They're all vegetarian.  We lived near a grocery store that was set  to the adventist.  And of course, there were no animal products at all.  So you couldn't run and get milk,  but you could run and get bread.  But that's kind of funny.  And then we didn't do any spending on the Sabbath.  We didn't shop on the Sabbath.  We didn't drive our business church.  It was a set aside day.  I have really great memories, because my dad loved nature.  So we always went on Sabbath afternoon drives and we would just land up on like Canada.  Wow. That was so cool. We just get in the car and we never knew we were going and we  end up somewhere in Michigan or not Michigan Montana or Rockington or the coast or Canada.  Like he would just get in the car. I've the church. We just spend the whole  weekend. That's amazing. Well, it's a beautiful area where you live  anyway, right? Paradise, if you just drove around. I mean, there's a reason they call it that,  Right. It's just a forest, right?  Yeah. It's, well, yeah, it burnt to the ground and the car fire.  90% of paradise burnt to the ground in 19, when I'm 2000,  19 or 19. Oh, my God.  I haven't lived there since we moved from California, we moved from  Redding, California to Pennsylvania in 2016.  So like, years after that, the car fire happened and a lot of my, a lot of our people, friends  and family members and they escaped 150 foot flames.  That's terrifying.  I think we haven't had the same problem.  There was a terrible fire that was crossed through probably around the same time.  And it was just all the stories were just horrific and the pictures were horrific.  Yeah.  That is one thing, you know, poor California, the fire, because I left before the fire  season was a thing.  never stopped at some point. When we were kids, there were fires sometimes. But when I, when I left California, there was a fire like seven months out of the year.  It's not all. There was always smoke. You couldn't go outside of your house. It was, I have asthma from living in California.  Yeah. Just, yeah. Oak was so bad all the time.  Yeah, I have friends who had to leave because their sons asthma was just too bad.  And he came to visit his uncle in Texas and was like, wait, he's okay outside of cat, you know?  Yeah.  That's terrible.  Yeah, it's terrible.  But so it's interesting though too, the seventh dad Venice culture, like you mentioned that  you were rebellious.  Like seventh dad Venice don't drink.  Do they drink caffeine?  They do drink caffeine, right?  But not alcohol.  Not, I feel like not much, right?  No.  No sugar, black pepper, mustard, capping, alcohol.  of any kind to back of any kind. Usually if you're a really good  Adventist, we two meals a day only. It's a whole theology on on the day of  a toenment. So their theology teaches that we live in the  anatomical day of a toenment. So basically we are all living in that one day  a year in the Jewish calendar. Every single day till Christ returns.  That's kind of cool. Actually, like that's a neat idea. That's not true.  But it's a really neat idea.  I guess that's the idea that we're fasting a lifestyle of fasting every day is why they're vegetarians.  And so it's like they're grasping.  It's like they're grasping parts of the true church and teachings of fasting orthodoxy.  And they actually, there's a lot of things they believe that are orthodox.  Like when I first started becoming orthodox, I was like, I've always believed that.  because that's what the adventist taught. So there's a lot that's true and there's a lot that I've been  able to grasp, especially coming from one more Judaic, a very Judaic background, or I maybe  identify more with Judiism that I would put the Christianity. That has a mess I am and I guess.  I think that's very awesome for me actually because it's gonna like, whoa, whoa, like,  I understand the Old Testament really well. I've read it my whole life.  And so I understand the Sabbath. I understand the rest. I understand grace.  So it's been very cool to like learn something and go,  oh my gosh, you know, like my brain makes loading with  with just like I've always known there had to be a  like a connection, but I didn't know what it was. And then when you hear it, you're like,  oh my gosh, how did I not know this?  This is incredible. And then you want to go back and tell everybody.  Yeah, that's the same part.  Right. And they're like, no, thanks. We're good. Yeah.  Because we're keeping the Sunday. So that would be like a  Yeah, which is interesting though, right? Because it's like, well, no, we  we believe that Saturday's the Sabbath. We're just not as good at not doing stuff.  But it's, you know, it's it's not actually that anybody argues about the Sabbath.  It's a people, no one people argue about it as ones who don't know what the  Sabbath is, right? Like if you think Sabbath means church day, then you're like, no,  no, no, it's Sunday. But not with this church day, then we're not rushing.  Yeah. Cause church day is definitely not a rather, it's not, it is a day set apart.  It is holy. It is beautiful, but it is not restful. Right. Any clergy person could  tell you that. Yep. So true. The last thing we would do is rest on the Saturday.  You gotta get stuff done. Yeah. But so your dad, he said he was a neat person.  We go on these drives that would just end up, who knows where, amazing, faraway places.  Because paradise is pretty far into Northern California.  I mean, it's not around the corner from Montana.  It's not, you know, that's a drive.  So I was born and raised in paradise, but we did live in Oregon.  Okay.  Oregon for a little time.  So that was kind of beautiful.  It depends on where we were.  But we have the Idaho for a short time.  I was born in paradise. I graduated high school in paradise. I have my first children in paradise. So yeah  Well, and you're little detours to other places where all equally gorgeous amazing  What was places like they're just I've lived in the North Pacific Northwest essentially so that's  Except for Pennsylvania so yeah, we're 3,000 miles if you look at a United States map  My daughter one time for Christmas made me this she drew this map out with black and white paint and  And like it's perfectly beautiful map.  And she took a red thread and she sewed the red thread  from, from Redding California,  where we wore it the time,  all the way to Hairsford, Pennsylvania.  And she put a little red pin there.  And if it could crazy to look at it,  because if you look at the map,  it's like equally left east to west,  like equally like the distance from each edge,  and like not least straight across.  Yep.  And so what do you have on my wall?  I want to say that Interstate 80 goes to Pennsylvania, right?  Because when you're in California,  there's a certain moment.  I can't remember where it is, but it's like on the road  to Sacramento from Napa probably.  But there's a sign that says,  it's like Philadelphia, this many miles.  And you're just like, what are you, what?  But yeah, I 80 goes right through.  You just stayed right on the freeway  and just moved right along the way.  And now we're living in Redding, California.  We were attending Bethel Church,  which is a very, very popular charismatic,  like a world international union.  There's that church for nine years.  And before we came to Pennsylvania,  so, but I came here for a midward free job.  And so we traveled across the country  and just took a leap of faith.  Wow.  So, you knew nobody here.  Well, I'm curious if there was something  a little bit familiar about living so close  to the Amish community,  because you guys are right out,  I mean, you're right in it.  You're in Amish country, right?  Yeah.  And so does it, does it,  they feel like there's kind of a kinship  between the Amish and the Seventh-day Adventists  or do the Amish seem like a whole other thing?  I mean, they are a whole other thing, obviously.  My mom used to say when I was growing up,  but I was half Amish as a joke.  And then I ended up serving and moved here  to serve the Amish community because I actually understand  what it means to have a religion be a culture.  So I wasn't confused by the fact that they were religious,  but had a culture because I grew up in such a tight culture  that I felt like at the time,  I remember believing in like,  I think God has sent me here to be a missionary to the Amish  because I actually identify with them.  I get along so well with Amish people.  I have Amish friends.  I can go to their house and we have dinners together.  We take, we take horse rides.  We're still friends, even after I've caught their babies.  And I really believe that there's just something very,  yeah, I mean, I don't believe it.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  I love that friend.  She is the one that is  Creating that life and pushing that baby out and doing that work. I'm just catching it. I'm just said  Here God here. Let me put my hands out. I'm gonna catch this baby  I'm gonna bless that baby. I'm the first person usually to be able to touch a baby  I always say mom put your hand on touch your baby  And I think that is so precious and dad come catch your baby. It's not my baby. I'm just the one that's helping making sure that things are kept  I was called a sacred space where I'm holding that space for them so they can have a normal  healthy birth away God designed it to be.  And I'm keeping things normal and I'm watching to make sure it can stay normal and very  few times I've ever had to go to the hospital.  That's lovely.  That's lovely.  That's a lovely way to think about it because it really is true.  There's always this person who has inserted themselves who often doesn't.  I mean, you know, even if a woman has a regular doctor, she can go to the hospital and  it's a different doctor on duty and there you go, right?  So it's such a stranger a lot of the time who has nothing to do with the creation of  this child.  And it's a sacred co-creation with God.  And then this random person just gets inserted literally and is sitting there, you know,  how beautiful to have the father, if possible, catching or, you know, and to see yourself  more as someone who's there to make sure nothing goes wrong or if something goes wrong  to make sure the right thing is done for it.  But not so much to run the show  and to think that you're part of the home.  And usually all the complications  that would happen in a home birth  are going to be weeded out in prenatal care.  So you're gonna have labs you're doing those things.  And so you know that, you know,  this is a very low risk birth.  I'm not doing, I have done two set to twins  and I have done a breach at home.  But for the most part,  I've done just single pregnancy  with, you know, lower swim and all really good experiences with all those things. But um,  and I'm very grateful to God for that. But I think that's because, um,  yeah, I just training is really good. And then I had really good training and I got my license,  but also I just have a relationship with God. And he said, I always say, Jesus is the best midwife.  So, you know, I can come in and do what I'm going to do. But the best midwife is not me.  I love you. I love you. I love you. I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  I love you.  but everything is traumatic and stressful and dangerous.  Because birth is not dangerous.  Birth is a natural normal physiological function.  And most of us can give birth normally naturally.  And when we can't, we have the beauty of the medical industry  and the hospital and doctors that are doing their ministry.  But at home, I try to guard normal birth.  That's neat.  That's really neat.  It's interesting that idea that God is the best midwife.  And this sort of, you know, I think of,  and it's a much smaller way.  But like, even with Sunday school,  I've always really believed,  you don't walk around picking Sunday school teachers.  You just pray for God to reveal Sunday school teachers.  That's how the good ones come up, right?  But how much more so with that?  And I think with almost any project that we do,  if we can say, Lord, do what you want with this.  Like this is my offering.  Do take it where you wanna take it.  Sometimes that's nowhere.  And sometimes that's something amazing.  and whatever it is, you know, glory to God, like him.  He's running the show anyway.  So if we can cooperate with that.  Absolutely is.  And it's good to partner with him in that, especially as a midwife,  because, you know, it says, um, an exodus, the midwives feared God.  And so it's really important to remember that the midwives,  the ship are at in Pua were their names feared God.  And they didn't kill the babies that the Egyptian king asked him to kill,  because he were people were becoming too numerous.  And so they wanted the midwives to take out the babies at birth.  And the midwives said no.  It was a wholly disobedience.  And they feared God.  So I always think your primary goal as a midwife first and foremost is to fear God.  And your second is to serve that woman and give her hopefully the best experience that you can.  And when things are in gray areas, I'm trying to steer them back to normal.  And then when things are out of sight of an normal area,  no one to transfer and say, not be prideful,  stay humble and say, you know what?  We've done so good.  We really do need to go in.  And so what happens, which is not very often,  women trust, we trust each other  because we have a relationship.  I spend an hour, every month, we spend at least one  and a half hours together.  And then every two weeks, another hour,  and then every one hour, I go to their home,  I know their kids, their farm, their family.  So we're connected in a different way  than just a five minute visit with some of the comes in measures  and says, sounds good bye.  No offense to that.  They're serving hundreds of people.  But I really am privileged to be able to go into that home  and spend that time and really get to know somebody.  I really love that.  You minister specifically to the Amish community?  Um, 80% well until last year, about 80% Amish and about 20% English or non- Amish.  But yeah, I would say almost all Amish.  Okay.  What kind of the Amish community?  How is that organization then?  Is it an Amish organization that hired you like, who do you work for?  I don't work for, I work for my Jesus.  Okay.  I work for nobody.  I'm independent midwives.  So I'm licensing California originally and then I work as a traditional midwife in Pennsylvania.  But I have access to like I can file my own birth, my own birth certificates to the computer  through the state and I, yeah, my newborn screening supplies from the state.  So I'm connected but not connected.  That's neat.  That's really, wow, that is really, really cool.  And so, all right.  I'm sorry, I'm just sitting with this.  Like it's so cool.  I'm so interested in this idea that you went from like the 7th ad  bun this community to the Amish community.  And in some ways they're so far apart but in some ways they're so similar.  And that's the idea that you were comfortable with the idea that a faith and a culture are the same thing.  And as you're saying it, I'm thinking,  isn't it crazy that we're not comfortable with that in the US?  Because your faith should be so strong that it should color everything in your community, right?  like that. You know, when you think of Judaism, you think of orthodoxy,  and Greece, or in Russia, or wherever, I think, you know, we don't quite get it  yet because we don't have our American Orthodox culture ironed out enough,  but it's getting there. You can start to see it, right? Like you can start to,  if you're talking to someone about what she's cooking, you might figure out  that she's orthodox. Like, this is true. Especially if it's a Wednesday or  Friday. Yes, exactly. Like you can see those little signs. There are a lot of  little signs. But wow, how beautiful. All right, well, we are going to be taking a very  short break. And we're going to come back. And I want to talk definitely about your family's  journey with Huntington's disease, your decision to write a book about it. And I want to hear all  about that. So we will be right back with Karina Hall.  Here after Pazka, the Orthodox Church celebrates the Holy Mirbearers who cared for Jesus's  his body after he was crucified. But Murbaring has a broader definition. It can serve  as a metaphor for the practical, incarnate love to which Christ calls his followers.  In the art of Murbaring, author Elisa Bielotich Davis explores the lives of grace-filled  Murbaring saints in Scripture and throughout the life of the Church.  Offering questions for reflection in each chapter. By following the lead of compassionate  saints such as Joseph of Arimathea and Olga of Alaska. We can learn to embrace a simple  and profound way of life in ever deep and in communion with Christ and with others.  You can find this book at store.angentfaith.com. Again, that is store.angentfaith.com.  Welcome back to Everyday Orthodox. Tonight we're talking with Karina Hall from Pennsylvania,  although originally from Paradise, California,  and Corinna's a midwife.  And so we've been talking a bit about that.  And Corinna, I really do love what you were saying  about the idea that the midwives feared God.  And of course, that's a saved Moses  and so many other babies.  But it's also like what an amazing history  that to be able to lean on and what a beautiful thing  to be able to think about.  But okay, we have to move on  because I want to hear all about.  So I guess you were still in California  when you met your husband and or when you left seven dad  venism.  So tell me about both of those things  in whatever order makes sense.  Okay, so I met my husband in high school.  There were actually high school sweethearts  and we've been married for 37 years, 38 years in January.  So since 1988, we've graduated high school together in 1987  And we got married in January, 1988.  So about six months after high school,  we actually met the prom.  We knew each other before, but during high school,  he was like four foot nine or something,  like a little little junior and or freshman sophomore year.  And then junior kind of was like,  oh, he's kind of cute.  And then senior I was like,  oh, this kid's really cute.  And he's finally like my height.  I was like finally up to where I was.  So we hit the cut-off point.  Yeah, so we met at the prom.  We actually, I was going to the problem with one,  with a boyfriend.  He was going to the problem with his girlfriend.  We ended up talking all night long to each other.  And the next day, it's typical high school.  They got together and we got together.  Perfect though, because then they're consoled.  They're not mad, they're fine.  They're like, they're good for each other.  They're perfect.  I mean, I don't know how that ends up.  But, and so at the time, I had just recently come back  to walking with God again through young life,  which is a program through high school,  in Chico, California, actually.  And my husband was raised atheist and he's Jewish,  but with no Jewishness and atheists,  but with no talk about it.  So basically, just napping.  And nothing is you could possibly get,  and I was raised with so much,  that we had a lot to talk about.  So we met and we started dating then  after the prom, then after the prom  and we've been together ever since.  Wow, that's wonderful.  That's so, you know, that's adorable.  So you guys got married young though.  I mean, that's gotta be challenging.  That's gotta be hard.  Yeah, I was 18.  He was 19 for 20, less than 20 days.  And I was 18 for another like two weeks  when we married and we, we did nothing.  Okay, just to preface this ahead of time,  there was no Holy Matcharmoni,  there was no church wedding.  We got married, we married ourselves first.  And my mom said, you can't do that.  Show me your certificate.  So they're like, okay, so we hired an aura reader  to marry us on the beach in Vashana Island, Washington.  Oh my gosh.  Oh my gosh.  And we're not Orthodox, but you picked Vashon Island,  which is the home, of course,  of a well-known monastery with after free fun, right?  We used to see the monks all the time,  but I had zero idea of what,  I mean, I was raised to Adventist,  so I probably thought they were Catholic,  and I was like,  even if they, yeah, I wouldn't have even considered  what they were, but we had these monoliths on Vashons.  So after high school, we got in the car,  and we drove to Vashon,  And we lived there for like six months.  And we got married by the Ora Reader lady.  I don't know who she was.  What is that?  Yeah, Ora Reader, what is that?  Like a new age thing.  I don't even know.  I don't even ask.  We had a Christian wedding,  because at that time was again,  like not following anything per se.  We hired this Christian pastor to come do a wedding  for my parents, but we were legally already married.  So I technically have three weddings.  Right, a self wedding.  And my wedding, my mom's like, I don't think so.  And that was right.  I'm pretty bad.  I mean, I'm just here mom.  I'm like, she'll send me a copy of the certificate.  I'm like, I'll tell you what.  I mean, Northern California at that time,  all my antonine goals, they're all common law married.  And it's like, they had a service in the trees.  And so they're married.  that's like, you know what, that's not gonna work in court, man.  Like we went to a pie-placed market in Seattle  and got little rings made and put it in a little bottle  with little incense and flowers  and wrote a little love note about our love  and we threw it overboard on the ferry  into the Puget Sound.  Like boom, more married.  That's it.  I mean, in some ways we had it like understanding  that a piece of paper didn't actually make you married.  It don't make fairs there.  It'll keep you married.  So we had that like early understanding because we both come from divorce families and I think we just didn't want that to be for ourselves.  And that was kind of our reaction to that as a teenage mind.  Yep. And then I think that's really common actually right like this sense that like listen doing it the traditional way isn't working.  Like look at the end of the round us it's not working.  So trying to find something else is not it's actually not right.  actually not stupid. I mean, it's not great either, but it's not totally out there dumb.  No. And then we, when my mom said, we're a certificate, I'm like, oh, I better find somebody.  So I was taking a meditation class or something and I asked a lady if she'd marry us and  she did. And then my mom's like, well, aren't you gonna have a wedding with us there?  I'm like, oh, so then I had another wedding. I guess I just want a certificate. I mean,  Here you go.  She kept saying, I'll be in the ball.  You're just getting moving the bar.  What's going on?  That's so funny.  So we had a Christian wedding.  And yeah, my poor mom was probably inside just,  just not, she probably just shambled in.  But here, we are like the least likely couple  to still be married.  We have like no foundation in anything when we got married.  We were kind of messing with new age stuff  and hippie staff in general,  and doing drugs here and there,  not like hard things, but just hippie things.  And I feel like,  I used to say we were a wholly accident.  I love that.  But then last year, when I said that out loud,  I heard the voice of the Lord say,  don't say that anymore.  You worked really hard to say, married.  I'm like, you know what?  You're right.  I'm not really hard.  37 years is not a wholly accident anymore.  I'm in.  And I think it was like, I've been saying that for so long, he's like, I was like, I'm  going to give that.  And I realized, okay, it does, it takes the choice because even if you're not able  to love that person the same way all the time, which if you're married, you know what  I'm talking about, love grows and changes with time.  You always can love the third person in the marriage.  You can always love God.  And you can always love you back and give you what you need, even if you partner can't.  And so I think of that over time, as we both became believers, I was 22 when I got  baptized as a Christian again in the force for gospel church.  My husband was 23 when he became a Christian by a dream.  He had a dream that he was sitting in a meditation room.  It's all he probably knew at the time to dream about.  And there was a star David on the wall.  And he was looking at the star David and he sat down  and he started to like go into this trance in the dream.  And he looked at me and I was like,  Richard, Richard and the dream was in the dream with him.  Where are you going?  He goes, just take your place.  Just take your place.  I'm like, where are you going?  Cause I can see that he was like losing the around him.  And the star David became a kaleidoscope,  but it was a star David with this.  started David with the star David.  He followed it in the dream  and landed on the face of Jesus Christ in his dream.  And he said,  it went,  and he said,  the minute he saw Jesus's face,  he knew that he was God.  No one told him.  He said,  he knew he was God.  And then he woke up and he was like,  he called me,  I was a business my mom in Luddai, California.  And he called me,  I was like, I'm a question now.  I'm like,  what are you talking about?  I was in Luddai.  What do you mean?  I'm like, we're Christian.  You were Zen Buddhist last time I saw you.  And now you're, what?  Like, it's been 15 minutes.  What are you talking about?  I knew I'm like, what do you mean?  And he's like, I saw Jesus face  and I went to a Catholic church.  And I talked to a priest and I'm like, what?  He's like, yeah, he gave me this card to pray.  The hell Mary and he's like, I told the priest.  I didn't see Mary.  I saw Jesus's face.  He didn't have a theology yet.  And so he, then we started going to a little Orthodox church  in Eugene, Oregon.  That's what we're living then.  Really?  Yeah, Tint John, Tint John the Wonderworker.  Wow.  It's our first Orthodox,  which was our first church as a Christian couple married.  By that time we had  Autumn was born in Paradise, Kyle Paradise,  Zoe was born in Eugene, Oregon.  So by the time we were in Oregon again.  But wait, so hold on.  You can't catch up with my move.  Yeah, wait, where's the fourth square time?  When were you at the fourth square church?  When were you, okay?  So was you were in the charismatic church  and then the Orthodox church?  Or was it Orthodox,  you're a medical Orthodox?  No, that's right.  And then the Orthodox church for a very short time.  And again, it was like confronting all of my Adventist beliefs.  Like I saw that Father David and Esther were the priest  in his wife.  And I remember him bowing down and kissing the icon.  I'm like, oh, idolatry.  And I just didn't have a great foray.  I was, we didn't even have a cross in our church.  I had no grid for anything physical,  except for they all have the three angels  on their stained glass, but,  right, but that they don't have crosses in the churches  and then where crosses, we don't wear jewelry.  So I didn't have a grid for it, but I felt drawn to it.  But so then we went to St. Mary's Catholic church  for a little while.  And I was like, I can't be Catholic,  but that's a way to, I can't be that.  And so we became Quakers for seven years.  We were Quaker at the Evangelical Friends Church.  No way.  We were Quakers still in Oregon,  or were you Quakers now in Pennsylvania?  Oregon.  Oregon has Quakers.  I didn't even know.  Yes.  Look at that.  And they were wonderful because they listened to our questions.  And they could say anything we wanted to,  they didn't think it was weird.  We were just like, my husband was coming from such a different  background, I was undoing religion and trying to find what I  believed in all this. He was like starting to learn anything at  all about reasons of God. So it was kind of a beautiful little  landing place for us. And of course, it was hippie and peaceful  all that. So my path on the Quakers are very big on like you  finding your own revelation, right? Like on your own experience of  So I could see where that would be kind of a low pressure,  comfortable, good place to be.  Yeah.  Okay.  All right.  So how do you come back to the Orthodox Church?  Oh, that's it.  Yeah.  So you wanted to skip to that part?  I want to go, no, no, no.  You know what?  Don't skip anything.  Just talk.  Just tell me the story.  Yeah.  This is a great story.  So we ended up after we became Christians,  we decided we just were going to let go of us on our family.  we're not gonna, you know, we were just gonna let that happen.  And so that's why we have seven children.  We wanted 12.  We actually shot for 12.  And people were like, are you guys more man's or Catholic?  They're like, no, we just let children.  We just love babies.  We think babies are great.  And we lived in, we moved to Redding, California.  And I was in midwifery school.  I was working in Redding as a midwife in a Birken Center  and also like interning, I guess.  And yeah, and we just moved from,  we'd moved the Sacramento to a house there for a few years  and moved back to Reading.  So we're kind of in the same area,  within a couple hours.  Paradise Sacramento already all really.  Same kind area.  And my husband, that time we had seven children  on youngest Lydia was seven.  And we'd been in Reading,  but we moved there for Bethel Church  and we had been in Reading maybe like,  Let me think nine months or something.  We didn't know a lot of people yet.  I'm sure.  I'm doing a big, big church.  And my husband worked in Sacramento, so he was commuting back and forth.  He was a tech, he was a tech, who's a web developer, software engineer.  So, and I was midwife working in the student.  So, and we had a lot of kids.  And I was homeschooling some and some weren't college and some were in regular  school and some more charter school in summer homes.  It was, you know, I was working full time, but it's just crazy time.  I don't even know how we did that.  And one day, this is a Huntington's journey.  One day, my husband, watched probably back up.  So we'll make more sense of it back up a little bit.  When we were in Sacramento, and my husband's mom died of Huntington's,  she was only 56 years old.  So Huntington's is a neurodegenerative disease and it affects your thinking, walking, talking,  swallowing basically, it generates you into the point where you can't do anything for yourself.  You are in diapers again and you basically degenerate, you stop being able to swallow, and  then you intentionally die.  But it's a very long process.  So it's like having ALS and Parkinson's at all times in one disease.  So imagine all those three things as one.  So my husband and I, in Sacramento, we're both dreamers.  He had a dream, and in this dream, the Lord told him,  you need to go see your mom.  Well, his mom had been on drugs.  Old hippie, lots of alcoholism.  Really neglectful of her kids.  Like, his younger sister was taking care  of her younger two twins.  One who was multifally bad with disabilities.  She eventually died.  And that dad that was in alcoholic,  and she was out in bars and drinking because she had hunting  tins and there was no test then,  and there was no way to, no medications then.  And so she was just living wildly  because her mind was changing  and leaving her kids at home for days and without food.  So he hadn't talked to his mom,  and we hadn't really had them around our family,  her around our family because it was a very toxic environment.  Very sad, but at the time we didn't know,  that we thought was just drug South.  Paul, we didn't really realize it was Huntington's.  Cause that was before,  in 1994 when there was actually a way to test for it  and tell them there was no way to test for it.  So what the doctors are saying is that in retrospect,  all of this erratic behavior is really related  to the cognitive decline and just all the weirdness  of Huntington's.  That's right.  So all of that was happening.  And you get this bitterness in you because you think  just doing it on purpose and why don't they get their act together and all those things you think.  And when you find out when we got the letter that his mom was sick eventually in 1995 or for  pregnant with my fourth child Levi, we got this letter. We're like, wait, what? And it's genetic and  all of our kids are a 50, 50 at risk. So I'm like, oh my gosh, like, are we gonna keep trusting God now?  Because we said we were gonna trust God or new believers. And so we said, we're gonna trust you.  I'm pregnant. We saw a genetic counselor.  But fast forward, we made that decision to continue letting God plan our family, which we had never regretted.  She had a dream that he was supposed to go see his mom and him. And the same week, someone from our church, I come up to him and said,  have you forgiven your mother? And he was just like, wait, what? And she's like, have you forgiven your mother?  I feel like you're supposed to forgive your mom.  And he's like, I haven't talked to my mom in five years.  I don't even know where she lives.  That's a real story.  And so then he had the dream,  and then he woke up and told me, I said,  if Nancy said, go see your mom,  and then God just told you to go see your mom,  better find your mom.  So that was the Thursday.  He left on Friday.  He drove back to Eugene, where again, where she was,  and looked for her for the whole weekend.  He didn't find her Friday.  He didn't find her Saturday.  He was desperate.  So any morning he said, he called me crying,  and I can't find my mom.  Like, where could she be, right?  So he's looking for his mom, looking for his mom.  He can't find her.  He found me at noon.  He calls me sobbing.  He said, I fell my mom.  I said, oh my gosh.  She said, I called every number in the phone book.  And she was at the last five numbers  in the phone book for nursing homes.  And the nurse had come right now.  She's dying.  I said, what?  He said, she's dying.  I said, well, go.  And then call me, you know, when you find out.  He found her at 12.30, and she died at 4.52 in his arms.  True story.  Wow.  He held her.  He held her.  He sang Christmas carols over her,  because he didn't know, he didn't know what was mean.  Those were his.  Their hands would be incredible.  They didn't know.  Oh, don't worry, pray for her.  After she knew the Lord and wanted to know Jesus  before she died,  he just let her as close as he could to the Savior  and then she died right in his arms.  And then his sister called him as like,  how did you know to be with mom?  And she was dying.  He's like, I didn't.  Everybody was like mad at him.  Like how could we even tell if he was done?  Why didn't you tell us?  I can't tell her.  Yeah, he's like, you know, he didn't have time.  So she did his also.  And he was the one who was praying.  Right.  And her.  He's the only one that's a Christian in his family.  There you go.  And I just feel like God just like led him there  and was with her.  So she wasn't alone.  Is her first born son?  Yeah.  That's right.  And then his brother was like,  I can't understand what's happening right now.  Like this is weird.  This is weird stuff.  That's a crazy story to hear for sure.  The baby her spirit was calling to you.  And you know, he's like,  I don't think it was her.  She's not magic.  But yeah.  Yeah.  But it was a very, like, whoa, you know?  And that was the first time that we, I think he truly  forgave her that day, which was very important to do.  And I think that it forever changed our lives.  Because she's like, wait, she's young.  Right?  Right?  So when he, so he has Huntington's as well, right?  He inherited it.  Yeah, he does.  Yeah.  Yeah.  When did you find out?  So in 2009, we lived already in August 8th of 2008.  And then May of, or I'm sorry, in February, 27th, 2009.  I don't forget that date.  I had someone in labor supposed to go to the birthing center and be an assistant first  mid-wife at the birth.  And my husband goes back and forth to work from Sacramento.  About two and a half hour drive to ready in two hours and maybe 50 minutes from relived.  And so I knew he had left work at noon because he always left around noon that day on Friday.  And it was like, he should be home about 330.  I wouldn't give the kids from school came back.  No husband.  I make dinner if he had the kids.  No husband.  I get to nighttime.  They're, I put the kids to bed.  No husband.  I tend to talk I'm freaking out.  I'm like, where is my husband?  I'm calling leaving messages,  going right to voicemail.  I'm like, something's wrong.  Like what is happening?  So I put a little thing on social media,  hey, please pray.  Like my husband hasn't returned from home.  I think I'm gonna start calling hospitals.  I called his employer.  He left at noon, 1230.  He just disappeared.  And so I called the police and like,  we can't help you for 24 hours. So as I've known tomorrow, I hope you're missing person. But  right now, we just have to wait and see. So I called everyone of our family members and said,  look, maybe he knocked the road in this truck. You know, it's, I think it's the interstate five.  It's pretty straight, but there's a lot of like ravines and creaks and things. He could  have fallen into a ravine. He could be upside down in a truck. He could be needing help somewhere.  So we called the forces up. And I mean, we had everybody looking for my husband up and down  from Sacramento to Reading, California, every bathroom, every camera from a gas station,  every place we could possibly look. We have people praying all over the world and praying.  And no husband, just gone. Got back around four o'clock in the morning. I'm like,  where are you? And I'm asking the Lord, like, where is he? And all I knew, and I don't know how  to tell you how I knew. All I knew is that he was cold and he was wet. And I don't know how I  I actually physically felt cold and wet.  Like I don't know, babies, there's some like marriage,  you know, God's ordained connection there  and that, I mean, no, there is with marriage,  but like there was just something about it.  And so another person called and she was like,  how'd they praying?  And I just really feel like he,  he's somewhere like west of I-5,  like toward the oceans.  I'm like, okay, well, we'll start looking  that direction because I mean, hey, you know,  maybe God's speaking in this different way.  And so we started looking that way.  No, no husband, no new, new kids came back from school, no husband.  It was like in the evening that night, I finally got a call from the police.  And they found him three and a half hours west of I five in the national forest,  hiking by himself.  His car was in a creek stuck and hiking out with no cell reception for 17 hours of  hiking all that time. He talked to miles and miles and miles in in work clothes with no water, no food.  He in his brain started to change a little bit and he decided that would be a good idea to take a logging road home in February in Northern California.  And of course, a logging road gets narrow narrower. He found me went down into a creek, realized he couldn't turn around realize he had no cell receptionist running out of gas.  went down into little ravine to come back the other side of the road and a creek was down there and when he went over the water it just sunk in and started filling up with water.  So we jumped out of the truck into the back of the truck, got some clean water from the rain in the back of his truck and high to 17 hours.  in the North of Urcy. Wow. That's one way to find out that you've got some cognitive shifts.  Yeah. So when he got so dramatic, oh yeah, we in all the new, was on international news,  on national news, it's gone all over by that. Right. And you know, husband of seven disappears,  you know, and when he got home, I don't know whether the hug and were killing him. Right?  I was so, I was like, if this is intentional,  I don't know that,  who are you?  You have is broken.  Like I don't know.  Why would you do that to me?  I thought you were dead for real.  Right.  And how could you do that to me?  If this is an intentional, this is H.K.  This is Huntington's.  And so I just said,  I need to make a line here in the sand.  This is the line.  You're going to get tested or we have a problem.  We have a problem.  Right now you're being tested.  And so, yeah.  And so he decided, yeah, he said, I know.  He was so sorry.  He said, I'll get tested.  But he told me two things.  He said, when I get tested, you have to promise me.  You'll never lead in a nursing home.  ever. And that, and that you will, and that you'll put me in front of some amazing worship  when I can't talk anymore. So I can just be in God's presence. So I said, okay.  And so we got a call May 17th, 2009. So this would be like three months later,  after a series of psychological evaluations and blood tests and all that.  And the doctor calls and all we were all like everybody was on like, you know,  notice because we knew she was calling.  And we knew this was results which is going to change our life.  And I just knew he had it.  I just and he doesn't have it.  I'm fine.  I'm like, okay.  That's not the dog called.  Yeah.  And we said, we put the phone down.  And we said, hold on a minute.  I said, hello.  Hi, this is Dr. So and so.  I said, okay, can you learn the minute?  So as a happy result, I know, one second.  Put the phone down, we got in our knees,  and we just said, God, this is up to you.  You knew beginning from end, we don't know it,  but help us through it,  because we've always been taught,  don't ask why, ask how.  So we don't know how we're gonna do this,  but we're gonna do it.  Because why is kind of like self pity, like why?  No, no.  How was like, how can we get through this?  So we got up and said, okay, hi, here we are.  And they said, he's positive.  And we just cried and sobbed and cried.  And then we called our pastor,  we're like, how do we tell our kids?  You know?  And they're older now.  We have older, we have college age, high school,  junior high elementary.  And he said, we'll tell him in age bracket groups.  So it broke him up until that little parts  and told him each one.  He got to our youngest daughter, Lydia.  She was seven.  And we said, we told her.  And she goes, I know what you're trying to tell me.  And she runs in the other room.  And we hear her put on this, like, kids worship CD.  And she's in the room and she's singing.  And we're sobbing, because our response is like, not bad.  She's like, I'm never gonna stop praising you.  She's us.  And she's in her room and she's crying out.  She's little.  And she's saying, Jesus, I'm never gonna stop praising you.  And I cry, I think it about it.  And she comes back in and we're like, humble.  Like we're like, what is this kind of response?  Right.  And she says, I know, God, she said,  Jesus told me he's gonna heal daddy.  And I said, you're right.  He is gonna heal daddy.  And however he wants to.  And she said, and so we just,  and so we took that as like,  healing doesn't always look like what you think.  supposed to look like. He and sometimes looks like what you need, not what you want. So what we  learned. And so we just said, okay, like we kept living our life. I took a year of just a  grief. I needed like a whole year just to get our everything back together. We could function  and just to accept it and kind of move with it. And I had this world of the time over my life that  that I was like everyday grays, like everyday grays.  Just everyday grays, God, everyday, not the day before,  not tomorrow, just stay here and your everyday grays  keep me here.  And so that's how we blibbed,  because I don't know how to live in this, this much grief  and this much yuck.  Yeah.  Any other way.  I don't know how to do it any other way.  There is no other way.  So we just decided to love better than we love before  and take it one day at a time, which we've done.  And that was what that would be like,  Lydia's 20, 20, 25 this year.  Wow, this was 20 years ago.  It was 20, 24 years of,  and be 20, 18 years I think.  Yeah, 18 years of diagnosis  and 10 years of caregiving in October.  But I've caregave now for him for 10 years.  Yeah.  Yeah.  Well, and so you know, God willing to address,  you'll do it for a long time.  It's hard to.  Yeah.  You don't know.  I mean, he's on hospice now, but that could be.  That could be a long time too.  Yeah.  So it has been a definite like process.  And that actually that process and that suffering  that our family has had to walk through.  That is why we're orthodox.  You can go for the joy anywhere,  but you're not gonna find the joy this deeper than sorrow  without finding Christ himself.  And you're not gonna find the life that gives life  to our mortal bodies about the Eucharist.  So for us, if people are like,  oh, your orthodox says so, like, cool, am I really?  I don't want to be what the rocks.  I'm saying it with the set.  I said it not want to be.  I was like, I'm not worth the rocks.  Like you cannot make me worth it.  I was going to messian on fellowship.  We were keeping Shabbat.  It was beautiful.  I just,  I was a father's thing from,  from my mind actually.  I fought it hard.  But,  yeah,  but it was the suffering.  It was the understanding.  It was the understanding of suffering as something that could be actually something that  refines us and makes us better.  And it isn't running, not like we have to have it, but we kind of do because we are lousy  without it.  I mean, it's just true as awful as it is.  And as much as nobody wants us to say that, the truth is if there's nothing wrong, you  You just don't have to rely on God and you just never do.  Right.  And then God changed our whole marriage had to change  because things were got really hard  because his mind changed first.  So for some people, physical and the mental come together,  come together, mine was his was all psychological.  Suicide ideation, ready to kill himself one night.  He was at a nursing home for 10 months.  He didn't want to come home.  He was really, really hard for us to be around.  He was abusive to me.  He was kind of abusive to the kids.  He didn't mean to be, but he could help it.  So we're living with this person that like,  you know, isn't, we're like, I tell my kids,  that's Huntington's talking.  That's not your dad.  Yeah, but that's really hard to take in as a kid.  And so that's really hard to take in as a wife too,  but it's really hard as a kid.  It was just an awful time.  I started to not like my own husband.  I loved my husband, but I didn't know.  I was married to an actual stranger.  I didn't know this person was anymore.  And so that became really, really difficult until,  until he went to the nursing home.  I had that little 10 month break.  And in that 10 month break, God did something really  miraculous with my heart.  He began to show me what covenant looked like.  As one time a pastor said, do you love your husband?  And I said, no.  But what he should have asked me is, are you in covenant with your husband?  Yeah. And I would have had yes.  Yes. And I don't like him.  But I'm not going to go anywhere.  But the Lord did a work on my heart in that 10 months.  If time and I had read 1 Corinthians 13, a thousand times in my Christian walk, a million times.  And in and in that time that I had read that 1 Corinthians 13,  I never read love doesn't fail like I read at that night.  And I was like, I don't know this kind of love.  Yeah, I don't know if I don't know that kind of.  Too much, right?  Only God has that kind of love.  And I know God has got it.  No way.  And I started repenting and telling how sorry I was for  with holding that love from him because I didn't have  that I needed anymore and I had all these excuses.  And the Lord gave me a great set night that I have never  been without since that day, that would be 2018. And I've never ever  lacked the love for my husband since that moment. And it was like this.  It just was like a grace to be whatever he needed and receive nothing in  return, but have everything I needed from God along. And that was that was  really needed.  If so, as we close up, I just want to know. So if any of our listeners are  entering into whether it's Huntington's or something else,  it's really difficult, especially with caregiving  and with loved ones.  What advice do you give them?  If we're entering into it?  Yeah.  As they enter into it, is there anything to hold onto?  Is there anything to help them stay?  Whoa.  Kill your expectations first.  Clean to God, always.  and take it literally take it one day at a time,  because that's all you have.  You don't have tomorrow, you don't have the past,  you have today.  And if you screw up, it's okay,  I screw up all the time.  I praise here is all my bickering.  Trust me.  And all the things that I feel like I've just done wrong.  But at the end of the day, I'm still here.  We're still married, even if there's not that same marriage.  It doesn't have a same marriage anymore,  but this is the same covenant.  That means change. Right. Right. Um, yeah. And, and, and don't be too hard on yourself.  Cause and also nothing's no, no one has any tense person is the same. Yeah.  So don't don't, don't try to isolate watch videos and like try to like tell my brain how it's going to be later.  I'm not that at all. We hate the unknown, but that doesn't work.  No, you don't learn to live with the unknown. Try to stay today.  Try to stay present with your emotions. Try to stay present with God.  to try to be honest about everything because, like Father Stephen always says, God doesn't  care about our sin so much as he cares about our honesty. So it's really, really important  to remember. It's okay to be honest. Be honest with the right people.  Yeah. That's what you have.  Oh yeah. Well, Karina, thank you so much. It's just such a blessing to have gotten a chance  to sit and talk with you. I so appreciate it. Thank you so much. Thank you so much for having  Well, and thank you to our audience for joining us.  And come on back.  We're gonna have another everyday Orthodox Christian right here on every duerth at Oxford.  We'll see you then.  Good night.",
  "created_at": 1755585186
}