" Sports, Politics, Life. Roberts Robinson's Chevrolet GMC presents Kevin Heatsman has issues  online at robertsrobinson.com.  Well, I can never remember saying anything less controversial in my entire career in creating  so much controversy as my comments that were not the lead story.  I might even say they were buried.  In Monday's podcast about Patrick Mahomes and those photos that he took on that yacht,  in Miami over the holiday weekend with his wife and a whole bunch of friends having a great  time just before training camp starts.  And the comment was very simple.  Patrick Mahomes has belly fat.  That's just a fact.  A lot of people do.  He calls it dad bod.  Great.  I got a dad bod.  All these things are true.  And reaction to this was unbelievable because his trainer Bobby Strope came out and attacked  me on X and other social media platforms.  There were Facebook posts, all kinds of things going on.  I'm getting texts and calls from friends and family.  Oh my God.  You said Patrick Mahomes is fat.  Well, Patrick Mahomes is the one who's made fun of the way he eats.  He's the one.  No, he doesn't make fun of it.  He's bragged about the way he eats.  He has made fun of himself and referred to it as dad bod and all the way along.  He's been the greatest quarterback on the planet.  These are completely separate issues at this point in his career.  Patrick Mahomes is the quarterback of his generation.  He has three super bowls.  He does things on the football field we've never seen before.  He is redefined the position of quarterback.  He is the epitome of greatness.  It will not last until he's 45 going the way he's going.  He turns 30 this year.  He's more than just a number.  It is absolutely a marker for all great athletes where they make a decision on who and what  they're going to be.  I watched Jordan's speech play golf.  He was the best I've ever seen or as good as I've ever seen for about three or four years  in his twenties.  He's got a family.  He's got babies.  He's clearly not that serious about it.  He has no physical constraints at all.  He says he's going to arrive at the British Open next week late because they're having  another baby.  He's putting family ahead of everything else.  Patrick Mahomes puts a lot of things ahead of being in the best shape he can be for football.  He does.  He's doing it old school.  He's coming to training camp to get in shape.  He will lose weight.  His belly fat will fade.  It won't look like it did on that boat.  It won't.  But this is the least controversial thing in the history of sports commentary.  If your argument is, you looked at those photos and you don't think Patrick Mahomes has  belly fat.  Mahomes hasn't been serious this offseason about getting rid of it because that's all we heard.  New haircut, new dedication.  We got embarrassed in the Super Bowl.  Everything's different this time.  Best shape in my career.  We're going for this.  We're going to let our play doing the talking.  That's all we've heard.  Okay?  I'm not saying he didn't work out in the offseason.  He didn't do certain things.  But if his trainer is defending him, saying name a great quarterback, a Hall of Fame quarterback  or a Hall of Fame pitcher because by the way, Michael Walker is also one of Bobby Stroup's  clients.  Name a great pitcher, great quarterback with a six pack.  That was literally his argument.  I'm like, um, Tom Brady after he turned 30 the greatest of all time.  If you can't look at Tom Brady's pictures from early in his career, like the combine  or in his twenties, when they were a defensive oriented football team and Tom Brady was  doing very little as a quarterback, except winning games, 20 to 17, 17, 14, whatever it was.  And what he did in his 30s and then to play to what age 45?  I can find photographs all over the internet of Tom Brady.  Health, fitness, body is my temple, all of these things.  Nobody went to more extremes than Tom Brady.  You're literally killing me with this example.  You're a personal trainer.  And their argument is that Patrick O'Homes is a better quarterback with belly fat than without.  What quarterback has done that since let's say Terry Bradshaw maybe?  I'm not even sure he had that kind of belly fat, but it doesn't really exist today.  You can look at a guy like Aaron Rogers, who's only one one, but he's going to the Hall  of Fame.  And that's what I was challenged with on X.  What Hall of Famers had six pack abs?  But nobody's asking for Patrick O'Homes to have six pack abs.  That's absurd.  Don't twist the conversation.  But do not tell me I've been covering football and sports for 40 years.  I have met and known so many athletes who were fantastic in their 20s.  And when they got in their 30s, they were completely different in everything they did  because they had to.  Patrick O'Homes is not there yet.  He's turning 30, but he's not turning the corner on his fitness.  He hasn't.  He hasn't changed diet, exercise.  He hasn't changed anything.  The argument here, which is absurd.  It's the only athlete in history that makes this argument is I'm better with belly fat than  without.  I can withstand a hit better.  So your belly fat is better than having a strong core, a strong muscular core because most  athletes I've ever met talk about core workouts.  They want the core of their body to be as strong as it could possibly be.  Rip not six pack, not I'm a model in a magazine.  No, the best fit it can possibly be for the position or sport that you play.  Michael Walker is 34.  He has the same trainer.  He's never had belly fat.  But Michael Walker did have a problem when it was 28, 29 and 30.  What happened to Michael Walker?  His numbers went down.  He had the worst years of his career.  He rededicated.  He's in tremendous shape.  Michael Walker has no belly fat.  And after he turned 30, he had one of his best years ever in age 31.  He got signed by the Royals and then another contract by the Royals.  Michael Walkus probably never had belly fat in his life and maybe they're different  people and maybe that's not a perfectly fair comparison.  But it was never going to happen.  And I'll bet if you ask Michael Walker right now at age 34.  Okay.  I'll bet he tells you he works harder at it than ever before to be where he is.  He's got an ERA in the low threes.  He's having three or four prime years in his 30s because I'm going to guarantee you  he'll tell you he worked his butt off.  And he does things completely differently now.  13 years into his career.  Then he did three years into his career that everything changed.  He started to feel it.  He started to see it.  He had to change what it is that he does.  He's got the same trainer.  Where's Bobby Stroop saying that Michael Walker needs belly fat?  Please tell me that you because he works with pictures and quarterbacks.  It's a lot of what this guy does.  Michael Walker is 6, 6, 2, 15.  That's there.  No belly fat on the guy.  I'm sorry.  There's not.  He after he well, last year with the Royals at age 33 logged the second most  innings of his entire career.  Previously, the most innings were 2015 when he was what?  23 years old.  It was 23 and he logged 160 some innings.  He did it again last year.  Second most in his career behind that year in 2015.  And he did it at age 33.  That's what I'm talking about.  I've seen it over and over and over again.  I've never seen a quarterback body like Patrick Mahomes.  And they actually say that's what they're trying to do.  Now, maybe he is the unicorn.  He certainly plays the position like a unicorn.  We've never seen guys throw left handed.  We've dealt with it.  First quarterback that's rode back across the field.  He rewrote all the rules.  At first, we thought he was breaking the rules.  But Patrick Mahomes was rewriting the rules.  Maybe they're right.  Maybe this is it.  Maybe Jalen Hertz should be carrying around 20 pounds around his belly.  But Jalen Hertz is ripped and he's going to the Hall of Fame.  So when you challenged me, what quarterback that was ever fit around the belly  went to the Hall of Fame?  Jalen Hertz, Tom Brady, John L. way.  Don't look at pictures of John L. way in his prime.  Dude, that guy was a beast.  He was an absolute freak of an athlete.  They're everywhere.  And I can find y'all kinds of quarterbacks.  Peyton Manning was never an athletic freak, but he wasn't some belly fat guy.  When did Aaron Rogers ever have belly fat?  Aaron Rogers is a diet exercise playing into his 40s.  Dude, and I'm not comparing the two.  Patrick Mahomes is a greater quarterback with a greater career than Aaron Rogers.  But Aaron Rogers wasn't carrying around 20 pounds around his waist, saying,  I need to take hits.  No.  Go look at some of these other quarterbacks in the division.  Bow nicks is a freak.  Okay.  Justin Herbert is a workout machine.  These guys are ripped.  They haven't won Super Bowls.  They don't have the scoreboard.  I'm telling you it's going to get harder for Patrick Mahomes.  Look, he knows it.  His trainer knows it.  The chief's know it.  The chiefs aren't going to say anything.  They're not going to do anything.  And Mahomes is going to have a fine year.  But let's be honest.  He's entering season number nine in the worst two years of his career where the last two  the good news is they want a Super Bowl and lost a Super Bowl in those two years.  That's astounding.  But imagine.  Imagine if you lost that weight.  Imagine if the chiefs every now and then and he reads that you know what?  It's okay to call a play for Patrick Mahomes to run.  It's okay because it's what you do in the NFL now.  They don't align her on the football.  What if they did?  How much even better passer could he be if there was just a slight threat of every  now and then a called running play?  Patrick Mahomes had a 17th rated QBR in the league last year.  17th.  He had 26 touchdowns and 11 interceptions.  What would you pay to get the quarterback with the 17th QBR and 26 touchdowns  and 11 interceptions?  It wouldn't be 500 million.  But Mahomes has something the others don't.  He has this freakish ability to win games.  It is phenomenal and it's astonishing.  And we have watched all kinds of athletes through the years have that ability.  The goats, the very, very best.  The golfer that's easiest to recognize doing this was Jack Nicholas.  He was a pudgy roundbound in his twenties and he was great.  But in order to win a major at age 46, Jack Nicholas changed what he was.  He got more serious about it.  It was not the same.  It's never the same.  You cannot play 20 plus years and have it and treat it like you 25 years old.  You can't do it.  It's never happened for anyone.  If Patrick Mahomes is chasing Tom Brady, if he's serious about this, you absolutely  have to completely dedicate yourself to it.  And I'm not saying that would be my choice.  Maybe I'd just be raising my kids.  Maybe I'd do it like Patrick Mahomes.  But he's already doing interviews and saying,  all he's heard is about people chirping in the off season this and that, this and that.  The truth about the chiefs last year is they got farther than they should have been.  Okay.  They probably weren't good enough to get to the Super Bowl.  They got there because Mahomes is a freak in wins games.  And Andy reads a hell of a coach.  That's how they did it.  That cannot be the organizational game plan.  The organizational game plan from top to bottom needs to be.  Everybody is coming to get us.  We need to work as hard as them.  It's absolutely true.  Baker Mayfield had a better year.  Two ahead of better year.  Even Russell Wilson.  It's got all had higher QBRs.  They didn't get the.  Super Bowl because they're not Patrick Mahomes and they don't have the defense that  Mahomes had last year.  The chief's got there largely by defense.  That really can't be argued.  The flip side of this thing is if you're trying to look at his pictures and say he doesn't  have fat around his gut, you're dishonest.  If you're saying the fat is around his gut and that's by design and that's good for  him, then you don't know what you're talking about.  You just don't.  There's nothing good about it.  He never has been in sports.  Who said John Daly was a better golfer because he had better belly fat, big belly fat.  John Daly, if he deployed himself, and been a completely dedicated golfer.  How many majors could he have won?  He could have been one the greatest of all time.  Instead he was running joke.  Again, that's an extreme comparison.  Patrick Mahomes is not John Daly.  He's not.  But he's just all of a sudden, the chief's quarterback is going to be the first guy in the  history of sport where the trainer and the team and the quarterback say, Oh, no, this  is the way you play.  Belly fat is good for me.  So I can take hits in the pocket.  Belly fat is good for you.  That's their line.  They're sticking with it.  Belly fat is good for a $500 million athlete.  Well, he's the first.  I don't remember another.  I'll maybe a sumo wrestler, something like that.  I just don't, I don't remember a $500 million elite position athlete.  Sure, you can find left tackles.  They'll say, yes, the extra weight is that quarterback can't see it.  The core is everything.  Everyone that trains at the highest level, they're the same way.  And they talk about this all the time.  Mahomes was 26th last year in the NFL in average completion distance.  You can blame his teammates if you like.  That's fine.  Coming.  My point is this wasn't the year.  He said it would be the year.  Redeticate everything's different.  Here we go.  This wasn't the year.  He's doing it old school.  Old school doesn't mean Mahomes can't win.  I'm not making any dire predictions, but I know this.  It gets harder.  If you're not in the best shape you can possibly be in in your 30s, it gets harder.  You don't win as much.  The magic isn't quite there.  There will be a transformation to this man's body, but it was not this off season.  And that's really my only point.  And if that's controversial, if that hits people up, if that's making you go crazy, I can't.  I'm sorry.  I just can't.  I just, you as fanatical.  And that's great.  You should love your guy and you should love your team.  And you should definitely support your guy and your team over some podcaster.  I get it.  I would do.  I get it.  That's not how I look at things.  I look at everything equally, whether they're a local player or a Denver player.  And I know this.  If the Broncos had a quarterback with that belly taking pictures on a yacht a couple days  before training camp opens, looking physically not ready for the season.  If that were a Broncos quarterback, chief's fans would be going wild on the guy.  wild.  Everyone that's on me would be on the Denver quarterback for taking those pictures.  So you're just a fan.  I get it.  You should be that way.  It's the fun of, you know, whatever you do in your life, other than, you know, cover sports  or follow it closely or whatever.  Love your guy.  Oh, it's cute.  It's fun.  And we love the family and look at the baby pictures.  That's all great stuff.  Enjoy all that.  I'm serious.  If this were the Denver quarterback, you'd be losing your minds going crazy about how  unserious the Denver quarterback is about being in shape.  It's absolutely true.  And you know it's true.  And so I sleep well.  I don't care.  I can't believe this is even controversial.  You, hey, you can't look at him and say he doesn't have belly fat.  That's dishonest.  And B, you can't say the quarterback is better with with belly fat than a solid core.  You just can't.  Sorry.  That's not how sports works.  I stand by my comments.  KKJ's brought to you today by Aspen Wealth Management based in Overland Park.  Aspen Wealth is online at Aspenwealth.com.  So many times your retirement is all about taxes on your way to getting there.  Maximize what you can do tax free or tax deferred with Aspen Wealth Management.  Call 913-491-0500 for a consultation.  I do awesome financial planning, investment management, taxes and insurance.  Yep.  Aspen is the place for you.  Aspenwealth.com the consultation is free.  Make the phone call 2-day 913-491-0500 for Aspenwealth management online at Aspenwealth.com.  B-stock electronic superstore at O'Laica.  It's the home of the $199 television.  They always have a featured TV for $199.  And of course they have the 85-inch Samsung Smart TVs 4K.  Ready to go for football season.  Pre-season football right around the corner.  $699 is all and they'll deliver it locally free.  That's right.  An 85-inch football season at beastock.net.  One four six eight-o South Flaming Road.  150 first in I-35 in O'Laica.  And classic fence, KC.com.  Now that's a classic fence.  I spent some time with Brian over the holiday weekend and he has heard from many of you.  And it's very happy that his phones are ringing and that people are coming through with  the search engine.  You go to your search site and type in classic fence KC.  And you're coming through.  He's busier than ever.  Thank you so much for supporting this great local Kansas City business.  If you need a fence at your business or your home or just something in the backyard for  a little Fido, man.  Classic fence KC is ready to work with you and your family or your business.  It's classic fence kc.com.  You name it.  They can build it any kind of fence, any project, none too big, none too small.  They fix gates and they do repairs.  It's classic fence kc.com.  Now that's a classic fence.  All right.  On to more sports and the star bonds have been extended to the state of Kansas.  Kansas legislature hook, line and sinker, baby.  Set that hook, baby.  Rip that bass up into the boat.  They've done it.  The chiefs and the royals have reeled in the state of Kansas and hooked them on everything  and extended the star bond offer for one full year.  Okay.  So Kansas is lost its leverage.  They have allowed Missouri and Jackson County and Kansas City Missouri and everyone else  just equally back in the game.  Take your time.  There's no big hurry.  Let's go.  We'll wait it out.  I'm going to do.  We love you so much.  Great.  So we've seen reports and talked about Clay County in Missouri having a vote this November,  which would be a half cent sales tax in that county to build a new stadium for the royals  just north of downtown across the river, which I think is the best site of the sites  I've seen so far.  That's my favorite.  I like this plan.  I'm also not a play county resident.  So I don't have a vote.  But I have no problem paying the half cent sales tax to go to Clay County, whether I go  have lunch at chapels or go to a royals game or is that I don't know is there sales tax  when I go to my dentist or Kansas City dental?  I don't know if there is or not.  I don't pay attention sales taxes suck.  They vary no matter where you are.  Sometimes they're a point higher someplace than the other place, but it's just part  of the deal.  I don't even think about it.  Sorry, I don't.  It doesn't make my decision on whether or not I'm going to buy something.  The half cent sales tax won't.  So when I go have lunch or whatever it is that I'm doing, that's not a thing.  So that's out there.  And they're going to get it on the ballot apparently by November.  Well the chiefs now after that letter putting the gun to the head of Kansas the day, well  we can't get this done by June 30.  This is just as impossible.  We can't make up our minds.  Now the chiefs in an interview with the Kansas City star Mark Donovan has said, oh, we  couldn't possibly get a vote on the ballot by November.  If we're staying at Arrowhead, if we're renovating, our vote will be April of 20  26.  What?  Kansas extended.  And now you're saying, I guess what the chiefs are saying is, we'll announce what we  want to do and then go for it.  Well, either announced we're going to Kansas, that's done.  Or we're going to announce that we want to stay at Arrowhead and put an initiative on  the ballot in April.  The chiefs are convinced if they put something on the ballot, they will win.  I can't disagree with them.  I think they will too.  I think they'll win in Jackson County, even with Frank White in the way, and all the ridiculous  politics that are involved there.  Now we've got a recall election.  It's an absolute disaster.  Jackson County in Kansas City, Missouri.  But hey, listen, if the chiefs want to stay at Arrowhead, which I don't think they want  to.  I know Mark Donovan doesn't want to.  I don't think Clark Hunt does, to be honest.  I don't.  I just, I think there's too much money to be made with the new stadium.  There's a Super Bowl.  There's final fours.  There's events.  There's things that they can do at the legends that they can't do at Arrowhead.  If they were going to build a development and make money outside of football at the Truman  Sports Complex, they would have done that at some point in the last 53 years.  But they didn't.  I think they want to be in Kansas.  I think they're headed for Kansas.  And I think that's where it's going to go.  If they make that decision in the next couple of months and iron everything out with  the state of Kansas, then that's what they'll do.  But they're saying now publicly, in an interview, if we decide to stay at Arrowhead, we'll  have a vote on the ballot next April.  Which is the most absurd thing I've ever heard.  Although I guess you would tell the state of Kansas in advance of that, they're out.  We're going to the ballot.  But why would the Chiefs make the decision that they're staying at Arrowhead before the  vote?  That seems very risky to me.  And I guess the same as for the Royals now.  If they're going to do a ballot initiative in Clay County in November, if that comes to  fruition, obviously that means the Royals are on board with it.  They wouldn't let them go through with something like that unless they were on board with  it.  Before you go to the voters, you kind of have to promise the voters, this is what you're  doing.  You got to make your statement.  We're doing this.  If you pass this, it's a commitment, which the Chiefs and Royals will not do with the governors  of either state.  They won't make that commitment.  They're just playing the politicians, which is just glorious to watch.  Politicians get worked over.  It's hysterical, to be honest.  And it's happening all over the place, but they won't do that with voters because that's  their fans.  You can't do that.  You can't go to a vote and say, pass this and maybe we'll stay.  You can't do that.  Everybody knows you can't do that.  So watch for ballot initiatives.  And I just, I cannot even imagine in a million years the Chiefs decision would be in the  next few months, we want to stay at Arrowhead.  We're going to have a vote in April.  And you risk the entire thing.  Now that's well within the deadline of June 30th in Kansas that if it failed, they could  say, we're out.  We're going to Kansas.  But that's a short period of time that gives you 60 days to work out your deal at that point.  And now you've lost another year toward your new stadium that's probably going to take  from the time you make your decision.  It's probably four years before you're in.  So the least is expiring 2030.  We can see that there's some fairly real deadlines out there as far as the least.  And when you got to be in your stadium, but I'm just astounded that the, we don't know  what the Royals are doing.  But clearly in Clay County, they can get something on the ballot in November.  You don't have to get your ballot initiative in until like the end of August.  So the Chiefs literally have two months to put something together right now and be on  the ballot in November.  If they want to renovate Arrowhead, they do.  It's sitting right there for them.  But they're saying they couldn't possibly  get that together until April.  I don't know what's going on here.  Yeah, I've told you, if I'm going to be a cheerleader  on this thing, I want the Royals in North Kansas City  and I want the Chiefs of the Legends.  That's that.  New stadiums, both places.  Renovations have been done over and over and over.  The sports complex is dead.  It's just dead.  It's not what sports is in 2025.  That's not where people play sports anymore in America  or anywhere for that matter.  They go to areas that are far more vibrant.  And yes, Arrowhead's cool.  Go into a game at Arrowhead on a Sunday is cool.  Tailgating's cool.  All that's true.  It's not the reality of the way things are done today.  And the mistake was made.  The Royals' biggest mistake was made  in the early 2000s when David Glass was too cheap  to build a downtown ballpark.  This is something that should have been done 20 years ago.  Now there's no place downtown.  There is no real spot downtown for the Royals.  There were plenty 20, 25 years ago, plenty.  We know that because they built T-Mobile Center.  They built Kauffman Center.  They built so many different things in that time period.  But that has sort of passed.  Now it's different sorts of options.  And we'll see what they decide to do.  Starbonds and Kansas have been extended.  Woo-hoo.  The Royals are playing well.  Suddenly, is this flukey or is this outstanding?  I don't know, but they've won four out of five.  They pound Pittsburgh on Monday night, nine to three  at Kauffman Stadium.  This is the most incredible statistic yet this year  on the Royals and they're lack of hitting.  Because baseball in 2025 is about home runs.  We know that.  This was the first multiple home run game for the Royals.  Okay, Bobby hit two, Salvy hit one, Vinny hit one.  They got four.  Four that four home runs in this game.  It's the first game at Kauffman Stadium that the Royals  have even had two, but multi-home run,  more than one home run in a game.  It's the first time since last August.  August of 24, nearly a full baseball season  with a multiple home run game at Kauffman Stadium.  That's crazy.  They had four of them on Monday night.  They win nine to three.  Noah Cameron from St. Joe got a standing-o,  seven innings pitch as long as start of the year.  Got a standing ovation leaving the field.  The Royals have won four out of five.  They are 40.  What is their record?  They're four games under 500.  They're 44 and 48.  Now that's too many games.  They're four games under 500.  And they're five back of the wild card.  They've won four out of five and they've gained nothing.  They've gained nothing because the number of teams  in front of them.  They have a chance if they stay hot on this homestand  to be in second place in the division at the All-Star break.  They have a chance for that.  There's a player for the Pirates playing,  named Brian Reynolds.  You may or may not know him.  He's a right fielder.  He's a good player.  Very good player.  He signed an eight-year contract for $100 million.  And in his contract,  he gets to name any year he wants before the season starts.  Here's the six teams you cannot trade me to.  The Pirates are thinking about trading him.  He's okay.  He's batting averages down,  but he's got like 10 home runs, 45 RBX,  but he's believed to be a very good player.  And a lot of folks think the Royals might be trying to trade  for him and stay in this thing by adding a bat to their lineup  and an outfielder that they could keep for many years.  He could play right field for a long time to come.  This is the younger, not young, but young enough  that you could see him playing four or five, six years here  in Kansas City.  And so that relief the Royals are gonna trade young,  19, 20-year-old prospect talent is what you gotta have.  Somebody you think can be productive  with a big league level.  I'm not convinced.  He's certainly not a superstar,  but he looks like he's a very quality corner out fielder  and bat.  And there's all kinds of people on social media  that he's not leaving Kansas City,  that this trade's gonna happen while they're here.  I don't believe that.  That's very rare.  That's very optimistic.  That's the same people that think Patrick Mahomes  having belly fat is a good thing.  Awesome. I get it.  It's your team.  You think something credible is gonna happen  and they're gonna get this done.  But the most interesting thing about Brian Reynolds  is the six teams they cannot trade him to.  I'm gonna read you the cities of the teams.  New York, New York, Los Angeles, San Francisco,  San Diego, and Toronto.  Now obviously there's an LA team missing there.  The Angels are not listed.  It's the Yankees Mets Dodgers,  Giants, Padres, and Blue Jays.  What are all those cities that they have in common?  Incredibly high taxes.  And as blue as blue can be,  probably not the safest places you can live and play.  Didn't name Chicago, but he only got six.  He only got six.  So I think that's fantastic.  I know everything I need to know about Brian Reynolds right now.  You can't trade me to these teams.  You can't trade me to New York, New York,  Los Angeles, San Francisco, San Diego, Toronto.  That's the highest taxes.  It was not even close.  I love this guy.  Trade for him.  I love him just on that.  That's a perfectly good reason to think  this is the kind of guy we want on our team.  I like that.  All right, our news today is brought to you by  the window world.  Simply the best for last online at windows,  Kansas City dot com.  Don't forget it,  window world,  the auction is up and running.  A $50,000 home renovation.  It's valued over 50,000.  It includes pretty much everything.  Is up for bid last year.  It's so.  sold for less than half price.  I think it was 22,000.  It went for if you're looking to remodel a home.  If you need a whole bunch of work done.  Windows, citing doors, whatever it may be.  Front door entry system, patio doors,  porch ceilings, they'll do everything.  All the citing, Tyvek house wrap, Windows, you name it.  They're doing the whole thing, the complete home makeover.  A $50,000 value.  The bid right now, last I checked was $14,000 at Windows Kansas City.com.  It all benefits action for autism.  John Gillette and his company have raised over $2 million with action for  autism.  And they're at it again this summer.  KKHI and the patrons of KKHI have made a very nice donation to this charity.  And helping them this year.  So we appreciate the patrons and everything with our patron program.  And we'll let you know more about that.  After we, it's an item.  It's a really cool item that we've donated to the actual event.  It will be one of the silent auction items.  I'll let you know what that raises.  We'll find out.  But we've donated that on behalf of the patrons of KKHI.  So we love doing that.  And if you want to bid on this $50,000 worth of work from Windows World,  go to windowscansicity.com.  You'll see it right at the top.  Click on the yellow banner at the top.  And bidding will close on July 18th.  July 18th, it's all online.  You don't have to go to the event.  It's all online at windowscansicity.com.  Cross kitchens KC is Kansas City's remodeler.  They can do a lot of the work for it.  Bing, bong, bong, do a lot of that.  Cross kitchens is awesome at remodeling kitchens or man caves.  If that's your thing.  Countertops, flooring, cabinets.  Some jobs are just refreshes.  It could be done in two weeks or less.  Some are massive renovations.  No matter what.  Cross kitchens is your friend.  Cross kitchens, kc.com, Kansas City's remodeler.  And premier custom care, providing in-home health care, treating you like family.  It's more than words from premier custom care.  This business was started by the Jackson family.  Because many years ago, they needed some help with a loved one in their family and didn't  like the care that they got.  They said, you know what?  We think we can do better.  And they started this business and started providing better quality of care, more consistent  quality of care, especially with aging loved ones than anyone else in the Midwest.  Their caregivers and teams are custom designed for your needs, whether they're very simple,  little needs or something massive like end of life working with hospice.  It's premier custom care online at premiercustomcare.com.  On to the news and the death count just gets worse and worse in Texas and it's going to  continue to climb where that unbelievable flooding took place.  We never 104 confirmed dead in six counties, 28 were children.  God, stories awful.  Dozens are still missing.  And they're expecting a little more rain, but as we talked with Gary Lee's at yesterday,  the rain that's coming is probably not going to lead to flooding.  I don't think there's any real danger at this point of more flooding or bad things happening.  This was just horrific in the middle of the night, where people couldn't get warned and  do much about it.  It's just terrible.  And it's get worse by the day and we'll pray for the people of Texas.  We know they're strong.  We know they'll rebuild.  I just I can't even imagine 28 children of Paris from this.  It's just the saddest thing ever.  Donald Trump had dinner with BB net nia who on Monday night at the White House and announced  it, they were all sitting down for dinner.  They all look pretty hungry to me.  I'm looking at John Radcliffe, the National Intelligence guy.  looked a little bored.  They're kind of sitting at the table.  Like, okay, worth table, worth food.  They're not getting appetizers or anything because Trump opens it up to a news conference.  And it was a bit of an awkward one, but it was okay.  Trump announces that yes, he's going to be for he's really upset with Vladimir Putin.  And now he's going to be giving weapons to Ukraine.  He said, they'll mostly be defensive weapons, but he's going to be helping Ukraine now.  Excuse me.  Not what I signed up for.  He's like, we can't just allow Russia to steamroll over him.  Well, I kind of thought that was your plan was Ukraine will wave the right flag.  We'll negotiate this thing out and it's over.  Now we're going to provide more weapons.  How about Ukraine's syringers come up with some terms that are acceptable to Putin and  be done with it?  I'm sorry.  It's just not our conflict.  It just isn't.  At the same time, BB Netanyahu across the table from Trump reached across with a letter  that he wrote and sent to the Nobel Peace Prize Committee nominating Donald Trump for  a Nobel Peace Prize.  Trump seemed to be rather touched by that.  And I thought that was pretty cool.  And he was doing on behalf of the work that he's doing with Israel and Hamas.  And what he's done in the Middle East where I guess it sounds like we're pretty close  to having relative peace in the Middle East.  That people are going to be okay with each other and we're going to go back to just watching  Russia and Ukraine do their thing.  This is also stupid.  I don't understand war.  I just don't.  I just don't.  I don't know why more people can't be like, you know, you live your way.  Leave us alone.  We'll leave you alone.  Everything's okay.  You know, let it be, if you will.  We'll probably hear a bunch of news on Tuesday and Wednesday about tariffs and deals  with other countries.  Making it sound like there should be some deals announced and Trump has announced the stock  market reacted negatively on Monday.  Trump announced, look, if they don't do a deal, that's fine.  We're just going to slap the 40% back on them.  We don't care.  We don't need you as much as you need us.  And that's fine.  And that's where we'll slap these things back on you beginning August 1st.  So we'll see.  There should be a lot of tariff news.  and deal-making news in the next 48 hours or so.  Elon Musk has infamously started the America party,  the third party,  apparently to piss off Donald Trump  and destroy the Republican party  and hand elections forever to Democrats.  That's what it looks like to me.  So, Ron DeSantis, I'll say it over and over and over.  I'm not sure he can win the White House,  but dang he'd be a good president.  Ron DeSantis is on it.  He's got a simple way about him.  This is not anything anti-Jd Vance.  I'm not picking a horse for 2028.  We'll let the whole thing play out,  but everything I see DeSantis do I like.  And he had a news conference.  He said, look, he was asked about Elon Musk.  He's like, look, this is not how you do this.  The third party in theory sounds like a great idea,  but let's be honest,  and what DeSantis didn't say  and what the Republicans do need to say  is a third party is fine  as long as it splits the Democrats.  That's what needs to be said.  They need to be speaking directly to Republican voters.  A third party's fine  as long as it splits them, not us.  We can't have that.  Ron DeSantis, quote, to Elon Musk.  He said, Elon, here's what you need to do, quote.  Get a balanced budget amendment to the U.S. Constitution  and do it through the states.  Do it through Article 5.  We have 28 states that have approved this.  Once you hit 34, you write it  and the states are able to ratify that.  He said, while you're at it, do term limits.  It could be attached right to it.  He's telling Elon Musk, don't start a third party  if you want to be active in this  and you want to solve the budget problems  in the United States of America.  We need a balanced budget amendment  to the United States Constitution  and probably term limits.  If you do that, you've solved it.  You don't need a third party.  You need a balanced budget amendment  to the U.S. Constitution.  We used to talk about this all the time  and now nobody talks about it.  Neither party.  That's Musk's problem.  It's my problem.  It's your problem.  We all hate that.  DeSantis is so right.  Elon refocus your time and energy  to the balanced budget amendment.  Fine Democrats that are on board.  There's got to be some Democrats that will do that.  There have to be some Democrats that support term limits.  If you've got 28 states already on board  and you need six more, let's go get those six states.  Let's write this thing up.  Elon Musk, if you want to be remembered  as a great American who not only changed the world  through your products, your inventions, your companies,  your quest to go to Mars,  all of the great things that you seek  if you want a legacy in the United States  if you take your resources and put them behind  a balanced budget amendment to the U.S. Constitution,  you got a chance.  You got a chance to have an unbe-leavable legacy.  But your chance isn't the America party,  handing elections to Democrats,  splitting off the Republican vote.  That's not it.  Ron DeSantis has nailed it.  He's absolutely nailed it again.  Mayor Cute at the big photo op on Monday  at the Tony Aguire Center.  This is a new pool and community center in Kansas City, Missouri.  Second two years to build, we're tough on Mayor Cute here.  We're tough, but we're fair.  And he did this once before and I was like,  I don't know.  And now he did it this year and I'm like,  this is cool.  I like this.  He's not running for anything.  So you can call it a photo op if you want,  but he's not running for mayor again.  He's done in a couple of years.  It's over.  He goes to this new Tony Aguire community center  and the new pool, wearing his slacks shirt and tie.  And he gets in the water and splashes around  in the fountains and gets soaked head to toe.  I love it.  I'm sorry.  I think that's Goodwilloo community.  I don't care if you're a public under Democrat.  I'm good with this.  There's something real about that.  The first time you see something,  somebody does something in my bioc word.  I remember Tony Pania,  the Royals manager once famously went in the shower  with his uniform on where his players were  and it was acting goofy and sudsed up and everything.  We weren't there.  We just heard about it.  It sounded goofy, but this is cool.  I'm happy.  I'm good with Mayor Q.  Celebrate the opening of this community center.  This community center is a big deal  and getting another pool is a thing  because cities aren't doing pools like they used to.  If this becomes a place where your residents and people feel safe  and want to go and have fun and spend time with family,  I am all for this.  If Mayor Q wants to get in there and splash around,  I'm with him, man.  I'm all in with Mayor Q.  We got word from the buccis that's coming to Kansas Speedway.  This would be the first buccis in Kansas.  There's a buccis in Missouri down around Springfield, I think,  or near Branson.  And this would be the first one in Kansas.  They're starting the delay of construction by two months,  so they won't be starting.  They're supposed to start right about now.  Now, they'll be late August or September.  The numbers are in.  Bucky's is going to cost $95 million to build.  It will have 120 gas pumps.  It's right next to Kansas Speedway.  It will have 200 employees  and the salary the pay will start at $20 an hour.  These people pay, but you've got to be good.  And they got rules.  Like no tattoos, no long hair out.  No, they got rules.  You're gonna work with buccis.  You're gonna follow their rules.  And you're gonna be good, and they're gonna pay you for it.  They're gonna pay you legit for it to work there.  This is gonna be 200 jobs that are not like working anywhere else  in this industry.  But they got rules around it.  They've delayed the construction of my couple months.  First thing I heard about this, I thought,  well, maybe they're waiting on the chiefs to see maybe they want to go the other side of 435  over closer where the stadium would be.  be. But it doesn't sound like that's what this is at all. Sounds like they're going to  be right by Kansas Speedway no matter what they've got their land. They're all in and  they're getting ready to build good for them. Amazon Prime days are here. Again, I don't  do Amazon Prime days, but this doesn't surprise me, I guess. But my life, if you want  to talk about shopping, we used to have a thing we called MAL burn. You take the kids,  the wife, the kids, and you just, oh god, we're at the mall all day. And by the time it's over,  you got MAL burn. And Black Friday came along in the 90s. We had little children. And  the day after Thanksgiving was everything because we're trying to save on diapers, we're  trying to save on anything. Like go stock up, or whatever it is, you can save you save it  was really lower prices. Things that we needed, a video game, whatever the kids got to have  this for Christmas, save, save, save. Black Friday's been an American institution for decades.  Amazon Prime Day is bigger. It's blown away, Black Friday. I have no doubt that it's bigger.  It will never be for me what Black Friday was. I didn't really do Black Friday that much,  but I understood it. And I was happy that, you know, my wife or my mom or whoever went  and did it and wanted to save a bunch of money. I participated. I didn't get up at  6th of the morning. Go to Black Friday. The day after Thanksgiving, that was not my thing.  But I'd go later in the day, hey, there's deals. Let's go take a look around, whatever.  But Amazon Prime is blowing it away. And the reason it's blowing away is it's so much easier.  You just sit at home and you order it. And it comes right to your door. I'm going to order a  tubalips stick today. There it is. It's here in two hours. Oh my God, are we lazy human beings.  Lazy lazy lazy 23.7 billion dollars. Amazon Prime days.  Our final final today is brought to you by Foundation Recovery Systems and my guide Jared with.  You'll never find anybody that knows more about foundations than Jared with. He is your go-to.  And it's a two hour circle around Kansas City. You live within a couple of hours at downtown  Kansas City called Jared. He'll come take a look at your property. 816 506 1090. This is one where  the phone number is very important folks. It's not the website. It's Jared with. You want to reach  him personally. If you don't remember this number, it's obviously at the KKlist.com or you can email  me and I'll get you his phone number. You want Jared. Period. 816 506 1090. 816 506 1090 for all of your  foundation needs. Ideal health Kansas City is the Regenerative Health Center in KC. Let your  bodies tissue work for you. All kinds of great regenerative medicine possibilities for you to feel  better and get rid of your chronic pain. Dr. Kip van Camp is double board certified as an  an interventional radiologist. He's been published in multiple journals worldwide about joint pain,  COVID shot issues, Alzheimer's and Parkinson's work on set with his dad as when he started over 15 years  ago. He's been doing this a long time more than the others. Not some big corporation. He's right  here in our community and this is his life's pursuit folks. Regenerative medicine. Idealhealthkc.com.  And North Kansas City dentist, North Kansas City dental. I mentioned earlier, Dr. Bush is my dentist  at nkcdental.com to locations. One just across the river from downtown the other West Plaza location  is in Kansas. It's nkcdental.com. Our final final is AMC theaters is offering up based here in Kansas  City. Two days and Wednesday's half price. Well, a lot of folks are going to the movies.  F1 is the hottest thing going right now. It's done over $300 million worldwide. It's only been out  since last week. Mission Impossible came out first week at June. It's been out five weeks maybe.  But more of the weekend. Mission Impossible final reckoning. I said Mission Impossible 2. I don't  think that's right. Mission Impossible final reckoning. There's been four or five of these movies.  $580 million to box office. They're making movies that we're going to enjoy again folks.  Not politics, not goofy. No big overpowering message that you're not going to like trying to force  something down your throat. F1 is said to be just pure entertainment and a visual spectacle.  Tom Cruise movies are never political. He just wants to entertain you. These are winning.  And here's your deal. Like to save a buck or two. Two days and Wednesdays. 50% off at AMC theaters.  I think that's a great promotion. Obviously those are the days of the week where fewer people go to  the movies. So perfect. 50% off. Didn't say that about popcorn. I don't think the popcorn is 50% off.  Just the movie itself. Half price. Two days and Wednesdays at AMC theaters. The movies seem to be  making a bit of a comeback. Call me a traditionalist or something. Call me nostalgic. I think that's  pretty cool. I like the movies. I wish I went more. But they got to make more good movies.  To go see them in the theaters. There you have it. Our final final today. Don't forget all our  sponsors at the KK list. If you'd like to become a patron, go to KKas Issues.com. Click on become a  patron. $5.99 a month. Get the premium podcasts each and every week and the newsletter on the  weekend. We'd love to have you on board. Has a patron at KKHI. Mostly we just say thanks.  We're hitting the play button every day. And if you hit the like, follow or subscribe button that  mean a lot to us. Tell your friends that you think Kevin Keatsman has issues.  Kevin Keatsman has issues, has been presented by Roberts Robinson Chevrolet GMC and is produced by  Crooked Dale Media. Please hit the like.  or follow button wherever you listen or give a  review for premium content podcasts and weekly  newsletter join as a patron and KK has issues.com  for as little as five dollars a month support all our  sponsors and other conservative businesses at the KK  list.com.  This has been a production of Cricut tail media  incorporated."