{
  "podcast": "Farm4Profit Podcast",
  "episode_id": 41351972676,
  "episode_title": "The Farmer’s Guide to Win-Win Negotiations",
  "audio_url": "https://dts.podtrac.com/redirect.mp3/chtbl.com/track/AF8199/afp-22652-injected.calisto.simplecastaudio.com/ee0d7693-cf91-40f0-9644-5c7b641c3579/episodes/585b65be-5a31-419d-b698-98d409b4754a/audio/128/default.mp3?aid=rss_feed&awCollectionId=ee0d7693-cf91-40f0-9644-5c7b641c3579&awEpisodeId=585b65be-5a31-419d-b698-98d409b4754a&feed=NQG_ZnDw",
  "duration_seconds": 4701.649,
  "text": " And oftentimes a common misconception as we are on opposite sides of the table, trying to battle and hammer it out and beat the other side.  With that misconception, people absolutely think negotiations conflict.  But if it's rather us working together and figuring it out as something that creates value for all parties,  even that slight shift in framing in your mind can make it a lot easier to approach negotiation.  Ladies and gentlemen, farmers, ranchers, and distinguished guests.  Thank you for listening to the Farm for Profit Podcast, where we discuss the latest ideas,  methods, trends, and techniques available to help your farm achieve higher levels of farm  profitability.  Remember, if you aren't farming for profit, you won't be farming for long.  Hey listeners, welcome back to the Farm for Profit Podcast.  This is Tanner.  It's Cory.  And Dave's here.  Remember, 5152079640.  That's how you connect with us.  That's how you share ideas for topics and discussions,  just like the one we're talking about today.  The topic we're gonna cover is a repeat topic.  Cover it at three or four different times,  but every time we cover it,  we learn something new and it's important  and much asked for.  Yeah, I feel like it's even though it's covered.  I feel like it's been a while,  just because we have and it's probably gonna be  pretty important going forward here.  It's pretty timely, right?  At least here in the state of Iowa, right Dave?  We have cash rent termination sent out September 1st, September 1st, is that in other states,  two are just Iowa. They are, but other states have different dates. Okay. So it's just timely.  So coming out here in August, just ahead of when that termination date comes, our discussion on  negotiations is going to be very timely. So excited to welcome our guest today. She is, as Dave said,  and the world of negotiation.  A Tia Kureshi.  Get that. Yeah,  listeners. Uh huh. Yeah.  Welcome to the podcast.  Thank you so much for having me.  I am very happy to be here.  You have a lot of unique ties to this topic.  But first of all,  I want to learn about your tie to agriculture  before we go back to your experience in negotiations.  Yes, I actually.  I'm shockingly uniquely suited, I think, for this particular podcast because I joined a farming  family through marriage several years ago.  So my husband is a chariot and apple farmer.  He is six generations.  So now we have a one-year-old son who is seventh generation up here in Northern Michigan.  So I have become deeply imashed in farm life, specifically for fruit farming.  Hmm.  Her buddy Ryan's going to like this too, because he's a big Michigan apple.  Apple girl.  Yes, we've, we just kind of did our six months, you know, what half of the year of 2025  looks like as far as listenership goes in Michigan cracked the top 10 states.  Yes.  Wow.  were a little surprise and appreciative. Yeah. I'll have to start throwing some shade at Michigan.  We never find any bad to say about Michigan. It's always Nebraska.  I'm a lot of farms here in Michigan so I'm glad to hear that you've got listeners.  So you seem surprised that you married into agriculture. I am shocked. So my background is very  business oriented. I went after graduating from University of Michigan. I went and worked  in management consulting out in San Francisco. I worked for a couple of tech startups and  was in the Silicon Valley world in San Francisco and then Denver. And then I ended up  back at MIT in Cambridge to do my masters. And that's where I came across the world of  negotiation and conflict resolution. Absolutely fell in love with it. Thought I would stay there  because there's a huge community of practitioners out there and then I met my husband.  And while I grew up in Southeast Michigan close to Ann Arbor, I didn't expect to be in Michigan  much less rural Michigan on cherry and apple farms. So I am just as surprised as maybe you are  that that's where I ended up, but actually I love it. I do. I can work remotely part of the time.  I can be on the farm in the summer and then I can also travel to my clients for work.  Like Song Says fell for the southern boy draw and overalls or just the rope hat. Maybe just the rope hat.  Oh, it's pretty idyllic.  You miss your ganders have a miss your ganders. Is that for the gander or for the  You're right. It is a michigan.  Really?  Yes.  You guys doubt me.  Come on.  I do know you quite a bit.  Do michiganers have an accent?  Hmm.  I think there's two michigan's, right?  There's the upper peninsula and then there's the upper michigan.  Yeah.  Yeah.  It's true.  And there's probably different accents there.  Yes.  I would agree with that.  Yep.  I might have her husband on some time to learn how to, you know,  How do you get one of these seed girls to come out out to the farm?  He must be the ultimate negotiate.  I was going to say, honestly, it's true.  I mean, look at the whole thing that he has accomplished and spun together.  You could have a whole podcast on dating, farming, farmer dating life.  They're giving you sponsor there.  Farmers only, that, that, commerce on that.  Negotiation.  Negotiation.  I'm not only did he get her to come to the farm,  but also brought tangible skills  that are extremely valuable to any business.  Yeah.  So let's now kind of unwind.  You did talk high level of your background  and your qualifications on the topic of negotiation.  Let's kind of step through that process  as to how you gain that experience.  Yeah, absolutely.  So I started off within my background  of management consulting and working in Silicon Valley.  I think I started seeing all of the different negotiations  and conflict that took place  within organizations themselves.  And I found that to be fascinating.  And then when I ended up doing my masters at MIT,  I started working with the professor there  who still teaches negotiation.  And I started working with him.  I became his TA.  And then I started consulting with him separately  with corporate clients.  So I started my own consulting practice  where I was building up my base for working  and going into corporate organizations,  a lot of tech organizations,  and then family businesses.  Because I have seen,  I've been part of a family business.  My husband has a family business.  So I have a unique background  when it comes to understanding those even trickier dynamics.  So any organization that's growing quickly,  but within those realms end up being my specialty.  And so I started going through that process  while I was at MIT, built up my consulting practice  and ended up teaching alongside that professor at MIT.  But then, like we mentioned, when my husband came along,  I realized, oh, you can't easily move orchards.  And let me try and see how Michigan works out for me.  And I landed at the University of Michigan.  So I also now teach at the University of Michigan,  specifically teaching master's students  within the public policy school, negotiation,  and conflict resolution skills.  And then another piece of that,  aside from my teaching, my consulting practice,  I've also done conflict resolution and negotiation work  in Columbia with farmers there,  who the government has created a program  trying to get farmers in Columbia  to stop producing coca for cocaine production.  And they're gathering farmers into cooperatives  and subsidizing them to produce other crops,  which is obviously a very high conflict zone  with a lot of very delicate negotiations.  So I've gone there and helped farmers there  and really been in the weeds of it  with them helping them navigate that situation.  Are those negotiations successful?  is a production decreasing?  The production is decreasing.  The farmers are successfully transitioning to other crops.  It certainly isn't a straightforward path though.  There are times where if they don't have the opportunity  to figure out how to work together in a cooperative,  some farmers will just fall off  and go back to coca production,  because it's much more challenging to work together  on a different crop,  Because Cartels will allow you to grow  coca on a small plot of land  and they'll come pick up the coca and just hand you money.  So it's a pretty easy way of crop production,  except that every decade or so they'll come in  and blow down an entire town, if you push back at all  and kind of kill everybody in the town  to remind them that they're in charge.  So that's the downside, which is a pretty intense downside  that a lot of the farmers mentioned to me  as something that really motivated them to transition away.  Well, I didn't expect to talk about that today.  You know, we need to find a different prop here  and I will.  Oh, you gonna start growing?  Can't we grow here?  I don't have to go in my arms.  I'm gonna talk about a new cash market.  I warned you about the downside.  So you can't blame me.  Now we can fight back here, right?  Yeah.  MIT to the University of Michigan.  What?  What an area of college is negotiations.  Like what college program is that?  It's within the business school.  Yeah.  It's a good question.  But my master's program was really interesting.  It was based on user-centered design.  So it was split a little bit.  And I think that gives me a slightly different perspective because user-centered  design focuses on what does the other person need for something to be successful. And that's  really when you tie that to negotiation, you become very successful in a negotiation if you can figure  out what the other side needs. Because no one is going to be okay with a one-sided deal. Even if you  are able to make a handshake deal and it's heavily favored in your side, once you walk away,  are they going to hold up to it or not? So one of the biggest keys in  negotiation is figuring out what's going to work for them and then how do I  integrate that with what works for me? And that was part of my program in my  masters, which I like to incorporate quite a bit with my consulting work.  That makes sense. Dave, you probably deal with negotiations more than any of us  on the land side of things. You're selling stuff all the time. Is that true?  that you got to figure out what the other person  and other party needs once.  Sometimes it's very timely here.  I got a call about eight o'clock last night  from a gentleman we're trying to negotiate an easement with  that basically told me to get men screw off  and I hope you're not trying to make a real estate career  cause I'm gonna crush you.  It was basically the message.  So it turned to a very one-sided conversation  and this is called eminent domain.  We're gonna take it.  That's not a lot of negotiation.  Nope.  We tried. We tried to negotiate. We tried to even offer money cash, try to find out what he wanted.  And it didn't work. And farmers don't like the word, most well-land owners don't like the word  eminent domain. That's a pretty negative connotation. But don't you have to have a reason to use  eminent domain. Correct. Yep. Public benefit. And in this case, the easement gave that benefit there.  Okay.  Interesting.  We get to talk about a lot of things today, but one word that you already brought up is you  get to teach students negotiation skills.  Yeah.  This is something that I think our audience could benefit from as well.  So what are some of the skills that go along when negotiating?  That's a great question.  The framework that I really like to use within negotiation is the seven elements framework.  So if I really briefly go through the seven elements, we start with interests.  So my interests, what do I care about and your interests?  What do you care about?  So David, you were just talking about it with the easement.  I need an easement, the landowner is absolutely not.  I don't want an easement through my property.  Now there are deeper interests there as well.  And so understanding those interests on both parties really helps to figure out how you  you can have a successful negotiation.  Then we also have options.  Options are what can we do together?  Options on the table?  What can we do together to figure out  a way to make the deal work?  Then we have criteria or legitimacy.  What can I bring?  What data can I bring externally  that provides legitimacy to the number  or the offer that I'm making.  We have communication.  So communication is often one we forget about,  which I'll talk about more later,  but how am I communicating to them?  What questions am I asking to get the information  I need from them?  Relationship.  I think one of the biggest misses we have in negotiations,  especially within farming is thinking through relationships  with other people, whether it's vendors,  whether it's big corporations  that we have to work with regularly  or our other farmers and neighbors that we have to work with.  And then we have alternatives and commitment.  So alternatives are off the table.  What do I do if I can't make a deal here?  So again, back to David's quick example,  eminent domain was the alternative.  And then lastly, we have commitment.  So I mentioned this,  But if it's a purely one-sided deal, that often means that people will likely back away from  the deal after you leave the table.  So how are you making sure that both parties uphold the deal that has been committed to?  So that is an example here.  Yeah, please.  So in this scenario, you said what was the first one?  Interesting.  Interesting.  So in this case, the neighboring farmer was also wanted by the farm that we were selling.  He was not the high bidder.  We sold it to someone else.  So when we sold someone else,  of course, then that made him bristle up  that no, he does not want to give an easement  across his property.  We found out that his interest was  that he did not want somebody developing back there.  So we tried to negotiate with him and say,  tell you what, let's make an easement  and we'll write in the easement  that guaranteed nobody will develop back there.  So we tried to appeal to what he was looking for.  Oh yeah, and he didn't want any corporate hunting.  So okay, we wrote in the easement, no corporate hunting.  We're really just using this for our own, you know, for the guy that was buying it.  Move forward.  Okay, we got a deal.  shook a hand.  There was money involved.  We ended up getting eminent domain committee.  They normally determined what is this worth?  So we got outside opinions of what is this worth, which you kind of mentioned.  And at that committee meeting, we basically made a handshake deal that, okay, let's do it,  because he'd rather have the interest of not commercial developments in the back rather than  eminent domain telling him what he can do.  But then we left the table.  It's been four and a half weeks, and we have no answer,  no signed documents, no anything.  So we're back to you have one week, otherwise we're  going back to eminent domain.  So the commitment was weak.  The commitment was weak.  Yeah.  You know, it's interesting what you started off with.  And this is a little bit of the relational piece,  but also deeply understanding his interests.  Underneath the relationship and interests  are often emotions.  And we can forget about the emotion that comes into play with an negotiation.  So what you said is really fascinating to me where he wanted to buy the property,  but didn't end up being able to.  He was the highest bidder.  So he's holding resentment to that.  And then not only was he not the highest bidder,  but this new owner gets to come through his property.  So it's a little bit of a double whammy probably to his pride.  And that sitting deep inside of him, not getting resolved or addressed, makes it so he's putting  roadblock after roadblock up in your negotiation.  I was going to use the term stone walling.  That's where we're at.  Well, and this is like when you decided that you wanted to start selling farms, do you think  that you would ever be negotiating or try for an easement?  Your job is to sell the farm, not get an easement.  That's correct.  Lots of hats you wear. Yeah. That's crazy. Wow. So those seven elements are some of the key pillars  that you teach in in your curriculum to these business students. Now right now Corey, right?  You were we're talking about contracts that you've got in place that provides you some upside.  As far as grain sales goes, we know this year, a tee that we are probably looking at a good crop,  Maybe not such great prices and some of the information that we have on our side  indicates that inputs are still going to be relatively expensive compared to the  value of the crop that we're growing. Corey would you say it's important now more  than ever or is it just always important to be a good negotiator? Well that's  always important it's if you take the grain marketing mentality right once  the corn seven dollars everybody's making money when corn's four dollars you  You can make money, but there's, you got to try a lot harder.  But why shouldn't you go get that lot?  What, I mean, if you could market it for 730 instead of 690, you know, you're making better  decisions for your farm.  You're being more profitable.  It's just as important in your operation.  Where do you think you have the most ability to negotiate?  Um, inputs, there's negotiation skills.  the grain marketing side, right? Chicago Board of Trade, set the price. But you can decide  who you sell to, when you sell it, and you can, if you have good relationships with your grain  buyers, the posted basis is not the basis that you can get. You can almost always get a better  basis. Okay. Now on the Apple and Cherry side, is it the same? Like that? Or are there more  opportunities when you go to sell the good.  There are more opportunities because it's not posted in the same way. Now what's  interesting is that there are two markets. There's the processing market and there's the  fresh market. So the processing market is the one that you can sell more volume to because they're  processing the fruit for frozen cherries or cherry products or applesauce, for example. And then  the fresh market is going to the grocery stores. So when you have an intermediary with the  processing market, which unfortunately has consolidated, which we have seen, right recently  for my husband, that creates a really big problem because with the consolidation, they can  squeeze the farmers incredibly low on the price per pound. So much so that in the past couple  years we have one big processor left in the Midwest, the rest are out in California, and a lot  of farmers are getting out of the business because they've just gotten squeezed way too low.  And interestingly, a lot of times that happens when you have private equity companies coming in.  They really try to squeeze the margins out of businesses that they see just like this one.  and my husband was what we call 100% grower.  So they had committed 100% of their processing crop to this processor.  But the processor doesn't make a commitment back other than to buy the product, but not giving  a commitment to the price.  And they just go lower and lower and lower and lower at a point where it's not even  worth producing it anymore.  So one of the things I didn't hear you say in your seven steps, if we refer back to Donald  Trump's book, The Art of the Deal, he talks about leverage.  I didn't hear anywhere that you said leverage in there and what I just heard from your last  comments was they leveraged people right out of the business because they could.  And in Corgendstence, if the farmland owner can leverage the fact that somebody else will  buy it, somebody else will rent it.  that keeps cash rent price high. So although there's leverage on the side of the  grower that says, look, I can't I can't do this anymore at this price. There might be  other people that will step in your place and rent that ground from you. So it's a it's  a very touchy subject when it comes to farmers, you don't want to step on others toes,  but there's normally five guys right behind you that'll that'll probably pick up that  cash ran at the level that you were dropping.  That's that's exactly true and it's really I think that that concept is  fascinating the idea of leverage because  the  processor for example, it feels like they have all of the power in this situation, but  This year for example has been a really tricky growing year  There was a late freeze with the crop so a lot of people lost their crop and then there was hail  So for a lot of, at least Michigan and in the Midwest in general, a lot of people lost their  entire crop. So now the processor is in a bind because they're not getting the volume they  need for production. So they've actually come back to my husband asking if he will sell to them  at a significantly higher price than they've offered in the last five years. So leverage  exists, but it doesn't always exist.  And I think that farmers in particular have a much longer term view than any other industry I've ever seen.  I've worked with several other industries and farmers just have to have a longer term view than any other organization, which means that they have to be much more strategic.  And with that long-term view, these PE companies, I think they come in and they don't realize that.  Because you don't know about the cycles within farming the way that farmers do.  And the piece that I think combats leverage is relationship.  Because if you use your leverage and destroy relationships and eventually people always come back around,  you always need someone.  Even if you burn the bridge with them back in the day, I've learned, especially in farming,  people always come back around. The need is always there at some point in another.  It might not be for five years, but your six or seven, it shows up again.  And I think that that's what, you know, I mentioned at the beginning, relationships we  forget about them in negotiations, but they're so incredibly important, especially in farming,  because of that long-term view.  Yeah, I was going to highlight the, I think, relationships is probably one of the most important  in farming. Whether good or bad. I mean, I've heard stories of don't ever rent the farm to this  family because great grandpa screwed great the other great grandpa in some poker game,  you know, like generations ago, but they're still holding the garage.  But you've brought us up multiple times. I mean, Cory's our CTO, you know, Chief Talent Officer,  but I think he could be farm for profits, Chief Relationship Officer, because that's something that  that you've demonstrated is a huge value to our team early on.  Because, but I'm terrible at negotiations.  You are, but you hold that piece.  You hold that piece of leverage, though,  that you've identified that important person  to have a relationship with,  with a lot of our advertisers.  And it sounds like you're doing the same thing  with your grain buyers because what I wrote down  when Dave brought up leverage was,  when does the farmer gain leverage?  Mm.  You kind of described weather as one thing.  But outside of that, I mean, the only other leverage you have for your corn and soybeans  is instead of going to ADM and Des Moines, you could go to Iowa Falls.  I would fall.  You could go to the elevator.  That's like the only leverage you have is you can take it to multiple.  A little less on the bean side, but corn a lot more ethanol plants and end users.  I guess.  There's some other leverage techniques out there for the farmer.  I've had specific people called or rent farms.  I only want to rent to an organic guy.  So now the organic guys have leverage  over all of the commercial producers  because the mentality that the landowner, absentee landowner,  maybe I'll use California or Texas or Vermont or ever,  they've read something and they want organic.  They want nothing sprays.  So now you have a leg up.  If you're utilizing programs like carbon intensity score,  45Z or any of that to where you might be able to have a leg up, you can use that as leverage to  Outdo the the neighbor farmer you might be able to get a little bit more  But that's because you're studying the programs  Right, it's interesting. What do you think about that atia?  Well, I think that's really fascinating because what I hear is  You're identifying a unique value proposition for your farm and there are a lot of different ways to do that  So when I was talking about my husband with the processing, he's pivoted to the fresh market.  But specifically, his value proposition is really high quality and local.  So those are a couple of items that people at least would improve farming really care about.  But I love what David's saying, where you can think about organic.  You can think, I mean, local might still apply in certain aspects for other farming businesses.  based on your practices and utilizing energy programs.  There are a lot of different ways to set yourself apart  to showcase value in a slightly different way,  but then I would also circle back to what Corey said  about relationships.  That provides leverage as well.  Because if you are the person that people like to deal with  and you are reliable and trustworthy  and you follow through on your commitments,  that in itself is huge leverage too.  because people want to work with that type of person.  They don't want someone who is chaotic and changes all the time.  And yeah, we get a good price this year, but what happens next year?  So I've brought up several things on the more the input and the sales side.  But I think probably the biggest thing you're wanting to get out of this,  what I guess I don't know, but I'm guessing is probably rent negotiations or land negotiations.  Well, one thing that Etienne and I talked about that has worked really well for  farm for profit in our listeners in the past is to kind of go through a couple of examples.  And I do think cash rent land availability is one that we should jump into as a specific way.  How can we potentially gain some experience today for those types of conversations?  So for the listeners that are not in the Midwest to kind of set the table, you know,  in Iowa, at least in our area, cash rent negotiations typically happen when at least termination  is delivered prior to September 1st and or in a relationship with your landlord, you know,  in amongst those times.  Dave sells a farm into a new landowner if their absentee has to find a potentially new  tenant to negotiate those terms.  But cash rent gives you access to that farm route.  Cash rent or access to that land comes in various different ways.  cash, exchange of bushels, crop share percentage of some kind, and flex, flex lease, and  any in all of the between.  So just to kind of set that table, that's what we want to talk through here.  So TF, we think about, we've got a landlord that we've known for just a couple of years.  Relatively new, we might be short on the relationships side of things.  They just served us termination notice with the intent to raise our cash rent.  two things I want to premise because you get a termination doesn't mean that they actually  want to terminate you. A lot of times it does but it just means that they want to come back to  the table to negotiate, like go up or down or whatever. You as a farmer can serve least termination  because you want to renegotiate, right? And then I want to say there's probably two different land  owners. There's probably the absentee land owner that's very, absentee or very far removed  from agriculture, very money driven. And then there's also is the people that are still very  tied to the small towns and around the area and are more probably relationship driven. So  there's a couple different things that delayed out there. And just because the termination  is served in Iowa anyway for your listeners, September 1st is when it's served by and  signed, but most leases go March to March.  So it doesn't mean you're kicked off the property right now.  It means in next March, renegotiate something before that.  Yeah.  So what would you suggest, our listeners?  We've received this notice and now what would be a best first step for us to try and start  with a leg up?  Yes.  I have three of the seven elements that are crossing my mind.  I have relationship, I have criteria or the legitimacy piece,  and then I also have interests.  Now I want to-  I want to-  Sorry.  You missed the one I thought you were gonna say, keep going.  Which one are you thinking?  Communication.  Oh yes, yes, communication.  Well, it's interesting, I often tie,  that's a great one.  often tie communication directly into interests because communication is  actually so crucial in understanding what they want. That's that's actually  your spot on, but I end up merging those two. So first I want to take a step back.  I understand that we are light on relationship. If there is an opportunity, I would  say knowing that these notices can get served, starting late summer fall,  What can we do winter, spring and summer to build that relationship?  Now, it sounds like it's a lot easier with someone who has the ties to the small town.  But the opportunity still exists with the absentee landowner.  And I would urge listeners to think about what am I going to do starting this winter,  thinking about the fact that this might come up for me next September?  Because I think there's a huge opportunity to have that forethought and be prepared for the next September.  I understand that we're coming up to September right now and I will address that, but I do think it's also valuable to be thinking about it once you do sign your lease for the next year.  Whether you are with the absentee landowner thinking through how to make connections with them,  Are you keeping sending them updates?  Are you communicating with them to understand what they care about?  What type of updates would they want?  What type, you know, is there anything that you can send them?  We talk about within relationship building the idea of reciprocity and I can't tell you  how powerful it is just to send a holiday card.  It is incredibly impactful.  There is a study that was done that there was a, they sent out their family sent out holiday  cards to people.  They didn't know, 100 people.  They didn't know.  They just sent a holiday card.  And I can't remember the percentage, but a massive percentage of them started sending  holiday cards back even though they didn't know each other.  But the idea of reciprocity is so powerful that they were like, Oh my gosh, we're getting  this card.  And we have to respond.  So just small things like that up front and thinking about can I send them, you know, if  I'm a bean farmer, can I send them some cool beans?  Like in a cute jar or a holiday card?  Yeah.  Yeah, it's just it's really powerful and it doesn't have to be expensive but small items  that build that relationship can go a huge way.  So then...  Well, while we're on that topic, can I interject here?  I'm hearing is retention. We do a lot of fundraising with my auction firm and we always talk about donor retention.  They gave last year the relationship was good. How do we keep that relationship going? So maybe  address it while you're on it. How does Corey keep the relationships other than a gift or a  Christmas card? Is there such a thing as tenant retention? I would I would say other than small  gifts and a holiday card communication is massive. Right? What type of communication do  they appreciate? Do they want to know from Corey? Like this is, you know, a quick update.  This is what we're doing during the winter season. This is what we're doing during the  spring season. It's actually amazing to me for especially absentee landowners. How much  they like to be kept in the loop a small way about farming practices because it makes them  feel a little bit like a farmer. And they like that.  For reason that I started a Facebook page. I got that in my notes before really anyone was starting  Facebook farm pages. Like before Zach Johnson was putting stuff on YouTube. I was like,  I need to start documenting this because in the reason being was because I started writing a newsletter  for my landlords and had pictures and all that. I sent a few out. I'm like, why don't I just post this  daily and then everyone can watch right not just my landlords they can keep up but they get that  I had wrote I had wrote that down because the very first interview that we had Corey on the podcast was  because of his social media and what he was doing with that family page and then when you mentioned  the newsletter it was quite interesting because if somebody wants to be attached to the farm  yeah it's extra work for you maybe you your spouse your team member whatever it is but how cool  would it be if you're a land owner, Dave, to get an email that said,  crops planted in the ground, we got that there.  This is the best soils worked up in years.  We also had two inches of rain over the last 30 days.  And by the way, my kid broke her foot.  You know, whatever your newsletter is.  And now all of a sudden, you're not a number.  What I do as a farm manager is I actually started doing,  if you have a drone, or you should do this,  you can use the panoramic feature.  And it's like a 3D walkthrough tour of the house.  How do we make the absentee land on our feel like they're on the farm?  Is do a panoramic drone picture after the crops are planted?  So I let them see fields,  zoom travel around the farm virtually through a software  so that they get a drift of what was planted,  even though they're not there.  Farms really wet.  It needs tile, we need to lower the tree.  Yeah, no.  Right.  I love this.  I feel like I'm learning a lot that I'm gonna take back  to my husband from this.  But that's exactly right.  You all know exactly how to keep people engaged  and that engagement and those touch points  are so beneficial to the idea of retention  that you're saying.  Okay, so we've identified that there's a lot  that we can be doing ahead of time  to kind of build up that relationship,  understand their interests,  and figure out that the criteria for this,  not to kind of wrap up this topic.  We're into negotiations right now.  Yes. We're in it.  We've identified that relationship out the window,  it matters about dollars.  Yep. What advice do you have for a grower?  That is pretty much utilized every tool you can think of,  and now it's just down to dollars.  Yep. That's a great question.  So this comes to understanding their interests and the combination of that  communication and then criteria or the legitimacy. So first, asking questions to understand  what they are looking for is incredibly powerful. Because if they want to renegotiate this contract,  the more information we can get the better. Where are you trying to end up?  What, you know, what is the purpose of this renegotiation? What are you looking for when it comes to  to the land itself, trying to understand, yes,  you know, they want a higher rent.  But is there anything else they care about?  Because if we come back to that idea of leverage,  are there pieces that we can add in  that create value for them that is not expensive for us?  Because while it does come to dollars,  and again, back to the idea of leverage,  but underneath the idea with relationship,  people have emotional needs as well.  So what emotional needs do they have in addition to the dollars?  Do they have a kid who loves tractors?  I mean, honestly,  I don't know a kid who doesn't love tractors.  Let's fair.  You're like, you're like, you're like,  you're like, I'm right here.  Exactly.  And is that something that you wanna visit the farm?  Like, can we give you a really cool farm tour?  I, there are so many different things  underneath the negotiation.  if you can ask questions to understand what the other person cares about, other than the dollar.  So figuring out those pieces and how you might be able to meet different needs for them that  meet more than just the dollar number can add a ton of value to an negotiation.  But let's talk about when you get to the dollar itself because at the end of the day,  while all those pieces can make a difference in the negotiation, the dollar matters.  Cori is that way you got your chemical applicator's license to become a pool boy for all your old lady tennis that you  The pool boy slash farmer  That's the next  So let's let's and when it comes to the dollar itself I find this idea of legitimacy or criteria or external data to be incredibly powerful  I actually find it powerful in any negotiation because we can all get really nervous in an negotiation.  Corey said, you know, I'm great on the relational side, but I hate I'm really bad at the negotiation piece.  And we can, we all to a certain extent feel anxiety around a negotiation.  And what can help suit that anxiety is figuring out what externally, what data is available to help me figure out what's fair?  Because at the end of the day, people want to feel like they're getting a fair deal.  They want to feel like they are coming to terms that maybe not is perfect for everybody,  but feels fair to everybody.  So give me an example of a per acre value range.  Well, just in case our landlords are listening, it's like $180.  That's 200.  That's good.  I have an average in Iowa that it's about $285 per acre  on most of the good ground.  And we do have a couple of resources just to clean in Iowa State  University puts out a land values survey for cash rent,  a cash rent survey every year.  And many of many of you are behind.  Landlords use that.  But as a guy that does it on the other side, sometimes I don't  feel it's up to date.  And then some landlords don't either.  And they start calling.  Go ahead.  Yeah, sure first I have ever heard Dave say around.  Ever.  I've never heard you say around under 300.  It's $4 must be coming down.  $4 for CSR.  Okay.  Yep.  Okay.  So I actually love that because that itself is that.  External data that people can go and find because who can argue with Iowa state saying,  hey, we are doing this research as is that we are doing this research as a institution  And we are coming up with this number that we think is fair.  And that's just a starting point. It doesn't have to be where you end up.  But there's probably a range around that 285 number. So perhaps with really profitable,  really high value land, it can be higher or with poorer soil, it could be lower.  So what you find is a range. So maybe that range ends up being 250 to 350 just for the sake of  our examples. Now, I say, I would say does give you a range for low, medium, and high  I quote amazing and for county my problem with their deal is it's a survey surveys are people's opinions and I want factual data  So if I took to an option there's sending that to people that either cash rent ground or cash rent their ground out  So by law of averages you can have people go in and put outliers  Hi and low because I know where you're going with this because he's gonna say little ladies have little sweetheart  deals with their with their son or their grandson or whatever. And it's only 100 bucks.  And you've got farmers that you also have farmers that are paying 500 to guys like you  managing farms wanting all the dollars. So it all averages out of the end. Right. That's  where you come to know. I was going to say the farmers that don't want to survey numbers  to be high for when it comes out and they purposely report low to. Yeah. I was in there too.  Going to know I wish we had an average as though not opinions. Yeah. I understand that.  And I don't know if there's availability.  My husband actually had to look at some data for this exact reason last year for understanding  farm land lease value.  And he went to a couple of different sources.  He went to someone who does property assessments, so trying to understand.  He does it specifically for property.  What is the value of this property?  We also went to an agricultural economist who has his PhD saying, hey, what do you think  land value is based on your understanding?  So what he did was found a few different pieces of data.  And that can help supplement the single source.  So iOS state has one piece of data, but there are, are there a couple of other pieces that  you can use to supplement it?  Because that could help you further define your range.  So if Iowa State's range is 250 to 350, but then all of a sudden you get more information  and it ends up being 200 to 500, that's really helpful.  Now here's where the negotiation comes in because if you are the farmer who's trying to  get the best price for the lease and of course the landowner is trying to get the best  price, but a lot of people don't do their research this diligently.  So first step when it comes to figuring out the number and coming in strong is doing the  research to get the data.  And so I'm the farmer and I want to negotiate a really good rate.  I know the range is 200 to 500.  I'm coming in with that I'm coming in at the lowest end of the range or whatever end of  the range is best for me.  And we call that anchoring.  We call it anchoring and I am anchoring the negotiation at $200.  And I can support that number because I have background and data that I can share comfortably  share to support it.  Now of course it's going to be a discussion because they're coming back with a different  perspective.  But you know that what's fair is somewhere in that range and you also know it's not the  best quality land.  So you're going to narrow that range to really be from 200 to 350 because it's just not  high quality enough to hit the other part.  So you have your range, you're starting at the range that's most beneficial to you and  you're narrowing that range on what makes sense based on different parameters.  So now you have a scope for the negotiation and a price point to work within.  But the power of anchoring means that you're starting from 200.  If you let them start, you might be starting from 400 and you're trying to chip away from  400.  But now they're trying to raise you from 200.  And so you might end up at 250.  But if you start at 400, are you going to end up at 350 instead?  Right.  Is there a factor of respect like you could actually low ball them and make them mad?  I'm anchoring down here hoping to get a little bit higher than that, but you piss them off and they should go away.  Yes. And that's where I think that you want, if you do anchoring, you want to anchor them within the data.  So you don't want to anchor them at a point that doesn't, isn't supported by data.  Because if you can provide the supporting evidence for why 200 could make sense, I don't think they're going to be upset with you.  If you anchor at 150, but you don't have any supporting evidence, absolutely.  They could throw out their hands and be like, I don't think that.  Yeah, we're up and off.  Yeah, exactly.  But you're not ripping them off because you're providing external data to support your number.  Interesting.  Well, I have already appreciate that you've added more clarity to some of these thought  processes than what we've had in the past.  Because I think some of the interviews we've done in the past,  we've gone straight to, well, if you can't negotiate the dollar, maybe you can offer a longer  contract. Or if you can't do a longer contract and the dollar is not negotiable, maybe you can say,  I'm only going to do half of it in March and half of it in December or whatever it is to manipulate.  So our listeners have already heard that advice. So this is neat to kind of think of,  There's still external factors even when the negotiation seems like it's only about dollars.  Let me bridge off of what Corey was saying and give an example and see what your thoughts are on this.  I had a client the other day that came to me and said, hey, we would like a number on the farm.  So as an appraiser, we give them a number of, we give them a range, a high-medium low,  based on comparable sales.  I don't know which number they chose, the high medium or the low.  They went to the tenant and said, would you like to buy it?  Prior to hiring us as a real estate firm.  Happens all the time.  So I literally just gave them the info they needed to go sell it by themselves.  They went to the tenant and said, hey tenant, will you buy it?  And this is where we've had this conversation before, who fires first?  Okay? And they said, make us an offer.  Well, they made an offer.  And it was at the bottom end of the range of where I gave them.  So then they called us back and they said, hey, go ahead and list the farm.  We listed the farm.  Well, sure enough, the same tenant offered us money.  Of course, realtors take a commission in the middle.  So we took a commission in the middle and they came up to the top price.  So I talked to both sides of it and I said, why didn't you just come up?  If you were willing to give that much to start with, why didn't you just come up?  Well, I mean, we tried to have a communication, but they really didn't tell us what they wanted.  And we would have gave that much, but they never really asked for it.  And so back to communication, I think if they'd have had a conversation,  that's why I become in the middle as the realtor is the communicator between both of them.  But then I'm the martyr because I'm the guy taking commission in the middle.  I think oftentimes that if one would lay it out, lay your cards on the table.  And I think we've had this in a conversation before.  Lay your cards on the table to let them know what our expectations are.  If Corey wants rent a farm, I can't give $400.  I will give you $350.  That's where I think it's worth.  But set that expectation, then they can come back and say, well,  I don't want to lose you, but I want at least 380.  I don't think people are having that conversation.  I don't know if they are.  Maybe some of the better guides are, but not  that I didn't want the commission on it.  But we got more for the seller because the tenant wouldn't pony up to the money that they want to start with.  If the tenant would have just pony'd up start with, do it would have been done.  Well, what's really interesting there, if you don't mind me chiming in is, you know,  the tenant made a low ball offer, but the seller may not have gone back and asked,  what's the best you can do?  which is really interesting because I think you're right a lot of David that there may not be that  conversation happening where we have a number out there and because we don't like to negotiate,  sometimes people aren't even willing to talk about the number and have the conversation and so  if I had been the tenant and the seller had said no thanks like I think we're going to list it,  I would have gone back and asked them, where are you looking to be? Right? It goes back to  understanding their interests and asking the question about where they want to be. Because I would  go back and say, I would like to try to figure this out with you. And if we can avoid having a real  turn falls, who's going to take a margin out of that thought to be. Exactly. That would be great  for us and value for both of us to split. I think that's why there is realtors on houses on land  and everything is because people don't like to negotiate.  Yeah, in this case, I do believe that the sellers didn't want to have the confrontation  with their long-term tenant. They wanted their long-term tenant to buy it,  but they wanted someone else to help them set a price. We get behind me,  them in low, and they didn't really low-low-ball. They came in with them,  like you said, the anchor. They came in with them, the data.  But the seller said, well, could we get this? Well, I think we can,  based on comparable sales data, well, sure enough, it did. It was once what somebody was willing to  give but oftentimes we never show our cards of what we're willing to give. I so on the topic of  show your cards though. And we'd be to transparent? Yes, absolutely. I mean, absolutely. I think  let me let me touch upon what David said and then I will come up to the idea of transparency.  It's really interesting David that you said people don't like the conflict. Often times people  equate negotiation to conflict. But with the seven elements, I find that the whole methodology  is creating value for both parties. And so the way I like to think about it is us working  together on a negotiation, right? So it's us working almost as a team collaboratively to figure  this negotiation out. And oftentimes a common misconception is we are on opposite sides of  the table trying to battle and hammer it out and beat the other side. With that  misconception, people absolutely think negotiations conflict. But if it's  rather us working together and figuring it out as something that creates value  for all parties, even that slight shift in framing in your mind can make it a lot  easier to approach negotiation. Now, Tanner, I'll flip back to what you asked about  being too transparent, I would not advise you ever share the maximum or minimum, depending  on what you're doing, that you're willing to go.  You have a number and you should certainly know what range you're willing to work in.  So I think this is really interesting as well with buyers.  So for example, people go and look at a house and they have a budget, right?  We're gonna do it attractor.  We're gonna do it attractor.  We're gonna do it attractor.  Let's look at attractor.  Let's say we're coming to look at a used tractor.  And we've got a budget of about $50,000.  We're going and we're looking at it and it looks pretty good and it drives well and it has  good navigation and GPS systems in it.  And all of a sudden we're paying $65,000 for that tractor.  Why?  One thing that we don't necessarily do before entering an negotiation is thinking through  what our own range is in a pretty strict way.  So this happens all the time in negotiations where if we don't define what our own interests  are and what our range is, we can easily go outside of it because we haven't anchored  ourselves. This happens with a lot of different purchases where we get swept up in things  and we don't define the value of them and all of a sudden we're overpaying. And so we need  to know what it is that makes sense for us within our budget and what makes sense within  the data. So we're not going into that situation. And even if you can pay 65,000 dollars,  I don't want you to go and let them know you can pay that. And I don't want you to pay  that if that's not what market rate is because if market is 50 to 60, you should not be  paying that extra five. But is something market what somebody's willing to give?  That's what you're saying. You're going to get salesperson to get the sunroof.  They think they've got to hire. Buyers always give you the negatives. Each new tires, they're  all worn down. It's got 10,000 hours and then the seller always say brand new paint, fresh  motor, etc. You know, they tell the positives, they tell the negatives and it's the amicable  communication in the middle. The problem is that we don't communicate even at an auction,  one side of conversation, this is why I like an auction. Take her house model for a second.  I'm a realtor and I represent Corey and Corey says, man, I'm willing to go this  time, but I can't tell that to the other realtor. And we just, we keep in mind that close  door here, you can't, you can't. I can't tell you what's wrong. They'll offer them this. They'll  off for this. And then the other  ruler is like, oh, they won't take this.  And if we'd all just sit at the same  blueman table and have a conversation  or in an auction setting, hey, they want more.  You want to give a little more? Yes or no?  Yes or no? Boom.  Hashtag auctions work. Didn't you send me a  TikTok the other day?  It was a wife's perspective.  The husband went to an auction.  Yeah. She was ranting about how they  decided they were going to get their  finances in order and he went  on a tractor. Went to the auction just to  look. He came back with a tractor.  granted it was a 4020 so it couldn't have been it couldn't have been how it landed  still it was good I mean they're budget and so then the next week you wanted to go to another  auction and she sat him down and here's your budget here's your budget yeah they in this even  though you shouldn't have spent money in the last time and it yeah it was a humorous  well tiktok but I get where you're coming from what staying on that topic of attractor  you know Corey has a theory for buying things off of marketplace facebook marketplace negotiations  You want to know what?  But in agriculture, I think we find ourselves  negotiating with peers.  How many more often than most businesses because  the asset value and asset exchanges.  So to give you Corey's anchoring advice.  He says piss them off first with the canned is this available?  Yes, you still will respond.  And then Corey says you take the asking price, cut it in half and add $50 to it.  So if it's $10,000 item, you offer $5,050 and say, would you take that?  See, I do it down.  I do similar, but I do it with more people.  I'll have 10 of my best friends call them at different times and they'll all offer about  60% maybe 65% of the time I call it 75, they pour them down to where it's like, damn,  this is the best offer I got to 10 people today. Let's take it.  Oh my gosh, that's amazing because what you're doing is you are creating your own competitive  market. So what you're having them think is the objective criteria that people are showing  me is 60% and this guy is coming up above market. So what you're doing is create your  market right you're manipulating the market which is illegal I think  Like farm for profit. There's no UCC  I'm new service. You know we've got our patriotic out. We've got listeners and well  I've never been a buddy's call on your farm equipment. Yeah if you we should offer a service  So for a low fee farm for profit will get 10 or 12 people to call on a listing  So if you want to buy a combine or for cash or in we'll call your tenant will offer away less money  Hey, I'm willing to do it, but the most I can afford is there.  I'm sending $5.  Yeah, yeah.  Make you look like a shining star.  Yeah, and if one of you happened to get it for that low,  you get a commission on top of that.  I think we could make this work first.  All right, I want to reel back in and do what Tanner does.  How big.  OK, so we're talking tractor share.  When someone goes and buys a tractor from a tractor dealer,  normally, both people know what the tractor is.  When someone goes once to buy farmland from David,  They normally know farms, the people selling it.  No, the farm usually.  Dave knows the farm.  When we're talking cash rent negotiations,  a lot of times these are people that have been removed  from the farm several generations  and have little to no idea of what's going on besides,  I get a check every March and I get a check every November.  How big is education in this factor?  I mean, from the tenant?  Yeah, both sides, but yeah.  Okay.  I would say it's huge because what you're doing is educating them with that objective  criteria that you found, with that external data.  You're letting them know what the marketplace is showing as the value.  And I would also say that people really care about the why.  So giving them a little bit of information on what the market's doing and how that impacts  the land value can be really helpful as well.  for example, like you're saying margins are getting squeezed down and it's a good crop, but  the prices aren't going to be great. That information can be really relevant to a landowner  so that they can understand the situation that you as a farmer are in.  Would you actually bring some of your finances in? Maybe not like fine detail, but like for this  acre or generalities. This is what it's going to cost my crop in the ground. This is what the  the average yields are for this soil type or this field, this area. Like I'm  at it, I'm looking at breaking even. Right. Yeah. I think that's absolutely fine to  do at a high level. I think that's really valuable for them to see, you know,  this, these are my costs. These are my inputs. This is what I can get out of it.  And then this is what I'm trying to pay you and at least. And I need to figure out  how to be able to make enough margin to keep going. Yeah. I know you hate farm  managers but I actually I actually had a client that they  wanted to raise the rent this year and I did not think the  break even was going to be there so I advise them so sometimes  a third party you know comment on the outside can help  to because it was already negative to start it was a story  Dave just made up this is not the reason so the reason I'm  asking here is like if you are removed from the farm in your  ground dollars is your biggest factor, right? Like not a lot of feel good if you're doing it organic  whatever, I mean it's dollars and what they probably go into is what the landmark it is doing and  if you follow what the landmark it is doing for buying ground it has not followed commodities.  So there's a little bit of emotion in farmland so I'm curious what your thoughts are on this.  If we're selling something,  Farmline's a different asset than a combine.  If I want another combine, I can go to XYZ auction company  and buy a combine tomorrow.  The next day of my checkbook is not there.  I can go buy it next week or two months from now  or after taxes or whenever, two years.  We can plan.  What does Iowa State tell us?  62 years, I think it is.  Every 62 years we trade hands on land.  So when that farm comes up next to us for sale,  there's less negotiation because I'm not going to have the opportunity to buy this asset  in my lifetime. Again, scarcity. Scarcity. It's not, it's not there. So we tend to put a little  bit of more emotion into it and spend more money, which then inflates that farmland market.  But then as speculators come in and say, well, this is going to go up. But if rent is following  the farmland market, rent doesn't have the same emotion that it can because when you're  it has to pay. You're not doing it for charity to lose.  If you're coming in and buying ground for too much money,  either made the money beforehand and you're supplementing other acres,  or you're speculating because towns 10 miles away and you think in 25 years,  it's going to be worth double, driple, whatever.  Well, you have so much money that you just want to write off on being green.  Possibly.  I think that's a problem that every farmer wish they had.  But you know, when you talk, start talking land 15, $20,000 an acre.  And then you got these people that don't really know much about farming, but own the land.  I want 3%.  I want 4%.  I can go get 5% on my CD or whatever.  Yeah, it just doesn't work that way because there's so many other moving factors to make  money on that land.  So either figure out something else to grow.  And what's your thoughts on this?  Like, what would you tell our listeners,  I had a guy the other day, so we just did a job.  Okay, so I'm having a different negotiation.  I'm bidding a job.  And I said my percent, I'll just make stuff up.  I'll say it was 10%.  And the guy says, we won't do it for 10%,  but we will hire you at 7%.  So then I have to.  So now the lines have been drawn.  I asked, and this is not the scenario.  He asked seven, and I said, look, I know what I'm worth.  and I'm not doing it for the practice anymore.  It takes nine or I'm out.  So eventually I had to say what my expectations were.  It's 9% or I'm out.  And he said, you know what, I'll do it.  9% as a farmer, I think we have to say that.  Look, I can't make me there.  Get rid of the farm and be out or I can afford to do it  at 300 bucks an acre, whatever.  What's your opinion on that?  I think that at the end of the day,  that's what we're talking about with alternatives  is at a certain point we get  to this position where we can't go any further, right?  We have our, we call it the zone of possible agreement.  There's a zone in which we can make a deal.  And so you're saying, you know, you started at seven and 10,  seven percent, 10 percent.  That was the zone.  And you narrowed the zone and you were like,  listen, I actually cannot make this work.  The zone is nine to 10 now.  You, you drew a line through the rest of the zone.  At a certain point, it is important to say what it is your limit is.  And even asking them, why, you know, what is your interest here in owning this farmland?  Because there isn't, you know, there aren't huge returns in a lot of these row crops.  And I would love to better understand from you the value of this land to you because I,  And here's the value to me.  So sharing the value that you get  and then understanding from them,  what is the value you're getting out of this?  Because I wanna be able to make it work,  but this is the range that it truly can work in.  And if you do get to a point of alternatives,  it can be helpful to share those alternatives  almost as a disclosure,  because people can get very defensive  when it comes to a rubbing point,  where you're looking at a moment where it might not work  and what happens if we have to walk away  and what happens if someone is offering me more or less.  And sharing that as a, you know,  I wasn't going to bring this up  because I want to be able to make a deal work with you  and I wanna make sure that it works for all parties,  but someone has offered me a higher price.  So I'm hoping we can figure out a range in which this makes sense for both of us,  sharing that in a very delicate way can be powerful.  I always recommend doing that later on once you've done the other pieces of building a relationship  and you're understanding their interests, communicating effectively,  thinking through all the options available to all parties.  But at a certain point, you will get down the line to that moment of this work,  or this doesn't work.  And what do we do then?  I get a couple more questions.  Email, phone, try to have a personal meeting with them,  or letter, is there one that's better than another?  Great question.  I think every negotiation, I have a hierarchy  when it comes to negotiations.  Top is in person if you can.  Because again, we're relational and half of communication  is body language.  So having that body language and having open body language  that showcases that you want to work together with them  is really beneficial.  Second would be video chat,  because at least you have the sum  of that body language coming through.  Third would be over the phone  because you still have intonation in your voice.  So you can still convey some tone  and some warmth in your voice of wanting to work together.  I would stop right there.  I would not negotiate any other way  Because, and you might want to confirm things when it comes to the idea of commitment in  negotiation, you would of course want it in writing, but when you're actually going and having  the back and forth, doing it in any other written form, because you don't have any emotion  or any intonation or conveying any of the emphasis behind what you're saying.  The way we read words is how we feel in that moment.  So if they're having a bad day, they are reading your negotiation letter in the worst form  possible and they're reading every line as a, like, this guy is yelling at me.  This, uh, that hits home a lot.  Very much.  We're going to see if Rachel listens to this whole episode because that was her and I yesterday.  She was texting her.  I was I was apparently mad because that's the way it was read. Oh  Yeah, she I had this in back saying there is no angry tone in this text. Yeah, I'm probably made it worse  Here's here's my happy font. Yeah  Probably made it worse. Okay. Next question for our listeners lots of young listeners  They want to rent more ground  You said a normal I would say hey Corey go send letters. Here's a list of every neighbor farmer go send letters to him  But you said, nope, face to face, stop there.  How do we get in front of them to have a conversation?  Is it just church coffee?  I mean, like what other tips and tricks  you got for our listeners that want to rent more ground?  I don't wanna step on Cori's toes,  but I kinda need to step on Cori's toes,  cause I need to expand my business.  Yeah, I mean, I think that, so let me,  let me take a step back.  If the letter is a, hey, I'd love to talk to you about this,  that's fine.  I think, but I would say if you can meet people through church, if you can grab somebody  toward the end of service, if you can go grab them for a coffee or you know they go to  a special bakery and you go and run into them there, that's face to face is going to be  much more impactful.  Farmer's daughter.  Yeah, exactly.  I'm born on this subject because letters to farmers and cold calling other farmers, landowners,  a lot of negative publicity.  So does that mean?  It does.  But at the same time, as once a young farmer,  probably still consider a young farmer,  but I've been farming for 10 years or more now,  how do you get your name out there?  Because you don't have time to go to coffee.  Your hustle, new and livestock, or off farm jobs,  or all this other stuff.  You should go to church.  But a lot of times you get young kids and all that.  That's a tough game.  How do you get in front of them?  Didn't we hear, and I got to think of how vaguely  to say this, because I know where we heard it from.  There is a young farmer that has put it in their budget  that wants a month.  They get a pizza, and they take it to a non-land,  non-current relationship.  Just show up.  Anybody can use a pizza.  If everybody eat in supper, that's fine.  They put it in the fridge or whatever.  They can use a celiacs.  But that was part of their item for a marketing budget.  Kwaz, I'm gonna take you pizza.  Most of the time they found out that they would sit there  and eat the pizza together to have that initial conversation.  Yeah.  How do I use?  Is it pepperoni or beef sausage?  I would turn it into cherry pie  just as a little plug for the cherry mystery.  How do we do the cherry land?  It's honestly, it goes exactly that.  So we are on a peninsula.  And my husband's whole operations are on a really small peninsula.  That's 18 miles long and a couple miles wide.  So the land out here is super limited.  And it is truly the relational piece.  And I understand that young farmers have families  and things are busy, but I would say that the relationship,  the time that my husband has been able to take,  because I think we would be considered young farmers too.  but the time he's been able to take to spend 15, 20 minutes,  talking to someone when they run into each other  at the gas station, pays massive dividends.  And I think we forget that.  We've gotten into this mode where we are all so busy  and so chaotic and so hectic,  but we all want to be part of a tribe.  If you think about our ancestors, we lived in tribes,  we lived as groups, we were protected in a tribe  and farmers were the core of that tribe,  because they provided the most important resource.  And we all want to feel like we are connected  to our community and farmers,  especially still have that connection.  And we don't wanna forget that connection  because that leads to the ability to  for a farmer who's retiring  or a farmer who's thinking about retiring,  to be willing to come to you  because you have had those interactions with them  And you are known as a young farmer who's trying to go grow to come to you and talk to you  about it.  Or you are the person who goes and takes cherry pie or pizza runs in a while to people.  But those connections.  You make me a logo for the hillaboe tribe.  Yeah.  Honestly, I mean, I can't you read about loneliness that people have.  And people want that connection.  And it means so much more today than it did in the past.  And so if you're the one willing to make that connection, it's going to pay dividends for  you maybe not this year or next year, but it absolutely will.  My ancestry comes back, Hillbone.  Well, for the sake of time, I just have one final question before we get some of your  contact information.  I also know that we have a huge fan of the podcast  that feels if you have a high quality pen  in an expensive watch that that provides you extra power  and negotiations is what?  Conversation started early in the board room, Tanner.  Oh.  Are there tools like that that matter?  I don't think so.  I think that there's this idea and negotiation  of homophily, which is I,  it's actually back to this tribe mentality  where I feel like I am actually a little bit  a part of your tribe.  You would probably,  the three of you would probably look at me  and never think that I would have anything  in common with you.  Let's be real, right?  Like we could walk past each other on the street  and you'd be like,  never in a second would you think  that we would have something in common  and that we'd be able to talk for an hour and a half?  But there's this idea of himothally  where you find something in common with someone  and you bridge the divide and that difference  And how do you bridge that?  And that connection is way more impactful  than them seeing a nice pen or a fancy watch.  So that's where I'm gonna challenge Tanner.  It's not about the fancy pen or the fancy watch.  It could be an old tractor.  It could be that you pulled in a Chevy truck  and they like Chevy trucks or whatever.  You just find commonality.  Yes.  And so I've literally had my mom's cat put down  while they were on vacation last week.  you know, RIP, Katniss.  And the vet had a Mont Blanc pen in his pocket.  And I've got a book on him and everything.  And I asked him about it.  We've talked for 30 minutes on how he went about,  like we have nothing else in common  besides he was putting down the cat.  And then he found out that his vet has 600 acres.  I wonder if we're on the net.  That didn't come up.  That didn't come up.  But so I would say, yeah, it's not about what it is.  It's just commonality in my opinion.  exactly could be college football.  It could be, I mean college football is such an easy one, right?  But it could be any, you know, a hobby or that pen  or, you know, a button that you have  or a cool fly fishing hat that you have.  Dave's gonna show up next time.  He's gonna have like a pin on his shirt  and a ball cap and a watch  and everything that you could potentially have  as a conversation starter just to see  what somebody picks up.  Yeah.  Now Dave, I want to know, can you spell, I'm awfully.  No, but I did write down because in my own letters,  I think it's great bridging the gap you said.  Yeah.  Anywhere's close.  It's H-O-M-O-P-H-I-L-Y.  Not what I would have done, but does it affirm?  I'm not gonna ever flock together.  Well, it's, I think Corey said it really well,  actually, commonality.  It's, what is that, what's that bridge?  What's the one thing you have in common  that you could chat with someone about?  I mean, I think if we have a true listener that went all the way through to the end of this episode  I want to know what is the strangest thing that you found in common with a landlord of yours  Send that in a text or an email, you know, I'm for profit LLC at gmail.com  I want to know is it cum la is it what's that really stinky fish ludafisk ludafisk?  bunch of Norwegians  Yeah, maybe something like that.  But, I'll tell you, this has been fantastic.  I'm glad that we found you.  It was a unique way listeners that we got connected to her.  And I hope this isn't the last time we get to chat.  If our listeners have a question or a scenario,  would you be okay if you provided some contact information  for them to potentially connect with you?  I would love that.  They can reach me through my website.  There's a contact form that'll come directly to me.  So it's just a Tia Kureshi.  uh, or a tear crashy dot com. And so they can just reach out through my contact form and be more  than happy to chat with anyone who has another question. I will put that in the show notes as well.  Guys, I know we've got more questions, but I think we just flat ran out of time today. So  really appreciate you joining us. Uh, this was a pleasure. I hope you had as much fun as we did.  I did. Thank you so much for having me. It was delightful. And I'm so, and I hope it's not the  the last time either. That's right, listeners, we appreciate you too. So until next time, have a good one.  Remember, if you aren't farming for profit, you won't be farming for long.",
  "created_at": 1755585689
}