" And in fact, I'd say for anybody watching or listening to this is,  you should cultivate spaces in your life where you can just say the thing.  And it doesn't have to make sense.  And so therefore I'm going to say the dumb thing.  I'm going to say the wrong thing until I can figure out how to say the right thing.  And I'm going to say it out loud, I can learn how to say it.  Welcome to People Watching.  A podcast where we figure out what it looks like to become the role model we've always wanted.  By talking with real people who have found real role models in their own lives.  I'm Megan Robinson.  Every week I sit down with a guest.  And together we cut through all the noise and identify better sources of hope,  creativity and wisdom as we learn to make decisions about the kind of life we want to live.  So join us. Let's do some people watching.  My guest today is Garland Dunlap.  I first met Garland about 13 years ago and my first semester at grad school.  Garland is an educator, writer and strategist.  He works at the intersection of spirituality, education and cultural imagination.  He holds graduate degrees in theology and education and has spent most of his career in higher ed.  He advises nonprofits and institutions on strategic clarity and mission alignment.  Where he focuses on spiritually grounded leadership.  Garland has just finished his first book on reimagining education through theological lens.  It has already worked on his next project on the aesthetics of learning.  His work consistently explores how people make meaning across difference and how learning  becomes a form, a spiritual and creative practice.  I was especially interested to talk with Garland about the intersection of creativity and education.  Because I think that all too often we think of education as container for policy,  rather than as a sandbox for growth.  I loved hearing him share about how Afrofuturism can be a path for us to re-humanize those who have  been pushed into the margins. And I also really appreciate it Garland's insights about navigating  the world through his neurodivergent lens of autism and ADHD.  Garland lives with his wife and son in the Pacific Northwest,  but where he's recently taken up a gardening as both a sustainability project and  spiritual practice. As with every conversation I have with Garland, I learned so much from him  about what it looks like to create space for reflection, renewal and deep listening.  Especially for those who don't feel like they fit the mold. You know my kind of people.  Make sure to like, comment, subscribe and share. And I hope you enjoy this conversation as much  as I did.  We had our, you know, wonderful.  Oh, this is awesome.  I am so excited. I can't even tell you.  This is going to be fun.  Awesome. Garland, welcome to People Watching and thrilled to have you here.  Well, I'm thrilled to be here.  Awesome. Awesome. As we get started with our conversation, I always like to have my get  read with my guests the touchdowns. And these I think just help shape our conversation,  our expectations for each other and help our listeners know what to expect from us.  And how we'll move forward. Whatever we share is by invitation, not obligation. If either  of us is not comfortable pursuing a topic, let's just say I prefer not to share. Thank you.  Silence is also a partner in our conversation. Feel free to take a moment to reflect without  immediately feeling the space with words. Leave room for the inner teacher to whisper to you.  Be present as fully as possible. This is a space to acknowledge our doubts, fears and  failings as much as it is a space to share our joys, convictions and successes.  Ask open, honest questions. If we're not sure what the other meant in the question or statement,  ask, it gives us a chance to clarify or rephrase. Ask questions that we genuinely don't know  the answer to. Surprise is a great canvas of insight. Here, here. Awesome. I also really want to ask  you and maybe we can continue talking the thread of role models can go into Afrofuturism.  Because I don't know much about this. And this is something that you've mentioned as an interest  of yours as kind of offering tools for you. And who, how did you encounter Afrofuturism? What made  it come alive for you? I'm just so curious about it. Sure. I think I know what it is. But tell me  what it is. So here, so I'll start with illustration and then we'll talk definition. Perfect.  You're familiar with Black Panther, the movie. Yes. Okay. So Wakanda is a kingdom, a fictional  kingdom in the middle of Africa. It is untouched by common colonization. Yes. Untouched by colonization.  And so they have this future technology. And if you look actually at the, even the structure of  the buildings, like it's very, so now it's futuristic, but like their society has a harmony,  there's harmony with nature. So you'll see the buildings are built in. So there's a lot of eco  friendliness. And there's the society structures seem to be working together. So ultimately, Afrofuturism,  number one, comes out of the United States. And.  started with the question of what my black experience, particularly the African  American experience, look like if colonization, if slavery had never occurred.  And so it takes that idea and then usually advances it into the future.  So that so Wakanda is a textbook example and picture of what Afrofutures is.  In fact, I could talk about Marvel, but a lot of people, I remember one of my friends was like,  look, black dancing was not a good superhero movie and I was like, yeah, that's because it's not a  superhero movie. It's an Afrofutures movie. And if you look at it from an Afrofuturist lens,  it is a like,  BC should be written on how it exemplifies Afrofuturist ideas.  Sure.  I mean, in a conflict between Killmonger and actually you can contrast Killmonger's perspective  to T'Challa's perspective, the black Panther and the keyest perspective as girlfriend in terms of  how they're dealing with the problem of colonialism. She is an interventionist. Killmonger is  a fighter and T'Challa initially is an isolationist. And so those are your two bizure three moves.  So now it branches out. It's not just a literary or even a film. In fact, black Panther's probably  the first film is actually music. So there's a lot of music, sunro, like, and Janelle Monet. And my first  encounter of it and I didn't know what it was, but I was like, there is something here and I don't  understand it was actually parliament funkin' down. So if you look at their aesthetic and if you  you look at all the things are doing on stage and I was like, there's something being communicated  here, but I can't fit it. Was it's an Afrofuturist aesthetic? It's it's it's again, it's carrying  that same idea of what could the black experience look like untouched by co by colonialism and by now  they're in a particular different direction. And as with many are, it's not necessarily presenting  itself as the definitive answer. So none of these artists are trying to say this is what it is.  So they're saying this is what it could be. Sure. Pretty much encountered the concept  through science fiction. Yes. Yeah, that's super cool. Yes, that's your typical entry  pathway. Yeah. But then you've got people like Octavia Butler who famously wrote  Perival of the Sower. Ultimately a science fiction novel, but actually starts in my 2025.  I just finished reading her xenogenesis trilogy. Okay, yeah. Yeah.  And so a little bit of history. So Afrofuturism starts in the United States, it expands into  diaspora. So it hits into the Caribbean and the islands and then crosses the pond and moves into  the pan-Africanism. Technically pan-Africanism is a different movement than Afrofuturism.  Okay. Okay. And the distinction I would make is Afrofuturism really is coming out of American  and American ideas or carries that. Whereas pan-Africanism somewhat is independent, but is more dealing  with content, a little African, and then moving out where from there. Okay. So their questions are a  little bit different because they're talking about what does it mean to you to find the nations of Africa  and then what does that look like? Because it expands globally and into the future. Okay. So similar  trajectory, but difference. Sure. Okay. Okay. Okay. It's interesting because a lot of people  are afraid of Afrofuturism. A, because I think they just don't know what it is. And B, I think it's  the Afro that terrifies them. Because it does center Black American thought. Now, okay, so here's  the hard discussion part. I think that makes people nervous because their only concept of centering  a particular cultural or ethnic identity is rooted in the concepts of supremacy.  So most people understand that if I say this ethnicity is good or this is centered, what that means  is this ethnicity is superior to all other ethnicities. And usually that is tangled in and therefore  those need to be suppressed or destroyed. Hmm. And Afrofuturism does not say that. Gotcha. Afrofuturism just  says what does it look like from our perspective? Take this idea and then covering into the future.  So it sounds like a very, it sounds like it can be a very collaborative perspective.  Mm-hmm. And then so now I'll speak to some of the Christians in the room who are probably still  nervous a little bit, but I would say, can you think of anywhere in the Bible where somebody envisions  a kingdom that does not exist or does not yet exist and yet insists that we move toward that  kingdom and according to those principles. Welcome to Afrofuturism.  I love that. I love that.  And that's, so in terms of a scholarly move, that's what I  so I hadn't influenced. I'm going to name names somebody we know in common,  Shannon Rivenstein. So I appreciate her because we have had a lot of conversations about beauty  and aesthetics and the role of creativity and culture making. And there's a lot of  sharpening in those conversations that we participated in. And so it was those conversations that  started me down the path of looking at aesthetics. aesthetics is a philosophical category,  but then aesthetics is an applied philosophical category.  and other realms. And so that's what made me start to ask, oh, what is the aesthetics of education?  And philosophy is excellent. Everything. So therefore, there's an aesthetic of something.  So what is the aesthetic of education? What is that really important?  Need to ask. And so that also sent me down the Afro Futures Path, because I'm like,  okay, so this is an aesthetic movement. It's an art movement. We can communicate it in this art  movement. And what I, so three themes that I have consistently found are redemption of the past,  Shalom in the present and hope for the future. Like, what would it look like? So remember my  special interest is learning and education. So like, what would it look like if education have  that aesthetic? Return to Shalom and hope baked into our system. Yeah. Yeah. And how does that change?  We do in education. What education feels like the outcomes, now the questions come.  Yeah. Afro Futures sounds to me, like a very specific expression or manifestation of standpoint theory.  Not in theory, familiar with that package for.  It cracks me up because in my communication textbook standpoint theory is literally  you critique and you encounter from the point of which you stand.  It really is just that simple. It really is just that simple. I can only communicate with you  from my perspective. Like our conversation is helping me encounter another perspective,  and hopefully mine will be transformed. But at the end of the day, it's still only ever,  it's we can only ever experience our own nervous system. Hi. And so therefore we're limited in  some ways to the perspective that we have. But it's it's Afro Futurism to me sounds like this  extension of that idea of saying, how can we move, how can, but also how can we move outside?  Yes. So it is speculative is the word. Yeah. I totally could parts about Afro Futures. So let me bring  in this. I told you to rhythm. Let me talk about the blues. So a lot of Afro Futures and also explores  the pain of the African American experience. And the mayor and the African American narrative,  which is just present. So I'm not pushing an agenda. The reality of the African American experience  is since we got on this continent, it has been rough. And there has been traumas that overused words  sometimes, but trauma is the only appropriate word to describe what many African Americans have  generationally experienced. And I'm not here to label fault or blame. And in fact, Afro Futures  doesn't does not either. And at least in none that I've read has it said or blamed anyone. And in  fact, I appreciate Octavia Butler because she describes these incredibly horrific things.  And she's just talking about it as almost like reading a scientific report.  Sure. She's just telling you what happened. Now, how you feel about it is how you, and if you feel  guilty, that's what you, but she what to feel about it. What happened? Yeah, or if you feel off about  her, whatever, like she's in the characters, don't demand that you take a particular stance. The  characters are just for the move on making, but she's not making any demands on what you need to do.  The thing is intentional on her part, because I think she's just telling you the fact she's showing  you where this character is going. And then she's letting you decide what you're going to do.  And I think it's the set speculative future that I very much appreciate about Afro Futures.  And that that speculative move that I'm trying to learn and understand,  appreciate and then fold into my writing, my thinking. And I'm trying to learn from these artists  who are imagining a future that does not exist. And by the way, that seems to be very important  to what we believe is Christians. Yes. Yes. I  a little phrase that keeps coming up for me is imagining different futures. If you've read Alan  Jacobs, Breaking Brad with the dead, he talks about looking at the distant past. What we were saying  with reading biblical narrative as part of the narrative, like reading these older texts  as speaking to us across time. And I think I don't think I think he's drawing on someone else,  but he says the future has nothing to teach us because we're the ones who have to imagine it.  Yeah. And I think that from a Christian perspective, so I have four verses, Genesis one,  or basically were made in the image of God. God is a maker. That is like that push to be  makers that push to be creative. And then we have some, I can't remember which, one thing I ask and  I would seek to do all of them in the temple and the house of the Lord, I'll  do it in my life and meditate on his beauty. So that is like this, how this presentness,  but what do we do now? What does it look like now? But then, and this is my absent favorite verse  and all of scripture, Revelation 21, five. And the one who was seated on the throne at the end,  Karsal, and he said, behold, I'm making all things new. And then he says, right,  these things down for their trustworthy and true. And so that's that kind of pull, that's that kind  of invic- envision it and talk about it. Talk about this just like-  John did when he was waiting all these things and you could not make sense of and you wrote about it  We language. He had available to him. That's what we're doing  We do have a glimpse of a future and so what does it look like to try to meditate on the beauty of that?  What does it look like to draw and that?  Does it look like to delight yourself in that and I think that's the hard task and I think  Going to Romans  Where he said do not be conformed to this world but be transformed  Paul says guess what you know  Me  You can see me. I'm right and I'll mush it down. Yeah, that's I like that movement. I like where you're going with that and I think  Yes, like that's what I see Afrofuturism doing  It's it's especially that it's a match in a match in a tip and to borrow from Disney  It's I think it inspires to me imagine hearing so it's a yeah  And because I do think there's a sense of  We should be working towards something  That Afro when I read I begin it stirs in me a  Desire to want to work towards something  I would say yeah if somebody wanted a foray in Afrofuturism start with Octavia Butler. Have you read the broken earth trilogy?  I had that yeah, okay  I'm a list. I'm a list. I've been in nonfiction for a while  So I'm just now getting back in the thick and twisted book. Yeah, yeah  I told a friend of mine. She was like asking for science fiction fantasy and recommendations because she barely was a familiar with a lot of it  I was like oh  I had recommended that to her. Yeah, and I said I will be very curious what you think because  The main character female character is a sympathetic character but not a likable character at all  Yeah, and I love that. I love that on it because it's like you want to find out  Why this person is the way they are and then you should really look at  The world the system the structures around it that have told her you can only  Be a certain way  Yeah  And you can only express who you are a certain way and if we do not carefully  Corral and contain and structure this you are dangerous and  In those are the kinds of themes that you'll see appear because again, it's reflective of the black  American experience  It comes in sinners that thought yeah, you'll see characters that you're like I don't like this character  Though I do sympathize with this character. Yes, or you'll see  The good guys being very flawed  Or making decisions that you're like, I don't know if that's the decision that I would have made sure  One of the key one of the key things in the pair of the sewer and then it's sequel is a main character  Essentially walks away from her family  To start a really her daughter struggles with that sure sure  Yeah, and what do you do with that right? Yeah, I don't think that  Butler who's passed away. I don't think that she's trying to tell you  What in fact? I think she would say what do you think you think you should say?  Probably sure you'd say  Sure because I think she which is again  A thing that I appreciate because it's such a movement that you see actually in the Bible is there's so many times  The biblical author all these horrible things are happening  And I don't think the authors trying to tell you this is what should be or even as endorsing what's happening  I think the authors hey this happens. So what would you have done?  Sure, who are you in the store in the narrative and yeah, yeah put yourself in the narrative  What's the choice you would be because are you best she but are you David? Are you your I out? Are you  Is jill his general  The general who ordered oh, oh, Joab. Joab. Thank you. I was like yeah  Okay, for the name rock. Yeah, are you Joe? You have done if you were Joe ab because job knew exactly what David was asking him to do  He who  What's the choice you would have made and that's what the biblical authors. I think are sometimes doing  Yeah  I just wrote a piece about this a Easter meditation reflection and it was about the thief all across  um and I think  in part  I think the thief is not named because we are supposed to put ourselves in the thief  The next to Jesus on the cross. We are so supposed to put ourselves in the crowd  And we're supposed to be the other guy  Yeah, yeah, but I think we're gonna I think we should be asking ourselves who are we in who do we want to  Sure, yeah, I don't think there's such  That's questions that we don't ask ourselves now and I think that's why we're so unhappy  That things like we don't have a good role models. We don't have any role models  Because we're not asking who do I want to be and why  That's such an important question who do I want to be and why  Yeah, yeah, yeah, yeah, yeah  I remember when I because for a while I was gonna be a philosophy major and this is a philosophy minor  And then it was like hey, I know theologies do with the stuff. I wanted to do the philosophy seems nice to get them to the menu  I go down. Yeah, I realize for me. It's the argues and circles. Yeah  It's the method and  Theology was the journey. So that's how I interpreted it and with you there. It is why I  understand I appreciate philosophy. I think it has a place and I am not  Some of the philosophy questions are just not questions. I'm interested in sure. I am not interested  I'm not interested in arguing the logical coherence of the trivia league.  I've accepted this true.  And I'm not interested in proving whether it's true or not true.  Yeah. Faith reaches beyond understanding, but it doesn't say.  It doesn't ask us to replace understanding.  It doesn't try to take the place of it.  Correct. And I think that there is a point which you just have to say.  It's just too big for my brain.  Too mysterious, too wonderful, too, too infinite.  And so I'm just going to have to understand, but I can understand.  And be okay with the not understanding.  Which is very hard.  It is.  So another early thought I remember having was realizing that.  At some point you're going, you can keep asking questions.  And you work hard enough, you can get the answer.  Like, most of them.  Yeah.  At some point, there's some end point where you're going to hit a point where you say,  I do not have the capability of answering the question.  And then you're going to have to make a decision.  And so what I realized is you don't always have to get to that end point.  Before you make the decision to choose.  Can choose before them.  Yeah.  And I think that is something.  So when I think about the idea of responsibility.  And I think that is a key thing to look forward to role model.  And also when compasses that what I think you're talking about is humility.  Humility.  But also taking responsibility for the choices that you make and the effects that they have.  Yes.  And what you were describing is you can logic your way to the very end and find an answer.  And realize you're just not going to find you're not going to come up.  with the ultimate answer or an answer that fully satisfies you.  Or you can just travel along that path and go, you know what?  I can see where this is going to go and I don't need to go there.  Yeah.  I don't need to walk to the end of the grand canyon.  I realize that it's deep.  Yeah.  I appreciate the view.  But I don't need to see it nor it's deep.  Yeah.  And I think that's something that.  That.  What is it I want to say?  We don't see that as often.  It's one of my other guests.  Ashley Hill.  And we were talking about role models.  And she said, honestly, the first thing that comes to my mind is just disappointment.  But I totally get totally fair.  That's the whole reason I embarked on this whole project in the first place.  I remember there was a specific episode when I was working at a seminary at the seminary and not Dallas.  And one of my coworkers came in and was like, so did you hear about the lay essentially.  It was the latest pastors behaving badly story.  Right.  And it doesn't matter who.  Because it doesn't.  And I remember my reaction.  And honestly, I'm more sad now about my reaction, but my reaction was like,  course.  Sure.  I was surprised.  I'm.  What I'll see you expect at this point.  And I'm more sad about that now.  But I remember, I remember saying to my friend, I don't know if this is huge or what.  I'm tired of looking around and not seeing people that I wonder of my or so.  I guess I'm just going to have to become the person I want to admire.  And it's because so many people are not taking responsibility.  We're always watching and we're always being watched.  And I don't make this in creepy spy way or whatever.  It's just if you move through the world and you are encountered by another human human being,  you're being watched for how you're moving through the world.  Correct.  You were having an effect whether you realize it or not.  So what are you going to do about that?  How are you going to manage your presence in the world?  And that doesn't have to mean performing.  That just means I'm going to be intentional or thoughtful about who I am and who I bring to the table.  And what you said about performing is so important.  So what a jumping back.  One of the things in realizing that I was, you know, that I virgin and I had autism.  I realized how much I was performing.  And to be fair, like the reason why masking occurs.  So if it was in the audience, you don't know masking is essentially putting on behaviors that are socially acceptable.  And that's not it's not deceptive.  It's not the intent.  It's more of as an autistic person.  You very quickly realize that you think it act differently.  And then you also realize that it is not in your benefit to think it act differently because there are actual consequences, social, financial, political.  And so then you learn to imitate the papers.  But what happens over time is you lose the ability to be in touch with your natural self.  And it causes harm over time.  And it causes stress.  I'm just thinking about performing.  Yes.  Because so one of the reasons why I'm interested in this idea of performing or the performative is just.  The ubiquitousness of influencers, how social media has trained us to always to be a brand to have or not.  We don't have that brand.  We are a brand.  Which means you're always performing the brand.  And so in that sense, I think, perform.  I'm calling that the performative to distinguish it from the fact that we do perform.  As you just described, you do perform.  And when, you know, performing has benefits and that it helps you.  There is a social good to similar behaviors.  But there is a-  Well, we all act the same.  Yeah, yeah.  Cultural, social, cultural, this is, you do things a certain way in America that you don't  do in the Netherlands, or you don't do in China.  But what you are describing in masking isn't just performing, it's conforming.  It is contour came.  Which is a very different performance.  Yes.  And I think within some of that performance, the not like if you're  confluence of thoughts.  Sometimes the performance can move towards conformance if you're not careful.  You're the mass long enough it starts to stick on your face.  You're also right in that, and this is hard for people to understand  when it comes to divergence.  We were talking about this off camera, but no, no, that version of brains really are  structurally different.  Like they wire different parts of the brain, light up under different circumstances.  And there's reasons for that.  There are some technical reasons for that.  But accepting that there are actual legitimate biological differences between divergent brains  and neurotypical brains.  What that means is you're right.  Like I didn't realize that I was trying to fit myself into spaces that honestly were  causing me stress because they were not designed to get me comfortable.  You had mentioned I read your newsletter about leaving your most recent role.  Was it because of the neurodivergence or was that just a contributing factor?  Whatever you want to talk about.  No, that was a combination of church politics and race.  Sure, gotcha.  Yeah, as you do as you do.  Yeah.  So that I do want to honor.  So I'm going to just leave it there.  Yeah.  Yeah.  Yeah.  I think that was one of the things for me in my own context was just, you know what?  You never, there is, keep trying to sit at the table and you just haven't pulled up.  You just haven't made room for a chair.  Yeah.  And there's a point at which you start to ask yourself, do I want to be at this table?  Why do I want to be at this table?  Yeah.  What is this table cost?  Yeah.  What does the sea cost see me?  It's not a rudder wind.  But in some sense, there's also a sense of when somebody actually tells you I never wanted  you here in the first place, which is an exact phrase.  I heard it's off.  Okay.  I'm so sorry.  I appreciate.  I'm okay.  I've done my day.  Yeah.  You got to.  And this is a sad truth and people don't like me saying this, but I'm going to say it anyway.  Because that's what I do.  I think howered races of research.  I've never been.  Yeah.  I wish that weren't the case.  It's true.  Sure.  Yeah.  I'm not saying everybody's racist and saying all the churches are racist.  I'm saying I've been covered racism in every church.  Yeah.  Yeah.  I hate to say it.  People are going to people and they just don't like different.  That's yeah.  Like I do not want to minimize at all.  I'm just also trying to go back to to use the big word theological anthropology and quite  frankly.  I'm really good at my reasons to keep other different out.  We really are.  And how many of times does this get addressed in the Bible in the book of Acts and the book  of Ephesians and the book of Galatians and the book of James, I think Peter and one of  those books and just as it goes back to again, the systemic structures that reward.  I've been doing a lot of reading or incentives.  How systems build in incentives to get the results they want.  Yeah.  So Michael Apple calls it the unwritten curriculum.  Mm.  Michael Apple.  Cause he, these are the context he's talking about is if you think about it, like what we're  actually teaching kids is how to obey authority when to sit up when to sit down.  all the just about teaching kids certain behaviors.  That's sure.  Yeah.  You actually look at the kindergarten curriculum.  Yeah, they're teaching them some academic stuff, but really with a teaching them is how  to behave in schools.  Yeah.  Point is.  Yeah.  Hope you're enjoying the conversation so far.  I'd love to know if there's anything that resonated for you or maybe brought up questions.  If you have feedback, a comment, or maybe you have a suggestion for someone you think I should  talk to, I would love to know.  I will leave a link in the description box below so you can just fill out that quick form, shoot  me a message and I promise it'll check it.  So thanks so much for being here and now let's get back to the conversation.  And I think I was thinking about this not too long ago and I was like, I did well in education  because I learned how to perform and I learned how to perform your way that the teachers  liked.  Yeah.  Education was a game.  And I liked it.  And I was happy.  I thought I was able to learn on in that, but it's just experience and transform, transformations  and thinking, just kind of look back and go, that's why I was able to succeed in a lot of  what I was doing because I knew how to perform what that person wanted.  Yeah.  And let's go back.  the story I told about the worksheets.  Had I'm to perform that I would've gotten better grades  and I was,  and to be fair,  I need to honor my teachers  because it's not that my teachers were bad.  I think I had some great,  some really good teachers actually.  But they were also just doing the thing  that made sense to them in the context of our day.  And at the end of the day,  they had to meet,  they had to talk to their supervisors  and they had to,  their supervisors had metrics.  They wanted them to meet.  Yeah,  and they have to put a grade in the grade book  and they need evidence for that grade.  Yeah.  Yeah.  I just remember being,  I remember being Dr. Lanier Burns' class.  I already see where this is going.  I couldn't have done it again.  I was like,  there was like the craziest exams  and you'd still get a fantastic grade.  Even though we got every question wrong.  And I remember talking to him,  he was like,  yeah,  he doesn't want to give exams with a seminar.  It's got a blessed.  Yeah.  And I just put into this is why I think  about education because we get it.  It's these questions of,  yeah, why are we giving the test in the first place?  What do we really try to achieve here?  And is the test the best way to go about achieving that goal?  Because I think most of us recognize it's actually not.  That's why there's one professor  on one of my theality professors  and I took most of my theality.  Cause he didn't give tests.  He had his right papers,  which was actually helpful to me  because it made me think through what I was thinking through.  Until you're in a lot of stuff.  All of those papers were not due  until the end of the semester.  Then you're sitting there with 25 pages.  You got to come up with.  It was like, oh,  self discipline.  That's the other thing I needed to learn.  And you couldn't even start writing that  until at least halfway through the space.  Right. I mean, that's real.  But that was so much more helpful to me  because sitting in memorizing a test  and which I'm spinning back with,  can be Larry helpful.  I'm going to memorize that for long enough to forget it.  But in terms of like,  how is that going to help me minister  to the antioxidant girl who wants to see the side?  It needs me to talk her through a reason to live.  Well, memorizing what the definition of conosis is not helping me.  Yeah. Yeah.  I have an entire program developed from ministry.  I have written out exactly what classes and how it would be  and how it should be delivered  and how to help people get through some sort  of preparation for ministry quickly  so that they can go do it.  Yeah.  And right now,  the working title is the Megan today.  We're having this full of theology.  We want to learn the reality and our stuff.  Nice.  Nice.  No, I love it.  And you and I both like,  we can definitely love me some theological,  I appreciate the speculative aspects of understanding  when nuances are big like that.  So it's not like I'm bashing that I'm not.  And I think me to do some of the things I'm doing now.  Exactly.  And at the same time,  I recognize its inefficiencies and where it is.  Yeah.  And I think one of the biggest things for me is,  if, as Christians, if we come out of a Christian tradition  and that tradition, at least at that tradition claims,  there's a better way to live than that better way  needs to inform.  Like you need to be in conversation  with what that better way looks like in this time and place.  And that needs to inform.  And that means questions are a good thing,  not a scary thing.  And so for people like me and for neurodivergent people  live with questions,  it is amazing how many people who have encounters,  who are no longer in the faith,  who are like, yeah, I asked questions  and people got mad at me.  So I stopped asking questions and then I'm like,  ask whatever you want.  Now, my rule is always,  I may tell you I don't know.  With that, and I'm not answering that question.  I reserve the right for both of those.  It's me whatever you want.  Like for real, you ask me whatever you want.  I'm not going to ask me what.  Yeah, I had a conversation with a friend of mine.  It takes a while ago.  So I did my Jesus.  Tell me more.  Look, I really want to talk to you about it.  I was like, okay.  So it's a perspective.  Yeah.  And so we were talking about it and my friend grew up  and in physical church.  And I said, do you remember your creeds?  Like the conversation doesn't need to get bogged down  in scripture, but do you remember the creeds?  Right. Let's just talk about those.  Yeah.  Cause I was like, those would probably be familiar to me.  And she's like, I just said,  all of the good creeds, all the major ones,  and specifically referenced Jesus's divinity  and his humanity.  So we already embodied himself.  I guess question is, I'm just not sure  of where he needs to do it again.  Plus he ascended his physical body ascended.  But before he ascended, he said,  I'm going to send you a helper.  I'm going to give a helper.  That's the whole experience.  So we have the piece that we need.  To do.  And by the way, the helper is better.  You.  What friend cause she was at a winery?  Like this person just started walking.  So my friend was like, I just wanted to slide over  and be like, could I have a glass of water instead of a human?  That's hilarious.  I'm not appreciate the thought.  And I appreciate the question.  I really do appreciate the question  because it's good question.  Yeah.  I want those questions.  And I'm just like.  Sometimes people.  And I just had a text conversation  because someone would ask me what tie they even sounds like.  And I'm definitely of the orientation  and of my practices.  I'm gonna give you a response that is based on  what I understand of the Bible.  And it's very cool to understand it as possible.  I might give you my opinion,  but I'm more going to lean toward this is what it says  and here's how I understand it.  And here's also where there's room to understand it differently.  That's usually an absolute approach  any particular answer.  Again, every now and then I'll actually give my opinion.  But I'm like, I like my opinion,  but I don't know if that's what you need right now.  Yeah.  It's really gotta be a conversation here.  So God has said about it and argued to God about it.  Yeah.  I feel like most of the time when people ask for your opinion,  they ask where you come down on issue or whatever.  I'm always like, see, here's the problem.  And who would you answer at?  I actually need to answer about 10 questions before.  Yeah.  To get to the answer,  to understand why I'm answering that  and why it's not so simple as I think this or that.  Or anyone's here or other.  And I learned this from one of our favorite professors.  It's actually a bad question and let me explain to you why.  Yeah.  I remember on,  I loved sitting in his theology classes.  Just like philosophy classes,  seminary tends to call particular kind of young males,  Jack asked.  Yes, it does.  And there were a lot of them.  And they would always ask this question,  where you could tell they just really felt,  oh, they had gotten a question that's gonna trip them up.  He hadn't heard this part, this form,  I mean, I just always loved watching our professor.  See, just, she knew there.  I'm allowed the person to ask,  had he hand in his pockets, just listening.  But he hopes to have this whole grin on his face.  And I was always, I just always felt,  and he was very nice.  Always was long.  I saw him being a little different.  It was also the little grin was this,  I'm just sharpening my knives.  And I had always said when he was holding back,  then it definitely times when I was just like,  oh, you're really letting off the hook there,  that was fascinating.  And I appreciated that he was also,  because sometimes people are just like,  okay, I'm wrestling with this.  I've seen him be very pastoral and be like,  okay, so here's a technical,  let me walk you through where you get to.  Because again, oftentimes you're walking into the,  I came in as a young seminary,  and I was going to figure out the whole divine sovereignty,  man responsibility question.  I knew that I was going to get the answer  that question once I walked in.  And in about five minutes in the city,  I was like, not only is that a bad question,  but there are like eight other questions  that I need to resolve before I even could be  getting to approach the question.  Sure.  Now, I remember theology born in Trot of theology.  I wish they had kept it as pro-legomena  and been theology because it just  fun to say what we're pro-legomena.  You know, the pro-legomena.  And I remember sitting there for the first third,  first quarter, first third of the semester,  just being so thoroughly annoyed at laboring revelation.  And I remember going to talk to him,  and then finally, I remember saying to him,  oh, you can't do theology until you understand  how you get the content.  And that's why I teach it the way I do.  Yeah.  And it's, it is funny, because I want to do  like a theology of human communication  because we have a theology of communication.  We just call it revelation.  Theology of divine communication effect.  Yeah.  And so that theology, I do think we have not,  I think there's room to understand the theology  of human communication.  Yes, I believe that there is for that to be articulated.  Several things that I've been arctic.  Yeah, it's one.  Yeah.  But I wanted to ask you, I know,  I knew we would stray far and wide.  We'll talk it.  We'll talk about it.  I wanted to ask you, have you learned any of John Ruskin?  I've had enough.  Yeah, I know who you're talking about.  I have not.  Do I need to put him higher on my list?  The reason I'm saying it,  because Alan Jacobs, again, he's been on his blog  and on different outlets where he writes,  he's written articles about John Ruskin.  And Ruskin was very focused on aesthetics  and justice, social media.  Yeah.  Like we're thinking about craft, craftsmanship, beauty,  the effect of beauty, on daily life, system.  So we're reaching the limits of what I do now.  I'm intrigued to read Ruskin,  but as you were talking,  when you were talking about the aesthetics of learning,  I was just like, I just wonder if Ruskin  could be a good conversation partner for that?  I know.  Because you talk about the all-encompassing,  like beauty is not an afterthought,  beauty is not an add-on beauty is.  And actually I just listened to this interview with,  you know, come to me and make it.  I thought I hated when those names  just like, come out and it was like, yeah.  I'll post the link in the description box.  I'll send it to you.  But Martin Shaw, there we go.  Like, more like a storyteller,  mythologist and storyteller.  And he was talking about trailing beauty.  And he uses the image of when Arthur.  Holy grail round the nights of the round tables and Arthur in his nights were not out like our war  Making war of whenever when they were at home  There was always what one particular animal mythical and they were constantly seeking they never found them  But that wasn't the point the point was the seeking the point was following the trail of this animal  So Martin Shaw makes the point like we're trailing beauty beauty is not a quality beauty is an effect  Beauty is how it makes you feel  Yes, and so what are we doing seeking that's inherent that's then an inherent  Inherancy everything this is something that I learned in conversations is that so beauty is a phenomenon  But beauty is a transcendental so it's part is she's a sister and she has two other sisters  That is goodness and truth and beauty does not exist without goodness and truth and if one leaves the other two  And which is such a key concept for me and it actually solidified some things for me  Which is also what got me only aesthetic path because aesthetic beauty being a phenomenon and aesthetic being the category but  There's gonna be a weird segue, but I was like okay, so what's the problem with pornography?  Pornography is an attempt to have beauty with truth and goodness and since goodness are removed beauty leaves as well  And that's why sometimes like you can look at something and say  Okay, there's something wrong with that, but I can't figure out what it is. Let's say with I propaganda  Propaganda is an attempt to have  Truth without goodness and the beauty and so it leaves  It's when you're looking at propaganda, but it's hard for you to say why it's propaganda  It's because of truth beauty and goodness are no longer present. Yeah, and that's why you always  There's this there's the  inherent tendency to seem beautiful people is good  Because we assume that if one of them was present the other two are well  Yeah, yeah, yeah  Yeah, what's the beauty privilege or whatever that they call it pretty pretty pretty privilege or pretty people  Yeah, I knew I knew it with more literature than that  But yeah, yeah, so yeah, so anyway  That's why like when I was reading you have mentioned the aesthetics of learning and then I was reading an article  Where Jacobs was talking about Ruskin if I can find it. I'll send it just like you can make like an intro  Yeah, but I'll definitely have to dig into him because I think and it's sad that like you have to call  Like if you mentioned the word justice in these days you have to put all these qualifiers on it because people assume  They know what you're talking about when you say it sure which I would think that if we're talking the Bible justice should not  Like that's not a controversial idea. You would think you think and yet for some reason in this environment it is and so  yeah, I  Justice is inherently wrapped up into a lot of these concepts of beauty and in a way that I  Can't fully articulate and don't fully understand which is why I keep chasing it  Which I think that's part of my I know a lot of what you're thinking about in the season is creativity and so when it comes to my creative process  It's really about chasing ideas in that so when you read Pilates this will make more sense  But I think there's an inherent for me the process of knowing and learning  there's an inherent  Faithfulness and  belief comes with attending to that process  It's an understanding that when I'm digging  At the end of that rainbow that there truly is a pot of gold  Even though no that it never seen it, but I see the rainbow and so therefore that's enough for me to go chasing after it  Yeah, and I love him and in that process of discovery it leads me to another ring  another rainbow and so  What ends up happening for me my my people have asked me several times like how'd you write the book?  It was just an idea that wouldn't let go of me and so I kept chasing the thought until I got to the end of the thought and then it led me to another  Yeah, and that's I think that is I think what creativity is I  For a while I had anyone who knows me knows I love makeup  It's a hobby for a while. I worked as makeup artist and then and I did some I developed some more courses to help people  With shopping and all that stuff and everyone's always you should keep doing this  You should hear a little bit of love and it's like look I  Have a lot of knowledge about this. I want I am more than happy to share what I know with people if it helps them great  but  The right I've reached the horizon of that. Yeah, but you fit where you want to go. Yeah  Yeah, I think I'm gonna lower and think of on that  I just don't have that level of passion  For it to keep going but all this stuff like personal formation and role models and thinking about thinking  Systemically, I'm like that horizon is always receding. I will never reach the end of this in my lifetime  And that's what's interesting and I think that's what creative  Perspective creative practice. I think that's what that does. It says it won't like I love what you said  It won't let go of me. I tried to I'm real talk  This book has been in the making literally for decades  And I tried to not write it at some point and it just I couldn't not write it  Penultimate question  What about this conversation has been most helpful for you?  Oh, that's a deep thought. I see  Just the interaction. I appreciate your thoughts and I appreciate the freedom just to express without having to  You  say it in a particular way or say it.  Just to explore and not have to have an answer.  So I could appreciate the freedom and the space  that you've provided in our creating.  I think it's necessary.  And in fact, I'd say for anybody watching  or listening to this is you should cultivate spaces  in your life where you can just say the thing.  And it doesn't have to make sense, say the thing.  One of, this kind of in trouble in similar,  but one of my objectives and similarities is I was like,  I am here to learn.  And so therefore I'm going to say the dumb thing.  Having to say the wrong thing until I can figure out  how to say the right thing.  And I'm going to say it out loud.  I can learn how to say it.  Yeah.  I love that.  So you can see that space is to be able to say the thing.  Yes.  I love that.  It's a good challenge.  Last question.  This is the toughest question of them all.  Oh, beautiful.  What's the story of the best or the worst taco  you have ever had?  Ooh.  In bear mind y'all, we lived in Texas.  I know.  So I will tell you this is going to shock you,  but the best taco I had.  And I wouldn't say it's like the best taco ever.  But I think it was just the surprise of what it was  is it was like a chicken-teaky masala taco or something like that.  So there was like rice in the Indian garam masala.  I might be going out.  There was a little bit spicy.  So it wasn't a traditional like what you think Texas  talked about.  It was different flavor.  But I think it was the combination of it.  That was something I had never had before.  That was like that was awesome.  Yeah.  I had something similar.  So during the pandemic, our neighborhood  started scheduling food trucks.  That's true.  And then it was so popular.  They just keep doing.  We just, so every week we have different food trucks.  And there was a food truck that came in.  And they did a chicken-teacum masala taco.  And it was just, yeah.  It's hard to explain why was so good.  Because I've had the dish before.  It's not the wrong.  But I'm like, why enjoy that in that particular moment?  Yeah.  The one that I had, they have this creamy slaw on it.  Oh, nice.  Yes.  So you got the crunchy cool and the spicy hot.  Yeah.  Yeah.  So it was really good.  We got, I know.  I know, man, I had Dr. Grofkle.  I told her, I said, look, I can't.  I know you have your doctor now, but your prof1.  I'm sorry.  The york.  Yeah.  But she said she had really good tacos and like somewhere  rock-ball-on.  She couldn't figure out what.  That's, if people don't realize that about Texas,  like the best tacos are not the places.  Like, I'm like, you know, I had this pink slime.  And it was like in this corner.  You know, honestly, it was a little bit sketchy.  Yeah.  If that taco ever, right.  Did you ever eat a taco and see mouse?  Oh, right.  I was chief in the Senate.  Oh, my goodness.  That person's amazing.  Do you have any?  Yeah.  I never thought about it because I was like, this will either  be the best decision of my life or the worst decision.  And I will regret it.  And no one never stopped.  No, when I walked in and I saw a bunch of construction  workers, I was like, oh, give me three of everything.  Like that you have told me everything I need to know about  this.  Oh, next time I go to Dallas, I'll have to just  sing it to talk about.  Yeah.  And I was like, I drove by it all the time.  And I was like, this is the half.  It looks shady.  And you're like, this seems great.  It was great.  But it was definitely worth it.  Am I too white for this place?  I have concern.  And so no, totally lying.  It was absolutely worth it.  It was absolutely.  OK.  So next time I go to Dallas, whenever that is, also,  Gurlen, when does your book just desserts come out?  Good question, Troy answer.  I don't know a long answer.  So just recently got into the publisher.  So I need to get a schedule in terms of the time frame.  I would expect probably into the year beginning of January.  I will definitely keep you informed when you're  there's like a picture.  With and stock.  OK.  Yeah.  Yeah.  Yeah.  With and stock.  But it's an obscure topic.  But it's at the important topic.  And I think when I've talked to people about it  and the people I've shown that like, yeah,  this is an important topic.  Yeah.  I love with and stock because they will  publish so many weird titles.  There is a tie, they have a title to forget the author.  But it's basically the all-out like Karl Barth and the Red Hat  Chili Peppers.  Which is, yeah.  I think it's worth talking about that.  Yeah.  So where can people connect with you or find you  if they'd like to learn more about what you're doing?  Yeah.  So how would say subscribe to my sub stack  and that is faithandmuses.substack.com.  There is a free version.  If you want to support the work and you can  grade to the paid version.  That's $5 a month.  I would greatly appreciate either one.  And then I think if you, I also am doing some work  with my wife.  So she started a nonprofit consulting.  And it's called Not Just Fundraising.  So it's not just fundraising.com.  She handles a lot of like the fundraising side  and operation support.  And then I do some strategic planning and leadership  development.  So if you listen to me and you thought,  I'd love to be talking about leadership and leadership  development and somebody who can listen.  help me put ideas together, check the website not just fundraising.com and schedule the  appointment and we can we can work with one another. Awesome. I can testify to Garland helping me  be the person in the later than I am or want to be. So definitely take it from me,  contact him. LaNida is awesome as well. She's awesome. Yes. Yeah. I don't want to make sure  we are living in our very different people in all of the best ways. The things I do poorly,  she does well. And then she does everything well. So I don't know that there's anything she does.  I want to make sure to put the links in the description and we'll do that.  Oh, it's been a delight. It's been a delight.  Hey. Thank you so much for spending time with us today. I hope you found something that  resonated with you and that encourages you to become more hopeful, creative, and wise in your  own life. Make sure to check out the links in the description below and like and subscribe if you  enjoyed this episode. Shalom."