{
  "podcast": "High Vibe Table Talks: Empowering Solopreneurs",
  "episode_id": 31049474909,
  "episode_title": "Cloning Solopreneurs with Will Christensen's 15115 Automation Method",
  "audio_url": "https://chrt.fm/track/55B2C1/traffic.megaphone.fm/MOZAM5937339337.mp3?updated=1733931283",
  "duration_seconds": 2248.124,
  "text": " Jazzcast Pros.  If you needed to automate one thing in your business today, what would it be?  For many solar panors, they want to automate a ton of things and  There's two questions that you probably have when it comes to automation.  What do I start with and how do I do it?  In today's episode where I chat with well, we  dive into so much stuff but really around automation will have this  incredible formula 15115 and he's going to talk all about it. It lays out  such a simple way for you to figure out what you're gonna automate and then we  talk about how to do it and we talk about a lot of stuff with AI. He gives his  favorite AI tools that people pay him a lot of money to help them with. We talk  about ADHD and building a business with ADHD, he has such a good in the  lighting round. One of my questions is what his creativity means to you and his  answer was one of my favorite on the podcast yet. So make sure you stay tuned  for that. If you haven't already, make sure you subscribe to the podcast. I  appreciate it so much. But I love this conversation with Will. It was really,  really good. I don't typically interview a lot of men on the podcast, but his  management team sent me over topics to discuss and I was reading it and was like I  need to have this conversation and I am so glad that I did. So without further  ado, let's chat with Will Christensen. Welcome to High Five Table Talks. The  podcast to help you the current or aspiring solar pannour navigate the messy  middle so you can make both an income and an impact. Hi, I'm Rishan and I love  of creating safe spaces for women to be courageous  in their dreams.  I'm very excited to dive into this conversation  with Will Christensen.  So we'll thank you for joining the podcast.  Yeah, happy to be here.  So I am in Syracuse, Utah, which is north of Salt Lake City.  I was from Colin in from, from my basement  because I went remote in 2018 before it was cool.  And then the whole rest of the world  decided to join me in 2020.  I have no idea why that was.  Yeah, so I serve many different segments.  I've got a lot of experience in automation  and integration.  That's kind of where my career started  and then it shifted more towards delegation,  which is where I'm focused now.  And I clone solo pinures.  So solo pinures who are looking to make their first hire,  I made so many mistakes on my first hires.  So many mistakes.  And so we've got a guaranteed process  that we help solar pinures go through  where they can't mess it up.  Like it's impossible to mess it up  because we've got so many good systems in place  to coach them and support them and help them actually scale.  There's kind of two parts of the conversation I wanna have.  I'm excited to dive into the 15115.  Yep.  But I also wanna dive into you as an entrepreneur  and how you run your business and kind of the,  I love to dive into the messy middle parts of it.  And it seems like you have done that yourself.  You know, you said you made a lot of mistakes.  And you really help a lot of other entrepreneurs  through that.  So I want to kind of hit both sides of that.  So yeah, absolutely.  I won't leave the audience hanging on too long.  Can you share with us what is the 15115 method?  Great question.  So basically I had people coming to me  and the most common question they would ask  is what should I be automating?  It's interesting because it seems like a simple question.  Like I should just be able to tell you,  here's the five workflows you absolutely should be automating.  And I can tell you some common workflows,  but what I discovered was that everybody was  a little bit different.  And so what they needed was actually a way  to discover for themselves what should be automated.  And I learned later, it's actually what should be automated,  delegated and or eliminated.  So like where do we go through that process?  And so the short version is 15115 is what you should write on a sticky note.  So pause the podcast, go find a sticky note, or open up your phone and open a new note on your phone.  And that new note of the top is going to say 15-1-1-1-1.  What that stands for is 15 minutes a day, an hour a week, or an hour a month.  So think how often do tasks happen?  They happen daily, weekly or monthly.  If it goes over 50 minutes a day,  over an hour a week,  over an hour a month,  you should probably consider  automating, delegating or eliminating that task.  If it's lower than that, don't get sucked down that rabbit hole.  I have spent eight to 10 hours trying to automate  like a 10 minute task.  And I got to the end of it, I automated it,  but I was like, oh man, that's gonna take five years  to become ROI positive for the time that I saved  by automating this thing.  So sometimes it's okay to dive into that way  because you know you're learning something  that's gonna help your clients  and I've done that before on purpose,  but do it intentionally.  So when you write down each one of those things,  the last five is do it five times manually.  So on your list, let's say that you opened up a new note  in on your iPhone or on your Android phone,  and you type in voice type, I love voice typing.  I've voice type in, this is the task  that I've got happening and it's weekly.  Then ignore that for a while until it comes up again.  Oh, it came up.  So put a tally mark.  So you would put a tally mark,  one, two, three, four, five tally marks next to that item.  And then once you've done it five times,  you know enough about the if-then's  inside that process that you can actually write a standard operating procedure for it  and automate it and or automate it depending on what's out there. You know enough about it to  actually automate. That's how you decide what you should automate. Yeah. And it's so great because  you know, one of the reasons why, you know, when when you're assistant whoever you use to  touch base with other podcasts to see if we can connect is around ADHD and I was listening to  Oh man.  Some content of yours earlier, how you're allergic to the copying, pasting texts, you  automated something to help you pick up garbage when you were a kid.  And so it sounds like there's a lot of curiosity just naturally built in to like how can  I eliminate the things that make me want to stab my eyes out?  Like a lot of my community, my audience really resonates with that.  a great, great place to start. And I think that your formula allows people to chunk things  out. And like, you know, okay, I did this five times. I can I take an hour this week to  automate it so I can get that ROI back like you said.  It removes the to be or not to be question. So you don't, you're not standing there as  hamlet holding that skull and saying, should we automate? Yeah, we should not. We automate.  I found myself asking that question to myself over and over and over again.  And then I would go do the thing and I would automate it and I was like, well crap, that was a total  waste of time. I should not have automated that because now the client is coming in and they're  saying maybe instead of often. And if then statement was off of the maybe, it's like, it just  So many things that I just did not understand.  And so that was the whole purpose was how can I create a way for me to not get trapped in the should I automate cycle?  And then out of fear, because I've got to automate something, you go down a rabbit hole and you get to the end of it.  And so another question people were often asking me, how can I get my team to adopt automation  or AI?  How can I at the time it wasn't AI?  Because AI wasn't a thing.  But how can I get my team to adopt this?  I say, the first thing you've got to do is stop them from going down the automation  rabbit hole that doesn't actually work.  Because there's no faster way than to burn the automation or AI bridge for your employee  then to send them down the rabbit hole,  they spent four hours trying to automate whatever it was  and they get zero return.  Mm-hmm.  Have that happen two or three times  and you're never doing it again.  Yeah.  And so giving your teammates a framework  so that that gets taken care of, that's gold.  And so segue being AI,  I mean, what are some things that like you use yourself  or provide your customers with AI that really helps with efficiency.  Beautiful question.  So the one I'm talking about a lot right now is called perplexity.  If you use perplexity yet?  No.  Oh my gosh.  This has replaced the big G for me.  I no longer use Google.  Really?  Really.  Like I actually, I googled something the other day  and I was so frustrated with the results page, I was like, that's it.  And I went and installed a Chrome extension that made it so that perplexity is now my omnibox search bar.  Wow.  So like if I hit control T and open a new tab and type, perplexity is what gets the query.  Now, there's a couple of situations where I found this to be annoying.  When I do searches, I do searches for one of two reasons.  I'm looking for information, right?  I'm trying to make some sort of decision,  or I just want the dang website.  Like I can't remember the exact URL,  so I want it to pop up at the top.  Proplexity kind of stinks at that.  Like it does not do a very good job of finding you  that top search result kind of situation.  I've had to go back to Google for some of those situations.  And I'm wondering if there's something like...  some sort of keyboard shortcut or something that I can tell it.  but I just want you to find the correct URL associated  with this thing.  And you could type it in like whatever my career was,  URL, and I'm sure it would do it just fine.  What I've discovered though is you can ask it questions like,  who in the lifetime of Marvel Comics  has been worthy of picking up Thor's hammer?  Oh.  You go type that in there, and here's the crazy part.  it will go in and it will go through a search results page.  And it will basically using some advanced logic,  like it says, okay, the user's gonna give a query  and you're gonna respond.  And before you ask, think about the query  and see if there's a way that you can rephrase it  in a way that more people might have searched for it.  And so it's doing the searching for you better than you would  because most of the time, people aren't fantastic Googlers,  my wife's like, I don't know how you find crap online,  but you seem to be able to find stuff.  I can't find.  And the reason I can find stuff is because I spend the time  to like modify the words so that they are more common.  And I watch the suggestions.  So I get more stuff.  I don't have to do that anymore.  I just type it into perplexity.  Proplexity says, oh, cool.  And it goes through.  It reads the seven or eight different pages  that were relevant to what I was describing.  And then it summarizes the answer.  So instead of me having to go look through  every single page and look at all of what's there,  it's just there.  Chachi B.D. 4 has recently announced  and they've got a search function  that's built into Chachi B.D. 4.  They had one a while ago,  they were getting lots of complaints for copyright,  they got rid of it, they brought it back.  It's okay.  It is not as good.  I have found as perplexity.  Proplexity is good enough that I've been able to be like,  I want to buy a new podcasting mic.  Find me the top podcasting mics out there  and compare and contrast them in a table.  And the table is dang accurate.  Wow.  That's really cool.  And I hadn't come on specifically around AI,  not that long ago.  And one of the things as we were discussing,  it was like one of the tips is just,  instead of going to Google,  to Chet GPT or go to some sort of AI because when Google first came out, we didn't know how to prompt it.  It was like, find me food and you're like, okay, well, where are you? Do you have a dietary  restriction? How much money do you want to spend? Do you have kids? Like, there's all these factors  and you have to prompt Google with those things. And now we're just learning how to prompt  AI and it sounds like perplexity does a really good job of learning more about what type of  results that you specifically want on top of your query.  Yep. Yep.  So very cool.  So before we hit record, we were kind of talking about some of the content  that you do put out and I was thinking about it when I was listening to one of  your some of your earlier content around like you put out a ton of free content.  And I know that a lot of solo Pinour struggle with,  am I giving away too much stuff?  Am I giving away too much for free  that people are never going to buy from me?  So how would you answer that question  for those who struggle with that?  So what I would say is as a solo Pinour,  you don't have a lot of advantages in this war  that is business, right?  Like in this game of like competition,  cutthroat, you know, I'm gonna eat your lunch  because I want that business, you know,  we don't have a lot of things going for us  in terms of like, man, we're so good at this.  The two things we do have is our agility.  We're able to move really fast.  Where these large organizations  that do the same things we do are kinda slow.  Because it's such a large organization.  There's a lot of bureaucracy that I cut through.  all of that kind of stuff this there.  The second advantage we have is teaching.  When we share our knowledge,  because those big corporations, they will not share.  That's like, that's our bread and butter.  We're gonna teach you, you know,  become a client and then we'll teach you how to do  all of this stuff.  My experience is I can over-educate my audience  to the point where they realize just how complicated  the thing I've become an expert in is.  And so 15115,  You don't pay anything to get that from me today.  And the reason I shared it is because I know,  once you get a list of like 20 different things  that you're trying to automate  that you've done five times manually,  they're gonna be like,  crap, I might need some help, right?  And that's on purpose  because you have a sticky note on your desk  that says 15-115.  That's way better than a business card  that I just sat down in front of you.  Do you know what I mean?  Like, what better way for you to remember?  Oh yeah, Will helps with this kind of stuff.  Or he might know somebody that helps with this kind of stuff  and can kind of dig into all of those different pieces.  Mm-hmm.  If you are enjoying this episode, check out the Stir 716,  the podcast to help you unpack the issues,  elevate your voice, and activate change in your community.  This is Mrs. T, AKA the spark, along with co-host,  the doc, and our cool cousin Kim.  subscribe to the star 716 on the Jazz CAST Pro's network,  available on all major platforms.  New episodes released the second and fourth Tuesday  of every month.  And remember, the star 716, where education meets conversation.  Yeah, I heard someone say recently that in the age  in which we are with the internet, people  are a lot less willing to pay for education.  They're willing to pay more for application.  And so I mean, you can Google,  practice it, what proximity?  Proplexity.  Perplexity.  You go perplexity.  Anything.  And you're going to get a ton of free stuff back.  But now how do I go and apply it to my business with my ADHD  in the specific type of offering that I have?  Yep.  Here's, so one of the things that I found that's super interesting,  and I'll be curious to see who fine tunes this enough  to the point where I'm willing to pay for it. But I have had moments where I'm like, okay,  pretend your Alex or Mosey, Chadgy BT and rewrite this for me. Right? Re rewrite this email that  I'm trying to send. You can go 10 steps farther, turn on the voice mode, which by the way, the voice  mode on Chadgy BT four has gotten really good. Like wicked good. You can actually interrupt it.  So you can be like, hey, oh yeah, you don't have to wait for it.  Like it is amazing what it will do and how easy it is.  So like I have on my phone, I've got it right here in front of me.  So basically I can just open it up and say, hey,  chat GPT, you're about to be on a podcast.  What would you want to tell people about yourself?  Like what can you do?  Let's see if this works.  Absolutely.  That works.  If I were to introduce myself on a podcast, I'd say,  hey there, I'm chat GPT, a conversational AI developed by OpenAI.  I'm here to chat, help out, and share knowledge on a wide range of topics,  from answering questions to offering advice,  or even just having a friendly chat.  I aim to make conversations engaging and engaging.  So I'm actually going to interrupt you there real quick.  What I'd love for you to do is look up Will Christensen.  He's the guy who founded Data Automation.  and look up 15115. What is that?  a focus work, one minute of break, and five minutes of review.  You're totally hallucinating there.  You may want to look into that a little more.  So as you can see, it's going to be off sometimes, not exactly what's there, but it did  a great job of guessing and it sounded really good.  If I didn't actually know what it was, I would have totally believed that.  Well, so that's the downside of AI, right?  You have to be careful with some of those different pieces.  I was really, like I knew I was stretching its boundaries.  Yeah.  That's probably the key thing I would say for the listeners.  If you haven't had multiple conversations  and have a conversation with something about something  that you're super knowledgeable,  like you just finished a book,  have a conversation with about that book  and start to ask it more specific  and more specific and more specific questions,  you'll figure out, oh, there's a level of specificity  out there where if I know that this is probably only  found on two blog posts in the entire world.  The AI probably doesn't have enough data to train on that  to actually give you a reliable answer.  And so I knew when I asked it,  tell them, did it get who I am?  Like give a bio for Will Christensen?  It's got that all over the place.  And I'm on hundreds of different podcast episodes  so I know that information's out there for it to train on.  But 15115, that's probably in maybe 10 or 15 different episodes.  And so it had enough to know that it was a framework, but it didn't have enough to give you the exact details of that framework.  And so my challenge for the audience would be go start having conversations with it daily and do so in a way where you begin to understand its boundaries and limits.  Yeah.  So that's that's the real challenge of AI is knowing like my gut said,  Mmm. Should you ask it the 15.15 question? And I was like, it'll be hilarious if it hallucinates.  Yeah. I knew that that's where it was at, where it could go. And that's because I have  pushed those boundaries on a regular basis to see where what is it actually capable of getting  right? Yeah. So with, I mean, it's incredible how much AI and deep learning and all of these  technologies have it feels it felt like they were growing exponentially now they're  growing at the speed of light and I'm sure that every generation says that but as solo  pernours who our time is such a valuable currency and we're trying to figure out where to put our  time. How do you manage new technologies new things that are coming out on of you know what feels  I was like, because I know every person listening to this is going to go and like Google  themselves through chat, GPT or you know, like they're going to see, you know, do that  thing, the prompt that we just did.  So how do you manage that?  So my, so perplexity is an amazing tool for this.  The reason I would use perplexity and I would pay for it is because the paid version will  let you do more searches.  You can try it out for free.  It's got, it's got its own free version.  The thing that's amazing about the platform is when I have a question about which piece  of software should I use for X, Y, and Z, it reads that first page.  So instead of me having to get overwhelmed by all of those different sales pages, it reads  them for me, gives me a semi-informed decision so that I can then whittle down and go down  to the information that I really wanted.  Another thing that I would honestly recommend is automationhunter.com.  So automationhunter.com is a website that I publish to.  It's actually a YouTube channel as well.  And I am constantly reviewing apps.  So I'm going in and I'm finding what's out there for solo pedoers that that's going to  make a difference.  And so, you know, you're welcome to submit reviews to me or say, I call it creating a bounty.  You're welcome to create a bounty with me and basically say, well, I need to find an app  that does X, Y, or Z.  I will go find or sometimes it's as simple as like you go so so if you're an entrepreneur and you're  you know considering this idea of a new app and you're like switching to a new CRM is such a pain  in the butt like I don't I do not know which one I should switch to. That's a perfect example of a  bounty email me will at equityhammer.com. We'll jump on a 15 minute episode of Automation Hunter  and I will ask you questions about that bounty and then recommend a CRM.  So like there are lots of resources like that out there that are constantly trying to help  with that overwhelm. But I would say the first step is just buckle up because it's going to be  a ride and don't be afraid to try new things, but also don't spend too much time trying all the  the new things are you'll never actually build a business.  Yeah. Yeah. That's a great point.  I have a couple episodes around CRMs.  And so that's a great place to start because I think CRMs  should be salespeople and entrepreneurs'  bibles. They should be touching.  But it can be like, I don't even know where to start with the CRM.  And so I always tell people to start with a Excel spreadsheet  because it's easily accessible before you figure out  what you do want, what you are going to use.  So I would recommend rather than Excel.  Excel is what everybody, they all know like tables,  whatever, Google sheets, that kind of thing.  I actually tell people to go to Airtable,  Coda, Notion, or ClickUp.  One of those three, use the table functionality,  because they all have free versions.  All three of those platforms I just mentioned,  all have free versions.  The key is that they can do relational databases.  So you can have a contacts tab and a companies tab and you can assign contacts to one company.  Where a spreadsheet falls down first as a CRM is when you're trying to assign two contacts to the  same company because then you're putting in a carbon separated list and if you try to do a  mail merge on that, I try. Like you run into all sorts of problems when you try to begin to force  a one-dimensional piece of data.  That's what a spreadsheet is.  It's one dimension into a two-dimensional,  meaning I want to associate two records  with one record in another table, relational database.  So all of those platforms I just mentioned,  air table, click-up, notion, and,  Okoda was the other one that I mentioned.  All of those have free templates for CRMs  that you can go get right now.  And it's just as flexible as a spreadsheet. Delete, merge, move whatever, going there before  the spreadsheet will actually save you some time and energy because it's going to have all the  fields on there already that you got to fill out and delete any that don't make sense  because it's very similar to a spreadsheet. Right. So that's where I would go first. And I agree,  If you're not currently writing down who you're talking to, holy crap, go write down  the stuff we were talking to.  I've been shocked with, like I just tried a new one called Adio, ATTIO.  It's an automatic spreadsheet, so it looks at your email history and your calendar and  then just updates itself.  I have not dug into it in grand detail, a good friend of mine who runs a podcast, excuse  not a podcast. She runs a monthly newsletter called Optimize Monthly.  So it's optimized monthly.com. She and I are kind of partnering up to kind of  build out a directory of sorts. She's using Addie right now. And she's,  she's on it. She's on the paid version and she's been on for about a month.  It's got a lot of cool sequences. She's not sure if she's going to continue  paying for it. But it was pretty cool to see it fill itself out. Like I,  I got it and I was like, oh cool, they've got some sample data.  Wait a second.  I've emailed like all those, oh my gosh,  this is, there's 1900 contacts in here  and I didn't put any of them in here.  Oh, and it started like categorizing them in like,  you know, which industry they were in  and how large the companies were.  And I was like, oh my, so anyway, lots out there  to test and play with.  Like working in, I had a role where I was specifically just in sales and now running a business and working with entrepreneurs like a lot of entrepreneurs with ADHD.  That data entry is like soul crushing.  And if you can a AI tool.  Soul crushing is the right word for that.  Because I think entrepreneurs are dynamic.  They're engaging.  They love talking.  They love creating.  They love connecting.  They copy and pasting.  Like you said, we're allergic to it.  And so painful.  Yeah.  Yeah.  So I think AI's biggest compliment  is going to be doing this stuff that crushes your soul,  that is painful to you.  So honestly, AI was, so I can remember being in high school.  This guy gets up on the stage and he was like, so they want me to come out here and motivate  you.  They had like motivational speakers, they would hire to come speak to high school students  to get them revved up about college and you know, all of the other, like go, go, become  someone, right?  The guy goes, you know the coolest thing about working hard and like actually being successful  And we're all like, yeah, what?  And he was like, I don't have to know how to spell.  And I was like, what the fetches even mean?  Like that's like the opposite of what my English user  taught me last hour.  He said, I have an assistant who does all of that for me.  She manages my entire everything when it comes to that.  And at that moment, I was like,  that's gonna be me one day because I can't spell worth beans.  Like we are going to figure out  how to do that. And that has kind of been my mission in life is to figure out how to connect  those dots. On the note of an assistant said every entrepreneur ever, I wish I just had someone  who would sit on all my calls and write down all the to do's. And then I take care of  them, like like I'll do them, but I just need somebody to write them all down because this  whole note taking thing on the call like so frustrating for 12 bucks a month plus maybe 20  bucks a month. So like 33 bucks a month. So you know what? I bet I could do it in under  31. So for for a dollar a day, I have fathom note taker that sits on every single one of  my phone calls and it captures all of the to do's pushes those to do's to zap your that  get pushed to click up and all of my todo's are written down with a little link back to  the timestamp of where the AI thinks that the task came from.  For $1 a day, I have a freaking, and it's better than full time guys.  I could get on 80 hours of meeting every week and guess what, it doesn't care.  It just jumps on and continues doing that.  AI opened the door for those of us with ADHD in a way that is just mind numbing.  I felt so I'm very religious and I said some very thankful prayers to Heavenly Father when  AI became a thing because I was like, I feel like this was made for my brain.  Right.  Oh, yeah.  I have just been diagnosed with ADHD this year and so the grace of like this is how my brain  works has been life changing. And so then to find tools like that. So I could talk forever with you.  Actually, I would like, run of applause because I was so tempted to come on like as you were talking  when I was listening to other content. If you're so I was like, I want to dig, have you like,  break apart by business and but the audience doesn't want to listen to you bring me apart by business.  Well, we should definitely do that on another call. Anyone who is currently out there  and this is an offer that's open to your whole audience as well.  Anyone who is currently in the mode of trying to figure out  how to grow that solar printer business.  And they're at a point where they're charging more  than $150 an hour for their time.  That's my only requirement.  Jump on a phone call with me for 15 minutes  and I'll bet you a $50 Amazon gift card.  I will change your life before the end of that call  in terms of automation and integration  and like will help you find a new app.  will help you find a new piece of what's there  and pick apart one of those challenges.  And that's on the table and a bet I'm willing to make.  So if you get me and I'm like,  yeah, I totally lost that.  I can't do the $50 gift card thing,  but I'll happily help you.  I'll be surprised.  I have yet to experience,  I'm happy to pay out 100, 200, 300 bucks a month  to keep that off for alive.  So I will happily pay you,  but I'll be shocked if I can't find something  to share with you that doesn't shift your world for you  in automation or AI.  That's awesome.  So I'm gonna challenge you  because we're running up on time  to see if we can get the lightning round questions  and the fastest time yet on the past.  All right.  I'm ready for the lightning round.  What is a must read book?  Oh my gosh.  Leadership in self-deception.  This book changed my life in terms of how I work with other people.  So that book, get a grip on your business  which is like Gina Wickman traction.  It's the, the fable, the entrepreneurial fable  that talks about that.  That book is amazing.  And then four disciplines of execution.  Awesome. What does creativity mean to you?  Creativity means looking at a problem  through a different lens than the one you normally wear.  So being willing to say, okay, today I'm wearing my,  I'm afraid of being abandoned lens.  And now I'm not, okay, how does that problem look?  So, like, being willing to shift the lenses through which you look at the world to try to solve a problem, that's what creativity is to me.  That's awesome. What is the best piece of advice you've ever received?  Oh, my gosh.  Probably always be honest.  Like, like honesty is the best policy, right? Like that it sounds super cliche, but I have found that in moments when it feels like it might be better to  obvious gate or scrape something under the rug, that has often come back to bite me.  And so I would say transparency is probably your most effective tool in client relationships.  Yeah. I agree with that. What is something that's on your bucket list?  I would love to, two things all throughout there. One, I served a two-year mission for the  Church of Jesus Christ Latter-day Saints in Brazil. I would love to take my wife and family  back to Brazil. To meet some of the people that I met there, I was 19 when I was there 20 years ago.  It's blowing my brain out that I can't believe it's been 20 years. Yeah, that's where  not going there. I'm going to go midlife crisis on you. So the other thing that I would love to  do is I would love to go to Europe. Specifically Scotland, Ireland. I've got some ancestors from  that side of the world.  And I'm hugely and well as fan.  And just I really think that there's some cool stuff.  I've worn a kit to church multiple times.  Yeah.  So I want to go back there with my wife.  So that'd be cool.  That's awesome.  My, not, this is lightning round is not about me,  but my goal is to spend my 40th birthday in Ireland  with my friends and family.  So we're on the countdown for about two and a half years to tell that.  So I think I might join you on that on that.  Can I be added to the group of friends that come to you?  Because I think we're, I'm actually very close to that.  I'm, I turn 39 in April.  So I got like a year and a half.  So I got to, I got to figure out how to make that happen.  That's something that could go.  Well, Nightchu, uh, coin was the ancestors who came over from Ireland.  Check out Declutter and Press Radio, the podcast to help you organize and declutter your space  with short, actionable tips.  I'm gonna give you practical tips on how to keep shared spaces decluttered and set boundaries  from the start, with a little help from a seasoned college graduate.  This is the perfect listen as housing decisions ramp up for the college school year.  Glass will get into how to navigate the mix of personalities in this living situation.  Subscribe to Declutter and Press radio on the JAS-Cast Pro's Network.  New episodes every last Tuesday of the month.  This was so, so great.  Thank you so much for joining the podcast today.  I mean, there's so much, so much there.  make sure to put all the links and everything in the show notes and where people can connect with you,  learn from you, take you up on that offer. So thank you so much for joining the podcast today.  Yeah, happy to be here.  If you like that episode, please leave a review. Those are always so helpful on whatever platform  you listen to this. Until next time, remember the big dreams and small steps will transform your life.",
  "created_at": 1755547452
}