" Hello and welcome to the How-To Academy podcast, the biweekly show from London's home of  Big Thinking and Fast-Christian Dulu.  The science writer Thomas Levinson is one of my favourite historians, and his latest  book, So Very Small, Does Not Disappoint.  Tom tells the surprisingly epic story of how human beings discovered germs, and eventually  came to realise that far from being merely glorified zoo animals for microscope wielding  tourists, microbes were actually the cause of infectious disease.  It's a tale starring some of the most famous figures in the history of science and medicine,  from Robert Hook to Florence Nightingale and Louis Pasteur, but you do not need to be a history  of science nerd like me to enjoy it. Without further ado, here's the interview.  So Very Small is a history book spanning centuries, telling the surprisingly thrilling story  of germ theory, and importantly, why it took so long to develop. But before we head back to 17th  century London, the real start of this story, let's begin this podcast in the present.  How much influence do germs have over human life today?  Enormous. I mean, throughout history, of course, infectious disease has been humankind's greatest  killer. And very briefly in historical terms, it looked like we had sort of escaped this  enormous peril. But it's not true. You know, well over a million people a year die of tuberculosis.  HIV AIDS is still in the world and causing damage. In the country where I sit right now, in the United  States, we have, we allegedly eradicated measles early in the 21st century from the United States.  Now we have an outbreak that's been going on for months that's seen, you know, over a thousand  cases. Polio was supposed to have been eradicated by the turn of the century, still with us,  et cetera, et cetera, et cetera. And oh, by the way, there was just a globe spanning pandemic of a  novel upper respiratory disease that killed millions worldwide. So it's not exactly as if this is a  minor problem. germs are with us. Things have improved enormously though from the, the pre-jum  theory days should we call them. Oh, absolutely. I mean, first of all, germ theory is the idea that  the recognition that microbes initially bacteria, because that's all that was known about at  the time and then viruses, are the pathogenic agent that sets in motion and infectious disease.  You know, so in order to have plague, the only way you get plague is by contact with Y pestis,  the bacterium that is implicated that causes the plague, a case of the plague in a human or an animal.  So before you knew that there were things that people could do and some of them were even effective  to help mitigate the danger of infectious disease. But there was no way to attack the diseases  understanding how they worked, how they entered the body, what you could do to prevent  an infection from happening or perhaps reverse the consequences, reverse the, you know, the actual  disease once it took hold. That all had to wait until people said, oh yeah, Y pestis causes the plague,  this bacterium causes typhoid, that virus causes smallpox and so forth and so on. That's what was  required to, you know, do what happened across the 20th century basically, which is figure out  how either to prevent disease from happening at all, basically vaccines and public health clean water  cleanser, is that kind of thing? Or to reverse these diseases once they took hold, which is  antibiotics, antivirals, the various range, the pharmacopia that's developed to, you know, basically  microbes in their tracks. The dominant theory of contagious disease in Western medicine until  germ theory was the miasma theory. And what was the miasma? And why was the theory of the miasma  so appealing? One of the themes of my work across a number of seemingly very different subjects is  how do scientific ideas change? What leads to realizing something new that's useful that's, you know,  true to a certain approximation of truth and all that good stuff. And so I'm really fascinated by  the problem of how old ideas persist for as long as they do. And that's, you know, as you said in  the introduction, that's really the core of of my fascination with this topic. And, you know, a  couple things have to happen. One is that the preceding theory has to be adequate in a certain sense.  It has to describe what's going on. It has to construct a kind of story, a reasonable story about  whatever, you know, material events it's trying to explain. And the great thing about miasma theory  is it really did. If you look at it, it basically is, you know, bad air emanations from the earth  of the decay and wrath of a swamp, whatever it may be, you know, or just sewage, whatever,  releases these some kind of stuff people would talk about seeds. People would talk about just the  sort of the corrupting sense of this emanation. It could be ascribed to divinity. You know,  God is the source of all events and, you know, uses miasma to, you know, carry out his will on  earth to, you know, bring sickness or health to, to a given person or.  given town or what have you.  You know, and you could say, okay,  well, that explains how God does it.  It's also a perfectly good secular explanation.  You know, in fact, diseases are often associated  with filth or decay or decomposition.  You know, if you can smell active sewage,  that means you could be in range of cholera or typhoid  or the other, you know, diseases of the gut  and so forth and so on.  So the great thing about miasma theory  is it was flexible.  It could allow for sort of different theories  of ultimate causation.  It had some corroborating evidence, you know,  bad stuff, diseases.  It provided a kind of mechanistic explanation.  If you wanna know how an epidemic happens  or how infection happens, well, this bad air can go  from person to person or, you know,  a sick person can emanate whatever it was  that had initially encountered them  and then pass it on through the air  to this, you know, the next victim.  So there are lots of things that miasma theory  allowed you to think that explained  the things you were observing,  that seemed like an adequate description  of the events that you were trying to confront.  And, you know, absent some more coherence  and some mechanism, it was as good an answer as any  until two things.  One, the things it didn't explain became more  and more apparent.  You know, this is sort of the old idea of theory change.  A theory works until enough facts accumulated  that it's inadequate and then there's a break  and you want, this is a cartoon version  of a lot of thinking in the history of science  or those sort of philosophy of science.  How to, how to ideas change.  So that's one thing that can drive change.  But the other thing is that the theories change  because the context of how people figure things out changes.  All right, let's go back to the plague in 1666 in London.  This is the time of the scientific revolution.  There are men like Isaac Newton and Robert Hook  fundamentally changing how we think about nature  and humankind's relationship to nature.  And in particular, for this conversation,  we're gonna think about the discovery  of the microcosmos and the microscope.  How did we come to understand that tiny animals,  too small to see with the human eye, lived all around us?  Well, the discovery of the microcosmos  is one of these sort of great adventures  in the history of science.  Microscope had been around for a while by the time you get  to the peak of the scientific revolution  in the 1660s and 70s at 80s.  I mean, the telescope came first in 1610, 1608, 69,  that kind of thing.  Microscope followed soon thereafter,  sort of just turning the lenses around  to make, again, making encouragement of it.  And people, you know, used them to look at the world  and they saw these sort of like,  it was really fun to look at things you already knew about  and make them larger.  And you see more detail.  You look at one of the first great popular books  about using the microscope was a history of bees.  You know, so people looked at bees  and they saw all these nice things in their wings  and so forth and so on.  And that's pretty much where my cross could be stayed  for like, you know, on the order of half a century.  And that was partly because that's the first  thing you look at, of course,  and partly because microscopes themselves  weren't that powerful.  They had to be improved.  And you got that improvement starting really after  the middle of the century.  Robert Hook was one of the people.  He developed a compound microscope that was very accurate.  And he produced the second great popular science book,  perhaps the first first in English,  that was called micrographia,  which was his extraordinary series of gorgeous drawings  or etchings of his drawings that he had made  of all kinds of things, some non-living,  like the point of a needle,  but also these great depictions of the living world.  Most famously this beautiful flee that's this fold out  drawing and you can see the, you know,  this glorious detail of every aspect of the fleece body.  And I was still looking at stuff we knew was there,  but, you know, noticing new details about them.  Micrographia, though, found a particularly important reader  in this up till then completely obscure Dutch cloth merchant.  And I'm apologizing in advance to any listeners  who speak Dutch for butchering his name,  Anthony Van Levenhook.  He was a, I say, cloth merchant, a draper in the city of Delft  in the Netherlands.  And cloth draper is used lenses to inspect their,  their, you know, bolts of merchandise and so forth.  And he somehow became fascinated with those lenses.  And then encountered micrographia,  perhaps on a trip to England, he took one,  perhaps back in his home city of Delft.  And started just as an amateur out of curiosity,  see how good he could make his own lenses.  And then looking at things.  And some time in the 1670s,  he started looking at things that appeared to have nothing in them,  like a drop of pond water.  And what he saw when he looked at, you know,  pond water was this, you know, teaming catalog  of living things some just large enough, you know,  little tiny multicellular creatures  that you could sort of glimpse with the naked eye  if you looked at it really carefully.  But then this whole catalog of creatures,  much smaller than that, completely unsuspected,  completely invisible to the naked eye,  that we're doing all kinds of cool things.  They were moving, they were, they had little arms,  they could sort of jet across things.  They had funny shapes, they were spirals,  they were balls, they were all these kinds of cool things  that no one had ever,  seen before. And so this completely obscure guy never had any, you know, serious contact  with the Republic of Letters, you know, the, the learned people all across Europe who communicated  with each other and to the burgeoning Royal Society in London about all the cool stuff about  nature they were learning. And he wrote a letter. And he had a friend who was closer to  that world, sort of write a cover letter to the secretary of the Royal Society saying,  this guy is for real. These are really interesting observations. Take a look. And, you know,  that was the beginning of a 50 year career for Leaven Hook as a microscopist in conversation  throughout that period, you know, from 1670s to the 1820s, sending the Royal Society,  you know, shef after shef of, you know, paper with covered with observations and drawings  and descriptions. And in 1676 itself, three years after he started this correspondence, Leaven Hook  sent the first known account of seeing these microbes. That was the first discovery of this whole  new realm of life completely unsuspected that he would then go on to an explorer for, as I said, decades  to come. Hello! If you're looking for a companion podcast to this one, check out the happiness lab.  It's a show all about how to lead a happier life, hosted by Yale professor Dr. Laurie Santos.  This season the happiness lab is exploring happy parenting. He'll hear from voices like Glen  and Doyle, Vivek Murthy and Dr. Becky Kennedy with tips on how to do some of the hardest things  in parenting and how to motivate your kids. If you want a parent, check out other episodes from  this year like lessons on how to handle relationships and how to stop drowning in stress.  Tune in by searching for the happiness lab on your favourite podcast app.  So why didn't he, or the virtuosity of the Royal Society, consider that these microbes might  be connected to this spread of disease? So that's the core of sort of the question I try to  ask and answer in the first half of the book, I guess, is why not only Leaven Hook and Hook and  Newton and everybody else doing the, you know, in this conversation failed to make a connection  between microbes and anything that mattered to humans, human disease, any, you know, that there was  any meaningful connection to everyday life as we experienced it on our, on our, you know, large  macroscopic human scale. And partly, I think, you know, you have to give them a little bit of leeway  because, you know, the first time you see something, you don't know anything about it, you know,  it's hard to make the leap at all. But it is interesting that, you know, it's not like infectious  disease was a strange and unknown thing to everybody in the conversation. I mean, the great plague of  London was 1665 to 1666. The key people that, you know, in the Royal Society, the Leaven Hook was  communicating with, had lived through that. They had tried, you know, in several of them,  Hook and Robert Boyle and others had really tried to sort of figure out what was going on. They tried  to use their, you sort of newly emerging scientific method to figure out what caused the disease,  what the disease did in the body, whether there was any way to respond to it, all these sort of  basic and very good questions. And they'd failed at that time. And so you do have to ask,  what happened? You know, what was it about this discovery that made it such a one-off, you know,  it just, it was interesting people were fascinated by it, you know, people looked at it,  lots of gentlemen bought microscopes to, you know, play with it home and all this kind of stuff.  And yet this connection was never made. And I think there are, you know, there's never a single,  you know, one-off answer. But I think you have to look not to the science, but to the culture and  sort of the ideas that were sort of dominated the way people thought about the world at the time.  And one of the critical ones was something that had originated in antiquity and then been carried through  in the Middle Ages and beyond through church interpretations, this notion of a great chain of being,  of a hierarchy from, you know, God on high through the angels to humankind, and then humankind  existing outside and in dominion over nature. So it comes down in my view to the notion that you  can only think thoughts that your larger conceptual framework sort of allows you to frame.  And that in order to think new thoughts, that framework has to erode. It's not just that you have  to make a discovery and see something new. You have to actually change your, your sense of connection  to the rest of the knowledge that you know. And in this case, Leven Hook himself presented it this way  and I think it was received this way. The observation of these microbes was exciting. It was  interesting, but it was kind of a sort of tourist trip. You know, there'd be the, you look through  the microscope, you'd see these little swimmers, you could pick out the swimmers from  gunk from between your teeth, right? You know, that's one of the critical experiments that  Leven Hook did. He scraped his own teeth and he looked at, looked at the scrapings under the  microscope and he saw several microbes and, you know, and, and the drawings he of that event  include some of the very first depictions of microbes anywhere in, in, you know, the written record.  And these were entertainment and in fact almost presented us.  such, how wonderful they are, how marvelous, how exciting it is to see this.  And that's kind of how they were received Robert Hook gave a lecture in the 1690s complaining  that people had sort of lost focus and were just using this as a kind of toy.  And I think you can understand that impulse if you have only if you say, okay, there was,  it was extremely difficult, not quite impossible, but extremely difficult to think that  these tiny, invisible, you know, no brains, no limbs, no nothing.  These creatures could actually have a meaningful impact on the crowns of creation, us,  what human beings think and believe do work.  What are the characters in this book who embodies the intellectual contradictions of this  Baroque era is a witch hunting American called Cotton Mather.  Can you tell us about him?  Cotton Mather is one of my favorite characters in the book.  Yes, he was a witch hunter.  He's one of the great villains of the Salem witch trials and arguably he is, you know,  largely responsible, not entirely, but largely responsible for the deaths of a bunch  of innocent people and the enormous disruption of the lives of many more.  And he was somebody, you know, and he had a sense of the reality, both of God and of Satan  that was, you know, palpable.  He imagined Satan in New England, you know, sort of grabbing little girls and turning them  into, you know, it's just, I mean, his, his, his, sort of sense of the, the reality of the  divine and the divine's enemies was, you know, almost impossible to recreate in our, you  know, modern, much more secular age.  That stuff was real to him.  But he was also somebody who was fascinated by the material world.  And he, you know, at one point thought he might become a doctor before the family business  of being a, a Puritan minister sucked him in.  His dad and a bunch of his uncles and his grandpa were all, all very much in the church.  And at some point he started, you know, collecting curiosities about the natural history,  essentially, of, of the American colonies and sending enormously long pro-lix letters  to the Royal Society saying, look at all this, you know, curiosi Americana or something  like that.  And he was interested, you know, that combination of interest.  He was, he cared about health and sickness.  He saw his duty as a Puritan minister to try and minister to, to his, you know, congregations,  bodies as well as their souls.  And he was, he had this sort of love of empiricism that in some sense, belies and in some  senses an extension of his sense of the reality of Satan's influence on earth.  Um, you know, he thought there was material evidence of that too.  And so relatively early on in the first decade of the 18th century, uh, he encountered  through his slave, uh, the idea that you could inoculate against smallpox.  You could take material from somebody who had a not too bad case of smallpox, take some,  you know, pus or, or dried stuff off of scab, smallpox scab and scratch that stuff into  the skin of another person.  They would then develop mild symptoms of smallpox.  And then as people knew, once you had smallpox and if you survived, you were then safe,  you were immune to the disease ever after.  So, um, he learned from this life that this was common practice in the part of Africa that,  that, uh, this man, Onesimus had come from had been stolen from.  And then in the mid 17, 17, 15 or 16, uh, matters so a letter to the Royal Society,  it would let it published in the, um, philosophical transactions of the Royal Society of  which he was now a member.  He was a fellow of the Royal Society.  Uh, and he saw a, uh, this, this report of the same practice being done in, in, uh, the  Ottoman Emperor in, in, uh, Constantinople.  And he said, ah, you wrote, he then wrote back to the society and said, look, uh, you know,  my slave has already told me about this and, and I can, you know, give more evidence that  this really works.  This really happens.  And if smallpox should visit Boston, again, I'm gonna try it.  And of course, smallpox showed up a few years later, 1721.  And he did to both success and enormous opposition.  Oh, so what happens in Boston, 1721 is a British ship.  The, uh, HMS seahorse shows up in Boston Harbor in the spring in April.  And, um, it has at least one of probably more people who have already caught smallpox, uh,  onboard.  Now at that time, ships were supposed to anchor well offshore and, and stay in quarantine  until they were cleared.  But for some reason, the seahorse did not.  It, it, it, um, it came alongside Boston, you know, one of the Boston, uh, worse.  And, um, and at least one smallpox, written person came ashore.  And to see horse was sort of pushed back out into the harbor.  Uh, but by then it was too late.  Um, that first case was ultimately found in a, in a sort of guard was put on the house door  where he was.  And that was a sort of standard practice.  You had, if you had a case of, um, smallpox in a home, the home was quarantined, you couldn't  go in or out.  Uh, food was supplied, you know, by the, by the, uh, town fathers and so on.  Uh, and that's what they tried to do through about June.  At which point it was clear two things.  One is that there were well over 100 cases by that time.  And the town was running out of people to station in front of doors.  Um, and it had spread off the worst.  It was, you know, the, the disease had broken the bounds of just sort of immediate sort  of maritime setting.  Boston wasn't that large.  At this point it was, you know, under 10,000.  thousand people. Over the course of the next several months, the disease raged to the  town. There were several thousand cases and something like 900 people died. So that's  close to 10% of the population of the town died in this epidemic.  Well, in June, as this was just starting to accelerate, as it was becoming clear that this  was going to be an actual epidemic, not some small, containable outbreak.  And that has said, you know, I know this stuff. I know about inoculation. My slave told  me they, you know, they learned of Europe, we're talking about it. It's being done. Let's do  it here. And he sent a letter to basically every medical man in Boston is saying, let's do  this. And only one replied and said, yes, it was a surgeon named Zebediah Boylston. And  they did it. They started on Boylston's son and a black man also likely a slave and that  man's son were the first three to be inoculated. The turns out that the older, the older man,  the father of this young black child probably had either had smallpox or inoculation before  because he basically had no reaction to the inoculation. The boys got pretty sick, but then  recovered. And that was sufficient for Boylston and Matther to pursue this as a way to prevent  the spread and preserve the lives of people in Boston. And they started inoculating more and  more people. But both the medical community and the town sort of governing bodies reacted  against inoculation for several reasons. They said it was dangerous, which was not entirely false.  You know, you were after all scratching real smallpox into somebody's arm. You were giving  people, the literally giving people what was intended to be a mild or sort of, you know, very  light case of the smallpox. So yeah, smallpox inoculation was dangerous. And it was seen as kind of  blasphemous. You know, it's up to God to decide who gets sick and who dies and who gets well. Who is,  you know, who is gotten Matther to interfere in his God's, you know, will and choice by trying to  preempt that decision, preempt the choice of sickness or health. So there's a whole range of  opposition to him. That was strong enough so that in the end, Boylston was only able to inoculate  something under 300 people who did very well.  Enormously, but you know, there were, I think six deaths in the group that he inoculated, at least some  of which were genuinely from either other causes or from smallpox already acquired before the  inoculation happened. So it was, you know, compared to a 14% death rate for those who caught the sort of  wild smallpox. This was an enormously safer option, especially given that basically, you know, virtually one in two  people in Boston came down to the disease. So afterwards, Matther said, you know, look, all these people  died and we could have saved them. Isn't this terrible? And, and he was right.  Now, the Christian paradigm that man has just been if the angels and microbes are too far below to be of any  significance does gradually fade into the background of the history of science. But then we have the chain of  social hierarchy taking its place. And this holds back the work of men who are household names really  in the history of science like Dr. Semelweiss. And you tell his somewhat tragic story in the book.  I do. I mean,  Semelweiss is an individual tragedy. The larger tragedy is that the discovery he made, and he wasn't the only one to make it,  but he's the most famous and did the most to try and advance this. The discovery that he made could have saved  uncountable numbers of women's lives around the world. And you know, anywhere that that that that  poor, poor, poor child, that fever was a problem. Semelweiss had identified not the cause of the problem, but the solution to it.  This is, you know, some of us works in the period that I in the book I called germ theory without germs. When people figured out the logic of germ theory  without identifying what it was that formed the specific thing, the specific material particle that led to a disease.  In purple fever, it's actually a small number of different bacteria that can produce this terrible infection that occurs  very commonly occurred very commonly. After, you know, in in form new mothers, you know, you deliver a baby. There'd be lots of, you know,  blood and stuff and you know, lots of ways into a body and if a micro,  if a pathogenic microbe made its way into one of the injuries of childbirth, then you could get very sick indeed and and die, you know, very high death rate.  The world around us is moving at incredible speed and the times the pace of change can feel really overwhelming. Don't you think?  I am Stephanie Bumbizmat, an activist author and digital educator. How do we manage? Is my new series why I sit down with global experts,  thought leaders and trailblazers to explore how we navigate this past moving world.  So if you've ever found yourself wondering how we manage all this.  was changed. Let's find out together.  And, you know, the critical step in figuring out, again, not what was causing it, but  how to solve it, actually was reinvented several times between the end of the 18th century  and then some of us was working in the 1840s. But what some of us did is he realized,  in his hospital, there were two wards. It was a perfect natural experiment. There were two  wards in which women came to give birth. This was in Vienna's largest hospital, the General  Hospital. And one of those words was staffed by doctors and medical students, all men.  And one of the wards was staffed by women midwives. And this was at the time when Vienna  was at the leading edge of medical education and really sort of medical discovery and  was using the sort of still young science of pathology to try and understand disease.  So one of the critical parts of the medical students' education was to dissect the cadavers  of patients they had lost. So if you're a medical student on the maternity ward and a woman  dies of child bed fever, a prayerful fever, down she goes to the dissection room, you go  down and you look at all her organs and you see what was diseased and you try and understand  what the connection between one organ and another that had been infected and all this sort of stuff.  And then you would go back up when you were done and you would deliver another baby. With all the  you know, guck of the dissection you had just taken part in, walking on your hands from the  morgue to the birthing room. And the consequence was the death rate, the infection rate and death  rate in the doctors and the male administered doctors and medical students ward was vastly higher  than it was in the midwives ward because the midwives weren't expected to be trained in medicine.  They didn't go do the dissections. They just stayed where they were and worked with new mothers.  And some of us sort of had this brilliant insight that something was going from the corpses to the  living mothers who would then become corpses and interrupted that and the way he interrupted it was  by requiring anyone who had taken part in a dissection to wash their hands extremely thoroughly  in a chlorine solution. And you know, the instruction was to wash till the smell of death is off your  hands, which turns out to be long enough to kill any microbes that were that you might, you know, be  transporting on your person. And it worked amazingly enough. It was the cringey. If you have  pathogenic microbes, then what you want to do is sterilize the scene where you are and he did that.  Unfortunately, he was, I mean partly he was a very contentious sort of pugnacious guy and if people  disagreed with him, he'd sort of accuse them of being murderers and all this sort of stuff.  So he was not really good at playing the medical communication game. But also people who  the German medical, German speaking medical establishment still didn't believe in germ theory and  they saw, you know, one of the most prominent of your child, the great pathologist, a  enormous figure in the history of medical science, not just in Germany, but worldwide,  rejected several of ISIS conclusions. And he did so because he had a different theory of disease.  Poor conditions, bad, bad, bad environment, poverty, all these kinds of things were the source of  disease and that deranged the body and made them vulnerable to any insult that came along.  And several of ISIS is really kind of mechanical idea. There's something bad in the diseased  material of a dead body. If you get rid of the bad thing, then you won't replicate it in the next  that was a very kind of mechanistic and unlovely way to understand it to a lot of people.  But I think the real kicker in the story actually came to understand the kind of opposition to these  ideas. You have to go to the American physician who was trying to work out the same problem,  more or less the same time as some of us. This was Oliver Wendell Holmes, senior, who was a  rich Boston ramen, sometime poet and medical doctor and father of his son Oliver Wendell Holmes,  junior, who is in the US as famous as a very influential Supreme Court justice. But senior,  you know, at a medium of medical society, had somebody asked sort of what was going on in an outbreak  of verbal fever that was going on in the greater Boston area at the time. And he started to  investigate it. And he just built this, you know, catalog of cases. And he noticed this pattern  that cases would follow a given doctor or midwife from one patient to the next, that there was  something that that medical person was doing or inadvertently doing that carried the disease from  patient to patient. And so he said, you know, doctors are, are, you know, vectors for something. We  don't know what it is, but they're vectors, doctors and midwives. And they shouldn't do that. And  they, you know, they have to rigorously clean themselves, clean their clothes, don't, you know,  don't wear the same clothes between patients wash your hands really seriously. All this sort of good  stuff. And he published this. Um,  And the leading American OBGYN of the time, you know, maternity doctor, guy who wrote the textbook,  man named Mees or Mikes, I don't even know how to pronounce his name, MEIGS, who was a physician in Philadelphia,  responded that Holmes's argument was the monitoring, I'm quoting now,  and the monitoring of us off more, and I said his explanation, his account was impossible because, and again, a quote,  a gentleman's hands are clean.  I mean, let that sink in for a moment.  You know, this, you know, a doctor couldn't be the vector of disease because his social standing was such that, you know, he was pure, right?  And, yeah, social hierarchy made a difference.  It made, you know, if there were things that doctors should be doing and weren't, that was an indictment of them on a fundamental level,  and that was unacceptable in that context.  Just tragic.  How's, you know, after some of us, some places picked up on his ideas, there were some hospitals in Britain, elsewhere.  But many more did not. And, you know, it's just, you know, you think of the women who died who just, just because, you know, somebody didn't wash their hands.  And it's just awful.  As is probably obvious from the number of people we've talked about already, there's no one person responsible for the germ theory.  But, Pastor is the outstanding character in this very, very slow revolution.  And, of course, we all know that the milk on your breakfast cereal is safe to drink because of Pastor.  But what was his major contribution to our understanding of life?  Pastor is this fascinating figure, clearly brilliant. Not a doctor. He was a chemist by training.  And he kind of got sucked into this world.  There's this marvelous story in the book, and I'll tell it now.  You know, he at a time when he's a very young professor, just taking up a university post, you know, town well outside of Paris, he was not in the center of the action.  And he's teaching chemistry.  And he has a student in his class who is the son of a local sort of industrial alcohol manufacturer.  And one of the things he made was alcohol made from beet juice.  And as this son was taking Pastor's course in his, in Pastor's sort of first year doing this,  his dad was having a lot of trouble.  A bunch of runs of trying to turn beet juice into alcohol kept ending with this foul smelling sort of nasty, you know,  duck that that clearly wasn't alcohol.  And the student said to his, you know, young professor, what do you think is going on?  And so Pastor went to the factory and his wife, you know, this was, you know, in the fall of sometime late in the 1850s.  And, you know, by, you know, winter, his wife was complaining that he's, you know, drowning you at her husband was drowning in beet juice and he was like,  completely immersed in this problem.  And what he found was that in the batches of beet juice that went nasty,  instead of yeast being present, still being argued what yeast role was in turning sugar stuff like the sugars in beet juice or the sugars in grapes or in barley, you know, malt.  And so, you know, turning that sugar into alcohol, what the role was exactly wasn't clear or wasn't agreed on at that point.  But what was interesting to, to, Pastor was that that yeast wasn't present in the bad batches.  Instead there were these bacteria that made at the part of their metabolism, they need sugar and excrete lactic acid.  And lactic acid was, you know, what was contaminating these bad batches.  And when he started thinking, well, you know, microbes do things, right?  They have effects, you know, they go someplace, they consume stuff, they, you know, get rid of the waste products.  And when they do that, they can have an effect on whatever medium it is that they're growing, whether it's a vat of beet juice or then he actually wrote a book on,  quote, disease is of wine and beer.  And what Pastor saw was, in essence, the idea of a germ not yet as the cause of a human or animal disease, but as something that could change its surroundings.  And that was really the start of his, you know, extraordinary career of both identifying pathogenic organisms and figuring out what to do about it.  And, you know, the, what to do about it can range widely. I mean, you mentioned milk, pasteurizing heating milk till the potentially contaminating organisms are gone is one way to prevent organisms.  We don't want from entering either our milk or our own bodies.  But there are lots of other things you can do. And, and, and, and, and, and, and, and you're in particular a pioneer of vaccines.  And it's important, developers, not just of individual vaccines, but what he himself actually called the principle of vaccination.  He went on to identify the microbes that cause first a couple of, you know, sort of agricultural diseases, what was called chicken color, or poultry color.  And a problem with silkworms, a parasite, you know, a micro, a microscopic parasite that was doing damage to the silk industry in France.  And then stimulated by the other great sort of towering figure of this sort of heroic age of germ theory, the German doctor Robert Cook.  So, the book went on to identify work on pathogens like the anthrax pathogen, which  cooked for the first time proved was a bacterium.  That was the first human disease where the entire process of disease from bacterium to  disease to how the life cycle of the bacteria made it likely that the disease would occur.  All that was done by Dr. Coke.  Pastor tried to steal some of the credit for that, but then did an extraordinarily important  thing, which was create an anthrax vaccine that was effective.  All this was happening incredibly rapidly in the 1870s and 80s.  And both Coke and Pester and then this growing number of collaborators would go on to both  identify microbe after microbe associated with disease after disease, tetanus, stipheria,  leprosy, typhoid, and, you know, the list goes on.  Just these incredibly, you know, deadly, horrible diseases that had been scurges of humanity  since, you know, records are there to identify them.  These were all identified in this extraordinary period in the last quarter of the 19th century  and Pester and then others were, you know, immediately on this question of how do you  stop these diseases?  They found, you know, the basic suite of techniques that we use to prevent disease from occurring  now, all in that, you know, extraordinary brief intense time of discovery.  Well, we are, as we alluded to at the top of this conversation in a world where belief  in germ theory is declining.  The pandemic and Trump and RFK have accelerated those trends.  What do you see this heading and what can we do to get public understanding of science  back on track?  One of the things, you know, all joke in that I heard from some, you know, student of human  nature said, you know, all the distinctions between humans and animals that we thought were  absolutely unbridgeable, you know, they're not there anymore.  We know that animals use tools, we know that animals have forms of language, we even  know that animals, different species have things that we could identify as culture.  Yeah, different from what we achieve ourselves, but, you know, there isn't this just completely  sharp divide between human capacity and animals, except in one thing.  Human beings are unequivocally the worst species out there at the challenge of one trial  learning.  We forget what we forget our lessons really rapidly.  And part of what's going on now, I think is, you know, the 20th century was the heroic  age, you know, if the late 19th century was the heroic age of the discoveries of germ theory,  20th century saw this extraordinary application of its lessons to the problem of solving infectious  disease.  And you know, the first great fruits of that were vaccines against a growing number of diseases.  And then amazingly antibiotics, which come along in the 30s with self-adruggs and then  the 40s with penicillin and the whole sort of set of families of antibiotic compounds that  were identified after the Second World War.  And then in the 50s and especially in the 60s, you had a second wave of discovery of vaccines.  And that was when you got rid of basically all the, you know, catastrophic childhood diseases  that, you know, I'm just old enough to have been sort of at the tail end of the generation  that was still vulnerable to the whole suite, you know, measles vaccine didn't come along  until the 60s.  Diphtheria had an earlier vaccine, but it was improved in that period.  Rubella, mumps and chicken pox and all these came in this period and very importantly,  polio came in this period from the 50s mid-50s to the end of the 1960s.  So we've had over half a century now where basically no parent has had to sit with their child as they go through  what was essentially the universal experience of getting the measles or, you know,  whooping cough, which is, you know, pertussis, which was this, you know, horrific and very deadly disease  and killed nastilies.  You know, horrible sound that these kids would make as they would do this, you know,  it was called whooping cough because there's this terrible kind of wheezing cough that would happen.  And these children would die these agonizing deaths.  And it was a, you know, the death rate was substantial.  All this stuff gone.  This is what, you know, back in, you know, the 19th century and certainly before death rates in  children zero to five and zero to ten were, you expected if you were going to have a large  family, you expected to lose one or more kids to one of these childhood diseases.  That was just the way it was.  That was just the odds, right?  We haven't had that experience at all for half a century, which is not terribly long in,  you know, in historical times, but is a long time in an individual life, right?  And so I think what has happened is to a largest cent, almost everyone who is, you know, certainly,  you know, making this isn't as bad as kids right now has never had to face the reality of infectious  disease as something that will cause, you know, their families to suffer that may take a child from them.  And it's very hard to imagine that there's a real risk.  And then you have this sort of whole kind of woo wellness thing.  I don't want to be too dismissive, but I am pretty angry about this.  That  It goes back to a not entirely wrong but extremely dangerous viewpoint that says, you know,  what matters is health and the balance in your body and your living right and eating right  and not being stressed and all these, you know, all these things that are good.  You know, there's nothing wrong with, you know, eating a good diet or going out in nature  or touching grass.  These are great things.  I don't want to stop anybody from doing that.  They are not in themselves significant to the bacteria and viruses who might, whom you might  encounter along the way.  You know, people forget that we aren't the only ones who have agency.  I mean, the old idea of the right chain of being has morphed into this notion essentially  that we are personally responsible.  We are the actors in nature and if we live right, if we do the right things, if we,  you know, eat the right, you know, properly, you know, organic, this, any other thing, you  know, breakfast cereals or what have you, we can govern our circumstances and keep ourselves  healthy and safety, keep our families healthy and safer.  And you know, bacteria get a vote.  You know, if you run across cholera, you're not going to, you know, all the wellness activities  that you do aren't going to help, right?  If you change a kid's diaper and that kid has had a polio and encounter with polio for  some reason, you know, your risk as we saw in New York State in the last couple of years,  people catching polio from changing the diapers on their kids.  And you see that in war zones.  You saw that there was a terrible polio outbreak in Syria during the Civil War for the  same reason.  You know, we aren't, you know, we are incredibly skilled.  We have opposable thumbs.  We have big brains.  We make tools.  We have great insights into the world.  We have all this knowledge, but that doesn't mean we run the world.  You know, we live surrounded by immersed in a world that is much more sort of defined by  and dominated by the microbial population than by us.  And if you, if you ignore that, which is basically what's happening now, you run yourself  into problems.  And the reason I think people feel confident in ignoring that is, as I said, because we've  had 50 years where those microbes, because of our technology, because of the vaccines, because  of the things that we do, those microbes haven't been a threat.  If as a consequence, because of this terrible, you know, sort of willed amnesia, this gift  for forgetting that human beings seem to have, if we say, okay, well, I guess, you know,  all those people who say infectious diseases are so terrible and we need to vaccinate  and all that are wrong because you don't see any meals around you.  Nobody's getting chickenpox, etc.  Well guess what?  You stopped exhing and you have, as we have in the United States right now, an ongoing  multi-state measles epidemic, an entirely preventable disease entirely that's already  killed three people and they kill more.  An incredibly grim ending to a fascinating conversation.  Thomas Levinson, thank you so much for joining me on the podcast.  Thank you.  I had a great time talking with you.  This episode started Thomas Levinson and was produced and presented by me, Vasco Stusulu,  and make the show with Nicole Wong and our editor John Dorty.  Until next time, thanks for listening.  The difference between ordinary and extra ordinary is that little word, extra.  On the growth mindset podcast, I dive into the psychology of human potential and what  the science says about self-improvement to give you that little extra.  According to experts, your potential is not sitting under a rock waiting for you to finally  trip over it.  Destiny is merely a function of dedication and hard work, so leave your inner chakra at  the door, put the astrology chart down and stop waiting for something or someone to fix your  life.  Take responsibility for yourself and give me a listen on the growth mindset psychology of  self-improvement podcast."