{
  "podcast": "PhotoActive",
  "episode_id": 41354833716,
  "episode_title": "Process, Product, and Problem Solving",
  "audio_url": "https://aphid.fireside.fm/d/1437767933/d76bf7dc-58d3-4746-b5c1-17ac3c2b6d29/0c96a3fa-f171-4d92-b2d6-50c039b4d2fd.mp3",
  "duration_seconds": 1994.031,
  "model": {
    "name": "tiny.en",
    "device": "cpu",
    "compute_type": "int8"
  },
  "text": " Welcome to Photoact with Bob Namp, the Bat Photography and Technology.  I'm Kirk McElle and I'm Jim curls.  You can find show notes including any photos we discussed in this episode of photoactive.co  that's photoactive.co.  So we have a non-technical topic today.  And if I can propose a title for the episode, it would be process and product.  Because we're going to talk about photography in the sense that it doesn't matter how  your photos end up? Wait, that's what? That the results are less important than the journey.  So that the product is less important than the process. And this is inspired by an article  that showed up in Apple News from the other day. The joy of taking pictures no one else  will ever see. Stop feeding the algorithm. It was from digital camera world. We'll put a link  in the show notes. And it made me think that go back 15 years. The only people who ever  saw your photos were your close friends and family or if you had a bunch of people around  to show photos of a vacation. Or your son or daughter brings home a potential significant  other when you get out the album of baby photos. Or, you know, that kind of thing. People  didn't really look at photos that much. I mean, okay, if you had a wedding, you've got  a photo album and you might look at that and show people. But there wasn't this, the  world had not become a world of exhibitionists and exhibitionists in the sense of people  who put themselves on TikTok to show themselves doing dumb things or to show how good  looking there, they are, or to show them on top of, or in front of some landmark where  you can't see the whole line of people waiting to get the same photo, that sort of thing.  It photos were a, they were very personal in the past and all that's changed.  Yeah.  Well, and I think you said 15 years and we probably need to back that up another 10 before  that.  Well, I'm thinking before social media, although, okay, yeah, before social media.  This book came around in 2004, I believe, for the general public.  So that's when people started posting photos online like that.  Some of the people may have posted photos on a website, but it wasn't a common thing  and maybe a professional photographer had a portfolio.  But people didn't share photos the way they did once Facebook and Instagram came around.  So let's say 20 years.  Yeah, okay.  That sounds more likely.  I mean, I'm thinking of Flickr as being one of the very first, you know, photo sharing  sites, but mostly that too was photographers who were sharing things. So I went out and took photos  and I'm going to put them up here rather than what we see now, which is, look, here are just  everyday things that I saw. This is the cup of coffee that I had. This is the place that I've been,  like that kind of thing. So Flickr was created in 2004 as well.  So that's really an inflection point that year.  Yeah.  And by the way, I actually did share a photo of a coffee that I had this week.  So I'm not going to try to make a sound like I'm above all of this.  In fact, I mean, actually the opposite because what this article inspired me to think  about was just that idea of taking pictures for the sake of taking pictures because I  still look at Instagram and I think that's because there are some people that I follow there,  some accounts that I appreciate, but it's so much more work now and it doesn't feel like it's not fun.  There's so much that is ads, there's so much that is engagement bait, which is also like one of the  reason why I really like glass. Like I still pay for glass and we've talked to the people  from glass a few times on this podcast because that is very much more photographers who are  sharing their work. That also never is different. But if never the less glass is a fire hose,  right? You look at your feet, it's picture after picture after picture after picture.  And while they're nicer pictures and there's no algorithm, you only see people you follow. I mean,  I mean, you can look at a more general feed  to define new photographers to follow.  It's still a fire hose that prevents you  from taking time to look at a picture.  Oh, hang on a second.  I don't think it prevents you from taking time  to look at a picture.  It just gives you a better selection of pictures.  But you still want to look at the next one.  You can stop, but you want to look at the next one  because we've been trained to do that.  Look, I can stop anytime.  This social media does not control me.  Hang on a second.  I got to go check my feed.  Yeah.  Because I'm looking at my feed now, and I'm  going to show you it's got three photos.  That are all a, look like a 4.3 and a 3.2 aspect ratio.  So it's your three photos on my iPhone 16 Pro Max.  So it's on a large display.  And when I'm looking at one, I see two others.  So I can tap one to isolate it.  But the feed itself is still, okay, here's a nice photo, but look at the one below it.  That sort of thing.  In fact, if you're listening Tom and Stefan, maybe the feed should be an option  for the feed is just like a single photo.  But like when you're looking at TikTok, you see one video and you swipe and it's  which is to another one.  Maybe the glass feed could have an option to just have one photo and you swipe  to see the next one instead of this sort of endless scrolling fire hose feed.  I love that idea.  What's interesting is I never thought of that because we're so used to having the scroll,  the endless role for so many different things.  So this brings up another thing and I don't like using the H word, right?  There are certain words.  No hobby.  I don't like using the word hobby.  Photography is a hobby because to me hobby has these negative connotations of women doing needle  point, men making replicas of the Notre Dame cathedral out of matchsticks, you know,  that kind of thing, or something past time to pass your time that you're doing just to  fill your time.  And that's not what it is.  This is a passion project to take photographs and to work with them and to edit them, etc.  So I don't like the H word for anything like that.  People discover this because I think that's the way I think that's the way I think  Think what's important is this is a way of expressing creativity.  When you first get a camera, I mean, okay, forget about smartphones where everyone has  a camera, but back in the day when you got a camera, you had to figure out how to use it,  right?  You knew when you took a bad picture.  When you pointed at something and you got the picture back and it was dumb and you slowly  learned how to make pictures that were more interesting.  And that's part of the creative process of that, of learning how to make interesting pictures,  which can be quicker with a smartphone because you can take as many pictures as you  want, you don't have to pay for development, etc.  The creative process unlocks something in our brains that is pleasing.  It's a different kind of dopamine.  It's not the dopamine you get from scrolling.  It's a dopamine of satisfaction that you've done something that is nice.  The question is does everyone need to see it?  Because what you'll find is that most people who see it don't think it's very nice.  Then you're going to think you're a crap photographer.  Whereas if you just take your pictures and look at them and think, I like this picture.  Yeah.  I actually want to get back to the dopamine a little bit later because I think that's  a really interesting point.  Maybe now because I just brought it up.  Just in that sense of the other thing that happens, and again, I'm guilty of this too,  is you go out, you take a picture of something, maybe you caught a nice sunset.  This could be on a phone, on a regular camera, whatever.  And you post that to social media.  And you get people who are friends and family, or maybe others,  who think, wow, that is a really great shot.  And I know deep inside, it is not a great shot.  It is a perfectly okay shot.  But it may have the elements that captured,  you know, like the reflection of a sunset in the bay or some of those things that like  really good color saturation perhaps that tug at our brains and our eyes and say, Oh,  well, that's different than just some other snapshot. And so you do, like you feel that  dopamine of, Oh, you know what? Maybe this is a better picture than I thought it was because  these 10 people think it's great. And those 10 people may think it's great because they  like you. Right. And they think that they're not just in the photo picture or they are  happy that you were there for that experience. Right?  Were there being nice to you because they were meant to you last week?  All of my enemies are deciding to be nice for one week.  But this is, but I'll go ahead.  You know, before our last episode, we were talking about some photos that I took and you asked  me to send you one after I've edited it.  And I'm going to send it to you now because I forgot to send it to you.  And I was saying at the time, and I showed you the uncropped edited photo, I was saying  at the time, it's not a really interesting photo, but it's something I like about it.  Right?  And so we'll put this in the show notes and maybe with some others, I don't know if you've  gone through your photos to find a couple like this.  It's a picture I took in the evening in front of my house.  There's a wheat field across from my house.  Some of the wheat seeds blow over onto my front lawn.  Here, this is wheat that was fully grown mixed in with the grass.  You can't see that there's a drought in the grass is all brown.  It's golden hour and the light is on the wheat.  The detail, when you look at it at large, because this was with my like a Q360 megapixels,  detail of the little, I don't know what you call the little whiskers on the wheat is really  fascinating. I would not say it's a good photo, but for me, looking at this photo now,  this reminds me of the experience I had when I saw this and I went inside to get my camera  to capture it. If you remember in the previous episode we were talking about I went outside  and there was some water dripping off a rose bush and I went to get my camera. This was a similar  thing, not raining this day. It's like, ooh, okay, I want to capture this. And whether  anyone else thinks it's nice.  It doesn't matter because for me,  it's reminding me of that subtle feeling  I had looking at it saying,  this is a moment of beauty.  Well, and this is a moment of beauty.  And I know exactly what you mean.  There's that, it feels like a little tickle  in the back of my head that sort of activates  a different way of looking at something.  It's like, oh, we're in photography mode now.  I think I've used that in the past.  And it's kind of a dumb term,  but it's that aspect of something that I'm looking at,  I'm looking at in a new way, and I want to capture it.  And that, I think, is an even better dopamine response,  if it is even dopamine, but it's more satisfactory response  to making something like you're creating something you're not just looking at something or having someone  say, hey, this is a good picture because you experienced that. And I think that's one of the reasons  why I like doing landscape photography and I don't feel like I do enough of it. But so much of  landscape photography is you are getting out and doing it. Like, yes, you can come back with a lot  of great pictures or maybe you get skunked and the weather's bad and you don't get any good  pictures or you're forced to look for something else because the sky went crappy and there's just  no good light but maybe there's some really good macro opportunities nearby. That sort of thing.  But you're out there. You're experiencing it. You're problem solving in real time, which I think  A lot of people don't really give enough credit for in photography that so much of photography  is problem solving. Not only figuring out what exposure I should be at, which aperture I'm using,  how much depth of field should I expose, like all of that kind of stuff, but it's also  where can I make a composition that's interesting? Everything in front of me looks really boring,  but something here has caught my eye and I don't know what it is. And so you're exploring.  It's like all of that kind of exploration, visualization, looking at light and shadow,  like all those things kind of bombard you in a great way, which is the process.  It is the process. And the process puts you into a flow state, which  shuts everything else out around you as long as you're doing it.  Yes. And there's there's not a process of looking through Instagram other than,  I really should stop this and get up and go make a cup of coffee or something like that.  One more. I'm going to scroll one more. No, one, two more, three more.  Yeah. You know, it's 15 minutes later and you've forgotten.  I used to do that. Here we go. Mark my age.  I used to do that watching MTV. Do you remember MTV?  Music television? Yeah. I remember when MTV first started.  Yes. Same here. Same here.  I know I got old.  I am at all.  I am at all.  Three years old?  I wasn't three years old, but thank you for thinking that I'm a young young boy.  I would watch MTV in high school and because dear listener, I was a big nerd.  I know that's going to come as a big shock.  But on the weekends, I would be up late and basically I would watch MTV and think to  myself, all right.  The next video, if that's good, I'll watch it.  And then if I get to a bad video or a boring video, then I'll go to bed.  Sometimes it's 2.30 in the morning and your question and your life choices.  But having that process, getting back to photography, having that active participation of  photography, I think some people just sort of skim over that because they think I need  to just point my camera and capture something, which smartphones are really good at doing.  There's a whole lot of process that gets handled for you with a smartphone.  Trillions of operations per second.  You know what?  I'm looking forward to September because I think we're going to see the best cameras  that have ever been in an iPhone.  It's going to be the best iPhone ever.  It's going to be the best iPhone ever.  being able to work through it is really kind of a, this can sound cheesy, but it's kind of a gift  because you are forced to think in photography. And as much as photography is going and looking at  images, looking at like all the photography books that you have. Like that is also kind of a process,  But on the front side of that is, how am I going to make something?  I'm not just capturing something.  I am making something.  Even if it's something that you're capturing really quickly, like there was prep involved.  There was thinking, there were settings, there was all of that.  And I don't want to sound defeatous, but it just seems like that gets lost so often  because there's such a flood of images that we get exposed to.  I think also since we can take so many photos, we expect a percentage of them to be good  or great photos.  And when you had a roll of 36, if you had one or two that were good, you were happy,  right?  If you were photographing, I'm not talking about snapshots or family photos.  I'm talking about photographing, you know, in air quotes art photography.  You can just keep shooting on your phone until you run out of storage space.  And the number of keepers, as some people like to say, is you've got many more opportunities  to catch something that's interesting.  Like you could take 50 photos of the same thing from slightly different angles without worrying  about burning through roads of film.  And this gives you more opportunities.  However, having too much choice is also a problem.  And using choice as a crutch, using 50 photos as a crutch instead of taking the time to  compose one or two or three is also a problem. It means you're trying to go through the process  too quickly instead of, you know, doing the whole thing as you should from, you know, all the  things you're talking about the problem solving. And I think that's a really good term.  Process product and problem solving should be the title of the episode because I think that  the problem solving is probably the key to all of this and the key to any creative activity.  I'd like to compare this to cooking.  I know you'd like to cook.  I'd like to cook a lot too.  I bought a blender last week.  I haven't had a blender in decades.  And this morning I made some gazpacho,  pretty simple recipe, tomatoes, cucumber, onion, garlic,  a little bit of vinegar, and a little bit of olive oil.  It wasn't great.  Too much onion.  But the process of making it, for me cooking,  I don't mind when I fail when I cook  because it's a learning experience.  I don't know if I'll make a spatula again.  Last year, in order to prove I could,  I made both ketchup and mustard at home,  and neither of them were worth the many hours  it took to make them prepared to what you buy  in a supermarket.  But the process of making the gazpacho  is interesting enough that, okay,  the product is a gazpacho, which I ate for lunch,  which wasn't great,  and I'll maybe eat some tomorrow for lunch,  and it won't be great, and that's it.  But it's the process, it's more interesting than the results.  Over the weekend I made a quiche.  It was not my best quiche, but it was pretty good when I make a quiche.  It's generally quite good.  And then it's gone, right?  So any kind of thing that you make like that, it's the process that's important.  It's not eating the quiche that's important.  Well, that's also another example of a flow state too, because when you're cooking, I'll  typically have some music on or I'll be listening to a podcast.  There's other stuff going on, but it's mostly focused on ingredients and preparation and  following the recipe.  So that is also a focused flow state because I'm not thinking about work.  I'm not thinking about all the 100 other things that could distract my mind.  And so even though sometimes we'll be cooking something that might be either super easy or  more complicated with lots of ingredients, it's that process of just unplugging in a way to  be able to do something in a focused way.  So cooking, photography, art, that kind of thing.  And from my Gaspacho, it involves singing along to China Ketsan Flower and I know you  Ryder.  See?  There you go.  From the 51570 Grateful Dead show at the Fillmore East.  But see, that's part of the mood, isn't it?  The mood of music.  When I was into a podcast or an audio book when I'm cooking, it's too serious and I can't  be playful in the cooking, right?  I got to pay attention.  But when I'm listening to like a Grateful Dead concert or some other music, it opens up more  opportunities, I would say.  Yeah.  Another thing that I want to touch on while we're talking about this, because actually  what I thought of first when you sent me that article was not so much the social media aspect of it,  but that what are you shooting aspect of it? When you're shooting things for yourself. And I think  some of that is because I do a mix of photography for myself. I do a mix of photography, like I do  some paid photography, and it's been interesting. And you also do photography for articles.  And I do photography for articles too.  So there are different disciplines of the photography that I do.  And part of me taking this full-time job at CNET where I'm mostly writing, my photography  has really been scaled way back in terms of just me going out and taking pictures.  And I can feel that.  I mean before I was much more focused on photography because we have this podcast.  I would write about photography for DP review and things like that.  And so now that I'm not really putting myself in that space,  I'm realizing that I need to put myself in that space if that makes sense.  So it wasn't something that I was just doing all the time and thinking about all the time.  Now I need to be more deliberate about going out and making photos.  And that has been an interesting change because I'm back to asking, well, what do I want  to go take pictures of?  Not I need a sunset and I need to close up picture and I need to test whether this camera  has a good dynamic range, like all that.  Like, what do I want to go take pictures of?  And honestly, I've been kind of stumped on that.  So our West episode was about macro photography as an idea for things you can take pictures  of.  Just when you're in your house, you see something interesting.  You get your camera and say, how can I make an interesting photo of this tiny little  thing without all of the context around it?  Yeah.  And that's great as a really close buy thing.  But it also makes me wonder, well, okay, as an example, I've been down downtown Seattle  a couple of times for various reasons.  And so Pike Place Market is super touristy area, but it can be really great for street  photography and that sort of thing.  And there have been a few times when I've been down there or somewhere similar, there's  a Sunday market in my neighborhood of Ballard that's great.  And I've taken my camera thinking, well this would be a good opportunity to see people  and fruit stands and all the textures that you get from something like that.  And I just haven't really taken any pictures and just trying to figure out what do I want  to take photos of.  And I think it's kind of stumping me.  It's not that I have things that are not available to me.  It's what do I want to take picture?  You need the subjects to come out and grab you that when you see something, it says this  needs to be captured.  And that's the wheat in that photo.  Yeah.  That's the kind of thing I just walked out.  I saw this, I said this needs to be captured.  That's the kind of thing.  You need to be receptive to that.  And it's true that for you, it's hard  when you're doing all these photos for your work  in one way or another, it's hard to,  there's a term in Zen called Beginner's Mind  that the ideas that you should have  beginner's mind all the time,  where in the Beginner's Mind,  there are many possibilities in the expert's mind.  There are few.  You need to be beginner's mind thinking of all the things around you.  Everything around me is photographable.  It's just to decide as I like to say where you put the four corners of the frame.  So you need to get your brain into that photo receptive mode to start looking at things  and think like that.  You need to have moments when you go out and saying, I'm in photo mode.  And I'm not going to decide what I want to photograph.  I'm gonna just photograph whatever I come across  that looks photographable.  That is an excellent distinction.  It's not just that I went out with a camera.  I brought a camera as a just in case,  but I never got into that mental mode of,  okay, I'm gonna look for some photos.  I was more focused on, hey, you know,  it's a nice day and if I see something,  I will take a picture of it.  Right.  because I wasn't really thinking in a photographic way.  I never really took any pictures.  That's a really good point.  Yeah.  Hey, you're smart.  You know this stuff.  I think it's more that I've reflected on this  from not just the technical point of view,  from the artistic point of view  that I will get photography as both a craft and an art.  And that allows me to think of things differently  Instead of thinking, oh, I have to get the depth of field of this just right and I have to  expose for the highlights and make sure the histogram looks good and all that. I don't really think like that.  I'm not entirely F8 and B there. I generally keep my Wicca at F5.6. I don't care about the  blurry background stuff because I think that's a bit of a gimmick. And I like to just walk around  and think, wait till something is there and just reaches out to me and says, photograph me.  That sort of thing. Yeah. Yeah. And being open for that. Right. Which is huge. Yeah.  Do we want to do snapshots this week? We could. I have a possible snapshot for  somebody that arrived today that I haven't used. Well, how about I start talking about a  movie that I watched I talked to you before we started recording. A 2024 film of the Count of  Monte Cristo. It's a French film and it's about three hours long and it's the most popular  French film for many years. I was going to Jeff and France, they don't count box office revenue,  like the US does. They count the number of people who go to see a film in the theaters.  And this had over nine million people going to see it. And in a period when people don't go to  movie theaters as often for a three hour film based on a, you know, 19th century novel, which,  I mean, there have been a hundred versions of it on film and TV. So people more OS know the theme.  but that's quite a feat and it's the same directors did a two-part movie of the  three musketeers the year before and apparently they're planning to do more along  that wine. It's a 1500 page novel so they obviously had to cut a lot out and  they created some characters and they removed a bunch of others. It's one of  my favorite novels but it's a really enjoyable movie. It's a superhero movie  without superheroes, right? Interestingly, if you look at the genesis of the superhero, if you  think of Batman as the superhero, not Superman, not the alien, but Batman, Batman was greatly  influenced by the shadow. Do you remember the shadow? Who knows what evil works in the hearts  of men? The shadow does mwahaha. Well, Mont Cranston, he had learned these secret art into  that and stuff like that. Well, the shadows influenced by the count of Monte Cristo, who after  being thrown in prison escaping, he becomes this guy with all these powers, not actual powers,  but skills. And you see him as he's getting revenge on a bunch of people and it's an enjoyable  three hours. So, count of Monte Cristo, you can get it probably on the iTunes store. Definitely  worth watching. Jeff, what did you just get today that you don't know if it's worth talking  about as a snapshot. Well, it is going to be worth talking about it because I have it in  my hand. And actually, it is kind of a camera thing, but in an odd way. I mean, hold it up  for you. That looks like a cable. It looks like a USB C kit. No, it looks like a microphone.  It looks like like a microphone. It looks like that thing that the doctor sticks down your throat  to see if you have an ulcer. Is that what it is? It's kind of like that. So this is a little  a little snake camera because...  ...because...  ...there is a bee.  ...and the bee is what they call it.  Endoscopy, this is an intelligent,  visual, industrial, endoscope.  Endoscope. Endoscope.  And basically, we had a scare or have a scar that there might be a pipe broken in my house  in a place that could be under the wood floors in the living room.  So not something that you can see easily or get too easily without tearing things apart.  And as part of troubleshooting, I thought, well, it would be great if I could just have  like one of those little sneaky cameras and just follow the pipe where the brake seems  to be and just see.  And then like in the past, I've thought about that and you have people who they put these  down sewers to check those kind of things out.  And of course, I went on Amazon and I was like, what would it cost for something like that?  Because I'm going to guess a question about 16 bucks.  $28.  So not too bad.  There may have been some $16 ones.  This one seemed like a good good.  Because it's basically fiber optics with the lens, right?  It's not like a fancy lens of any kind.  No, it's not fancy at any kind.  It has some LEDs at the end, so you get some light.  Right.  This one actually has a little tiny side camera in addition to a front camera, so you can  sort of take a little more.  And this just plugs into your phone.  Some of them have a dedicated screen and a scope, and you can pay more for that.  And of course, the professional ones will be three hundred times.  But the ones that Dr. Lewis.  Five few.  Yeah.  But I figured like for 28 bucks,  even if it's only semi working,  even if it only works partially well,  it's gonna be enough to tell me  whether or not there's water dripping from a pipe.  So I'm not knowing that could cost you a lot more.  It could cost a lot more.  So before I start trying to figure out,  okay, do I need to get an expert  who can take up the wood flooring  without just taking a chainsaw to it,  which is what a plumber would probably do  and calling a plumber and dealing with maybe,  house insurance, household insurance  and all of that kind of stuff.  Maybe I just spent $28 and take a look for myself.  So you just got this and you haven't used it yet.  Exactly.  So next episode, you'll have to take some screenshots  and tell us what the results were.  Yeah, possibly.  So far, the spot has not produced any more water  And so I have a feeling that this is a false alarm  and something got spilled and we didn't realize it.  But we'll see.  I would rather do this and find out  than wait to see if the wood floor buckles, right?  Yep.  Okay.  I like that idea.  Until next time.  Thank you.  Take care.  Until next time.  Thanks for photos.  Oh, okay.  Thanks for listening to Photoactive.  You can find show notes including any photos  We discuss in this episode at photoactive.co.  That's photoactive.co.  We couldn't afford the M.  You can join our Facebook group at Facebook.com slash groups slash photoactive cast.  That's photoactive cast in one word.  You can subscribe to photoactive in your favorite podcast app or on Apple podcast.  See the links on our website and think about leaving us a rating or review an iTunes  or in your podcast.",
  "created_at": 1755585343
}