{
  "podcast": "Talking Lead Podcast",
  "episode_id": 41353302763,
  "episode_title": "TLP 580: Kyle Mills Unraveled: Fade In, Foresight, and Global Flashpoints",
  "audio_url": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/secure/talkinglead/Fade_In.mp3?dest-id=122949",
  "duration_seconds": 8013.505,
  "model": {
    "name": "tiny.en",
    "device": "cpu",
    "compute_type": "int8"
  },
  "text": " Sue on as a proud sponsor for talking led podcast and the lead head for gate use the code lead head for 25% off this one  Lead heads. We are back with another episode of the talking lead podcast. I'm your host lefty  Where we have been  LEDUCATING the unlegicated since 2012  13 years of bringing you guys good wholesome fun  education or entertainment  Whatever you call it, excitement baby.  And today is no different.  We have a returning guest.  His last appearance been, I guess over five years ago.  But we are glad to have him back.  Ladies and gentlemen, give a good warm lead head welcome to Kyle Mills.  Kyle, welcome in.  Now thanks for having me.  Yes sir, yes sir.  We're glad to have you back.  Last time we had you on, we reviewed your book.  Was it, it was Vince Flynn.  You were doing the Vince Flynn novels then.  I can't remember which one it was.  Yeah, I can either.  Well, you were kind of the middle of my 10 year doing  the Mitch Rapp books.  Yeah. Yeah. So I think that was like episode 347.  If you guys want to go back, check that out.  Listen to that.  But Mitch is number one New York Times best selling author and he's got dozens and dozens of books under his belt and  He had one almost 20 years ago. I guess it's been you had this this character called fade and you have resurrected fade and  in your new book  Fade in is this the second in that series?  Nah, not really the new fade in which just published is really the first in the series  The other book like you said, I wrote 20 years ago if you went back and read it  It would feel like kind of a prequel from a younger days  Yeah, yeah, so I guess I mean I guess you kind of had to do that when you brought him back is it's kind of make that more of a  like a flashback to his younger years, I guess.  Yeah, you know, 20 years is a long time.  And it's a long time.  It's a long time.  And nowadays, you know, where everything changes,  it's funny, that's the first book of mine I've ever read.  Like I've never gone back and read one of my books,  but it's funny to read because, you know,  the internet was sort of fledgling  and people were buying stuff from the sharper image.  There was no amount of money on or anything.  So it's funny how quickly books become historical fiction.  Yeah.  And we're going to talk about his new book.  But before we do that, I mean, last time that we had you on, and we  were kind of in the midst of the the COVID pandemic.  If you, if you want to call it that, but there was a lot going on with  you, you were kind of in between Wyoming and Spain at the time and you were kind of, you know,  iffy on whether you'd be able to get back to Spain and we were talking a little bit  prior to the show and it looks like you got things worked out and you might be headed back, huh?  Yeah, well that was touch and go. I remember my residency was running out in like one week  which couldn't fly to Spain, and they opened it up for residents.  So we moved all of a sudden, drove down there  in a rental car, put all our stuff in storage,  rented our house and Wyoming out, and we had to get  COVID tests in the parking lot of some building,  or near the airport, and if we had tested positive,  we couldn't have gotten on the plane and we had nowhere to live.  We basically got a rental car and a couple of duffled bags.  Fortunately, we both tested negative and managed  to get on that flight, which was, but it was weird.  It was like, you'd go to the bar salon airport  and it was empty.  Like nothing was open.  It was just like, it was just us.  Like you had the whole city to yourself.  Yeah.  And Spain had been locked down.  They'd quarantine themselves and all this stuff.  So it was, it was a,  It was a crazy time, particularly in Spain.  Yeah.  And bringing that up because we're going to get into that  in your new book.  But we'll hit on that in a minute.  As far as that pandemic goes that we all live through  and most everybody survived, looking back  hindsight on that and reflecting, as your opinion  changed on that. Did you learn anything new? What did you get from where we are?  From where we were then to where we are now on that?  Yeah, I would say probably the most interesting thing about it was that I really thought  that the world would have systems in place after SARS and everything that would have systems  in place that were pretty solid for doing that, for mitigating the problems,  communicating with society.  And that was, I was, I think overly optimistic  on that.  I felt, it felt a little haphazard  and other than Operation Warp Speed,  which seemed to chug along pretty well,  it just seemed a little chaotic.  More so than I would have thought with CDC and WHO,  you know, ostensibly doing this every day.  Right? Yeah. And that seems to be like a big mystery to everybody.  It's like, this isn't our first rodeo.  And in comparison, it wasn't as bad of an epidemic as we've had in the past times.  And like you said, the communication between the inter-agencies,  And then also just governmental, you know,  back and forth and politicizing it  and using it as a weapon to, you know,  to come over to our side  because this is how we do things and how we see it.  And then also countries,  because the whole world was going through this.  And just the lack of communication,  it seemed like even through the different countries,  you know, because everybody wanted to do things  their own way.  Yeah, and some countries got hit much harder  than others, Spain was hit really hard, really early in it.  And I mean, they're, they actually have a huge medical capacity.  They're more beds per capita than the United States even.  And, but they also have a very old population.  So they were just getting hammered.  Their hospitals were filling up.  People were dying left and right.  And ended up quarantining,  We were like having a pretty harsh quarantine.  Fortunately, I was not there for that.  So it was, yeah, the reactions were different  all over the world.  It's Scandinavia reacted in a very different way.  The United States went state by state really.  I mean, I'm from Wyoming.  So we got off the ELSI.  There's no people here.  So yeah, I mean, we were all pretty spread out.  You can kind of do whatever you wanted.  So it was an interesting time to see it.  to see it and I, you know, my fear now is that we didn't learn anything.  Um, and do we ever?  Yeah.  I mean, this is a little bit what Fade in is about.  It talks about how the governments are getting crazier and more incompetent.  And so they're good at like screaming about partisan stuff and, and, and trying to get  reelected.  They're very good at getting reelected.  But if something major happens and it's really is a real crisis and lives are at  stake, they get a little wandering at that point. All they know about is how to use it to try to get,  you know, re-elected or to get people around.  Exactly.  To keep the power.  Yeah, exactly. And so, you know, things when things got me, I think about even Texas, yeah,  I followed their power shortage. And there were power outage a few years ago because I had  written a book very similar to that called Total Power in the Metrap series. And as  That's the one we talked about.  That's the...  Oh, is it?  Okay.  And so about a terrorist group attacking America's power grid.  And I remember watching Texas, you know,  they're trying to blame the windmills and then doing this.  And now it's, and you know, saying windmills don't work  when it's cold, which is pretty funny if you're from Wyoming  because the Texans don't even understand what cold is.  Their cold snap was like our nice spring day.  And it all just gave, then nothing happened.  They like, they didn't do anything about it,  so it's just good happen again.  So it's an interesting time to be alive  because there are a lot of crazy crises.  I mean, not only war with Hamas or with Russia,  but also power grid failures.  You've got storms, it burns in the west where I am  and floods in the east.  And no, it really does anything about it.  think for us as the like the US military would have the capacity to spot wildfires and put them out.  We have a thing called satellites. Yeah,  planes. I mean, don't have spy planes. We're not doing much with those. Fly around. I mean, the drones  the drone take down water these days.  But that's how to do it. Does that get you reelected? Maybe not. Maybe that's the calculation.  like, I, fire, you know, doesn't get neither getting near either here nor there to me getting  reelected. So not going to worry about it. I have to present this, you know, this, this, this  need, you need me. You can't survive without me. So, you know, if they solve all the problems,  then they're not going to be needed anymore. Exactly. And it may be just maybe you create more.  I don't know. I think of Russia attacking Ukraine. Well, it's just create some problems and  that I can take over and solve them.  There are conspiracy theories about that.  I wrote a book about that too,  a few years ago, Russian,  dating its neighbors, which book was that?  Red War.  Fortunately, I got it out there before they actually did it.  Maybe you gave them the idea.  Maybe it's fault, Kyle.  Maybe I did it, it might be my fault.  I've given a lot of people a lot of ideas apparently ever.  Well, we kind of question that on the last interview.  It seems like, and I say you guys, you thriller, especially, you know, the military, governmental,  political thrillers.  You guys seem to have an insight because, like you said, my book was out before that happened  and then it happened.  same thing with the pandemic. There were several people that were talking about this virus thing and  doing books about it. And then, you know, it seems like all of a sudden boom that that happened.  War with, like you said, Russia or Ukraine. This is uncanny. It's like you guys have a little crystal  ball that you can look into. I mean, that's what you're always thinking about, right? And what's  the next threat and how could it happen and all these things.  But truth is now the world's getting so crazy.  I mean, like for instance, Redmore, I wrote about Russia attacking its neighbors.  But when I researched it, so I do deep dives into this stuff, which is what's fun about  it for me.  I could not put together any reason, any rational reason that Russia would attack its neighbors.  The truth is based on my research, the Russian military has always been wildly overrated.  Their economy is not particularly strong, etc., etc.  And they're the largest country in the world by land mass,  the, and a fairly small population.  The one thing they don't need is more land.  And so I gave the guy a brain tumor.  Like, that was the really, the only way I could think I could come up with.  That really, he was weak and the leader was weak.  And it was really more worried about the people around him taking him out to, to take over.  And so this was more of a distraction.  And then Putin goes out and does it and it has played out exactly the way I envisioned  that it was just a disaster for them.  It's a disaster for Ukraine.  They gain nothing.  They've losing people hand over fist.  They have a plummeting population.  And now they're killing all their young men.  So you can't predict anymore how nuts people are going to be.  Yeah, then we've got the Israel-Iran Hamas debacle going on as well.  Yeah, they're even crazier.  Hamas attacking Israel is like me going into a barn slapping Mike Tyson.  Like, you knew exactly how that was going to end.  Right.  Yeah, they did it anyway. I mean supposedly and again, there's conspiracy theories going on  You know with that as well. There's always conspiracy and I like  That's what I do for a living. That's right  You make these these awesome books  Hey there lead head to your old pal left you the special offer just for you lead heads our friends and gold's Jim Tennessee  are bringing the heat.  Sign up at any gym for just $1 enrollment and get a free personal training session to kick  start your gains.  You're not just working out and tapping into a lead equipment, group classes to push your  limits, and recovery perks like saunas and those world famous hydro massage beds.  This is fitness for strength and readiness, lead head style.  16 locations across Tennessee from Knoxville to Memphis, Chattanooga to Nashville.  Get up, goalsjim.com or call 615-956-6016 extension 2 to find your closest goals.  Slings iron, lift heavy, and get the gun show ready for summer lead heads at Goals Gym  Tennessee.  615-956-6016 extension 2, tell them lefty senior.  Now I wasn't familiar with the first one.  It's just called fade, wasn't it?  Right.  but just getting into this one and picking it up,  I felt like I didn't really miss anything.  I mean, I'm sure I did and I need to go back and read that.  But it was easy for me just to jump into this and pick up  after 20 years and move forward with this book.  And I really enjoyed it.  It was a good book.  I like the guy who does your readings.  Oh, yeah, well.  Yeah, he does a good job.  But it's kind of a pet peeve for me  when guys do female voices.  It just kind of takes me out of it.  It's like, I wish sometimes they do multiple readers.  I've never had a book done like that.  That's what I'm, they're kind of interesting.  Yeah.  Yeah. And that's, I think it was you and I that tell you,  is there you and me or Jack that talked about that?  It's like, why don't they get like a sign rolls to people?  is like, they have it.  And I'm sure it's all about the money.  It's more expensive.  Twice as expensive, probably.  Yeah, probably.  Or it's probably much harder.  I think we do have to sit in the same room.  A lot of these guys sit in their closet.  You know, surrounded by their clothes.  So it sounds good.  Today's the crayon.  That's incredible.  They're going to go in their closet.  Now you got two people in your closet.  That seems a little weird.  You know?  Well, they have studios for these things.  A lot of them do now.  But I remember, you know, they just sat in their little tiny room with its all sound, you  know, optimized and all that.  Really, really quiet.  Yeah.  Um, but other than that, you know, and that, that's not just your, that's any book that  I listened to or not.  I'm not even able to.  Yeah.  When the, the guy goes into the female voices, but he did good on a couple of them.  I mean, actually, I could, I could throw a lot at that poor guy.  Yeah, he was laughing at him about it because he's got everything for all different accents,  a lot of female characters.  He's got cartoon characters.  He had to do like Marvin the Martian and Yosemite saying, yeah, I was like, I'm going to  make your earn your money.  And that's a part of the book that I wanted to talk to you about.  So when we get to that, I want to remind me about that because it was good.  I liked the way that you did that.  But I want to catch up with you, because like I said,  it's been over five years since we talked last.  And the pandemic and all this stuff.  And you had to go back and forth from here to Spain.  And you had a lot going on in your life.  Yeah.  And you were doing the, you took out, well,  you didn't take over, but you, the Vince Flynn books,  that was kind of your main gig.  And then, again, I don't know, for whatever reason,  Don Bentley is doing those now.  And we had Don on, was it last year?  He's been about a year when we had probably  was because his next book doesn't come out  until the end of September.  OK.  It was last year's first one.  Yeah.  OK.  Yeah.  And then that was kind of a mix up,  because you said you're going to send me your book.  and this one came and I was like,  I think they got, you guys mixed up  and sent me the wrong book.  Because, oh right, right, right, right.  Yeah.  I didn't even know I was getting this book,  but I guess Dan figured I needed to have that my arsenal.  Yeah, absolutely.  But I know you and Don are good buddies,  you're good friends.  Yeah, yeah.  Guys have done some shows together  and interviews and things like that.  How does that work with you guys when like you were doing that you did?  How did you do like nine nine? Okay  Did nine of those how does that handoff work?  When you know you've you've been doing it for so long and then they bring in a new guy do you guys?  Do you kind of like do a debrief or?  You know anything like that or how's that? Yeah, I mean to some extent for sure  I mean I know Don for a long time already. I was really excited that they  I chose him after I left.  That was a perfect guy to do it.  Yeah, I mean, we talked a little bit about  where he was gonna go with the book.  And I tried to leave it.  I kind of consciously left the last book,  feeling very much like the end of my arc.  You know, I'd kind of taken Mitch  when he was very angry and frustrated and alone.  And I took him through nine books at the end.  You know, he dealt with a lot of stuff.  He had essentially a partner and kind of a daughter.  It was in a better place.  And I left there.  I killed off a couple of complicated characters.  And I felt like, okay, now Don, I've left you  in a really good place.  You can go anywhere you want with this book  or with the next arc in the series.  So, and then, you know, everyone's  and while we talk about little details,  like, you know, how old is some character or something?  those calculations are really hard to make and I made them when I took over. Because I read through  the whole series again and like took meticulous notes and made all these calculations and stuff.  And then obviously expanded the universe significantly over another nine books.  So every once in a while we'll chitchat about details if he can't remember what I had done in some book  or whatever. Right. Now the fade is an original character to you. Yes. Yeah. So, so lead  hands in my previous episode, I was letting them know that you were coming on. I had misspoke  and thought it was one of Vince Flynn's characters that you were expounding on. And I was wrong  about that, and I'm sorry. I just want to clear that up with our listeners, make sure they understand.  But with, again, when you're handing stuff off and is there like notice, how much notice  do you get?  It's like, okay, you know, you got two more books and then we're going to hand it off  or do you even get that kind of courtesy?  Oh, I left.  So yeah, it wasn't, I gave them a bunch of notice.  Yeah.  So however, yeah, that worked.  Yeah.  I gave probably a year and a half or so.  I think probably when I started my last book,  which was the last book on that contract,  I called them and told them that it would be my last book.  So that gave them more than a year to find somebody  because it's not that easy.  People have, they have contractual obligations.  And then they asked me who I thought  might be a good choice to replace me.  And hilariously, I did not choose Don, but I didn't even mention Don because he had just  gotten to number two on the New York Times bestseller list with a Clancy book.  So I didn't think he'd be interested.  And then shortly thereafter, he and I had dinner.  We're having dinner together and he asked me if I was going to continue the mid-trap  series, but it did not been announced that I wasn't.  So I told him I was and unbeknownst to me,  he had been asked to take it over.  And so he lied to him about that, he lied to me.  And then that he wrote you for Paul this agent.  And he's like, oh my God, they're firing Kyle  and they're not even telling him,  I don't want the job.  Like I'm not taking it.  And he's like his agent said,  well, let me call and see what's up.  And they said, no, Kyle laughed,  he can help us do not as long as he wants.  You're protecting each other's feelings.  Yeah, and then he, he, he, he, or he called me the next day and he's like,  I can't believe you lied to me all night.  He's like, well, you lied to me too.  Exactly.  It goes hand in hand.  Now, now knowing at this point, knowing this, is he like, is he like making any requests  from you?  He was like, hey, would you kill this guy off?  So I don't have to continue that.  No, no, no, I had been really careful about that.  like I told him, I'm gonna leave you in a primo spot  to, you know, I'm gonna finish up this arc,  I'm gonna tie everything up in a nice bow,  and then you can go, you know,  wherever you want with Metrap.  Yeah.  Yeah.  It's kind of an interesting dynamic, you know,  with when you get into the situation,  like Vince Flynn and, you know, him passing  and then bringing other people on to carry the torch.  And yeah, it's a little, you know,  little different than, you know,  somebody that just,  same person does it throughout their entire life,  you know, kind of deal.  Like Steve, you know, Stephen Hunter  with his character.  I think it's an interest.  It's definitely interesting.  I mean, obviously Vince is an amazing writer  and created this amazing series and character.  You know, on the other hand,  it's kind of interesting to see  different perspectives people have on the character in the series. I mean, I brought things that were,  I mean, I tried to stay very true to Vince's style, but I brought things like humor  to it that he had not done. I had moved it away a little bit from just doing Islamic terrorism  into doing other types of threats. And then Don, particularly if you read his first book,  He brings his military background to it, which I don't have.  So I don't write. My background is more having grown up around a lot of CIA, FBI type people.  So I'm not being like an espionage kind of.  Yeah, I'm more of a CIA intelligence. That's my kind of my knowledge and my comfort space,  Whereas Don has a lot of knowledge about the military.  So he can bring that to the book with authenticity that I don't think I could have.  Just to imagine if you guys teamed up.  It'd be fun.  Right?  I've never done it, but I've talked about it with authors before, but never pulled the trigger.  Yeah. It kind of reminds me of like the Star Trek like Trekkies and how they've, you know,  the fans themselves have kind of gone and written their own scripts and how, you know,  they like stories done and told them with AI nowadays, you know, they're actually going and filming,  you know, some of this stuff on their own. And, you know, and the studios are taking notice,  It's just like these guys are doing a better job  than what we were doing.  That's gonna be really interesting to see,  because I don't know, maybe when I retire,  I'll get into filmmaking,  because by then AI will be ready to do it,  and they've been a couple of weeks.  It ain't terribly fun with.  Yeah, I'd be fun to do a couple of my books,  right, I learned to write scripts  and learned to film this stuff.  And I think there's gonna be,  you know, there's a huge indie book, you know, market now,  which kind of rose up because of the invention of, you know, e-books and the Kindle.  And then now I foresee a huge indie movie industry rising up.  And just like the indie books, there's some amazing indie books out there now.  And that have not gotten a mainstream publisher for whatever reason.  I think they're gonna be amazing indie films as people particularly I think even much more so than books because  The bears to entry into a book are not that high. You know by a typewriter get some paper, right?  but the  bears to entry to filming a movie have always been  You know insurmountably high so  So now you lower that barrier, they're going to be all kinds of people with insane talent.  Yeah, now you need to.  So that never wanted to go to Hollywood or like get into that quagmire, but have the incredible  talent to actually produce amazing stuff.  Yeah.  And the reason I brought that up is, you know, I Pete, you get into, you know, that territory  of, you know, these fans are just doing, you know, they think they're doing an homage  to their heroes, their favorite, whether it's Star Trek or whatever it may be.  But then the studios see that in a different way with their attorneys and they're like,  hey, you guys are still in our stuff and you're getting the whole other bottle of wax.  I was just with books, do you see that happen at all?  where, yeah, I wrote this little spinoff of fate or whoever it may be.  And they put it out there on the internet.  It sort of depends.  I mean, fan fiction, I think, has been pretty well tolerated to some extent.  But it also depends on the author.  I remember we were our little local library here in my tiny town and Wyoming was doing  like a Halloween thing for the kids that was a Harry Potter  themed and they got a cease and desist order  from JK Rowling's people.  This you live in Jacksonville?  Oh, she's British.  Oh, well, I mean, I don't know how they found out about it,  but they did, they're scouring the internet  for anything like that.  So I think that it will be a big thing.  But one of the things I'm just super interested in  is the idea that you'd have some really interesting directors out there who could, if I wanted to write a script of one of my books or one of, you know, my friends who's a novelist or whatever kind of novel.  Yeah.  You know, particularly like fantasy, which is huge, but very expensive to film that we would be able to connect with people like that and have a movie made for, what?  25 grand or something instead of you know, 10, you know, 10.5 million or she  hardly in. Well, they have like these crowd funding, you know, things now too,  where you know, it's like, hey, if you went out to your fan base and said, hey,  we're gonna make a movie, you know, on this book, you know, you would get, yeah,  get the fan support and they have like a little input and there's this, you  probably familiar with them. It's called Angel Studios. I can't remember exactly what I think  it's called Angel Studios. But that's kind of how that studio works is it's it's crowdfunded  and they take input from the people that are donating or you know, doing whatever and then they'll  make a movie on that.  This is our idea, you guys want to get behind it.  And then they'll put their names in the credits and everybody that helped donate and do  all that.  It's super fun.  I mean, it'd be really interesting because I mean, Jeff Curtis, studios put some serious  crap out.  I'm pretty sure I can do better than some of the stuff I've seen on Netflix.  Yeah.  So, Kirkham is an author and he's done like a post-apocalyptic kind of book series.  And Angel Studios took his book and they've done a couple of movies and then like a TV series  kind of thing.  You know, it's interesting how they're doing that.  Yeah, it'll be really cool.  There were eventually just like books that'll be so much content that the hard part  will be sifting through it. You know, separating the gems from all the garbage.  Because unfortunately, I feel like that's the way the internet is going to some extent.  Pretty soon it's just going to be BS, rage and porn. And that's like all that's going to be  all left on it. Yeah. Well, I got a little more faith. I need some optimists.  So let's get into the book.  And then, because I want to circle back to the movie aspect, but I want to cover the book  first.  So this is, again, like the second book in this series, maybe it's the first, but it's  the first book in the series, but there is a prequel.  You're like Star Wars.  You know, they did their prequel.  Or even the Bitz one series.  wrote a bunch of books and then he went back with American assassin and explored, you know,  his origin, mid traps origin story. Yeah. So this is about a Navy SEAL former Navy SEAL  who's gotten in with the CIA or, you know, other government agency. And he's got some issues,  I guess to save the least.  And that's where I wanted to get in, you know, when we get to that part about Daffy Duck and  all that. But kind of take us in and I don't want to give a lot of spoilers, but we will do some  spoilers on here because the book is out. It's been out for about a month now, and it a couple weeks.  A couple weeks. Yeah. Yeah, a couple of weeks. So we won't do a lot of spoilers, but we'll  Well, amp it up.  You know, get you guys interested.  It's Kyle Mills, fade in, and fade is the main character.  So tell us about the non-spoiler version of this.  Yeah.  So fade is, his real name is Sala Malphayed, and his parents were first generation immigrants  from Syria.  He was born in the US and New York.  And he became an ABCL and his teammates found, so I'm all if I had to be kind of a mouthful  so they nicknamed him Fade and it's stuck.  He then went to work for the CIA, but kind of got screwed over.  He got shot in the back and he was, the bullet was paralyzing him and they did not give  him really much medical support.  And so that's kind of where you found him in the first book.  They tried to, a hormone security,  tried to force him back into service,  to sort of use him up until he became paralyzed,  and he went on a bit of a rampage against them  with the idea that he would die at the end of it.  And so that then he brings it back here.  Or that brings it back to this book,  where he comes out of his coma  and he is put in a position where,  I mean, he's kind of lost.  He's wanted by the police.  He's woken up from this coma and he has offered basically rehabilitation by this billionaire  who then wants him to consider coming and work for him.  That's a pretty good synopsis.  And then the action ensues.  It does.  Yeah.  So this billionaire named John Lowe basically goes back to what we were talking about earlier.  He sees the governments of the world failing.  They're becoming increasingly autocratic.  They're becoming increasingly wrapped up simply  and maintaining their own power.  They have no interest in really solving problems,  maybe even interested in creating them  to maintain fear and chaos so they can stay in power.  And Lowe sees this as incredibly dangerous.  He sees his billionaire classes becoming hyper powerful.  You know, if you think about Elon Musk,  I wrote this book before Elon Musk out into politics,  but think about a guy who we can barely communicate  without his satellites.  We can't shoot stuff into space without his rockets.  You think about social media clean energy.  Yeah, they feed us everything we see by an algorithm.  They can show us or not show us anything they want.  They control everything that we see and think.  And so he sees this as becoming very dangerous  and is going to lead to societal collapse.  So he's trying to bring together some of these billionaires  and number of politicians into a group  that understands that if you have 250 billion making  another billion isn't that important,  but sort of slowing things down  and being more thoughtful about things  and controlling the rate of change  so that we don't collapse human society  might be in everybody's best interest.  But how do you do that?  And it's not easy.  And one of the problems is sometimes there's no substitute  in a situation like that for killing someone.  And that's Fades area of expertise.  So he also wants to create a small,  very, very talented high-end paramilitary capability.  And that's where Fade comes in.  Now this guy kinda reminds me of what people,  when they say Illuminati,  You know, the illuminati. It seems like low, you know, that's his group of people.  They are the illuminati. They control the truth.  Yeah, I mean, they have unbelievable amount of power.  You know, I mean, just, but this is real life. I mean, I'm not telling you anything,  if you get like Zuckerberg and Elon Musk and those guys all in a room,  that's a lot of the world's power right there.  And depending on how they want to utilize it,  it can have a lot of major effects on.  And even them, it seems like they've got puppet masters  and they're not the real behind the curtain people.  To me, it doesn't seem that way.  It seems like there's still somebody even deeper  than Elon or Zuckerberg or any of these guys.  It's dark or...  I mean, even the politics.  I mean, those guys have been more willing to take a knee  to the American president that I honestly thought they would be.  It seems like, you know, there's the old saying, fuck you money.  Yeah. I feel like by $250 billion,  I don't want to listen to anybody.  I wouldn't take anybody's calls.  Yeah. That's kind of just a little.  Oh, yeah.  But, so yeah.  And so I think we're seeing this.  And we're seeing it with AI now,  which is kind of crazy if you think about  when I started this book, writing it,  I wasn't really even a thing.  Now it's years ago.  Yeah, it was a couple of years ago.  And so their ability to target us, say on social media, has expanded like a thousand  fold just over the last few months.  Now instead of saying, I mean, they already know everything about us, right?  This is unprecedented.  Even when you think about the stasi in Eastern Europe.  I mean, they knew a lot about you, but it was a couple of guys hiding in your attic with  real to real tape and a pen and a piece of paper with headphones on, right?  Okay.  These guys are everything you think, everything you talk to all your friends, everything  where you've been, everything you've ever bought, all these things.  And now with AI, they can use that to profile you.  Not like they used to.  I mean, they used to profile me as, you know, white guy, almost 60 lives in Wyoming, right?  And I'm going to mark it to him or I'm going to try to convince him of something.  The sell them.  So I think no, everything.  They can just take me put it into a psychological, you know, algorithm and say,  how do I market to Kyle Mills?  Yeah.  And they can do that for everybody in the world.  So it's not selling anymore.  It's controlling.  It's controlling.  Absolutely.  It's that was maybe how it started off.  is like, hey, we can increase our revenue  because we can target this guy's likes.  But now we can control this guy  to do what we want also.  Here's what you're gonna think, right?  And we're gonna hide everything from you  that would make you think differently.  And they've tried this,  they've been psychological tests and it works.  So this is something that even during,  you know, they think about back in the day  when the royalty was all powerful.  I think 400 years ago were something,  they couldn't control what the average person saw and did.  I mean, heck, what could they do?  Stick something to a tree that they wrote on,  but you couldn't read, so it didn't really matter to you.  But it's eight hours a day, man, at least.  You're staring at that screen  and whatever they're feeding you.  Yeah, through this screen or it's this screen mainly,  and this is the, they record you, they track you.  like you said, they know everywhere you're going,  who you've been with, because they can triangulate  and know that that person's phones are here.  It's, yeah.  Yeah, exactly.  Everybody you associate with, everything you're,  people you're near.  And I mean, I'm already seeing this.  It's really interesting.  So when you put a book out, you get all this spam  from people, you know, their scams.  I think they're like, oh, sign up with us.  will publicize your book to our many, many subscribers.  And, but it was always like deer, and there'd be like Kyle Mills in a different font or whatever.  We will, you know, they're always like misspellings and shit. And so now it's in Christ.  So I know I'd get one of those a week. Now, one a day, but there a deer Kyle, oh my God, I just  finished fade in and sell out my faiet is such an amazing character. It goes on and you're background  with your father being the director of Interpol and CIA and all this stuff.  And it was just what our subscribers are looking for.  This was all written by an AI that scoured the description of the book and my  thing. So they are targeting me personally in this beautifully written way  to convince me to pay them to do nothing other than probably try to get into my  bank accounts and siphoned them all off the North Korea.  So, but that's going to be everything now.  just constant personalized appeals from scammers and politicians and everything.  And you're not going to be able to tell, even if you respond to it,  they will respond to you. You'll have no idea. Unless you sit down face to face with somebody,  you have no idea what you're dealing with or who you're dealing with.  So I just pulled up Grok and I typed in,  And if you were to interview Kyle, what would you ask him?  Be creative and original.  And then it goes through, and it gives me a list here.  Yeah.  These questions aim to surprise Mills,  engage the lead head brigade and uncover fresh perspectives  on fade in in writing process and personal influences.  It's kind of terrifying.  And I think also humans, this is something my character John Lowe is sort of wrestling with,  we are willing much more than you would think to see that power to politicians, to the wealthy  and to computers.  I mean, it's amazing.  Think about, I mean, just how much will it date and including your irises and all that  are you willing to give to clear a private company that they're going to use your data  in all kinds of ways just to cut the line at the airport?  Yeah, I'll give all that up.  Yeah.  Because so we're willing to, and that's what we're doing.  I mean, as soon as governments or private companies get power over us, they never give  it up.  That never goes away, right?  The Patriot Act, it comes into power and then it never goes away.  just that creep of every year, they have a little bit more on us, a little bit more power  over us, right? And it never goes away. So this is what it came up with. My me just typing  that in. There you go. I actually never really use AI. It's funny.  I was going to ask you, I'm going to have to try more. It's fun. It is. It's very cool.  The thing is though, I think for me what I love about my job is writing books.  So people will tell you, oh, you can write AI, I'll write this for you.  In fact, it pops up now.  It's super annoying on Microsoft Word.  It's like AI assistant and it's always like tracking down the margin.  And I go, this is what I like to do.  I don't want AI to do it for me.  It's my favorite part of the job sitting down and creating these worlds  and these characters and stuff.  And the idea that AI would do it for me,  I just find it's fun to try to like deep dive with it.  Once you get it past its initial like canned answer stuff  and then you try to, you know,  you go into deep dive and you know,  it's fun to see, you know,  some of the things that they come up with.  Now, it did get this for us,  says this is your third fade novel.  It's because it's getting it off Amazon and Amazon has it written wrong.  Something gets into Amazon, you can never get it out.  I see.  So I think the book I wrote called the second horseman has fade in it, but it's not true.  Let's see what this, let's ask one of its questions says reviving fade after 20 years.  Fades at one of a kind character.  Is he a thief?  I don't know.  So he's definitely not a, he's a bit of an unrepent mass murderer, maybe.  He's a dark, he's a funny guy.  He's a philosophical guy.  And I wanted to resurrect him because we live in a weird world.  Like it's not, he has the same skills as Mitrap.  But Mitrap was very much about good and evil, right?  He had typically a, he had a terrorist coming after him that guy was bad.  The Metrop is good, love to America, all these things.  Fade is dealing with this weird shit, the margins.  Like, what is AI going to take over?  Are these countries going to start these wars?  Or is America going to collapse under the weight of its own animosity between the two parties  that most of which isn't even real?  So these are the questions that I wanted to deal with.  these modern questions because the truth is,  Russia is never going to invade us.  Neither is China, we're uninvatable.  The Muslims are never gonna take us down.  They're not very good fighters.  They can't get here in large numbers.  What's the threat to us?  So is much grander.  It's this runaway technology.  It's our own animosity.  It's really maybe even existential.  the idea that I mean, think back on when the when computer first beat our humans best chess  player, people really freaked out. That was what we do, right? You know, we and now what  you're going to find out is the thing that we see is making us special. We're smarter than  whatever the average bear literally other creatures, yeah, special place in the universe.  We're just dim went we're pretty dim-witted.  AYA is going to be much smarter.  And so what is our place in the universe then?  Who are we?  What do we do other than sort of breathe air  and suck up resources and drop dead eventually?  And I think that's a thing that's going to be hard for us  to deal with them.  What if AI does take over their ideas  that it could create a separate economy?  So this robot and AI economy will take care of everything  for us way better than we ever could.  And then just pay us to suck up there.  They'll have the economy and we'll get a check every month  just for being born.  Like what do we do then?  One of the truth is, idle hands are the devil's work.  What you don't want in the world is a bunch of young men  with access to weapons and nothing to do.  Because that's gonna go very badly.  Well, I mean, it kind of goes into the Terminator,  scan it, yeah.  And I don't think it's gonna be like that.  I mean, people worry about AI becoming sentient.  That's not why these sentient works.  And it, but what it can do is take everything,  but it's almost more dangerous.  Just take everything from us that we need,  like our sense of purpose,  our sense of superiority, our jobs,  You know, a reason to get up in the morning, right?  I mean, all this, if it can all be done better than AI.  I mean, and then the answer to your question is,  what's our purpose?  Yeah.  What's the meaning of life?  People have been contemplating this for thousands  or whatever.  Yeah.  Since the beginning.  And it was served God for very long time still  is for the Muslims much less than the West.  Yeah.  I don't know that that's what people would say.  Or maybe it's your job.  like I build whatever, I build cars, people need cars,  I'm a doctor, I heal people.  Well, once all that's gone, family, family could be family,  people are having fewer and fewer children.  In America, all over the world, really,  I'm even in Latin America, Russia's collapsing,  their China's population's collapsing, Europe's.  So why not some of this?  Do you think that's something that's maybe been,  so bloomily instilled in us, you know, because that's why, you know, one of the, um,  conspiracy theories on the pandemic was just to thin out the population, you know, the  aluminum wants to, you know, 500 million people total, you know, whatever.  As a person with no children, I think that we can either, yeah, that people just realized,  wow, kids are expensive time consuming and kind of sticky.  And women, as they have had, women had no choice, even when I was born, really.  I mean, you know, now you have contraception and women have equal ability to go into the  job market.  And I think that's all it is all over the world is that you know what you would call it.  What's up?  I've heard it called selfishness.  It's like, you know, you're just, you're just, you're just, I don't know.  You don't want to have kids because then you've got to, you know, dedicate time, money, effort, you know, to them.  I hate the idea of selfishness though because I have a lot of people have children because they really, really want them.  It's not to like help out society.  Like people don't say, geez, I think the world needs another kid.  I don't want one, but I'm going to do it for the planet.  You know, people either want kids or they don't.  And I think a lot of people probably want lower numbers than they women had, you know, before contraception say.  My brain had an ability to grow families.  They had five plus kids on each.  And now women have jobs and other things to perceive.  So I think that's kind of inevitable.  But I mean, also, this had to stop.  I mean, the population's pleasure is interesting in that in my lifetime,  the population of the world is more than doubled just in my lifetime.  And that's kind of incredible.  I don't think that was a sustainable pay.  So it's gonna level off and it starts to decline,  which will be interesting because nobody's ever handled that  before it extends maybe the black death.  Like how do you, which is the pay,  who knows what's that?  I'd say who knows, 1,000, 100,000 to 1,000 to years.  I mean, there could have been a simulation  that evolved just like us.  And giant out.  You know, I mean, this supposedly this, you know,  this planet, this universe has been here  for millions and millions of years.  So, and we've just reached our evolution  over the past, what, 2000 years?  Yeah, I mean, I certainly modern societies  like yeah, the Romans, I guess the Greeks.  Yeah, I'm starting to what we think  of as modern society.  Right. And if you look at the overall time frame of that,  This could have happened several times.  Yeah.  What is that?  There's some name for that theory,  the Salirian theory or something.  That's what it is.  Yeah, it's something like that.  I got it wrong, but it's close to that.  Yeah.  Well, yeah, it certainly could have happened.  So we'll see what happens with that arc.  Well, it also did not go crazy  would be a good thing.  Yeah, this is a matrix.  We're living in the matrix right now.  We are programs.  Somebody outside control in this.  And could be everything's a simulation simulation.  Yeah.  And that's that.  And the reason I bring that up is that's kind of the feeling I got from fate.  Because fate just seems like he's not in reality.  Feels like it seems like he feels like he's just living a program.  You know, and he struggles with reality.  He does.  Yeah, a little bit.  He spins his own sometimes.  And he has a lot of hard time because of coming out of the coma.  whether he's a waker, he's asleep and all these things for a while.  But it's a world in which less and less is real.  People are dictating AI's now.  It's weird.  I didn't know that.  Oh, I guess I was in Nashville.  It was like West Nashville, I think.  The West Nashville area.  And it's more of an affluent, you know, well to do area.  And I was going into this theater.  And outside there was these two people walking.  One had a leash on an dog face, the dog mask and like ears.  And this other person was walking them on a leash.  and I felt like I was like,  and this is this real, am I awake?  You know, but couldn't get a real dog?  I don't know.  I think it's a thing.  I think that maybe a thing.  It's where the human interaction is messy.  And so we'll see if people can put up with it.  Was, I don't know if he was hallucinating  or what he was doing, but there's one thing  we were talking earlier, where some Looney Tune characters  come into play.  And it reminded me of your watch The Boys.  Oh yeah, for sure.  Oh that's what?  There's just one character that, you know,  hallucinates about all these cartoon characters and stuff.  And it reminded me of that when that scene came up.  And I just started laughing.  Is that kind of the angle you were going with?  Yeah, I mean, fade as, I mean, that's a flashback.  So I needed to just talk a little bit about Fade's background.  And the best way to do that, I felt like, was as he's waking up from this coma that he  would have flashbacks to critical moments in his life.  So that's kind of a scene from the first book fade.  But with more kind of surreal stuff put into it.  So I kind of put dream stuff, a little bit of dreamy, not completely realistic stuff  in it to kind of denote that it wasn't real, that it was a dream as he's coming out of  this coma.  And that I wanted to get all that a little bit out of the way for so that you'd know who  he was.  He was a really well established and understandable character, even though he's a complicating  character. And then you could move forward and learn about his arc as he recovers from  the coma and then gets sort of dragged in to get swept into this group that you know  in a way or trying to take over the world right. I mean John Lewis says that at one point  laughs about it. Yeah. But he's like you know but I'm kind of serious. Like somebody's got  to ride herd over this or we're going to have chaos.  Well, I think it, I think he does it a couple of times in the book.  Yeah. Yeah. And so I got the, he wants to take over the world.  I think he does, but I think in a way, he didn't feel like it was realistic.  And then he's been very surprised at how easy it is.  How easy it is. Yeah. And I think about like, you know, the Trump administration.  now how little, you know, you think about the United States,  we'll step all these checks and balances and things.  And what you're finding is that Donald Trump  and whatever he dreams up, he can do.  And so it's kind of that way with John Trump.  He's in the horizon.  And I mean, that's been the history of every administration  is that, you know, they try to push the limits to.  Yeah.  And he's just pushing it really, I thought,  There might be some pushback like occupying cities with the military would be like people would be uncomfortable with that  But or working entirely through executive order for things like this  You know things people complained about under the Obama administration. Right. See much more  I just can't think of anything he could do that he would get pushback on he's  who he wants so and that's kind of what low is finding out is that and I think he tells fade this at some point that  you just do whatever you want until people push back,  but no one ever does.  And so as long as you got a lot of money or power,  people will bend the knee to you.  And that's been sort of the history of humanity,  to some extent.  Amazing ability for one person to take over a country  and rule millions with an iron fist.  Even if they'd like a rack,  understood how I'm saying,  he was part of an ethnic minority.  But he ruled that place with an iron phase.  He'd even looked at him wrong.  You were dead.  Family was dead and your village was burned.  And so, you know, it's kind of amazing  that he was able to do that.  Yeah.  And through history, we've seen that.  Yeah. And now you have systems of control  that are beyond anything we've ever seen.  Right? I mean, Donald Trump could easily just take  over Facebook and ask easily.  I mean, I don't think you'd have to force them.  just say I'm doing it and they go, okay, that's pretty much what they've done.  I think there'll be a little more pushback than that.  I don't think not at all. I don't think at all. I mean, certainly they've all bent the knee to him.  Now I, you know, Amazon, like these guys, they're, they do what he's, they're told.  And he could do that and just be like, take, take everything off that's negative about.  I think that they also did that under the other previous administrations is they just, they did what they  I don't think they really ask her they were told also. I don't think they were asked. I don't think those guys  How does that much imagination? I feel like Trump has a lot of imagination  He does  I don't know I mean certainly they asked to take down  So and the only thing I think it would Biden is he wanted them to take down  Like the naked pictures of his son they had hacked his phone. Well, it's not just  So that's the other things that they wanted them to do.  It's not like take this down, don't do this.  It's like do this and put this information with COVID.  Put this information out and stuff like that.  With a lot of different things.  So, and yeah, they could have.  This isn't about, it's not about Trump.  They could have.  All they have to do is tell these billionaires  is you all take your money away.  Or not even take your money away.  I'll just cut your profit margin by one 10th of 1%.  sell their children to you over there.  So it's really interesting the power dynamics and how that's happening.  You think of Putin.  Iron-fisted control over his country.  You would think he wouldn't have that.  There are modern European country, but you can do anything these once.  He can march a million people off to Ukraine to die, and they do it.  So I mean, you'd have a hard time convincing me to go to you to try to take over Ukraine  to go get shot at by the Ukrainians.  I'd say, don't we have enough land here?  I mean, United States, nice place.  I don't feel like I want to die to Greenland  being a perfect example.  I go die to take over some big frozen place  or what?  I've been a hunt seals over there.  No, thank you.  Hunt seals.  So it's very interesting in this dynamic.  And low, I guess a little like Trump has imagination.  It's like, well, I'm going to try it.  We put a little bit into that into the book.  I noticed that there were some jabs at the current  administration in here.  Were there?  Was it intentional?  Okay.  Yeah.  Link.  It did any administration.  So you'll notice in my books, there is no Democrat or Republican.  There are none of those issues because this is,  Partisanship is a scam,  voiced it on us by the elites.  It's a tool for control.  It's a tool for control.  It's a great party.  There's a great thing on Vox.  They did a thing on Tucker Carlson and stuff.  He said a long time ago,  and he comes right out and says it.  He's like, I'm the ultimate elitist,  and I gotta keep people fighting,  and I think he says,  so they never look over my wall.  Right? They don't want people to know I live in the wealthiest county in the United States.  And nobody really wants to know what level of privilege that it's, you know, it's  probably not ones and you know, all this. And it's on both sides. It's nothing to do. They don't care.  Go to a party with a bunch of billionaires. They don't care what your politics are. It's about  money and power. Now you're making sure everybody fighting to where you've probably interacted with  with both the super-richly and the politicians.  I have.  And on both sides of the aisle, because sometimes  one guy's in power, sometimes the other guy's in power,  and nobody cares.  They're just gonna give whoever's in power money.  And it's all about maintaining that elite level.  level. Nobody they're not patriots or like it's just about power. So that's what I want to get  across. Don't get fooled by this partisan stuff because the people at the high level are not  playing that game. Nobody much longer game. None of them care about you. All they care about are  themselves. And so John Lowe is hoping to pull that back because it's a lot of times also that  the people who come very wealthy and very powerful just the people you don't want to be there.  Yeah.  Because they don't want to be like that dictator.  Kind of got confused.  He's like, you know, I'll just take complete control.  You know, he's super rich.  He doesn't have a family.  No friends that, you know, this is how you paint the picture of this guy.  Right.  You know, he's a master manipulator, but he's also a visionary.  and he's got this goal, he seems to be very focused.  Yeah, exactly.  And hopefully it's a benevolent goal.  He seems to think it is, but you know,  the question is is it?  I mean, how much control is he willing to take?  Yeah.  And I'm not gonna tell you anything here.  That you do a good job of paying that picture of,  I don't really know about this guy.  It sounds like, you know, women in these this way and then another man and he's, you know,  genuine and I think fade sees that also.  Um, but yeah, and the danger is giving the planet a giving way that power.  And it doesn't matter if you're giving it to Trump or Biden, these are irrelevant details.  Yeah.  The problem is giving it because like tyranny can come from the left, like it did Soviet  Union, China can come from the right like it did with Hitler.  But it's something that democracy doesn't last long.  It's not the normal way that humans organize themselves,  which is strange because it's extremely successful,  like extremely successful.  But for some reason, people get tired of it and give it away.  And now we have it. It's not just the politicians,  but it's to these groups of very powerful,  most great hyper wealthy people democracy doesn't last because of greed because someone wants to take it all  and a bunch of us are willing to give it away for two to take this yeah i'll give you this if you  give me this right you know it's one of the things i loved about george or wells books like  1984 animal farm is that he really never portrayed the downtrodden people as the good guys  because they were had been manipulated into this through their own greed, their own hatred,  their racism, their whatever nationalism, and they had been manipulated into giving up their power  to this dictator. So they weren't the good guys. You know, they just were the unsuccessful ones.  Yeah, the Victor writes history, right? Exactly. Exactly. So John Lowe, he's one of the  major characters in this. Let's run through a couple of other Maddie again is, you know,  another main character. Was he in the, I assume he was in the prequel as well?  Yeah. So yeah, fades like at one time best friend, they were in the military together in  CIA together and then had a pretty serious falling out, almost killed each other. Now Maddie  begins at a very different place in his life and fade is, um, yeah, trying to deal with them and  they're trying to figure out what their relationship is now. I like complicated relationships,  between people. Yeah. And again, through the through the whole book, I just get, you know, if I'm  putting myself in fades shoes, I just feel like I'm in a days. He doesn't know if it's real or, you know,  fantasy throughout the whole thing. And, you know, good reason because of his condition and, you know,  maybe all this stuff they're pumping into him. We haven't even got to that yet, you know, this machine,  Yeah, the mystery machine that's brought him back to life, you know, kind of deal.  And you're saying, I think I saw an interview that you did.  You're saying like that machine actually exists.  You basically, basically, don't something.  Well, to some extent, the, certainly one thing you should look at is leads, the elites,  right?  They were talking about like the CEOs of companies and stuff.  They're pretty old.  And they're all super jacked.  knows that. I mean, really, I'm really fast. Like Zuckerberg is fast. 10K. They're not doing  that with bands in their office. Bezos is what he is. Yeah, Bezos like, he's like, he's  not an old picture of Bezos. He's a scrawny little geek. Now it looks like a James Bond  to one. Yeah. They're not doing that because he's in the gym, you know, six hours a day.  Let me tell you, they got the good stuff. Also like, Fade was talking about, like, getting  infused with the blood of young people, which they've done studies on. They've done  that's very much on the down low,  but that is a real thing.  And you, you know, it would work, I think.  Well, you know, but also, you know,  right now, elites are picking their embryos, right?  They do in vitro and they do genetic testing  on their embryos and they want a smart one,  an athletic one and all that.  Something that the average person can't do.  So these elites, and this is kind of inspired by a party  I once went to with a bunch of, you know,  very, very wealthy people and their children,  these kids are gonna be amazing, right?  They're gonna be brilliant and hard working  and they're all gonna intermarry  and then they're gonna inherit their parents' money  and they're all going to be,  yeah, just becoming entrenched up here  and everybody else will be sort of down here.  Yeah.  But the child's, the children's blood,  you know, you bring that, that was kind of the thing  that they were jacking into him.  But that's been in fiction for decades and decades,  like the vampires,  and they would drink the children's blood or whatever.  I can't remember that there was another character,  a fictional character, she was a female,  and that's how she stayed young.  She would bathe and...  Oh, that was actually a real character from the,  I don't know, was it?  It was based on it's 800s or something  some mean or something that was that she did that. Yeah. But this, the studies have shown  that it works in animals. And there was some crazy guy I can never remember his name.  He was trying to live forever with all this stuff. And now he started a cult, I think. But he was  transfusing, I think, the blood of his son. He said, he stopped doing it and said, no, no, it doesn't  work. And so I'm guessing somebody got to him, frankly, they were like, we don't need to go down  this path because people will be snatching children off the street and like bleeding them dry.  So they already are. Yeah, which is true. Yeah, it was probably a true. That's one of the reasons,  maybe. So it's, yeah, these people have, you know, they're going to have access to therapies we  don't because they're too expensive or too difficult to administer. And that's something I'm showing  this and these, you know, the power of that is going to be huge in the power of their  and their ability to circle the wagons and just create a hereditary elite like it was hundreds  of years ago. Their children will have money. They'll frankly, they'll have been selected  from an embryo, any genetic defects that were a problem. They'll deal with that with  with Prince being around the, um, the, um,  inbred issues, you know, that the,  oh, that's easily fixed.  Egyptians and the kings, you know, that, you know,  I think they all got around it by all the women  who are having sex with the, uh,  with their security guards.  Curing ours.  Yeah. Cause I mean,  they're doing the genetic testing of like old royalty.  They're like, this guy isn't who you think he is.  Yeah.  He's got DNA.  Those women weren't stupid.  Somebody.  Yeah.  But with genetic manipulation that they can do nowadays,  they can bypass that.  And again, it's genetically enhanced and be genetically elite.  Yeah.  And it's interesting, because H.E.L.  was a tree wells wrote a book called The Time Machine.  And it was about the upper classes evolving away  from the lower classes.  And the lower classes became these cannibalistic cave  dwelling apes and not for classes, you know, war togas and  are all blonde. And great. Yeah. And, but as is so often true, he  did it was much worse than he imagined because evolution takes  a long time. But genetic manipulation doesn't say that's one  generation. They can fix it. So there's so much smarter, faster  and stronger, they brought back the dire wolf.  Yeah, it's really a Jurassic Park is real.  Yeah, it's fascinating.  Can you imagine in another generation  that some Jeff Bezos' kid is not only going to be  having IQ of 160, he's going to be a four minute  mileer and a pro level boxer.  It can breathe in outer space.  Yeah, and it's like, and then how are you going to compete with that kid?  Are you going to dislodge them from their position?  We die out, you know, SP ons die out and the new evolution of mankind is on its way.  And we love that.  Like so, I mean, think about dynasties, you know, the bushes, you know, Clinton.  I was one of the reasons I know everybody hated Hillary Clinton, but the thing I hated about  most was that she got there as a family dynasty. She wouldn't have been there if it hadn't been  for Bill Clinton. It's neither with George Bush II. And so, you know, you worry that, okay, now  Donald Trump will leave and then it'll be Don Jr. And then it'll be barren. And you know, those  family diaspora, you can't get rid of them. Even Donald Trump's father, you know, they were big into  the politics. So it'll be interesting to see if you can, and then after generation, you know,  20 years of say the Trump's or the Clintons or heck people were talking about Michelle Obama running  or the Obama says, no matter, they get so much power, they accumulate so much power,  they then you can never dislodge them. Then it's Obama's kids, then it's his grandkids,  whatever, right? Yeah. Yeah. You got to be super careful about that. It's same thing happens.  with fame or with, you know, Sonny Bono was in Congress.  And then I think it meant his wife, I think,  that she took over for him, I think.  And so these people get very entrenched.  I wish you could go through every, I don't know,  there were some of the questions you know every few years.  It's got rid of all of them.  Yeah.  Well, turning it.  Totally. We all know that that's the problem is that they get in there and they get,  you know, they go in there as a thousand air and they come out as a, you know, billion air.  Yeah. And you can't get around. And this is something else that's very much part of this book.  You can never get rid of them. So the sun's which is like 90 years old.  Yeah. Or, you know, Biden trump all of them.  And you think when's the last time you needed it?  You thought I needed it, innovative solution  to a complicated problem.  Find me a 90 year old.  You know, I mean, it's, you know,  my heart needs grandpa.  How to fix my phone, right?  That's not what you're doing.  But that's what we're doing, right?  We have all these really complicated problems  that are gonna affect the next generation.  So let's get a bunch of people over 80 to try to solve them.  I mean, it's kind of like a lot to think about.  Yeah.  Today we're cleaning the SIGP365.  You're gonna wanna follow the SIG guidelines  for disassembly and reassemble.  You wanna take the firearm apart,  put it out piece by piece,  and then you're gonna grab your favorite  one CLP plus product. Whether it's paste, liquid, or aerosol, they're all going to do the same thing.  Today we're using the paste. You can see that it comes out and it spreads very easily.  Using the nylon brush you're going to go in and you're going to cover the entire fire on.  Inside now we are safe on all metals, plastics, composites, rubber, wood, leather.  So you're going to go piece by piece, put it on there, wiping it on to clean it.  Then you're going to go back and you're going to wipe it off.  Remember, seal one is a wipe-on wipe-off process.  Use Q-tips to get down on the little looks and prannies that the microfiber cloth does  not get to.  The wipe-it all off and do not forget to do the magazine.  periodically you're going to want to take the magazine apart to clean the insides.  You're going to reassemble according to the manufacturer's guidelines.  Get it together. You're going to perform a function test, make sure it's operating properly,  and then you're done. Remember, seal one and done.  Seal one is a proud sponsor of the Talking Lead podcast and the lead head brigade.  Use the code lead head for a 25% off discount.  We didn't really talk much about Matt, but they used to be friends had a falling out.  Matt's kind of his hand learning.  I guess kind of to the degree anybody can handle fade.  Yeah, exactly.  Yeah.  He's kind of giving him his his missions and and whatnot.  He reminds me of.  Oh, as I'm reading this, I was actually putting like, I was trying to put who  would play that part, you know, kind of deal.  Oh, in a movie?  Yeah, in a movie.  I never think in those terms.  Do you not?  No.  I'm more of a book guy than a movie, guys.  But not after the fact, after you've done it, it's like, if it were a TV  series or maybe who would who would I want to play?  Originally, when I did fade 20 years ago, I thought Brad Pitt, who isn't  era, but I was like, they could make him up to look Arab, because he does  likable but crazy really well. Yeah. Yeah. Well, we've been 20 years ago. That's true.  When I wrote that book. So he was just like I thought, that's the guy to do just kind of like  completely nuts and homicidal. But you, but you really like him funny. You know, all that kind of  stuff. Good looking. Apparently he's looking. Like a really good looking dude. Yeah. As you paint the  picture of him. Yeah. What does he, I've  fade describes himself as like the cross between a  bollywood action star and and and and a like  al-Qaeda terrorist. Yeah. I noticed that you did some  characters of some of the characters. Yeah. For the  release of the book. And then for him, you don't, you  know, other ones have faces and you know, all this. And for  him you just kind of got some long hair over a face where you don't really have a face  there.  Let me say it was intentional.  Totally intentional because I feel like we're dealing with a main character.  Everybody creates their own, you know, and they're not necessarily like what you described.  So I wanted to keep him a little mysterious.  So when people read the book, they could put together what they thought he looked like.  I still haven't, I haven't painted a picture of him yet.  Now, I got a solid, you know, this is,  is him and what he looks like.  In my mind, he really looks like,  I gotta, again, this is gonna date,  the date me a little bit,  but I don't know if people remember the movie,  the mummy.  It was like the first one I'd brand in Fraser in it.  I mean, it's a long time ago.  It's a great movie.  But there was, he had kind of this sidekick  who was an Arab guy who's played by,  I think his name's Obed,  but I can't remember his last name.  And he had like tattoos under his eyes and long hair.  And he was always kind of,  when I picture him, I kind of picture that guy a little bit.  So here is that cast.  Yeah. And so where is he?  Is it this guy?  Arnold?  You might have to go down a little bit and say you can find him.  I would.  Is he this guy?  Oh, yeah, there is.  Yeah.  Oh, yeah.  I said, oh, bad.  His name's Odad.  Odad.  Okay.  But I mean, obviously he's much older here.  But if you see a picture of him from that era, he has like kind of tattoos under his eyes.  He looks in many ways the way that I was thinking  that favor look up you just said in  Like you search for it in India jet or no, it's called the mommy  That one yeah, yeah  I don't know that you would ever wear that outfit, but oh, yeah, yeah  But yeah, I get I get what you're saying I was thinking  This guy from when you said the mummy I was like oh yeah, it's this guy  Get to me back. We got that actually played the mummy. Yeah, this guy. Yeah. Oh, that guy. Well. Yeah. Oh, yeah  Yeah, yeah, yeah, yeah, the other guy. I don't know that don't see that of course. He's also bald so maybe that's that's what's throwing  Yeah, hair on there and yeah, but you know obviously Arab looking  So I always you know I definitely picture him that way which is  is kind of important to his character.  I mean, he does speak Arabic.  He comes from a Muslim, you know, a devout Muslim family.  He's not religious, but comes from not background.  So, and that informs, you know, to some extent who he is.  Yeah.  So, there's, and not as much as I was thinking there would be  with this guy being a multi-billionaire  and having unlimited resources and things like that.  There's this one scene that thought was really cool  where, and it didn't have fate in it.  It was Matt and him and they were headed to go meet,  what's the guy's name?  Boo, boo, boogers.  Oh, Bochang.  Bochang.  Yeah.  and they get rated and you know, Matt's like trying to get all tactical and do this and  and low saying just stay in the truck.  Just stay in the truck.  But you know, Matt gets out and then all of a sudden people just start dropping.  You know, I thought that was kind of cool too.  Yeah, you know, you can't control them.  Can't the sometimes the reality on the ground is different than it is back in headquarters.  What kind of research did you do as far as the weapons of technology that you use in this,  that machine that they talk about, some of the drone weapons that he was used in the...  Well, the machine is definitely all about the performance enhancing drugs.  Obviously, the blood thing I read, the studies on that, but also the cocktails of performance  hand-hancing drugs that people are on. And what we talked about earlier that all the  sudden all these CEOs not to mention actors, I mean, my God, actors will go from looking  like me to looking like Schwarzenegger in three months for a role.  Joe, that was not a thing before. And so that was part of the research I did. I learned a lot more  about performance and answering drugs that I ever thought I would ever need to know.  What's the good ones? What do we need to be? Oh man, there's so many good ones, but they're  so dangerous, like trend. You want to get jacked, man. And you don't care if you die.  Hit that one. What's that procedure that people are having done now? They're going down to  Tijuana. And it. I don't know what it. Yeah, to get more muscular. No, well, it's for repair and  healing. There's all kinds of that stuff with like centrifuging your blood and stem cell and  all that. But I'm not sure any of that works. I could never find a one because I was trying to  obviously heal him quickly. I hate like this soap opera, coma thing, where the guy wakes up from the  coma and he's fine. Yeah, you know, that just not happened. Let me tell you. And so I was trying to  to find all these kind of next gen therapies.  But those kinds of things, I don't find work.  The drugs though, they definitely work.  So there was definitely there.  The stem cell there because a lot of athletes  are having that done.  Yeah.  But I'm not sure it works.  You might just be a placebo-affected-expensive,  expensive.  It would be for a specific injury.  But I actually looked into it once,  but I was unconvinced.  It's one of those things that seems like it should work,  but I'm not sure it does.  And then certainly the AI controlled weaponry  with drones and things, that's out there.  That's just in its first stages.  And that's gonna completely transform warfare.  But in ways that I'm not sure of,  because I would say that warfare, modern warfare  is unprofitable. There's no way you can really, yeah, I mean, there's no way to have a war  in this day and age and come out better for it, starting a war. You can't make it up.  You know, the good old days when you were the Romans, you're like, oh, we're going to go in here,  we're going to kill and enslave everybody and take all their stuff. That was profitable.  But there's too much destruction, too many insurgencies,  the international community won't let you take  all their stuff, things like that.  So it's really not profitable.  And now with the drones,  I mean, in the next few years,  it's going to become incredibly unprofitable in that.  Well, it's not an asshole of no destruction.  It's gonna be crazy.  It's a sense of looting,  but it is profitable in the sense of,  I make bombs, I make drones, you buy all these bombs, all these drones, all these bullets,  all these guns, all these uniforms, you know, all that.  For the industry, it's very profitable.  Extreme countries, not so much.  So there's no reason to start a war.  I mean, Russia being the perfect example for profit.  Yeah, to better yourself, like rushes,  if they took all of Ukraine, they would not be better off.  They're worse off.  Now they got Finland in NATO,  sitting all along their border.  Sweeten, the poles are rearming like crazy.  They're an incredible fighting force.  The rest of Europe is now rearming.  There's so much worse off.  Got lost a million men.  They already have a collapse in their population.  So that's a perfect example, Hamas.  I don't even know what happened there.  But it's certainly not profitable for them,  not profitable for the Israelis  have certainly not benefited from this.  And so this is, and then with drone warfare,  that's going to become an order of magnitude worse.  And the obvious one is China invading Taiwan.  Yeah, I to me is very worrying and very interesting to me because their window is closing  Pretty soon that technology is going to be such that you cannot attack a country like Taiwan without losing  Yeah, three million people in the first day, you know, so it's a  And maybe that I thought that would take us into a post-war  period, but I think it's just gonna  turn us into a really, really deadly horrible war period because people are still going to want to go to war.  Well, if we like it, what do you think the next conflict is going to be? What's the next?  I don't hear your story. I don't know. I don't know. Maybe Iran. I worry about China every day.  Because that's just gonna be a bloodbath and there's no again, no reason to do it China's plan on land  I don't think anything they want. I don't think that's gonna  I don't think it's gonna happen. I don't think so  But I would have said Russia is not going to invade Ukraine and Hamas is not going to commit suicide  In Israel either I wouldn't I would have laid 90% higher than 90% odds of both those  Oh really? Yeah. I would have said Russia. I mean once they started making noise about it.  Yes, but 15 years ago, why on earth would Russia want to get involved in something like  that? So hopefully China's saying rational resources. I mean, I don't know. They don't need  them. I mean, I mean, Russia's massive and full of resources. And now there are sanctioned.  I mean, it's just, I don't know, to me, it just didn't make any sense.  Yeah.  And it's not going to be just in light.  So, I mean, he didn't like the boy actor.  I don't know.  He did.  I guess he didn't.  But boy, he had to be the great thing about being Putin is you're not getting killed.  Because you don't like you, it's Zelensky.  Your million guys are getting killed.  Yeah.  You know, most of them.  Yeah.  So it's, it's, I don't know.  It'll be, it'll be interesting to see.  I mean, maybe, I don't know.  maybe we'll, I forgot about Greenland and Canada and the Panama Canal.  Maybe those are going to be the next ones.  We're willingly, you know, he's given them the option to willingly, to kneel, to kneel.  Yeah, they don't seem to want to.  So we didn't really get into the plot yet of the book.  You know, we were talking about the pandemic earlier, the COVID virus.  And is that a spoiler if we do that?  Well, I mean, it's very much about, yeah,  I mean, not to go into too much detail.  John Lowe wanting to get enough control over the world  to sort of back it down a little bit,  to bring it back from the precipice.  And in the midst of him kind of working toward  what in his mind is a long-term goal.  There's a snag.  There's a snag.  and that the governments of the world  prove incapable of handling it  because they're all circling their wagons  and trying to save themselves.  And he becomes put himself in a situation  where he's kind of uniquely qualified and equipped  to deal with this in much more so than the world.  And so the world's governments.  So he gets sucked into this.  I think much sooner than he felt like he was capable.  And because of that, he has to lean on Fade,  who's sort of his fate and his team  who are kind of his combat wing.  Yeah, they are his sword.  Yeah, exactly.  I'm gonna ask you this,  what are you having as the Dallas Cowboys?  So many people ask me that.  And it's a fun story.  Yeah, and it's a funny story.  Okay. Because I know absolutely nothing about football.  I know less than nothing about football.  But my dad was stationed in D.C. when I was in high school.  And so it was originally the Washington Redskins.  And somebody was reading it, and a friend of mine was reading it,  and for the football sections, because I was like,  I don't even know what anything about it.  And he's like, is this intentional?  Is this like a historical novel?  Like, what do you mean?  The Washington Redskins don't exist anymore.  It's not what they're called.  And I thought, oh shit.  What's a team that for sure will be around  for the next year?  And I think he said that you can count on the Dallas Cowboys.  And I like, so I just changed it.  But yes, it was originally the Washington Redskins,  which are now the Washington something else.  I don't know.  What is it?  or something.  You're not like that.  Yeah.  I think they're actually talking about changing them back to.  And that's why I didn't do it.  Because I said, well, should we just change the name?  He's like, they'll probably change it back.  And I said, OK, what's the most reliable, famous football team in the world that is  not going to change?  But I want to give you a few more kudos if you to kept the Redskins.  He goes like, yes.  No, that would have been a right or right.  That would have been a political, right or left political statement.  I try to stay away from them.  So my goal in a free book is to get hate mail equally  from the left and the right.  For somebody who's saying, that evil president is Joe Biden  and then next day get one be like, that evil president  is supposed to be Donald Trump.  And so I know if I get hate mail from both sides equally,  I've done my job, right?  right down the middle. Equal opportunities, right? Exactly. I like to I'm like South Park. I'll insult anybody.  When you do globe trot a lot on this also, they go to a lot of different  countries.  Grew not a Spain.  Where I live, so that's a lazy thing. That was a lazy thing. That was a lot. Yeah, because I know it really well.  and how that that fade has there.  Is that based on when you've seen there?  Yeah, there's actually on this,  there's a big mountain behind my house that goes up to a national part  and I ride my bike on it a lot  and there's this huge kind of leg.  It'd be now it'd be a mansion, but it was built God knows when  and it's really in ruin.  Yeah, and it's this amazing setting in the olive trees with the huge Sierra and white Sierra Nevada's behind it. Oh, wow  And my wife wanted that house something awful and I was like oh hell no, we're not getting into that  But it would have been so cool in  her mind  To have just in the big holes in the collapse parts to just fill them with glass and then have part of the house  you know, it was gone, but it's still a floor and just like that could be the terrace, but it used to be part of the house.  And so, um, they do that something grease where they'll have a partially collapsed building and they'll turn it into a restaurant and see your like kind of on the half-clapped floor or something.  Right. And so now it's outdoor used to be indoor, but now.  And so that it sort of heard that dream of that house and I thought, I'm going to  build, I'll have him live there.  Like, here's your house in the book.  Yeah, it's in the book.  And then the aqueduct, like him wanting to build  the lazy river with the house.  I was about that.  Yeah, there's a bike ride I really love that's on the,  in the middle of nowhere out on the gravel there.  And it goes by an aqueduct that Napoleon built.  And is now there's only a few arches left of it.  And I thought, what a sweet, lazy river that,  maybe you'd like go along the aqueduct  and then you'd come back to your pool.  I was gonna pull this up.  You probably pull up just Napoleonic aqueduct  or not a Spain and it would probably,  so that's the old Arab fort up there in the left.  It's probably a very, yeah.  There's a huge Arab fort,  that it kind of hangs above the city  that's called the Alumbra.  It's just massive.  Because that's where the last Arabs were kicked out of.  Yeah, that's the Henna Aleefae.  Oh, wow, there's the, yeah, that's what it looks like.  So that's the last place that the Arabs were kicked out  of in 1492 by the Catholic Kings.  The last Arab protectorate in Spain.  Now, I think on the last episode, you were telling me that  maybe the house you were staying at,  you said you just bought a house,  but it had air-bick influence.  Yeah, it was a flat-out air-bryant.  Like you walked through the arches  and it was all Arabic writing.  And I had two front doors,  because you had one front door kind of guess went in  and one front door is family-winning,  because you couldn't see the women.  You weren't able allowed to see the women.  And one of the doors was now bricked up  had my mail slot in it. But that house is about 500 years old. Wow. Okay. And it was cold  and drafty as you might imagine. But I like the the picture that you painted of it. You  know, it sounded really cool. And then right, Riah, is that her name Riah? Riah, yeah.  Riah. She was a interesting character. Also, was that was that kind of pulled from the  headlines as well was she was she a jalain max will kind of  Well, she was one of the young girls, not not the mistress.  On the mistress.  She was kind of stolen from Bulgaria when she was 14 years old and put in  that, you know, on that circuit of the, uh, the rich and famous men, you know,  go to the parties with the young girls, which, yeah, you know, unfortunately,  That's a component in the book next book I'm writing.  And it was way before the, like I wrote all this way  before the Epstein stuff blew up.  So this is sort of again the victim  of being good at predicting stuff.  And you try to write these books  that you think will be a couple of years out  and then history will overtake you.  And so that Ria, I mean that's a little bit,  It's inspired by some of the people that I've hung around and not that I know anybody that I am aware of that goes to those kinds of parties, but I was, I've known a lot of very wealthy people when I lived in London, a lot of very wealthy Arabs that I was friends with.  And let me tell you, go to the bars that they go to,  the ones that you can't just walk into,  that you're going with them.  And you realize every woman in here,  six foot one and gorgeous and 19 years old.  And they're literally dancing on the tables.  Everybody's getting up and dancing on the tables  and everything.  And you think, none of these girls  give me the time of day.  I'm sure they can smell the poverty on me.  Oh, I mean, that's real.  Boy, you go into the parking lot.  We pulled in and like $100,000 BMW,  and it was the crappiest car in the parking lot.  And so that is that and some parties I've been to around Jackson  Hole where I lived that's now very wealthy.  And some of the things with the government that I've done,  I remember once I was going to a football game  with a government guy who I guess should probably  he's dead now, but I'll say he remains nameless.  And we were gonna miss the kickoff.  So we just had the highway going in the opposite  because of the traffic, right?  Just had the highway in the opposite direction closed.  We pulled over the median and just drove the wrong way  up the highway.  And I thought, this is the good life.  So I would've been in that life with my 98 GMC UConn.  on. Yeah, we were in the limo and just pulled over with the police escort because he's like,  I don't want to miss the kickoff. And me and my father were there. We're like, well, you know,  we're sitting in traffic. What are you going to do? And he's like, well, I'm not missing the kickoff.  We made it.  But it's kind of incredible these things to go on. And I wrote a lot of the stuff before the  the Epstein thing, like really ever became a thing.  And now all that's happening is people are aware of it now.  But that kind of stuff has always gone on.  But now it just became front and center  because of Epstein's arrest and his relationship with Donald Trump.  Because it's newsworthy now.  But it's still going on.  I don't know what you mean, the only one.  I mean, it cleanse with extremely wealthy people.  I think it's just, I think it's really become into the forefront now because obviously  Donald Trump is such a big fixture in the news.  Yeah.  But if Clinton had one, then it would be because of her, right?  So, but this is going on all the time.  And that's being one guy that got caught.  I mean, I mean, Kanye, like you're here in a  about like a lot you're just hearing about it all the time now. It's just coming to light.  But do you think he killed him? So you know, I'm not a big conspiracy guy, but I did a deep dive into  that kind of about that video and everything and how his neck was broken. He was a guy that it was  very convenient for him to be dead. And now I guess Maxwell's now moved into a much more  comfortable situation and I would not rule that out.  Yeah.  So it's just turned into such a hard situation.  You know, very plausible, right?  It's very plausible.  A lot of very powerful people clearly.  And again, this goes to the elites again.  All of a sudden, no problem.  We're going to release that list.  We're going to release all this stuff.  And then all of a sudden, it turned into,  There's no there's no file. No, just don't don't look here and look over there. Yeah, so it's  Once again, the elites you can't keep them down  You can't hurt them can't keep a good elite down. Yeah, you really can't a great outdoors a  Place where memories are made  Where adventures are born and where the spirit is rejuvenated  If you're amid our commitment goes beyond just providing gear  We're here to connect you to the right product and service.  Taylor made for your adventures.  Every moment outside is an opportunity  to embrace our passion, to learn, to experience, to bond.  We believe in the power of the outdoors  and with top of the line gear from Pyramid,  you're not just experiencing the wild.  You're becoming a part of it.  Guided by our vision, we strive every day  to share our knowledge and passion  for the vast, beautiful world outside  because when you're armed with the best,  every expedition becomes an incredible experience.  Pyramid, adventures, and recreation.  Now, you make some other kind of subtle references in the book.  What's your hang up with 80s female bands?  Well, that was a little bit of a throwback.  I wanted to be, first of all,  fade loves cheerful music.  It's the past a lot.  So he loves the go-go's.  And if he's going to go on a killing spree,  he's definitely going to do it to the go-go's or the Ramones or something.  The Beach Boys and Savvy, John.  You've got Banana Rama.  Banana Rama.  Yeah.  Cause it's fun music for him, but I also,  so I had a book about him like 20 years ago.  And he went into a coma really 20 years ago,  but I wanted to keep this that timeline vague  because the truth is he couldn't have been  in a coma for 20 years.  You've never recovered from that,  no matter how many drugs and armor therapy you have.  So I wanted to keep that time for him vague.  And so you'll notice that I put all kinds of like movie references  and music references that go all the way back to the 80s,  which was way earlier than when I wrote that book.  Yeah, whatever 20 years ago.  And so that his background would be really vague.  There was a book or movie one's called,  I think it was Blue Velvet by David Lynch,  was the director, very strange movie.  The one thing I loved about it was there was no timeframe in it.  Like you'd have a modern car,  but people would be listening to a boom box.  And then like every, the fashion was all different.  And I loved that idea of it was completely timeless.  And so I thought I would do that with this book  where you couldn't totally pinpoint Fade's age or background.  I'm trying to share that.  Pulled it up.  There it is.  I don't think I've ever watched.  I've heard of it.  I don't think I've ever watched it though.  Blue velvet.  It's very David Lynch.  It's a very strange movie.  But if you look in it, there are just like these elements from different times.  It's like, if you made a movie now and somebody had a walkman and then they had this  car from this era.  So that's kind of what I wanted to do  was create this really weird time warp around him  that you could never figure out exactly  what his time roll was.  Because this is what happens with rap too.  Like I had to stop aging him.  Yeah.  Because he was getting so, he's my age,  he'd be almost 60.  Yeah.  We're almost the same age.  I'm 50.  Yeah, just term 59.  So, and then you have all this secondary characters or a problem too.  You know, Mitch Rap has this daughter who's quite young.  But if you didn't age him, but you aged her realistically,  someday she'd be older than him.  So, they didn't work.  So I decided to get really vague and take a little bit of David Lynch.  Yeah.  The little inspiration from David.  I talked to Stephen Hunter about that.  And his character, Bob Lee Swagger, and he ages,  Bob Lee and his throughout his series.  And so did Vince.  Yeah.  I felt like Vince would have worked his way out of that character  and didn't have the character or something,  but I didn't feel like I should do that.  I like the way they do James Bond.  Because James Bond, you just never know,  because I mean he picks up here, he picks up there.  And I like the way that they...  After a while, the events of a character's life,  you know you think about Mitch Raps starting with a Pan M103 which is very visceral to me because  my father was the lead FBI agent on that and it happened at my college graduation dinner.  So I know that Mitch Raps is exactly because he was graduating from college when that happened.  His girlfriend was killed in it. So I know exactly how old he is and as an aging athlete,  I can tell you that jumping through all those windows and stuff like that starts to get harder to get up in the morning  Just trying to tie the shoes, man  It's rough, but I like I like how you did make those you pointed back to some of the 80s references there  I like to go and then you start you it starts off with a quote from tears for fears  Yeah  That quote really every time I hear heard it for years  Even when I thought fade was dead and gone. I never write about him again  The dreams in which I'm dying are the best I ever had. Yeah, that just really made me think of that character always brought him back to me  It's one of my favorite bands. I left your superiors. They're an amazing band. Yeah, it's a little timeless, right?  Have you met him? No, yes  one of them  Um, these are, see that TV series psych?  No, I don't think I've ever heard about it.  Yeah.  So the main character, um, had like a thing for tears for fears and, um,  not the guy, the main guy that sings, but the other guy, I can't remember his  name from tears for fears.  He brought into the show.  He actually brought into the show and he was, he was on the show several times.  Oh, that's cool.  It was cool.  Yeah.  It was kind of cool.  Anything else about the book that we need to let our listeners know.  I mean, it's a great book.  I did the audio just for time and my eyes.  But the guy who did that was his name again, who does the world hammer.  Yeah.  Super, super good guy.  As far as how he does the characters and his pace and his tone keeps you in it.  But like I said, I hadn't read the first one, but you don't need to you guys can jump into it and  and pick up right where  you left off 20 years ago and  It's really good. I enjoy it. What kind of influence did you?  Where did you tap in for this character? Where did he come from? Where did?  fade come from  the initial idea and  And it was when I was probably 16 years old.  And I wasn't a writer and I don't know.  But characters in my life have, or people in my life,  just like everybody really influenced me.  And I was shooting with a friend of my families  who was kind of a legendary Marine, an operator  from Vietnam.  and he had this gun with him, a pistol,  and he had like four rounds for it.  And I swear to God, they were tracer rounds,  which was really weird.  Created a lot of smoke, but it was Russian.  And I had never seen a gun like it, obviously,  because this was still Soviet era.  And I asked him where he had gotten it,  and he said, he's kind of this amped up guide,  It was really funny.  Unlike a lot of operators,  they're pretty stoic.  This guy was a practical joker and really funny.  He got into this big story about some recon he was doing.  Solo recon.  The vehicle were coming and there was going to be this big attack  and blah, blah, blah, blah.  He had to go up.  He's in that story.  He's like, so I'm walking through the jungle.  There's this rushing guy putting his shoes on.  So I shot him in the head and then I went up.  And I wanted this ridge and then he's describing, of course, his brains will all the movements  of the troops and everything is in it.  And then he's like, and I was walking back and I walked by the guy and I had this gun  and I thought, well, it'd be a cool souvenir.  So I took it.  And he's like, that's why they're only four rounds for us.  That's what was in it.  And but it was such a weirdly non-Shalant kind of, so I shot him in the head as being the  sort of a side.  And all his crazy drink and he once almost got me killed and we had to, there was a helicopter  rescue, but I didn't have to get in the helicopter.  He did.  So I'm proud of that.  But I mean, like that guy gets you a lot of trouble.  You can't just leave, leave us hanging on that.  What's that little kayaking mishap?  kayaking, okay.  Yeah.  And so he was a marine and all his kids were like amazing wrestlers and we went on this  kayaking thing down a really, really tough river,  which I saw and it was in flood.  And I looked at it and said,  even it, I was probably 17 at a time and said,  this is a bad idea.  And they were of all kind of like,  oh my God, you're such a pussy.  And I was the only guy with a really kayaking experience  that I pretty decent kayak.  They were working with lesser equipment.  And yeah, that was way too much river.  But it wasn't a rustler.  I was a competitive swimmer, which came in very, very handy.  And so me and one of his sons managed to get out of the river.  Fortunately, I went over waterfall, got sucked down to the bottom,  came up in the hydraulic, got sucked down again.  And when I came up again, I was really close to my kayak, which  trapped in the hydraulic under the waterfall and I got hold of the  bowline and it was full of flotation bags and styrofoam and my friends  kayak had literally snapped in half and I saw it bobbing straight up down the way.  I could get out. I caught up with him and it took us about 40 minutes to get out of  the river because you just couldn't get to the size. These waves were  crashing and there were a lot of big logs that have been torn out and were in  the water. And I had seen the kayak that the John was in and two of his kids collapse. And  so we got out, flagged a ride, went to the Rangers and told him what happened. And we  all ran, went back and ran down to where we, I had seen where this waterfall was that we had  gone over. And they had managed to get into a snag in the middle of the river. And they were  all on the snag, but it was breaking up. And the ranger said, we can't even get a power raft down  here. The water's too high. The only way you could get these people out would be a helicopter,  like lowering a line. But they're like, they're like, it's not like in the movies where people  can just jump onto that thing. We don't have people to do it. And we're like funny story,  recon marine from Vietnam, just get the chopper in. And they did them. We were standing there.  The chopper came in lower the line down and his kids were pretty young. So he had to get  in with them and hold them in a bear hug. And they brought them up and dropped them in  the force and they took him back to get the other kid. And he's like, oh my god, they  It was breaking me in half.  Those kids, it was just a strap here  and he had the kids and weight.  And the helicopter top of him,  he's like, I thought it was gonna snap my spine  and they got all three of them out.  But think about competitive swimming instead of wrestling  if you're looking for a sport.  Oh, before.  Good, good.  Gary's larger than life and some of him is in fade.  Like, actually there's I think there's a story. I can't remember this book or the next one where he throws a  Marine off a battleship  and  um  It was in this.  So that really happened, but he was a Marine you threw an avi guy off the balcony. I think it was in I've heard the story  Yeah, that was him. He also launched a car off the front of an aircraft carrier with the you know with the plane launcher  thing. I see how far it would go. So he was quite a character. Yeah, somebody, you know,  I was speaking once about, and there was a crowd and old guy came up to me and he said,  I didn't know him, but I was in Vietnam. He's like, did you know he ordered the only bayonet  charge in the entire war? I thought, yeah, I totally see that. I'll probably just do it for the  the fun of it. But he was next level. Let me tell you that guy who like, there's a  diagram of to him at the Naval Academy about a bridge he blew up had to crawl under the  bridge with people shooting at him and fell off at blew up and went way down into the  hit con territory and had to come back alone. Which is not like, well for sure he's dead  John Ripley, they actually made a movie about him. I've never seen it though. And he had  come back and they're like, well, for sure he's dead and they're like, now, and then one day  just walk back into camp. Let's see. Is it this guy? Yep. That's him. Okay. But he was my father's  best friend. Okay.  I'm not sure.  I'm not sure.  I'm not sure.  I'm not sure.  I'm not sure.  Yeah.  A character.  Let me tell you.  Is that him?  There's a book.  There's a book on him there.  Yes.  And then I think they made a movie about him too.  But I don't think I've ever seen it.  I know I've never seen it.  But I think they made a movie.  Well, I'll just say that.  And so he, I mean, he is not the personality of fades way more out there than this guy was.  was, but man, I can just remember a lot of fun dinners and things with that guy just  drinking like we're all drinking like crazy and just like the almost outrageous character ever.  And just such an incredible legend like the stories that people tell about them are just like  superhuman. So always he always makes me think of Mitch rap and Scott Harvath and fade as the guys  that were just like unkillable.  Yeah.  And I got to imagine that, again, with your father's, what he did for a living and all these  interesting characters that you've met throughout your life, that that's had a big, obviously  a big influence on the way you ride in the characters that you ride and how they are.  What other real life people that you pull into for these characters?  I think a lot of them were just composites.  You know, I've been really lucky to know, you know, Bill Webster, who just recently  died, who was the director of the FBI and the CIA.  He helped me a lot when I was first getting started.  But MI6 and MI5 guys when my father went to London, the SAS, who were really incredible  group of people.  So it's, I mean, that's what I like, those were always the friends of the family from  as long as I could remember because I was four years old, you know?  So I got a real flavor of who these people were and, you know, what they did over the course  of my life.  So it became very easy to create these characters because they were compositive.  person I met and that person I met and they do something, you know, some of the scenarios  in my books really happened where they're just a slight twist on something that really happened.  You know, I, there's a scene in my first book where the FBI agent, like somebody  Rob's banking, kills some of the guard and the FBI agents, having a haircut, he doesn't have his  gun with him and he's like, I'm going to get, I'm just going to get into the chase, but I'll just  stay behind the police and just come in when it's all over like the hero and turns a corner  and finds out he turned it in front of the police and he was right behind the suspect.  And that gets into a gunfight but doesn't have his gun. That actually happened to my father.  That was a story that was directly about him.  And so a lot of those things, the stories I heard over the years and stuff  work their way into the books in somewhere or another.  Yeah.  I know earlier you said that, you know, when you're writing your books, you never think  of people that are going to play them, you know, never thinking movie aspects.  But I mean, this character, I mean, he definitely has big screen potential in my opinion.  Could be, you know, it's a little different.  know that's I don't know if people are looking for that you know it's it's it's definitely an  action thriller but it's also dealing you know with some gray area between good and evil as opposed  to you know got a white hot black hat and it's got a character who's not as squared away as a  Mitch Rapper's got harvath or many of the that's what our motivations are complicated.  That's what I like about it.  That's what I like about this character is that he's kind of the anti-hero.  You know?  Yeah, for sure.  He's got his own morals and way of doing things.  It's different from your Captain America type.  Yeah.  He was never a boy scout.  I can guarantee that.  And then people that you surround him with just kind of add to that whole dynamic.  And again, in my opinion, I'm not a Hollywood producer or anything like that.  I think this would be a very interesting, like a multi-series, not a movie,  but if you could do like one of those.  Like a mid-series of it. Yeah.  I think it'd be super fun and interesting.  And you could find, if you could get the right actor and, you know,  who was really compelling?  Yeah.  The Hollywood works in this serious way as though.  They make movies that I think that's as stupid as decision you ever made in your life  Why don't you just pick I got like 20 friends who could give you a book that's 10 times better than that?  It's already written  Why remake why do a reboot?  You know like red dawn for instance  I'll just throw red dawn out there. I mean they  Red dawn was like perfect the way it was great movie. Yeah, and then they tried to reboot it and  Bring it back. He's like you could have just done  another movie called it something else and kind of just changed it up a little bit and you  had your own movie.  Yeah.  I don't know.  But they are a weird, I mean, it's just they have a whole other dynamic than books.  Like, you know, you've got to think about how much the movie cost to make and who you can  get for it and then blah, blah, blah, blah, blah, all stuff I've never been involved  in by design.  Yeah.  Well, you know people.  So yeah, but I got asked to do a movie with this big movie director from India and I have to admit I was just like, oh man, it just seems like too much work.  I'm talking. I didn't do it.  So you're gonna have to up that pay a little bit. Yeah.  First of all, it's my job.  But, Kyle, I know you gotta go.  I told you we'd keep it around two hours here.  But I really appreciate you letting me know about the book  for one.  I definitely am gonna go back and get the first one.  I'm gonna go check it out, read it.  Yeah, well, let me know what you think of it when you're talking.  I can only again, assume that there's gonna be another one  of these coming up because you left it wide ass open.  Yeah, well, the hope is that will be the start of a series that continues to explore all  the weird stuff going on in the world.  Yeah.  Yeah.  And it's, it's easily digestible too, you know, as far as the length and and whatnot.  So hopefully, I'm trying to, it's trying to drone on forever.  So for those lead heads who aren't watching the screen, you can go to Kyle Mills website  It's calmills.com and it's at calmills author on looks like most of the social media is there.  X and Instagram and Facebook.  You guys can go go give them a follow and then I guess Amazon is that the best place to go?  Yeah, I mean bookstores Amazon whatever your favorite way to buy your book.  What's your tour?  You got a book signing tour or you're.  I did it.  Yeah, it's done.  Didn't come to national.  We did not come to Nashville this time.  So, maybe next time.  Because last time I told you if you come to Nashville, I'll take you to roll range.  That's right.  And we'll shoot some full out of you.  Somebody, you know, I need a bookstore to invite me though.  Is that what it takes?  Yeah, it's kind of along those.  Like, if you know you have to have a bookstore that likes to do thrillers and likes to do events.  Does it have to be a range?  Could be yeah, see if I can get my convinced my publisher to  Pay for me to go and shoot guns and drink whiskey. Yeah. That's good to me  Go, uh, I'll take you downtown. Well downtown Nashville's just for tours, but we'll take you somewhere fun. Yeah  I'd love it  Check it out guys fade in calm hills latest through the runoff will hear do you have anything else?  Besides the the fade series that you're working on  Yeah.  Now I'm just working on that.  I can only do one book a year.  So I'm halfway through the next one and probably come out in January of 2027, I think.  Okay.  That's what I figure I'll get it done.  You say you can only do is that just time-wise, you know.  Just time-wise, focus-wise, a lot of some authors can do multiple books a year, but I have  to drill in on one and it takes me about a year.  Okay.  Very good.  Well again Kyle thank you so much for being on the show.  Know the lead heads are going to love this book and more to come from Kyle Mills.  Thank you. Thanks for having me on.  Anything else we need to deploy or you want to get out there?  I don't think so. That's all I do.  Well I wanted to ask you more about your bike riding you know since you don't do the rock  climbing anymore it kind of your you know your hobbies and then talk more about Spain but that'll  give us an excuse to have you back on and we can talk.  And we don't have to just talk books when you come on if you, you know, if you want to just  come on one of like one of our topic shows, I'd love to have you come on.  Yeah, sure.  Just let me know.  Let me know.  Actually, I'm going to try to start climbing again, but we'll see how that goes.  So maybe the next time I talked to you, I'll gotten back into it.  Okay.  We're going to talk about this guy named Jim Fountain.  Does that ring a bell?  Yes, but I don't know why.  Vietnam. Um, oh, what was that? Uh, I can't remember. Anyway, we're going to talk about him  because I have a guy that actually knew him and worked with him and, um, we're going to talk about  that. So that's the cool. You should get Jack Carter did that because he just wrote a book, a historical  book about Vietnam. Oh, yeah. Yeah. Yeah. Yeah. I felt like having those characters father or something,  All right. Yeah. Yeah. Yeah. That'd be good to you.  And Jack.  Which is well. I mean, he's the military.  I've say, like I said, my, uh, I'm, I'm doing a lot of military expertise.  You got the espionage, uh, you know, side. Yes.  I got that covered. But right.  And that's what he, that's what this Jim Fountain guy was more into.  Was the, uh, the espionage.  It was red something. Well, I don't know.  I can't remember what it is right now, but put me on the spot, man.  But I will definitely invite you and at your leisure if you'd like to join us for some of our  our other recordings would love to have you on. Yeah, that'd be great. All right. Keep me posted.  Guys, that's it. Until the next episode is always keep your loved ones close. Keep your firearms  closer and keep your Kyle Mills. No, New York Times, everyone best selling author books even closer.  Baby",
  "created_at": 1755530892
}