{
  "podcast": "The Lunatic Fringe Podcast",
  "episode_id": 41354196646,
  "episode_title": "Lunatic Fringe with Olav Zipser",
  "audio_url": "https://mcdn.podbean.com/mf/web/6nkr3s2i7zzkwqeh/Olav_FFFai0up.mp3",
  "duration_seconds": 4170.337,
  "text": " In Zidero Sports, Icarus Canopies, now Gyro.  That's right, we've rebranded and Gyro is our next generation.  It honors our founder as that's a name we knew him by, but Gyro also marks the start of  a new chapter, and not to be biased, but it's going to be fucking epic.  Long story short, we're more us than ever, so if you're new to the sport, or even a  Skygodd Ninja Turtle, welcome.  I think our valiant leader Lucy, Jara's daughter, says it best.  And we still got that fuckie attitude.  Rebrand!  Woo!  Rebrand, woo indeed Lucy.  Anyway, hit over to Jara.com for more info and get amongst, Jill engines.  I was 19, broke, unemployed and sold my girlfriend's canopy for drug money.  So, I thought I'd better sew her in new one.  What a sentence and what a story.  This describes the humble yet outrageous beginnings of Enzi Aerosports, the home of Icarus  Canopies, in the words of our founder himself.  From getting a paratrooper toy from his mom, watching parachutes at the D.Z. as a six-year-old,  jumping off the war for the parachute made from bedsheets, doing his first jump at 16,  sewing his first canopy on a borrowed machine at 19, and starting to sell parachutes out  of a garage in 1986, Paul Giro Martin had an undying love for the sky.  Our company started with one man with a wildest of spirits and a true blue sky dream.  A renegade, in the time that Giro created and ran the Icarus canopies brand until he passed  away in 2017, he pushed everything he had to its limits.  We miss him and we always will.  Giro is the next generation of NZ Airau Sports.  It honors our founder of course because it was the name we all knew him by, but Jairo the  rebrand also marks the start of a new chapter.  Our next jump.  Jairo is the space between sound and silence, art and science.  Chaos and Calm.  Jairo is a state of epic tranquility that transcends understanding.  That moment in the door, in free fall, mid swoop, when nothing but the present exists.  a perfect balance of euphoria and thrill.  Gyro captures our passion for flying  and our commitment to designing  break the fucking rules, canopies,  that deliver pilots pure wild flight.  Hey gang, so I got a new book out.  It's called The Upside of Fear,  and it's exactly what you think it's about.  It's about the good side of, well, getting scared.  In it, we talk not only about the science  and biology behind fear, but the psychology as well.  And it's not just coming from me, it's coming from some of the best in the sport.  Omar Al-Hijalan, Jeff Provenzano, Maxine Tate, and so many more have contributed.  There sometimes terrifying stories to the book to help you overcome your fear.  So head to the lunaticfringepodcast.com.  You're gonna find the link to the book there as well as the other books.  It's available in e-book, paperback, hardback, and audiobook right now.  Come and stay from the cockpit. It's another episode of  What a dick friend, what the fuck am I?  Ready set go.  All right, in the can once again is the fucking pilot with another edition of lunatic fringe into the void  and boys and girls you're not gonna believe this one on on the other line the magic of Skype once again  I have well you tell me who am I talking to?  Hey, my name is Olaf Tibsa and  And I'm the guy who likes to fly the sky and I say, I'm swimming the ocean of gas.  I call it free flying.  Free flying.  Yeah.  It is.  Mr. Olav Zipser.  Olav, I am doing absolutely fantastic.  I'll tell you what, this is a real treat for me.  And for all the sky drivers of my generation, our generation,  because man, you've been kind of the name for a very, very long time.  I was watching the stuff that you were doing when I was just a little baby  guy ever and you're still doing it. You're still going hardcore man. I mean, it's amazing.  Well, I slowed down a little bit, but I'm still flying the sky 34 years later.  And yeah, I'm very happy that many people enjoy to fly the ocean of gases. I do.  At that time when I started, it was just belly flying and came from the swimming industry or not  industry but from the swimming sport as a kid. Also diving into the water from the  water from the tower thing and swimming the water scuba diving all this I learned as a kid.  When I was old enough to decide for myself 20 I decided to go diving.  How did that come about? Did you have family into skydiving or you just saw it somewhere?  how did you decide to make that first jump?  Oh, actually, it was very funny.  I almost did never jump.  I actually didn't want to jump.  I wanted to go hang riding on the Delta Flyhouse,  you know, the triangle thing.  Yeah, I had one friend who I helped once  to drive him up the mountain.  And then he flew down the mountain.  I drove him back up the mountain, kind of thing like that.  Wow.  And inspired me.  And I thought, like, man, that's a good thing.  I learned that too.  I already have a friend who can do this.  And I went to travel agency, but they didn't have any courses  available for the for the timing which I had vacation, you know, and they decided well, not  they decided they suggested go skydiving in Texas. You can do the AFF program. It's brand new in 1986.  It was a test program still. Sure. And I ended up doing skydiving. That was good, good thing for me.  So you went out to go make a hang glide for the first time and they just couldn't take the booking.  And that's the only reason you ended up becoming a skydiver.  Yeah.  Wow.  That's not what you expect from the father of reflying.  I mean, I would have.  I almost expected you to tell me that you've been dreaming of skydiving since you were  in diapers.  No, not really.  I mean, I saw the ramble movies and I got inspired by whatever, the war actually meant  that jump in, but it was never really in my mind to do things like this.  when I met this friend and I saw how he hanglights down the mountain, that's when I got inspired  you know to do something with aviation. So where's it? Where's it you did your first job?  In Texas, Texas is an island in Holland and it was in 1986. I think there was one of the few places  where the European people tried out the new American AF system to teach people. Wow, I was  I was lucky enough to enjoy that as one of the very first people.  So now you land from this first jump, did you know right then that that was for you?  I think so, yes, because I had it really easy in my mind.  The first three jumps were quite easy.  The first jump was a mental hurdle.  I almost was scared enough to not jump.  Really?  range not only have one junk master and I wasn't quite sure of what the whole thing is all about and  if it's worth it or something like this you know so I almost almost rejected but then I said  fuck it I'll do it anyway. You know that's really cool because I think a lot of people just assume  you know they they see someone like yourself or any of the the very visible sky covers in the sport  that have these tens of thousands of jumps and they assume that there's no fear involved  involved in their progression in the sport.  And it's always refreshing to hear someone, especially, you know, of your notoriety that says,  no, I was fucking scared.  I almost didn't do the jump.  So it's really cool to hear.  This is the truth.  Hey, I still get maybe not scared.  So much I get scared on a base jump.  I remember that.  That was intense.  But anyhow, it's healthy to be scared or not maybe scared, but at least concerned or safety  safety, safety cautious.  You know, gotta make in skydiving, I think, and suggest to everyone, it's like every day,  every jump, you make a new risk assessment calculation for yourself.  And only after that, you should allow yourself to either way, allow it or don't.  You know, make a decision at a time, you know?  Yeah, absolutely.  Not report or lazy about it.  There's no routine in this sport.  No, I think the fear is extremely healthy.  In fact, I had taken a pretty decent break from jumping.  Granted, I was flying in the sport the entire time, but I took about four years off and I didn't  start jumping again until someone suggested going out to make a jump in the idea actually scared me.  And I went, oh shit, I think it's time to jump again.  It's great.  It's a big deal to say.  And then you feel like, oh shit, man, that's really affecting me anyhow.  Yeah, no, it's amazing.  Well, so you make this first jump, you overcome that first hurdle of being scared.  How where does the sport really start for you?  Where where did it lead you to begin with?  Right after this, I think.  I told you I was almost scared enough not to jump, but that was actually probably my most famous jump ever.  Really?  Well, not for me because I don't really remember that much, but for my jump masters,  I thought from that point on their thought, I'm fucking with them because I did level four and level five and the level four jump and  Graduated me to level six and I never did anything like this  So as one of the first eight extra students was our talents ever right I did only six jumps for seven levels and I got  praise so highly and  people couldn't imagine it and  I bought the rig from my junk master  They sent me and hooked me up with people and throw it out so I could go to Zephyr Hills, throw it out.  Meet the best people in the world and that's what I did.  I cancelled my job and went to Florida and lived in the tent.  Wow, so you like right out of the gate man, you got out of AFF,  potteryg and moved to Florida.  Yeah, it took me maybe three weeks to cancel everything.  So the fucking shit that I had and fucking left it.  See now, that's the story I expect to hear about Olav Zipsir.  That's the story.  I got this here.  Somewhere, you know.  It was worth enough for me to try that.  I had a good job.  I was fixing teeth.  Dental technician can try that again.  So it's not like I left everything and decided never to come back.  Sure.  No.  I asked my boss for three months on paid vacation.  I don't know if Americans know what unpaid or what that means.  But in Germany, you have a working contract and you have only a certain amount of vacation  you and if you want to have more than you need permission for it or you don't get it.  Sure. And normally you don't get paid benefits or anything during that time but you get your job  back when you come back. That's pretty awesome. Yeah but my boss didn't agree to that.  He said I was crazy and then I just fired him and he said you can't fire me on your  I said, I don't care, man. I'll hire you anyhow.  I'm doing these weekends with the gay side.  I just go.  That's awesome.  So was Zephra Hill's Florida?  Was that the first place that you'd ever been  in the United States?  Yes, yes.  So straight to Florida to go jump out of airplanes for the  right off the bat.  And how was it?  I mean, was it everything you thought it was going to be?  It was, I far more than I ever imagined because I was,  I was a German boy from a bigger village that's basically it.  And now I come to Zephyr Hills.  So I actually, at that time, it was Phoenix Skydive Centre.  It was the Cabellas, they were running it.  They had DC3s, I believe.  It was the only place they had DC3s on the place.  And it was like, I would say, I was in the joyful time of ending up with the last of Woodstock.  And that was kind of the drops on.  the ludu wood. Oh man. Sometimes a hundred thousand people there was tents and trailers painted  like hippie, hippie times all around the airport. Little villages of trailer camps everywhere. Pink  flamingos everywhere was awesome. Wow. That had to be quite a culture shock for a little German boy  from a small village. Absolutely. But I quickly learned all the advantages of having such a life and  Yeah, clearly. I mean, well, how many years now have you been working? You did your first jump in you said 85?  86. So it's about 33 years now. Yeah, 33 years. Yeah, I'd say I'd say you've embraced the lifestyle.  I can't go back. I wouldn't know why. No, I mean, I could back and I still make some stuff  like art, you know, a lot work similar to what my previous job was all about, but  I like flying, I like teaching, I found a lot of people who give me joy when I teach them.  So, you're a first discipline obviously in skydiving at the time, belly flying was all that was going on really.  Correct. So, it was quickly, in Florida, people from the German team, Dietak Hirsch, maybe you know him, Kristoff Aunts, the Data Lewis Group.  As a young skydiver and so potential, I guess.  And they took me up in the four-way and eight-way team  in the German national team at that time.  And we started the...  Then we started the drop zone together, three of us.  Wow, there was a little...  Yeah.  There was a 1988.  And I was called skydive data loss.  That still exists.  And, yeah, and from that point on, I did AFF jumpmaster,  John Master and Tandon Master did all those things very quickly.  Okay.  Started working for up-somethings and team training and national team thing and competition.  But it wasn't my thing to fly on the belly.  I really had different things in my mind.  I wanted to swim through the ocean of gas, manipulate the air onto human body in such  a way that human free flight is possible and not just falls to the sky kind of.  So how did the idea or the desire for free flying first start?  I mean, where did you first start to think, you know, hey, if we can do this on our bellies,  we can turn this upside down.  How did that come to you?  It wasn't like this thing.  It wasn't like that.  It wasn't like I was going to invent something else.  I knew how to track everyone else.  I knew how to dive out of the DC suite when there's a sturdy way.  So you've got to go on your head.  There's nothing new.  All I did and had fun was flying two clouds in Florida.  There's lots of clouds.  They're very cute.  There's like, you know, they have like vertical edges sometimes.  And my private game, my personal fun was like,  can I possible jump out of the plane,  make it to the cloud, find my own rainbow  and fly that cloud edge down and see my shadow.  Right.  And doing that gaming and all that flying,  I just learn to fly all different angles  and speeds and stuff like that.  do your fucking Peter Pan. It wasn't about learning how to head down or how to do a looping  or something like this. It was about chasing the rainbow and because the rainbow is around  the shadow. And to get there quickly and still make it home and not have to walk through  the swamps, that's the game. It's a pretty good game. Alright, so you're doing this on your  own and you're basically chasing the clouds and playing Peter Pan and having a lot of  fun, but obviously from there to here, a whole lot of shit has happened. So I'm assuming  that you started getting friends coming out with you and this started to slowly morph  into what we now know as free-flying. Yeah?  Well, yeah. Kind of, yes, yes. I made some friends. We'll be a member. I was a young German  boy, 20 years old, couldn't speak much English. So it took some time to make some friends.  But I have to say, John, along from PD, you, everyone knows him.  He was one of my first friends.  He took me under his wings a little bit,  literally, because he gave me some of his early experimental parachutes.  I got to fly less than 100 square feet in maybe 88, 89 time.  How ridiculous.  So I made friends with him.  I met Scotty Cup that one.  Can you imagine what I saw about?  I met Tom Paris, Peter Goodnoir, and we did beautiful things.  But not like free-fly, but still kind of bellies.  When there were people together, it was like maybe going into tracking.  OK.  And then we had a game where we'd track next to each other and try to make a diamond formation  tracking, tracked out around the airport this time long.  Then we had a game.  I already knew how to go pretty fast and hold it and actually maneuver it.  It was not just a bullet dive, you know, down to a formation.  It was like what free fly is today, you sure.  Manugret back and forth and turn it like a, if level seven,  graduation thing, you know.  So whenever we put, whenever I put the tongue out,  next to someone in the tracking, that was the sign.  Well, that's cool.  It's awesome.  It was pretty limited.  It was actually crazy.  Could have done this better at that time already.  but no one thought of how to do it better.  Surely.  You know, that came over time of how to do it smoother,  train the people.  From that point on, I got more attention.  And here and there, I did some more AFF work  and train to people doing heavy of F already,  what my new words are and how I think about it.  Like, I don't like to say like jumping out of the plane  or exit.  I like to say to my students, we fly away  from the aircraft, we enter the air stream.  I used words like this.  Sure.  And yeah, more and more friends came together  and I made me have a job.  I didn't have to do it.  I have any more.  I did private, I don't know even what we call it.  Coach Dives.  Yeah, Coach, you just caught that in a different way.  Okay.  Coach Dives and load organizing with your friends, really.  So when did you know that something had changed? Like when did you look around and go wait a second?  Half of this plane isn't going to jump on their belly anymore. They're going to do some fun stuff.  Not that flying on your belly isn't fun. Don't kill me for everybody that loves belly flying. I think it's awesome.  But when did you know?  I know when when when I got to talk to people on the fire at that time in the late 80s.  Okay.  They did not understand of how I wanted to say things.  Sure.  Obviously also I didn't have the English vocabulary to say it in a proper way.  Sure.  But the imagine, nation and the reading in between the line, I understood the others don't  get it.  Right.  And that's understood.  It's really fucking difficult to explain them.  So that's where I came up with a new word.  I didn't call it free-fall.  I called it free-flying.  you know and free flying in itself is more like we fly away from the plane we enter the  s3 instead of an exit sure no it's a more imaginative word and I liked that and from that point on  I quoted free flying and not fun flying or anything well I'll tell you what do you you've got to have a  A real sense of pride in the fact that for someone like me who's a generation behind you,  although we're almost the same age, the word free-flying has been in my skydiving lexicon forever.  I mean, that's free-flying has been around as long as I've been in the sport and obviously much before.  And anybody and everybody that jumps now uses that as almost a second nature.  That's just part of skydiving. You gotta get a kick out of that, don't ya?  I'm very blessed. I think yes, I started a little fire and so care it doesn't go out and I gave a little spark to some other people who carry it to fire on and it's  it's it's it's like that now there's people don't go on the free flight campfire everywhere in the world and that's definitely makes me proud sometimes yes  Well, it's shit. You know, it's funny because I've actually mentioned you a number of times on the podcast and I always mention  one specific  section of one of the chronicles videos that I saw back when I was just starting out scot-having and  buddy of mine by the name of Jerry Fox had a trailer in the ghetto at Paris and  We had all piled in there after it  driving all the way from Las Vegas to jump all day and we're gonna jump the next day and  And we pop in his trailer and he lights up a blunt and everybody passes it around a little bit  and he pops in this tape called Chronicles and says you gotta watch this shit.  And I had never seen any of it before. Never seen free flying before at that time.  And the very first section of the video that came up was you to a sublime song and you were off in the distance on your head.  And you run to the cameraman upside down. You do two or three cartwheels, turn around and run away.  and I was fucking flocking, I was fucking florored.  Part of it may have been the weed.  Most of it was, oh my God, how the fuck did he do that?  And the very next day that we went out to jump,  I borrowed a big baggy jumpsuit from square one  and went out and of course flailed all over the sky,  but it was instantly because of that very first impression.  I was fucking blown away, as were so many people.  So it's I think you kind of undersell it.  You didn't start a fire.  You set off a fucking bomb.  Thank you.  Yeah, man.  No, no.  That's very nice.  I enjoy it.  You know, I have sometimes I when I think about it,  I think I have a couple more friends than I even know.  No, yeah.  Sometimes they're a person who really likes me  for whatever reason.  And I never even met them.  Enough funny cause of the videos to photos,  the inspiration, the beautiful guidelines,  which free fly and the first school of modern sky fly  was the space game.  Has kind of passed the stamp the way into what is  what could be nice, good flying.  For sure.  Now how did that start out?  Because I remember when you were coming up  with the ratings and you were using the,  what did you call it?  A space ball, the lead weight at tennis ball?  Yes, that was actually a necessity.  There was not a business trick or anything.  There was a necessity.  And if I may give you a little anecdote, basically,  I already have on my drop zone in Skydaw America,  I really have like say 10 people locals,  which fly really nice.  And we can start making 10 ways  and actually take the quips.  Okay.  Now we have 10 of us are barely good enough  to fucking try that.  You know?  So we're really happy.  We got our own playground and we are in Florida.  So now maybe one or two chronicles is already out at that time.  So free flight becomes more in the notice of the people, people try it like you do people, people teach themselves, you know.  So one day I believe someone from Texas, but let's not say text someone from somewhere else came and and he was cool.  body boy good good jump suit good week. I don't know looks perfectly normal free flyer at that time, you know and said like  Amen, I'm so cool. I'm come from there because of you guys can I jump with you and we were  Still very naive I guess there was not many people coming like this  We trained them ourselves  So we knew that people who we trained that were good church not not anyone came from outside and said like wow can do this shit  doing you know, can I come and jump with you? So we said yes and he jumps with us and  uh wow what a chaos man. I still remember that. What the fuck man I was worried.  Totally we do our thing and just do it.  You left and right everywhere. Total chaos then on the ground I ask him like kind of nicely  it's like hey man how was your job? He says it was awesome. It was so fantastic to see you guys  was just beautiful as all I wanted you know and then I said like yeah but did you not say you can do this  and he says yeah man I could do this really good I was see you all the time and I was there close  all the time and then I understood man the people think different things of what is good  no yeah that's not if someone just zooms around who no one knows and no one trusts and  he zooms around and does crazy shit in my idea because he can't even stop in his idea  because it's maybe more fun and stopping because you can't do it. And then he says and has the  attitude that was awesome and he should be, everyone should check his hand for like,  thanking him for being there, you know. And I go like, no man, that doesn't work like this.  Everyone here, really, really hard to fly really nice. That's why no one hurts each other  and scares each other, you know. This was bit on orderly. Why and why was this on orderly? He saw us  And then I said no, man, this doesn't work. Then I came up with this space board as a test  So I don't have to be the asshole telling people that they can't fly even if they think so, you know  I said for now on if you want to fly vertical in a certain  Formation then I made this ball which flies to  Exactly the same like our ten way at that time same speed and obviously straight down  And I made that as a test  I said to all my friends we all passed the test. So from now on that was the new standard.  If someone wants to come and join our group, fine. We don't need to believe you anymore.  You can now prove yourself, you know, who is this test? Sure. And if you cannot do it,  then obviously no one needs to say you can't fly because you know what you're saying.  Right, it'll answer its own question. So it took a lot of work and asshole behavior out of me  by telling people you can do it or you cannot come.  Right, which I mean at the end of the day,  you don't want to be the guy that has to shoot down somebody  that's just coming to play and have fun.  If they can understand themselves,  oh shit, I got to work a little bit before I can go do this,  then not only are they safe,  but you don't have to be the asshole.  Exactly.  It was ended up being a little business tool  because my school is very quite happy about this.  we were teaching someone towards a certain goal, which was a test.  And then in the end, we had an independent measuring stick in the sky,  the space all which we then test them on individually,  but the same idea to everyone all around the world in all seven schools at that time.  Sure. And that made a world standard and gave people a goal to work towards to.  Sure. Because if I said at that time,  If you can fly like this and pass this test and I say to everyone that dude is not so bad.  If he passes to be test and I would say to everyone that dude is actually fucking bad ass, you know, sure.  And people wanted to have that endorsement and people wanted to be part of the space games where we did the cool races with the only 500 around the pilots.  the AD challenge where people had to race in certain rotational sequences next to the space board and  Obviously you were only only allowed to be part of those  Sponsored and price-money space games when you actually tested yourself before and had the qualifications to to be even  participate sure now  And I mean, the free flying brought up a whole bunch of safety issues that weren't there  before just because of the speed involved.  So I mean, it was a necessity for you to come up with this way to assess people because  it can be downright dangerous with someone that's flying like an ass clown.  Absolutely.  And the dude I just told the story about, you know, he was just the first.  People came the next week and the next week and the next month and then they came more  more and more because, well, it got more and more popular, you know, particular, through the space  games. I believe we're almost every month of magazine printing in some country. We had a couple  of pages because of the space games. Of course. Oh, it was fucking revolutionary. I mean, when I would  get my issue of parachutists, I would, you know, you'd read the incident reports if you, if they  were there to learn lessons and everything, but then you just flip through the pictures to find  somebody that was vertical. All right, what cool shit are they doing? And it was it was no snub  against the four-way stuff or the eight-way stuff or any of that or the big ways. It was just that it  was so different and so new looking and so almost alien that you were just attracted to it. Like,  holy shit. Look what they did this time. I totally agree. You know, and I did get a little  shit of it and I did make a little fun of the belly fliers, you know, things like that. Sure.  The people I didn't start the belly flanges because they wanted to make fun of the accuracy guys  They're on fun. They wanted to do having fun their own way and then the accuracy skies  They probably said also of f**k you belly fliers, you know, you you special people  Sure, you bet well, I think everybody still kind of makes fun of the accuracy guys  There's the drain with the good neck jafries and and stuff and then Thomas training them still you know  or ESP that was actually.  And then we made jokes about each other.  Because free flight was still new.  Did no one really knew kind of.  You know, the old thought it was a phase.  Sure.  And I say like, are you guys still training  the student body position?  Well, I remember seeing a video that you did  one really cool jump where you were in a super baggy suit,  almost like one of the old flyaway tunnel suits.  And you were free flying around,  I believe it was an eight way belly.  and you'd go up through the center and then roll over onto your head and then dive back down  and be at a sit flying carve around them.  And it was just this beautiful kind of mixing.  And that's the beautiful movie which Patrick pass and Wendy Smith made.  Yeah.  It's called Crosswind.  It has a super collect of all kinds of different beautiful flying in the beginning of the 2000s.  Sort of.  Yeah.  And it was fucking gorgeous because it was this beautiful mixing of the two disciplines.  I mean it just it showcased the dynamic ability of free flying and the stability of belly  flying and it was really super cool.  I think it's one of the most photogenic pieces I ever was allowed to be part of.  You know it was all the smoke and the cool people flying there and also some baseball  tricks and dancing with Stefania.  Oh man, that one.  That one you know it was kind of funny because that video I wasn't even paying  attention to the video at the moment. I don't remember it was being showed with a large group of people  and I only caught the beginning of the first jump out of the corner of my eye and I looked over  and instantly knew I'm like holy shit there ballroom dancing.  Hey, yeah, that's what fucking was it was? Yeah, I was blown away because it came through perfectly  100% and I'm like he's ball how the fuck is he ballroom dancing on his head? And this is at the  time when I'm still working just to stay on my head and you're ballroom dancing. What the fuck?  Hey, in the end, it's the only trick is one needs to manipulate immediate air around a human  body in such a way that flight is possible.  Sure.  It does nothing but do.  Every belly flyer does it.  Sure.  You know, even an unconscious person manipulates the air around himself, but just not  consciously sure.  So even that fucker is free flyer.  I don't know.  The other way he wants to go, right?  the trick. Look ahead like driving a motorcycle, see your curve in advance, intercept,  make interception timing kind of curves with the others. So you know where to go to meet them at a  certain time. It is badass. I think free fly took the stalling out of falling. There's no way  you can stall as a accomplished free-fire.  Yeah, absolutely.  It's a little bit related to air around you in such a way that you can have control of it.  You learn to fly in any orientation, absolutely.  Now, it's kind of funny because it seems like your mentality is a mix of what I would think of as a very  strict German technical and very hippie all at the same time.  So you've got it.  It would mean to each other very nice.  Yes. I do. I did write down all those procedures  how to train the student, how to train the teacher, how to  train the teacher, how to make a competition, how to  train the judges for the competition. And then I put a  lot of work into all the different schools in Argentina,  Brazilian, Venezuela, North America, all over Europe,  Asia, Australia, applying or at least suggesting those new ideas to the  AeroClaps. Sure. They all start making their own little teams and that's why we  have a world championship. Yeah, absolutely. Well, in that part of it, very much  seems very, very German and regimented. And then the watching you fly though  seems very hippie. And by that, I mean, just very free. I mean, as the only word  to put it, it doesn't seem calculated.  It seems very free and very relaxed and very easy.  And that's one of the things that I was always impressed with  coming up in the sport with the really talented free flyers  is watching.  It just seemed effortless.  I believe that, you know, what is the goal on making a sport?  On running for example, it's to be energy-conservative, you know?  What's goal on a sprinting sport is to pump it out in a short amount of time.  So you must do both at all time, even if you go full power, like the sprinting sport in the sky, that's the sprinting sport.  And that direction is, I think that's why also some free flight techniques in the modern tunnel.  There are different than the original free flight techniques in the sky.  because in the tunnel you have an endurance sport. People want to fly half an hour an hour.  You can't do that with original free flight techniques. Sure.  You would out too much energy for you couldn't you couldn't do it. Sure.  So tunnel tunnel techniques are not necessarily better flying techniques,  but they are better flying long lasting technique. Sure.  a marathon runner, you know. He wouldn't run full power right away either. You couldn't do it.  And if you would be a sprint, I wouldn't run like a marathon runner. You wouldn't ever win.  Right. Two different leagues, even if you do the same fucking thing, you'll run from here to there.  Sure. So, and when did the competition stuff start to come into play with free flying?  Because I remember in the beginning it was it was the competition side of things was kind of slow  to start wasn't it? Yeah well first it was Pete McKim and with the SSI  pro tour which took over freestyle and sky surfing and pitched up to the ESPN  network and that was in 91 in Vero Beach that was the first official  competition for that. I was invited on that it didn't get a medal but showed my  free fly stuff, my head down stuff and that was they said there was unique  there never seen anything like this before so from that point on the year  after I had my own team which was Michael Mike Mike Vail, myself we were  at the free fly clowns you had a year to play and we rocked it after that  Mike Vail was that as student you know picked him up after AFF and even packed  for him just because I was so inspired to finally find someone to hang out with and  and teach him flying really cool. Really? He had money, he had money, he was a hippie and he wanted to.  Yeah, I mean he was another one of those characters that you'd see in some of these videos flying  around with these massive dreadlocks and of course the clown masks and stuff and it just was,  it just looked like so much fucking fun. It just looked like there was nothing that wasn't amazing  about it. It was, we had good music at the time, all this crunchy music, supply and rights.  It was a very badass young man time for me.  Yeah, well you know it's funny because if you talk to a lot of the skydivers of our generation,  most of them, if you ask them what kind of music, reminds them the most of some of their  favorite times in skydiving, sublime is like the number one band. And I can tell you right now  For me, it's specifically because of how much you guys used it in the Chronicles videos.  You guys, you guys, it's been that man.  Yeah, super dear, was those guys' charts, was used to be a musician.  He knew them somehow.  At the time when they were even famous.  And I think to supply them with the Chronicles,  it was the first time that in Europe people said that they even heard supply them.  Was on our Chronicles.  Yeah, man.  Imagine.  So that's fucking, that's epic.  Yeah, I don't know if that's really really true, but I hear that a few times  So for sure they were in the beginning of their career the sharing people so now when did the big free flying competitions start when when did it really kick off crazy like that?  I think my most important free flight competition which I would have not  Like to not win was in Spain 2001 was the first world championship the first world air games where free flight was included  And for me, that was a big milestone as it was to cherry on my cake or free fly creation  sort of.  You know, finally, there's a world championship.  So I want to I want to do in it.  And we did win it as the Americans.  I was an erased and American flag was this work.  Nelson.  Nice.  Yeah.  Yeah.  Swanson.  We were the team.  Nelson, Mike Swanson and Olav Zips are in 2001. That's fucking cool. Now it's kind of funny  because I tell you that I was introduced to you and you know getting stoned in a trailer  in Paris Valley watching chronicles. But in 1998 you competed in the US Nationals in  Elsinore. Do you remember what what discipline you were were competing in?  I think you're mistaken. It was not out to know it was Paris Valley. Oh, Paris Valley was  the one you were in. Well, I think you must have been at the 98 nationals then in  Elson or because Omar was competing in what was it, a freestyle in 98 and I was competing  in Skysurfing and that's actually the very first time I ever met you was in the 98 nationals.  Are you sure was Elson or not, Paris Valley? Yeah, positive because we were all sitting on  the grass getting ready to do jumps and maybe you had just hopped over for the day because  the nationals were going on. It's very possible.  but if it was asked to stay, I would have probably competed because I was an American competitor, you know?  Yeah, it was it was it was 98. 98 at Elsonar for sure. I'm actually sitting here with the second place medal  I got with my my Skysurfer. Congratulations. Yeah. Well, they're there were only two there were only two teams, but don't tell anybody.  I don't know if you're happy.  I can't do metals like this.  I only competed otherwise they would have had  not a competition.  Yeah.  Actually, it was funny because my Skyster partner and I were just going to do the open  or not the open, but just the intermediate.  And there were no teams in intermediate.  And there was only one other team in the open.  And that was Craig and Tonya Garcia.  Yeah, they knew what they were doing.  Yeah.  And so they asked us if we wanted to compete in the intermediate.  and we're like, no, fuck no, I'd rather get my ass kicked by Tanya than when a gold by myself.  So we went and Craig and Tonya kicked our asses.  So 2001, you win the world and you actually ended up competing in Skysurfing at one point, didn't you?  Yes, I am. As I traveled and went to oil competitions mostly for free start or free fly later on.  you know I always sort of like,  man, let's do the other competition too.  You were allowed to compete two times.  Sure.  So I did just for fun.  You know, I will never win it a good thing.  But I also did, I was a skyser,  as a skyser for myself,  I never really won much for nothing actually.  But as a competitor,  as a skyser of cameraman with Eric of Pade,  or Sean McConaug, or even Gaudencia Martinengo,  we made metals at the world, meets and also metals at the X Games.  Sure. Well, that was actually, I think you were the first person I ever saw,  um, um, do camera flying for a Skysurfer without wings.  Yeah, there was a 95 with Gaudencia and, uh, that was awesome.  I got an Emmy for this kind of flying over there.  Yeah, and it was impressive as fucking hell. I mean, it was, um, just mind bending at the  time because of course the best of the best needed those wings for the dramatic  speed changes in Skysurfing and here you are in a baggy free-fly suit just banging  it out in the most unique way and it was fucking fantastic. That reminds me of  the I think it was the parachuteish cover shot of you free-fly and holding your  Emmy. Yeah, I don't know there's been often there's a few Emmy shots  was me often. That's bad. So, Wiscau Densia, that was a really fun team. She was the  sister of my girlfriend and she was awesome. She was one of what she was the best.  With Rydi and Descartes, you know, they were the best guys of us at the time.  And was a proud iron for awesome first extreme gains with super, super event.  Super cool. It was kind of funny because I had Andrew Ford 40 on here a while back and he told me  that he was actually in a competition where you were sky surfing and the funny story that he told  was that you had put your release handle for the board was on I guess on your hip where it was  supposed to be and you'd stood up and the cables were too short so it was releasing the bindings.  So you just unsit the fly on the jeans that you were wearing and stuck the release hand  out of your fly.  Which is fucking awesome man.  That is awesome.  Hey, you got to do what you got to do.  You got to do what you got to do.  Right.  Man, that's fucking epic.  So you go through all this competition and stuff and then free flying is now taken off.  It's a full blown hardcore sport.  And then here come the tunnels and they turn the whole scativing world on its head.  And I don't know that anybody saw that coming because I worked at the old Las Vegas tunnel  where you know, you could barely manage to do kind of a tracking carve in the tunnel because  the wind was so slow.  But I was in instructor there back back in a day day and it's still going strong.  But these modern tunnels man, what's your opinion of them?  I think Skydiving is it's gonna die slowly. It's a pessimistic idea. It's gonna die slowly.  But yes, space is gonna get more crowded, a few more expensive, flah-lah, the risk factor will be  calculated differently. Plus, it's so much more easy to spend all your money. In a ton of these days,  if you would only drive 20 minutes down your city block and you find a tunnel in every big town now.  Yeah, so it's super convenient for for people who like to  Learn to fly. Yes. It's a fantastic new revolution. Yeah sad for skydiving. I believe but good for for people good for the news sport of  Channel flying yes, yeah tunnel flying. I definitely I think it is a completely different sport  I mean obviously you're still flying but it's it's a whole new world for sure  I don't know that I think it's the death of skydiving, but I certainly think that it's gonna confine skydiving too  more destination drop zones. I don't think there's going to be so many  drops on scattered around. I totally agree. And plus all the  imagine all this calculation. I mean like how many tunnels out there? I say  300 which you agree. Oh, if not more. Okay, that's just 300 300 times let's say  4 million. That's fucking what? 1.2 billion dollars. Yeah.  They just construct cost. That's missing in the skydiving industry. Not only  this order money which people pump into it. That's maybe a three, four billion dollar industry  which they have created and all that money is missing in skydiving in some way.  Yeah, no, I agree. Well, and I think the other factor that plays a part with the general public  anyway is the danger factor. They think you're only going to get bumps and bruises if that in a  wind tunnel and everybody thinks that's kind of a new dangerous, which it is. I mean, obviously,  there's more risk involved when you start throwing thousands of feet and nylon and string into  the mix. But yeah, I completely agree with you. I think that the tunnel industry has definitely  taken a lot from the skydiving industry in that respect for sure.  It's a complete disruptor. Disrupting ideas are always good. Freefly was a little bit of a  with this raptor and itself.  Sure.  It's just evolution.  I congratulate everyone who went early into this business  and probably made it quite healthy.  Oh, yeah.  This business, yeah.  So now we speak in a very long time.  But 100 not only had the beauty of nature.  I think to say very strong, I would say,  to swim, to learn to swim in the ocean of gas,  you need to have air around you or water around you.  without water you can't learn to swim, right?  You can learn to swim in the bathtub,  in a swimming pool or in the ocean.  So there's the difference in a bathtub  in swimming pool you will have zero risk  or very little risk.  It's very controlled environment.  You have no waves, you have no fishes, no sharks,  no coral reef, no shit.  Sure.  Oh, but yes, you can learn to swim  and swim really beautiful.  Why not?  Everyone can have fun swimming,  but I like to have fun swimming while flying next to the clouds,  chasing rainbows.  So little cars driving on the freeway,  seeing the boats going to the island,  see the coral reefs and the colors around it, you know?  Oh, absolutely.  And that is something which in a tunnel,  maybe one day was augmented reality and shit.  Maybe you can do it better there,  but I enjoy the beauty of the nature.  Yeah, I heard a comment once that I thought  was pretty apt. It said, nobody stayed on the treadmill in extra 20 minutes to see what was  over the next hill. You know, I've never been sitting waiting for my turn in the tunnel  and had to take my phone out to take a picture of the amazing clouds I was flying by.  So you're right, there is no way to simulate, at least not now, no way to really get that  type of feeling out of it. And that experience in skydiving, because that's unique to  this board. I mean, you know, and you're  eekness makes it worth it. I believe. Oh, yeah. I mean, when the  hell else do you get to hop in some plane and after you're above  a thousand feet open the door and dangle your feet out the back  of the plane and just watch the world fly by. I mean, come  on. I've never considered myself anything, but lucky that I  get to experience that kind of stuff. Absolutely. Now, I  I think like 24,000 jumps or something like it.  Now I've had the opportunity to sit a lot of time next  to the door being like sort of the Lord master or something.  Wow, my favorite time on planet earth is sitting in that door  and just fucking glaze out and let the door plan  and go past me.  Oh yeah, I mean, it's the same as the same as the same.  It's the same as the same.  It's green chair ever.  Oh, absolutely.  I mean, it's the same for me sitting up front  when I'm flying the plane and I've got a minute  to just kind of look around.  And I can't count how many thousands of photos  I've got on my phone because I just had to get a picture  of this sunset or that cloud or this view of the same piece  of ground I've been flying over for God knows how long  but I gotta have another picture of it  because it's just a damn beautiful.  I mean, I don't know.  There you go.  Yeah, and I don't know anybody sitting in an office  that holy shit, I gotta get another picture  of the coffee machine.  We are blessed by our own space time design.  Now, a speaking of shaken things up, you have had a long time desire to try and blast yourself  into outer space and make a jump from space.  I did.  I started with high altitude jumps early times in the 90s and skydive Davis.  They had a king here which went really high.  I did some little military jumps kind of in Germany.  Then I got a super duper opportunity with Patrick the Guaya Dong.  1995 just after Russia was finished being Soviet Union.  We went over there with a little budget and we rented an illusion 76 and shot ourselves up to 47,000 feet.  Made our own little spacesuits and was fucking crazy mission.  but it was awesome. And it inspired me to do that all one day better with less risk and more scientific  benefits from after doing such a stunt or research mission. Sure. And since then,  I think it was like 99 or 2000 when I got again more interested in this. And I researched some of the  private rocket companies which like SpaceX was not even existing at that time but there were some private rocket companies like  a modeler, aerospace, inter-orbital system, X-core, other little ones and I put a lot of effort into it to get some good connections and get to  to get the permission to visit those rocket companies  because I wanted to get myself a rocket and do,  I still wanted to build a better space to it.  So people can buy out two jumps and maybe come back  from space one day as a biomechanical flex wing.  Well, hadn't they looked into an egress system  for the astronauts?  And that was one of the thoughts was that they would be able  use basically a bailout and parachute system to be able to do exactly that.  Yeah, on ascent? Yes. Yeah, that was the escape. Yeah. Yeah. Yeah. But you know what?  All the astronauts technicians or space engineers which I have the opportunity to talk to in  Russia or America, they have never really considered one thing that the human people can fly  I'm self.  We, or I particularly, I truly believe I can manipulate the  around my human body that I can fly, stay in control.  Yeah, when that is possible in the low atmospheric  pressures or with high speed, even in high atmospheric  pressures, higher altitudes, then one can do such things.  And there are other opportunities which we developed  in how we can keep control even at higher altitudes,  where there's no atmospheric pressure to fly with.  People in everyone who, all the spacesuits,  which I tested, all the engineers,  which I ask and interviewed,  they never considered those kind of opportunities  that you actually can see or something from the inside out.  Sure.  And that is of the big factors,  which we believe makes it feasible to even attempt  such research missions in finding  that makes a benefit and can be implemented into a future space suit,  in space emergency rescue solution.  Wow.  Well, you know, it's kind of, I've stopped thinking things aren't possible anymore.  Now I just kind of assumed that eventually everything's going to happen,  because every time I think there's no way somebody can do that,  somebody goes out and does whatever it is I think they can't do.  It just becomes more and more amazing.  And it's super cool, especially in a sport as young as skydiving,  to see the crazy growth in the abilities of just the average skydiver from the lowly AFF student  all the way up to someone like yourself. It's just amazing what a short small period of time our  sports been around and how much it's grown. Yeah I think modern or new or different modified  teaching techniques are the key for faster development. The way we teach these days, the way I teach  someone is different and let's say one of these traditional military teaching programs.  Definitely different. Sure. And the way we teach is this beauty and harmony and fantastic  control by saying like we fly away we don't fucking exit something you know we don't  plummet somewhere and then try to get control no we fly away with control right away  and we manipulate it here we're not just pushing ourselves on any air cushion or I don't know  in now in the moment of what the differences are in the way you can with different pet  and go get kind of take the fear out of future students.  Sure.  Well, and that's the thing too, is the more you give them the knowledge and the techniques,  the less that part of the fear is there because that unknown is taken away.  There's always going to be that little bit of fear in there should be because like we talked  in the beginning of the podcast, that fear is what keeps you sharp.  It's what keeps you safe.  That alertness should never be gone.  should be there forever, but being able to take the fear of flying out of the equation is amazing.  Yeah, I believe people are like, what's this or something? You know, we have a certain sense,  which if I put myself under the wings of someone else and expect him to keep me safe and teach  me something, I kind of probe him for all his emotions. If I see that that person is nervous,  then I get nervous too as a student, you know. If you are a writer or a horse and you don't know  what to do, the horse will know exactly that you fucking suck in writing and don't know how to do.  So I think all students feel this unconsciously from their teachers also. So if you have a teacher  who can't free fly and is worried doing if, if that maybe your student is falling on the back  and they can't get them, then that fear is to telepathically somehow transmitted to possibly  the student as well. Sure. And yeah, I think a better educated teacher with a more self-confidence  can possibly be also a better pedagogy for teaching people in the sky.  Oh, I completely agree. I mean, the more well-rounded you are as an instructor,  or even if you're not teaching all the disciplines  that you know, the better you're gonna be able  to impart that information to someone else for sure.  So what is Olav's upset to these days?  Where have you been jumping lately?  Well, I've been traveling since I met you last in Dubai.  Remember, I was definitely,  this is already years ago,  or three and a half years ago.  I had a beautiful opportunity to work  with the sports government in Botswana.  My job was to investigate the country for a year and find airplanes to travel spots,  places to land, did some demos here on the earth, did tandem.  And basically the idea was to investigate if it's feasible to make a sports center for  skydiving in Botswana.  OK.  That was a beautiful job.  I had a lot of animals.  lot of animals had a little, even for myself a girlfriend there.  But research girl was awesome.  spent a lot of time in the bush with all the wild animals  and jumped out of medical helicopters,  took some cool people and landed them places.  That's awesome.  Yeah, that didn't work out after one year.  The contract did not get in green youth and some problems  in the local government.  Someone died also.  I was a new governor on place no one knew nothing about nursing us any how big chaos and it was too difficult for me  Then I spent a year in Namibia traveling there jumping all over there  Then I spent some time in South Africa also looking for maybe a new opportunity to create a new center  And that's exactly what I'm doing now in Thailand nice  Since a year and a half now in Thailand and I really love it there  It's a beautiful spot.  After Venezuela and Africa, a question kind of in the lifestyle, in the politics and the  behaviour of the people, I think Thailand is a blessed country by beauty and harmony and  just a soft lifestyle.  I'm not really foxblows.  It's beautiful.  And it's, I mean, you've been doing this for a very long time.  So the, the high stress and, and, uh, fuss and in fighting to get stuff done can't be appealing.  It certainly isn't to me.  No, getting visas, working permits, uh, you know, resident visas and shit like this.  That's the probably the biggest hurdle in my life, which I have to overcome every couple  years because I decide to, uh, have more adventures in another country and, and do what  I can do it. I'll find new places, teach new people and have fun.  Which is amazing. So as we start wrapping things up, what advice do you give to a few different  groups? What advice do you give to newer jumpers just finding their way in the sport? And  what advice do you give to jumpers that maybe think and shit there's nothing new? I don't  know if I'm going to keep this up anymore.  Wow. What aggressive? What advice I would give to everyone is like, um,  Keep it fresh all the time.  Don't always do the same thing.  Think before you fly and try to design something in your third eye.  Close your eyes.  Imagine it.  If you can imagine it in your eyes, in your eyes,  and feel your muscles while you imagine yourself doing a new flying maneuver with your friends or something,  then you probably have a good chance to actually do it in the sky.  if you can imagine it. If you can't imagine it, then maybe not be so open in trying new things right  away all the time. Because it's probably very difficult to just do something in the sky. If you can't  even imagine of what you're supposed to do before, you know? And I see, yeah, well, maybe it sounds  a bit negative, but I see people jumping into two difficult flying techniques with other friends  to early. Sure. And that bothers me a little bit because I really tried to work on not putting rules  on things but putting safety guidelines, you know, ideas, inspiration of what should someone  think before he thinks he's good and then try to mess with 20 other people in the sky. Sure.  Sure. Well, I kind of lay social media to a little bit of blame for people kind of getting ahead  of themselves with stuff like that because they're able to see things nowadays that when  we were starting out in the late 90s, you didn't get to see the free flying stuff unless  somebody had a bootleg copy of Chronicles.  And you know, or maybe you got to watch somebody that kind of knew how to free fly because  they happened to put their video up in the bar.  And that's the only way you got to see any of it.  Now all you have to do is write skydiving or free flying and put it on YouTube and you've  got millions of videos of badass people and a whole bunch of bad ideas for somebody that  doesn't know what they're doing.  Totally agree.  Hey, but what can we do, you know?  I think it's the full of people I inspired and what they do with the inspiration is obviously  up to the individual of how to decide if they're on a, which way they want to proceed, you  Yeah, for sure.  I mean, anything can be a weapon or used for something good, you know?  Well, I suppose it's better to have inspiration that might be out of reach a little bit at  that time that to have no inspiration at all, right?  I totally agree.  Imagination is more important than knowledge.  You can always imagine something new.  Oh yeah.  But if you just have a certain knowledge, then you fucking stocked with that shit.  I couldn't agree more.  I could not agree more.  Well, you know, it's funny because again, I like I told you my first introduction to Olav's  Epsir and to the free fly clowns and to free flying at all was that worn out tape in that  little trailer in Paris Valley.  So to be able to, and it's funny to use the word hero, but that's a good word to use because  I didn't know you back then.  And you absolutely were somebody that I looked up to and  aspired to do the things that you were doing.  And even though you're only just a few years older than me,  it was always this almost irreverence for what you were able to do.  And then having met you only briefly way back then I still held onto that because I didn't know you.  And then of course I got this finally sit down and talk to you 20 some odd years later over the course of our time working in the same facilities.  And when, all right, on top of everything, he's fucking cool.  Shit.  Well, thank you.  Yeah, man.  Yeah, man.  I try.  I try.  I like everyone should be crying.  Not to be cool, but just be yourself.  And then other people can tell you who you are.  Absolutely.  You just, people can just do what they do.  If people want to change themself  and pretend certain things in this really tough to judge them.  Agreed.  I completely agree.  the people you are bring what you can bring and have the happy vibes and suck them all  from other people so you can give them on to other people.  Damn right.  Damn right.  Well, all I'll tell you what man, I cannot thank you enough for taking the time to sit down  and I have this chat with me and I know there's a lot of people that are going to really  enjoy hearing what you've got to say.  Oh man.  Thank you very much Dean for this opportunity.  I wish all you guys who ever hear this, please all free fly your mind.  you know, think about things, space time design your life, you know?  And I hope to speak to you one day again.  Oh, you know we will man, it's a small world and a smaller sport.  I can't thank you enough.  Okay, all the best and hello, hello, hello.  Well, there you have it.  Another episode of the lunatic fringe podcast brought to you as always by, well, wait,  not as always, actually.  Rottie now by Gyro.  Formerly known as Enziero Sports,  you'll head to gyro.com  for their next level line of canopies.  By Pussfoot, the Extreme Sports Collective,  head over to Pussfoot.com to check it out.  By Summit Parachute Systems,  check out Summit ParachuteSystems.com  to talk to Jared Martin and the gang  about kick ass pilot rigs, rigging courses, and more.  By Flyaway indoor skydiving, go to flyawaytn.com  check out all the cutting edge stuff to come.  By Pure Spectrum CBD, head to PureSpectrumCBD.com to check out their wide range of CBD products.  And as for us, head to the lunaticfringepodcast.com to listen to any of the hundreds of  episodes currently available.  Hit the link for our YouTube channel, pick up your copy of the lunatic fringe book or the  accidental stripper, and get a sneak peek at upcoming guests.  Once again, thanks for listening.  We'll see you next time.",
  "created_at": 1755526687
}