{
  "podcast": "Two Grumpy Vets and a Duuude",
  "episode_id": 41350250744,
  "episode_title": "Adulting is a Lie: Send Help (and Maybe Snacks)",
  "audio_url": "https://op3.dev/e/serve.podhome.fm/episode/d85119fb-b5bf-437d-2ae7-08dc551f1aab/638910429465478310aeb4f44f-5338-4779-96d8-e362c92edaa1v1.mp3",
  "duration_seconds": 9776.264,
  "text": " That's a good start.  Yeah, that's saying, that's saying Bella doesn't do that too much once in a while.  Phil, you know, if I'm sitting in my chair or she'll, you know, put a front pause on my  Let me get me a hug or something, but right.  You know, and everything, but normally no, no, she's not  to type to jump up my own me.  No.  Yeah, that rain is a lap dog.  Well, it's not yet.  I mean, you know, yeah, granted, you know, I only got her last  Friday.  Right.  So.  But yeah, she's not right, though.  But have you looked on,  well, we talked the last night.  I got to look and I went ahead and looked up the,  there's a map called Wag.  And you know, there may be somebody who is a dog walker  in the, in your area.  Well, close by, I mean, my big 10, 15 miles away  and I may be willing to drive a little bit of waste.  Yeah.  So I might look, I just,  It's just yeah, the last few days it I've been feeling like I used to feel before I stopped working  Right, man. I mean I seriously last couple days. I've been I've almost been wanting to cry I've been hurting that bad  You know, it just because it's like fuck  You know, I mean I still I still take around. I don't you know, I don't shirt from that, but right, you know  But yeah, it just  I don't know. I'm trying. I'm going to have to wind up and go back to ortho and maybe physical therapy.  Yeah, see, they can figure out what's what that stat and did to you. Yeah, because it's  because I mean, you know, I've, you know, I've told them I hurt and all like that and they don't  say that I'm not lying, but it's like they're just I just I just kind of feel like they're  pacifying me. Yeah. As I know, motherfucker, if you don't get it, trade me.  Try. Please. Just one day of, you know, doing this and, and, and just feel it for one day.  That's all I'm asking. Yeah. I mean, shit, when my backyard's bad enough to wear,  I have a hard time breathing. It sums up. Yeah. Now there's, there's something there.  for sure. And it kind of makes me mad because, you know, I want to go out and make videos and  shit like this, but I'm trying to get my routine down with, with, you know, bellowing stuff like this,  and it's kind of get through this. Paying this just like, you know, make it. I mean, I will figure it  out. I'm not saying alone. I will figure it out. I believe it. So, you know, I mean, you  know, I won't keep it. I have a fine feeling that you would. Yeah. And I mean, I mean, I mean,  she is a sweet dog. Now, we'll say, I'm not sure if I'm not sure. See, she likes cats or  not. Right. I can tell you for a fact, do not let her see a cat in her yard.  As it was funny the other day we was out walking and we walked around the house, right?  And apparently, well, there's a black, straight cat. You know, I've seen it couple times.  I mean, Cat never messaged with anything.  So, you know, I don't worry about it too much.  Well, this cat was under the house.  And she, I guess, spoke to the whatnot.  And it bolted out from under the house and oh my God.  I'm glad I was prepared because when she got to the end  of that leash, I just held firm.  And yeah, he really wanted that cat.  It's a good hunting season.  Yeah.  That's, yeah.  Then more than likely it's not a good thing  to have a cat around her.  Well, you see, that's the thing.  I don't know because I don't know how many cats  she's been around and see what was funny.  Out in my backlight and dude saw, what's up, dude?  I've got a flat piece of concrete and that cat likes to hang out there and when we were  inside, oh my god, she spit most of the day at the back door watching that cat.  She's like, motherfucker, you.  And then, you know, few hours later, that cat moved up closer.  We said by the tree, so I went and got a leash.  I said, come on.  And so we walked outside.  And I mean, I knew exactly what was going to happen.  I mean, you know what's going to happen.  Yeah.  And she bolts and launches into that leash.  And I'm hanging on.  And that cat takes off.  Haven't seen that cat since.  Ha ha ha.  Well, cats gone, don't you?  You used to be crying here.  You used to be off, friendly for the early time.  I got one of the other things around.  Right.  Oh, and now anytime we walk around the house,  she's sniffing under the house.  I mean, if I let her go,  she would crawl under the house and check.  Right.  I'm sure she wouldn't fucking try to kill that cat.  The thing is, the cat's not there, but by God,  he still thinks it's there.  Well, the sense there, yeah.  You know, it's just fun hearing anything.  I'm like, no, come on, girl, come on.  You know, and then she'll, okay, fine.  And then she'll walk a little bit,  and then she'll try and nose back up under the house.  I'm like, ah, nope, come on.  Oh yeah, it's funny.  But yeah, no, it's, yeah, I don't know exactly  what she'd do around the cat, but,  I don't know if I'm gonna find out.  Yeah, I guarantee you she will fucking slap that cat about the head and neck region a bit.  Yeah, you know, she might, but say I don't know.  I mean, I mean, she is curious about cats because I've got that stuffed animal.  And so yeah, okay.  The first stage, oh my god, her attention was on that thing. She's like, move.  move. I'm on move. And it went moving and she knows it. And it went move and then finally  she's like, okay, it's thing. I'm leaving. And yeah, that's no fun. I don't want to.  And hasn't and hasn't messed with it since? Nope. Nope. Nope. But I do know she does  not like the vacuum cleaner. Most dogs don't. Yeah. Yeah. Now I pulled it out today because  I mean, it had been a while since I had swept or anything. And the house was looking kind  of rough. So it's like, yeah, I needed to do that. And so yeah, I pulled it out. And I mean,  And he didn't go nuts, but she made it to her to stay away from it.  Did she try to bite it at first?  No.  Nope.  Nope.  Well, I'm just an unfamiliar sound.  Yeah.  Yeah, it's just what it was.  She's like, I don't like that sound.  You're like, nah, and then I switched it off and I had to move the cord, so I left  it where it's hit.  And it was in living room.  I was going to wear.  She was hanging out at, right?  Well, she come walking by the vacuum and brushed up against it and it bolted.  Yeah, that was going to be me.  I'll jump.  So and then I moved the cord and then I wound up in my bedroom and I sweep it in my bedroom  and she had come walking in and was on the far side of the bed and I flipped the vacuum on.  Yeah, boom, she's gone.  She's like, yeah, no.  And then I said, I'm done.  And then she walked to the house to make sure that it wasn't around.  Right.  So, yeah, it's been kind of funny.  That's why it's for me.  Yeah.  Dogs are very interesting.  especially when they're racist.  What's that?  Especially when they are racist.  Oh, when they're racist?  Yeah, my golden retriever.  Oh, yeah, you talk about racist.  Oh, hell.  You, black person come by?  She was showing, I mean, we had two kids,  one of them don't post housing,  had my yard fence down,  and then the next housing,  because I was in an eight plex,  the next eight plex. You know, had their fencing. So there was about probably 40 feet in between  the fences that was just common, just common area. So these two black kids were walking in that  common area. My dog hid behind the fucking big tree that we had in our backyard hid behind it  and tell those boys got close enough to that fence. She bolted out from around that tree showing  teeth scared the living shit out of those two kids. Oh my God. Oh, yeah. If you're black,  she was show teeth. My next door neighbor was a black family. His name was that nail.  And if he was out in his backyard, oh, yeah, Augie would fucking go nuts until  until Nell got the hose because this dog, if there was any water around, she was in it.  So he got the hose out and was like, you know, playing with her with the water.  Jim had problem one with that when he shut off the water.  He was black.  He had a problem.  So he he's spraying the water, letting her chop at the water type thing and then just spraying  on her because yeah, she just loves water.  And then we call her in.  She's so fucking wet.  And I look outside and this fucking blue sky.  I'm like, what the fuck?  How the fuck is this dog wet and the ground isn't?  What the fuck?  And then about five minutes later, Nell comes knocking at my front door and I'll  He's in the house now.  Oh, see's now.  Oh, yeah.  She about went through that glass door after him.  And so we got all of you back in the living room.  And I went outside.  He's like, oh, by the way, all of you was outside.  And he, you know, you know, he doesn't like black folk.  And we black folk.  And so I just hosed her down.  She loved that until the hose went off.  Oh, yeah.  So he's frayed her with water.  And about five minutes later he comes and explains.  It's like, okay, not a problem.  I'm like, Jesus, dog, you're fucking just, wow.  As long as a black person is, I lose with water.  You find.  It's a, if they don't have, yeah.  If they don't have a hose, oh yeah, you're gonna get bit.  Oh yeah.  Well, I gotta say, I gotta say, everyone that,  I'd say a bell has been around.  She loves everybody because I went and saw my neighbor Ray.  I mean, he didn't get too close to her and nothing, but she was on the leash and didn't  try and bark or nothing.  And my neighbor crossed the street.  Johnny, he comes over and oh yeah, oh yeah, Billy just loves her.  And then when I took it to the vet, I found out that Bill of the Life was in the  like she's with us.  Because the vet walked in and I mean, I mean, the vet's cool, but he's a little weird.  He was he walked in and him toe shoes and those things, those things look kind of weird  anyway.  But I mean, he was cool.  Nice guy.  And yeah, yeah, freaking brother walked up to each of them.  of the assistant him and yeah, they were just patting her and all like that shit, bellows  eating all that up.  Okay, I'm good.  And then found a cheese with his, oh my God.  So yeah, Auggie was Auggie didn't get cheese with, but I tell you what sliced trees and  block cheese.  If you had it, Auggie was dead up in your face.  Really?  Where's mine?  Where's my cheese?  There's my fucking cheese at.  You're eating cheese, why am I not eating cheese?  Right, right.  Oh yeah, that dog was addicted to cheese.  But cheese was a little bit too expensive,  so the dog never got cheese with.  Right.  Yeah, no, it is.  I mean, I don't know.  I'm just trying things slowly because, you know, I mean,  she's a year old.  I mean, I don't think she's been trying at all.  Like honestly, for being a year old and being as trained  and as calm as he is for the most part,  it's crazy, man.  It's crazy.  I wonder the situation with the family that had Bella  before you didn't for whatever reason have to give her up  if they moved or moved into an apartment that didn't allow  ads or you know, whatever. And they basically had to give her up or do you know the story?  All I know is that all I know is that Bella was a stray Bella was.  Yeah. Yes, Bella was a stray. And they, uh, they put her birthday as about August 1st of last year.  You know, it's an approximation. But so, so, so with think about it, the first eight weeks,  So the first two months of an animal's life,  they're just puppy puppies.  Oh, yeah.  Yeah.  You know, they're just learning everything.  And then, you know, I don't know if Bella ever had a home,  but if she didn't, the next 10 months,  she was roaming the streets, I guess,  is the only thing I can figure out  and how she's so mild mannered is beyond me.  I mean, it's great. I'm not complaining, but no means.  But it's just, it's weird.  Right. And to be housebroken and, you know, that kind of stuff.  Yeah, I mean, I mean, she's had about four accidents in the house since I've had her.  You know, it was, which, you know, I expected, you know, a few accidents.  I mean, that was wild, I guess.  And then in a kennel for two months.  So, you know, it's like, okay, you know,  I mean, I didn't get upset at her because,  you know, she's still learning everything.  But as far as, and I normally take her out  every couple hours, you know,  two three hours, whatever, just to walk around.  and everything like that, just to, you know,  get her on a kind of a routine.  Right. And everything.  And I try and like it like eight nine o'clock at night,  I don't give her any more water till the morning.  Is right.  You, he will have an accident.  Without a doubt.  Yeah.  So I just, I just hold off and then in the morning,  You know, we, we, we start process again.  So well, and I'm sure here probably shortly, if I was a  Batman, she'll give you some type of sign that she needs to go  out, like a nose nudge on your hand or a bar or, you know,  something like that, you two will get a pattern developed.  right. Yeah. And she's, she's the someone that started that is, uh, I mean, not now on a regular  basis, but like, you know, she tries to, you know, put her front paws in my lap and then  nozzle me and stuff like that and get excited. It's like, yeah, I probably ought to take you out.  You know, yeah, that's it. So, yeah, and see what's  cool. Well, it's weird too. Okay, put her leash on her, take her out. And then when we get  back on the porch, I take the leash off of her and she stays right there. And if I sit  outside, just smoke a cigarette, I don't even put her on her leash. That's cool. Yeah. And  I mean, that's it's crazy.  And she does not leave and does not leave the porch.  No. Nope.  Does not leave the porch.  You know, I've ventured to guess there will be one time that she leads that porch.  If she sees a school, if she sees a squirrel.  No, you know, honestly, because Mark's have.  Now, yes, maybe.  Okay, but the squirrels, the squirrels still playing the trees.  You know, all around her.  And she'll listen, look up in the trees and see them play in her.  You know, trust my yard.  I got a tree.  This girl's love to run up and down in.  Uh-huh.  The yard right there?  He don't.  She didn't pay him no mind.  Wow.  Right.  That.  I don't think you got.  I don't think you adopted a dog.  Rich.  Really.  No.  Which, really, I really don't.  I think you adopted an alien.  Because Augie, that was another thing.  Squirrel, oh my God.  Yeah.  He saw a squirrel.  It was game on.  Right.  And he would chase that in because we were let him out in the front yard and we didn't  have a very big front yard.  It was a commentary yard.  But you had to mow your piece up to a certain point.  All the front yard bit was just basically common area.  And if she was out front and a squirrel went by, oh hell, he would chase that squirrel  wherever that squirrel led until it got to a tree.  I didn't have any trees in the front area.  I had, we had trees off to the very side.  And that was about probably a hundred feet.  So he would chase that squirrel all the way over to the trees.  And then when he couldn't see the squirrel anymore,  it's like, okay, come back home.  Oh yeah, but he was a big squirrel.  Squirrel loving, hating, chasing, fool.  And that's crazy.  Yeah, Bella's not like that.  this is great. It's awesome, but it's weird at the same time.  You know?  Yeah, I expect her to go crazy and please do some stuff.  Good chance, Abbot is that she's...  She learned early on that, yeah, you have to mind what the humans are about.  Yeah. And you know, and she's also still learning the new atmosphere. Right. And taking it all in,  I'm sure. Because she's never had humans. You know, she's like just, and now she has a forever  human. Yeah. You you definitely got blessed. I believe so. I honestly do because just in these  last six days, seven days, whatever. I mean, yeah, I mean, it hasn't really been that hard.  Like I said last night, the hardest thing is dealing with me, you know, because I can't walk  they're faster than nothing. And she will learn your idiosyncrasies and know the days that you  feel good and the days that you don't feel good. She'll eventually be able to sense that.  that  five  yeah, yeah, I don't know that that I don't I don't know that at all  You know, yeah, but when it comes for walks. She's like man, if I can all man  It's feeling good big dammit  I guess I don't really can't get to go for a walk  No, I still take her out walker is just  you know how you feel in the pendant on how many miles you get to go miles and  no it's not miles dude it's I you know will we'll walk to the back part of my  yard you know and walk around a little bit and walk back out you know and  normally by the time we get back up by the Jeep yeah it's yes he's at the end  to the leaf, stopping and waiting on me. And then when we get up to the steps, village  just walks up the steps and then just stops and then waits on me to get up. So, and she  just stands there. So, that's there. She knows. She knows. Yeah. And so yeah, I mean, I'm  I'm happy. I'll say that.  Yeah. Yeah. She's learning you just like the way they treat our trained dogs to sense seizures.  They'll know it's coming on before you do. Right.  So yeah, she's already starting to know that, okay.  You know, this is his, you know, limitations.  But I know she's fucking just over the moon, over the moon,  that she has a dedicated human.  Yeah.  Without a doubt.  Yeah, it's funny when she wants to play.  She lays flat on the floor and kind of  pounds or pause on the floor and wagging our tail and stuff. So I know Bella's wanting to play.  And so I'll play with her, you know, back and forth, you know, very leg-laying stuff like that.  And then I'll grab her cow. I got her and he's starting to play with that too. So  I bet she would have fun with the tug rope.  I got one.  She's still not used to it yet.  So is it a rope with two knots at the end?  Or the four knots all together, but yeah.  Okay.  Because they also have those rubber ones that have, they basically look like two handles.  Right.  Now, I also just went just as a knot at the each end and then two more in the middle and the ends are losing Friday.  Right. Yeah.  Yes.  You're still not really hip on that one or and I got her a couple tennis balls and she's not up on that.  So.  Well, you ought to take her to what's that big pet store chain.  pest smart. Oh there's pet smart, there's pet cow, there's quite a few um you know take her in there  and let her choose. Right yeah I I haven't taken her to a pet cow yet. I bet you if you got her  one of those octa places she'd probably play with that. Yes you might. And years and years of  for a tug toy. Right. Of course, the first time she picks it up and starts flailing her  head and one of those arms comes back around and smacks her in the back. She's gonna be like,  oh, fuck this shit. I ain't playing with this phone based no more. Right. Well, as  most of it trying to beat me up. So yeah, I mean, I'm good. I'm good. No, go ahead, dude.  Well, I was going to say if you take her there and take that perfect something out.  You know, it could be that that's what she'll play with the most.  That could be that could be. I think you got a very intelligent companion.  Yeah.  I found a way to you on that one.  Yeah, of course. Brian's companions.  No, there he is.  And not so much.  They're there there.  Yeah.  Would you call fine?  Yeah, there it is.  Maybe it wasn't the front have it.  Yeah.  Yeah, I'm not.  I never expected any of either one of them to save my life and  And the dire need.  Well, you never know.  They may just fucking surprise you.  And again, they just may be at it.  Yeah, they just I'm not going to hold my breath.  I will over-block it that way.  Well, you know what happens when say you fall down and you know,  you're standing next to your best friend or word to the three of us are together  and you fall down.  down, you know, the first thing is going to happen, right?  Or actually the first three things that are going to happen.  If you fall, first thing is going to happen is we're just going to stand there and  we'll have to catch it.  That try to maybe try to help you up better, go to P on me.  No.  No, that's number four.  That's number four.  Number two is we start taking pictures.  And number three is we start taking videos so you can hear us laughing in the background and  Then maybe fourth we'll come over there and help you out. Oh, okay. Well, whoo  Basically you get over there start helping me out. So hey, look at it this way. It's in the top five  There you go  in the top five at least  But who these days when somebody gets hurt fucking whole crowd around him is just fucking laughing at him  And nobody's gonna help.  There's so fucking laughing at him.  That, wow, it's expected to have a couple of,  couple giggles about it.  Right.  It's funny.  Pictures and videos work well too.  That's right, because what is the saying today?  No pictures, no proof.  That's right.  We're gonna damn sure have pictures and videos  so we can go back and prove it.  got pictures. It didn't happen. That's right. It did not happen. You know, so basically the first  five thousand years, nothing happened in the last five thousand years until the middle of the  18th century when they finally got the development of the film. Right. And print out well.  So that's right. It proved the history happened anything before that. I guess it never happened.  Well, a lot of people seem to think that now. I mean, no, ain't that fucking cruise?  It didn't happen like that. Yeah, it did.  Where's the cruise?  Yeah, motherfucker pick up a book and read it.  Right. Oh, if it's all in the internet, it's gotta be fucking true.  Yeah, okay. Look at all the fucking AI companions I got out there now.  Oh, yeah. Yeah. I was.  I'm sorry for the day and kids that are going off and thinking that AI is the best, uh,  best thing to happen to them. Yeah, for them to actually have say a mail and, you know,  talking to a female and someone like that. And it's like, you're just talking to a fucking  computer. Yep. But they fucking, that's reality to them. Well, I wouldn't say that I take  it that far, but I do it. I don't do it all the time. You know, I don't, I don't, I don't  ask it to, you know, make free. Yeah, free. Yeah. Yeah. We kind of get the point on that  one, but still. Okay, you know the difference between reality and AI. Oh, yeah. Yeah. Definitely.  Yeah. Some of those people don't. Some of the newer generation don't. Well, no, that's true. Because you see,  that's the thing. No one's taught him. And yeah, because people, people on their own really don't  don't carry to do their own research.  Probably rather, and this is why we have this problem of a lot of people thinking of if it's  only internet is true and no one's not because there's a lot of misinformation out there.  You actually view many different pieces and put the pieces together and a lot of people  just don't know how to do that.  Not that hard really. Right. I mean, I can do it. I can. Yeah. Yeah. And because you're  going to educate yourself. Yeah, exactly. Exactly. Yeah. And that's, you know, that's  the thing. Just, you know, if you don't know something, look it up and then if you don't  believe it. Okay. Look at another piece. Exactly. Look at, you know, a couple of different  viewpoints and figure out where you fall in middle. That's just what I do. And see, yeah,  I still get it wrong. Are you going to lie? Well, until any one of us is able to walk  on water with the water being, I'll say 78 degrees. Yeah. And you go,  fucking half. Right. You know, they know they ever gonna be  perfect. No, no, never will. But you know what? That's okay,  because that's what makes us human. Yeah. Well, yeah. So yeah,  it's that's, uh, yeah, I mean, I know I'll get stuff from I  just trying to just trying to limit it.  Yeah. That's the word I was going to say.  However, we, but it is a true fact.  If I tell you two plus two is going to be four, I'm sure you're not going to question.  No. No. Now if I tell you the last four digits of pi is 4176, you might want to question it.  I'm probably going to question that one because as far as I know pi runs out to infinity.  Yeah, I was going to say they haven't ever been able to find the end of pi.  You know?  Yeah.  But I mean, I'd look just to see just in case, you know, someone did come to the end because that would be like freaking awesome.  Oh yeah.  I'm sure that there is a computer out there right now  that has been doing that calculation for,  it's fucking the last 40 years.  Oh, I went down to it.  Just to see if there's an end.  Which we know is never gonna happen, so.  Or so, we'd say.  But I bet you, when we get up in the heaven,  God's going to say, okay, it was 1 9 7 2.  There's your fucking integer.  Right, right.  Eventually it will run out.  Well, then you're going to go damn.  I wish I knew that sooner.  We'll see the thing as I just asked Jim and I, right?  I just typed it in.  And it says no, no one has ever found the end to pie.  I is an irrational number, which means it  can't be expressed as a simple fraction and its decimal representation goes on forever without  repeating. It's not just that they haven't found the end yet. It's a fundamental property  of the number that it has no end. But they've calculated it out to trillions of digits  and they still haven't found out.  I know what.  So, I mean, yeah, you're right.  They're still trying.  And computer zies with days, the way it can fucking  calculate how many thoughts does it have per second,  tens of thousands?  Oh, yeah, easily.  Of calculations per second.  Yeah, yeah, that it depends on the processor speed,  know that. I mean, it's still, I mean, I mean, even the oldest slowest computer can still  can still compute faster than weekend. Yes. You can take an old Apple SE with, you know,  64 megabytes of RAM and it can still add subtract multiplying the by faster than weekend.  Yeah. Oh yeah. You know, or the Apple II or, you know, IBM's computers. In fact, I was  watching, uh, when it was modern, modern marvels or how it's made something like that the other day.  And on a commercial breaks, they had like little trivia thing, right?  Yeah. And the first, the first commercial computer was built in 1951. It was called the  univac one. It weighed 16,000 pounds. And that was all it said. I was just like, man, that's crazy.  Yeah. Like the first computers with NASA's, the fucking whole day on the room was a computer.  because they needed a whole fucking room.  Well, I mean, I mean, they didn't have the small, you know, a surface mount technology  that they have now today.  Well, yeah, now they're getting chips in the fucking nanoseccer sector.  Yeah.  Yeah.  Yeah, looked at the galaxies as the Z-fold seven, the newest one out.  And that things I found in a tablet built into one.  Right.  Yeah.  Because it flits twice.  Is that the one that you're talking about?  The way.  It's a small square.  Then you can flip it to the size of say a regular smartphone.  And then you open up again and it's damn near the size of a tablet.  Now this one here is closed.  It's, it's, it's, it's about the size of my phone a little bigger. It's thinner by far.  It's like half the size of my phone, thickness wise. And then you just flip it open.  And it opens into an eight inch tablet.  Oh, okay. Yeah.  But if you have a close, there's still a phone face that you can use. Yes.  That's right. Yeah. Okay. That's what it was. Yeah.  that's what it worked. That's a Z Fold 7. Now, there's a Z Fold flip that, yeah, you can  fold it in half and then when you open it up, it just, you know, it's like a regular  phone, then. Yeah. For our friend of mine, one of the guys I worked with had one of those  said he fucking, he bought her in about three months later. He fucking got rid of it. He  said he just said, I want that at all.  Yeah, that's a bad thought.  Well, doesn't seem annoying.  Was that the flip?  The folding pounds.  Yeah.  Yeah.  I mean, I don't know.  I mean, they've gotten a lot better since they first come out.  But yeah, I think it's, it's just weird, you know, and plus what the Z Fold 7.  Now the six has it, but the seven, they don't have the pen support.  You know the little stylus?  Oh yeah.  Oh yeah, okay.  And that just actually bugs me.  Kind of bugs me because, you know, I mean, I don't use my pen a lot, but I call my tablet.  I do use my pen.  Well, okay.  Okay, but if you use your pen so much on the tablet, why don't you do it on the phone?  Why do I do because this phone I have does have a  F-pin  Support and has a pen with it and I do use it. I don't use it a lot, but I do use it  You know, it's you know, especially if I'm trying to edit a video or what not on my phone  but uh, yeah  It but you see with that  that, Ms Z-fold, there's no pin support at all.  Now, there are workarounds, but I mean,  that phone there, I think from Verizon,  you're looking at $2,200.  Yeah, no.  Right?  You know what, I'll do the same thing  like I do with the movies.  I'll wait till they come on fucking TV.  I'll wait, I'll wait on that phone and tell it, well, if you subscribe to 12 months, we'll  give it to you for free.  Right?  That's what I'll get it.  And of course, at that point in time, it's so far behind the times, it's like that phone  comparing it to the razor.  Right?  Or that, or that slide keyboard.  just floons that that was a small phone, but you, you, you  have slitted open had a keyboard. Yeah, yeah. Yeah, I didn't  like them too well. You know, and I got one of those and it was  brick with strictly a PD it was a PDA personal whatever  lights. Yeah, yeah, personal data system. There you go. You  know, and the senior command got given those, right?  What? Mine went into my desk and it stayed in my desk. I'm like, if I can't use it as a phone,  what the fuck goes it for me?  Right. Yeah.  Well, they was they was wanting you to schedule your day out on your calendar.  right. When's the last time in the military, you scheduled your day out and it looked anything  like what you had thought that you were going to do. Oh, never. I don't never. Not in the  army, man. Not in the army. I don't care. How will you backward plane your day? It was  fuck the synergy you as cine dry is opened. Yeah. I mean, that's just exactly what it was.  You know, I guess what? It went backwards from there. Right.  So it's like, it's like why even try and play in, let's just go with the flow, man.  Yeah, let's have a meeting in preparation of the meeting.  So we can schedule ourselves another meeting.  Yeah.  Then they wind up having a meeting and then having the pre meeting and then having the other  pre meeting.  Yeah.  And then of course you have to have an after action review session of the meeting and what  was ever resolved?  No.  No.  No.  No.  No.  No.  about right. Yeah, I didn't I didn't have have too many of those. I got to go on the floor  and work more but there was a few times I had to jump in and play big keys and I didn't know  first. Oh fuck I hated it. My bet you did. But yeah, I do not know that one bit. Well,  But, but man, I had to do a job and I got selected for it.  So, you got a violent toad.  Not oh, every bit of fucking volunteer.  I always hated that.  I always hated getting violent toad.  And that's the thing, I could be standing in formation.  Minor my own business.  Now, you can't get attention.  I'm not platooning, starting to look at me as they tell us.  Fuck. I was like, what? I didn't do nothing, Sarge.  hard.  Yeah, but you're going to.  Now, oh, like, yeah, you are.  It's like, I don't know, man.  That's because you weren't paying attention.  Right.  That's the ending.  You know, I'm sitting there thinking because I was on the third row back.  And we'd normally line up by rate rank.  So at the time I was knee four.  So I was right next to my platoon or my squad leader.  Yeah.  He was a, well, he was a corporal because he was, he was E4P for so long and waiting on the  points to drop.  So, so, so he could go to P.O.D.C. which is now the warrior course or something.  I don't know.  Anyway, they had to make him a hard strike because he was, he had been E4P for like,  Oh, God, three, four months.  And they're like, look, we've got to do something.  You know?  And I don't, I don't,  I think the point's finally did drop  for him to go to PLC and he made us five,  or you know, probably about another month or two after that.  Why I made us five?  And it was funny, I'd give him shit.  It's like, man, man, I have to call you a Sarge now.  He said, no, he's a shit.  I love his, because his last time was, was popling.  P O P L I N. Poplin cool guy, just fucking cool guy.  I never did go on the search after that.  I just called him.  That's where he fucked up.  No, I'm curious.  That that is where when we had that happen, you know, somebody go from  45 they would either change teams or they would change batteries.  Oh really?  Yeah.  So that there was no so that that individual could actually be an NCO and not a buddy.  Yeah.  Well, let's say we were on the canning.  So I mean, we were we were attached to Charlie County. I 120 for a signal battalion.  And we were in we were in headquarters, but you know, because that's where all the  all the mechanics and everything. We were headquarters platoon. Yeah. And so so when he made his five,  there was really no place to moving. You know, so and  I mean, honestly, he didn't really want to be moved, but yeah, I understand what you're saying,  because, you know, you know, I mean, like I said, the dude, dude was a good squad leader.  He was real nice.  He would, he would, he would still jump.  Yes.  If, if you got, you know, messed up.  But, you know, it was, it was never that bad.  So did.  He still had to earn his respect as an NCO or did he have it because he was a corporal.  He had it because of the rank and his position being an all guard.  Being a squad leader for so long, I mean, basically the five was purely clerical because  everyone knowing, you know, he was a squad leader. And we all knew that, you know, what  he said when?  Okay. So you, you already had or he already had your respect of the position when he  given being saying he for, if he told somebody out another he for, it's like you need  to get this done. There was no question. Yeah. Yeah. None at all. That's it. I mean, yeah,  So, yeah, him, him making his five, like I said, he was, it was more for paperwork because  we knew he was in charge.  So at least you guys had the mutual respect, you know.  Yeah.  And that's why, that's why I liked him, you know, because he was a leader.  He actually one led by example, explained things and if he didn't know the answer, he didn't  bullshit you'd say, well, I'll find out and I'll tell you.  And he would, you know exactly.  You know, and or sometimes you know, he would ask me, do something.  I'm like, come on, man, really?  But you know, I'd still go do it anyway just because it was a nice guy.  And you know, he was a must-squad leader.  It's like, I, you know, I won't argue with you too much.  But there still wasn't the tree separation.  But again, like you said, you didn't have the opportunity just because of the fucking overall structure of the unit.  right right yeah I mean yeah there was and I'm saying unless they they moved  him to a totally different unit which you know they could have done but then  that there would have made me a squad leader because I was next in line how do  you think you would have done at that time probably not so well to be honest  Well, yeah, you're right.  Because I mean, I was what?  19 years old, I was a hothead.  You know, yeah, I was...  I didn't know how to act, really, to be honest with you.  I was an ass.  So yeah, I probably wouldn't have done very well.  But you would have learned to...  You would have learned to adapt and to...  It becomes that NCO versus, you know, just being an NCO in a total asshole, which I  know quite a few of them.  But yeah, no, you're right.  Well, I was one of them.  However, you know, you guys know me.  There's not much fucking gray.  It's the black bird's wife.  Right?  I wasn't a military. It's either black or it's white. There is not too many fucking shades gray here. Maybe two  three max, but  No, I was  When I met business you could you could fucking tell it in the tone of my voice and my my facial gestures of  That I have no doubt dude  I know you I have no doubt  But in turn, I could also talk to them on an equal level.  Right.  The Darryl and then bullshit.  You know, and just be one of the guys.  But of course, they also knew that, you know, when it was that not that time to be just one of the guys.  Right. Right.  Yeah, and this that's the biggest thing is trying to stay human and and and still be a leader especially  When you work so closely with  You know your group  Sometimes it's hard, you know because you know people see you one way isn't it and and then they see you another way and it's it's  you know hard thing for  you know some people to say a distinguished  But yeah, just differentiate. Yeah. Yeah. You go see there. Yeah  $12 worth per today  That's a $12 worth per day  Different you  But no, that's I mean that's true  That's the biggest thing  You know with the military  Yeah, man when I was the rear-deep and  and I got that oh set battery of 33 34 brand new privates within two fucking days of each other all come into the same unit  oh my god  oh yeah that and two days before my main brigade main body started to deploy  yeah I was a busy motherfucker  I bet you. And our, our battalion rear was assigned to be the guard for the backdrop area.  Which is fine. You know, every, every rear D had their assignments of getting the brigade out.  Ours happened to be, you know, guarding the backdrop area. So how many senior NCOs do you think the rear detachment had?  Oh, not me. Senior in sales.  Senior in sales.  Me. One.  One.  Guess you had to be.  No, one.  Me.  I had two e-part.  No, I had for the rear command staff.  I had one e-five and one corporal.  Oh, my God.  And me and the commander.  We're on up for people.  So guess you got to be at every fucking bag drop.  That's crazy.  24 bag drops in 58 hours.  I could call him preach say that was one of my longest days  I've ever had in the military was that  because I had to be at every fucking bag drop.  Right.  When I got to argue with the captain too,  that was a lot of fucking fun.  I was bad.  And so I don't remember which cycle the bag drops  was but this captain wanted to drop his bags beforehand as the other bag drop ended. He was  trying to drop his bags at that point in time. I'm like, sir, you can't do. There ain't going to  be nobody here to protect your bags. So I'm going to drop my bags. I'm like, you know, a service.  As soon as you drop those bags and you leave, yes, we will pick up your bags and then I'm  going to walk them right into the brigade commander's office.  But I will have already have called him first to let him know the bags are coming and then  you can get your bags from the brigade commander.  How about that?  He's like, you wouldn't dare. I'm like, okay.  You want me to hit dial?  I got his number right here.  You really want me to hit dial?  Because he told me, I'm the one that's in control of this.  If you have a problem, he said, call me personally.  So I got a problem. You want me to get my call?  I got no problems with that.  Oh, yeah, he fucking his head exploded.  And as soon as his head exploded, he picked up his bags and walked away.  Yeah.  I'm like, and he was some staff captain in fucking one of the Italians.  I don't know where the break.  I don't fucking remember.  But yeah.  No, ain't got fucking work here.  Oh, it is not gonna work.  You are not dropping your bags here.  That's funny.  Yeah, he was so fucking livid.  Like, you know what, in about three hours you can bring your bags back  with the rest of the chalk that is getting on the next plane?  They and dropped your bags.  They go be with their family.  He just wanted to drop his bag early because he wouldn't have to do that in interrupt his family time.  I'm like, look at here, how many other motherfuckers have families here?  You ain't the only one that's fucking special.  Everyone guys want to fucking spend time with their families before they bore that fucking airplane.  No.  And he was the only one that I had issues with.  Thank goodness.  Because after being up to 58 hours, yeah, no.  I was not a very happy person.  I bet not.  Yeah, that's crazy.  So after all of that happened and getting those 34 whatever brand new privates and  after the bag drought dropped commence I pulled my staff together I said I'm  going to fuck home and you'll see me and this was at and probably about three  o'clock me afternoon I say you'll see me the day after tomorrow my I seen fucking  coming in tomorrow. I think I slipped up fucking noon the next day.  It's crazy. Yeah, I think I slipped like 16, 17 hours. I was fucking so exhausted.  That's that's that was the mission. Yeah, but those all those privates, you know, they knew  I met business. But of course, they're all E1 to in a couple of E3s, you know, versus in an E7,  Okay, you're really not gonna have too much of say so, but in turn, I also told him after I gave him a fucking brief and do not do this this is missed.  And I told him that three times do not do this this and this. I said you don't get him more warnings. You've gotten your three warnings right now.  The next time is you see MJ actions  Try me  couple them tried me  But in turn I said if anybody has a fucking issue  You better come and see me  Because if you have an issue  We need to get it resolved  right and  the few of them had some issues and  We got those issues  Resolve because they could do it at their level  So we could head to my level, it got resolved.  And they were like, damn, this ass hole, fucking does what he says going to do.  Right?  So, I told you, you don't have to respect me as an individual, but I give less than  a day of me.  You ain't gonna hurt my feelings.  But by God, you better respect these fucking, this rank I have on my fucking collar.  I earned them.  Right?  Yeah, that's some main thing.  I would do that.  I would freak in respect to rank, but there's a few people I dealt with.  I did not respect them at all.  So, man.  Yeah, I had a couple of them fucking threatened to go to EO and I'm like, you want the  fucking number?  I got it right here.  You know, I have found that will squat just about anybody's argument.  you throw that. I'll bet him. Yeah. And then I, you know, there, I'm not going to call someone. So  you want to use my phone. Yeah. Exactly. Here's the number you want to use my phone.  The only thing I pulled them, I said, the only thing I want you to do is you better spell my name  fucking correctly. Right? That's it. Anything else? Okay. But you better spell my name, right?  It's you're gonna go that far.  But I'll give you the phone and let you call them.  I'll step out of the office.  I will step out of my office even and go have a smoke while you call them.  How about that?  Yeah, that squashed that EO thing pretty quickly.  Yeah.  No, no, I found I found even out here in the world, you know, people,  Well, I'll just do this. I'll do that here. You want to use my phone? It sheds them up just because  They're not expecting it. It's like I don't give a fuck who you call  You're wrong. I'm gonna tell you you're wrong and please call them. You know call the cops. I don't give two shits  Yeah, you know, but yeah, I've done that a few times in it. It works  And the thing is, when it happened, I didn't even think about it.  It just came out, you know.  Yeah.  Why had that one, didn't?  Uh-huh.  I had that one down.  Call anybody you want.  I'll get you there.  I'll find their number for you.  And you can do that.  And you can use my song.  And it usually was like a real,  It was like a real, just the air out of their bubble so quickly.  Oh, yeah.  It does.  It's great.  And it came out so quickly.  It sounded like this.  And it's even more fun if they're drunk.  Because then they really don't know how to act.  Well, you know, and I can tell you with my experience, I never, ever went.  Now I had team parties at my house or we'd have a platoon party at the, you know, the  infantry platoon sergeant's house.  And yes, people would be drinking, okay.  But as far as to go out to a bar with anybody and watch them get drunk and just become  stupid.  No.  I'm not going to do that.  That's just it.  The only time I did that was when I was over in Korea because I was the designated Walker  for about three guys.  And so when you say a designated walker, what do you mean it?  Well, we were over in Camp Casey right across as soon as you got up post was TDC, Tongue  to Sean.  And they had the, you know, they had the bar strip and someone like that.  So when I went out with those guys, I didn't drink.  They bought me sodas and or water.  I was a day and because we didn't have that. Okay. Yeah, you probably you say you fry you by  I'll buy you fly  Exactly. So basically I'd be the one that had the reason  to get them back on the post and get them onto the bus and get them where they needed to go  Because they weren't gonna fucking make it they basically kind of the designated driver, but we had to walk every place  So I was like, we didn't walk her.  And I will say now, no, I'm not sure.  I'm not sure about TDC, but where I was at in South Korea,  just outside just in a wish on boot right there.  When we went out to the bill, everything was on a hill.  And I'm telling you, walking down wasn't too bad.  Well, it was easy.  It was getting back.  There was the bitch.  I was terrible. I was, I remember one night I couldn't make a bag of this hill and I had two  captains come walk, saw me and I was on the side alley. They come walking down and I was,  I mean, I was falling down drunk and they grabbed me, half carried me, drug me to the gate.  I'm old enough my my ID going through and and they were flyboys. They were cool, but  And what was funny their barracks was  Mine was right behind theirs  So we was going to the same street would  Which was just passed to gate and so we made it to the street  They was gonna walk on up for a little while they were  whatever. And they asked me if I was okay, I said, yeah, I'll make it up. But yeah, so it was up  another fucking hill. And then of course I did. Yes. Oh, it did, man. And then I had about  another 10, 15 stairs. And then I think I was, if I remember right, I was on the second  floor. So yeah, that night was really bad.  I have no like stairs for a long time.  So, but you've been on Casey, right?  Yeah.  Yeah.  That's that's where I am processed at.  Okay.  The turtle farm.  Yeah.  Correct.  Okay.  So you remember where the front gate of Casey was in comparison to the turtle farm, right?  By the money.  About a mile and a half.  Yeah.  Okay, our barracks were another mile up to road by the division mess hall.  Oh, like that was all the way at the end of the post.  Go to the division mess hall, hang a right, and then you had to go up a hill.  Big hill to get to the barracks.  Right.  It was almost three miles from our barracks to the front gate.  Yeah, I'm not doing your fucking ass, I got damn far.  If you don't make a fuck  So man, you miss a bit. You miss a sibriella  You we in the cookie. You know what?  We miss we miss the fucking last boss  I'm just well, I'll get you on post. That's not a problem  but I'm gonna prop you up against the fucking  the MP stand and  I'm gonna fucking walk my ass back to the barracks, and I'm gonna be fucking kicking every goddamn rock  from there to the fucking barracks because you made me miss the last fucking bus.  Right? We never missed the last bus.  I'll put that to you.  I'll go ahead.  I was going to say that's where that's where my barracks was right there at the gate,  at the back gate.  So yeah, I was I didn't I didn't I didn't have to catch a bus like like some people did  Yeah, yeah, no  Yeah, it was it was nice for me  Yeah, kind of sucked for us. Yeah  But the good thing was that I never lived in a quanza hut with three other motherfuckers  What do you mean?  My Joe's  They lived in the quanza hut  Oh my, and then it was four quants of huts then a common bathroom and then four more  quants of huts all with four beds per room.  Yeah, thank God I was in hand seal man I was fucking hated life living that close to three  other motherfuckers.  No, thank you.  only had one other roommate and that was my team chief.  So he couldn't get any more fucking cozier with the team.  He said what we had to be.  I get to say, this is actually the first time I looked at camp Casey on Google maps.  And oh my god.  I didn't realize camp Casey was this freaking big.  Oh yeah.  But yeah, it was it was huge.  Yeah, that was the biggest base on the north side of Seoul between Seoul and North Korea.  Yeah.  Oh, yeah.  I knew, I knew it was big.  I just didn't know it was this big.  But back then, I only spent a couple days on Camp Casey and I was actually restricted  Mostly because I was new in country.  You know, and yeah, when you go into a new country  like that, it's like first three days or a week,  you have to stay on both.  So.  Yeah.  Yeah.  And it being the terminal farm.  Yeah.  You didn't have too much freedom.  No.  No, did not.  And Brian.  Why am I just,  Why might you think we called it the turtle farm?  Not a day, I can figure it was what there were tanks there.  Now, is it took you 365 days  to go from one building to the next,  which was right next to each other  for the imp processing and the out processing.  We're 20 feet away.  But it took you a year to get there.  I hope. Yeah. Yeah. Yeah.  Is you in process and then when you well process, you had, right to the next door.  Yeah, right to this building. 20 feet away. Yep.  That was a long fucking wait. Yeah, what is that?  I can play sucked. I'm not gonna get that point. I mean, honestly, I mean,  I went mine. I went mine going back to Korea just to see it, you know, but see it on my terms.  Yeah. You know what I mean?  And the difference being single and being married, that's what fucking was the kicker.  Let's say I was single one. I was over there the first time. So I mean,  I didn't really have a problem.  Well, yeah, I did. Yes, you did.  Yeah, well.  And, but see, you gotta go back.  Well, here.  Look, let me look it up.  Let me see that.  I gotta get a visa and all that kind of shit.  No, you can use your passport.  You know, it's a passport.  I don't have a passport.  I gotta get a passport.  That's easy.  That's real fucking easy.  I know it is.  I just...  I mean, that's just fill out a few questions.  A couple hundred bucks.  It's your gone.  Holy, it.  What?  Do save your pennies, man.  If you flew commercial, go into Camp Casey back to Camp Casey.  You can find a round trip ticket for about $744.  Wow.  Yeah. And one way ticket started for 68.  Well, yeah.  That's cheap.  Yeah, that is fucking extremely cheap.  Yeah, it is.  So yeah, I mean, you know, what was the cost of business class or first class?  Yeah.  You want to be a boozy, don't you?  And then after you give me those answers, I'm like, have you find one more section?  Oh, yang will be able forward this.  From Los Angeles to Seoul.  So you would have to go to Los Angeles and fly the soul 18,092 dollars.  All right.  That's what first class first class.  Yeah.  Generally, it says between 16,474 and 21,196 dollars.  Yeah.  I don't want to I don't need to fucking own the aircraft.  I just want to use a seat on it.  Now here's the next one.  Where's the smoking section at?  They all.  The International.  What do you land?  No.  International flights.  When you cross a day line, you can smoke.  Normally.  Not on any aircraft that's out of the United States.  Yeah, no, no, no, no, no, no, when we, when I flew to Korea, we had to wait till the  international date line. And then they told us we could smoke. And then when I left Korea coming  back, we could smoke. And then when we hit the international date line, they flipped it on because  we was in American airspace and they said no more. So we couldn't smoke no more.  Oh, okay. So yeah, no, I remember that.  Well, I bet you I bet you you probably you can't smoke on any aircraft period anymore.  around the world. Yeah, they don't they don't have those restrictions. America is about to  own one that does. Maybe it's fewer countries. Well, and maybe if you're flying Korean  airline or you know, something like that, we have that as possibility. Yeah. Well, these, these  flights, these prices that I'm quoting are flying on Korean airline. Oh, okay. And that's  like business class flights to South Korea is 24 hundred bucks.  Premier, Premier, premium Econ class, I don't know what that means, is 573.  Let me see what, yeah, that's just crazy man.  Well, yeah, because the first class is a fucking, your seat turns into a fucking bed.  Literally a fucking bed.  Yeah.  well I'm not fucking just just that's just like fucking hotel I'm  written to bed for fucking one night I'm not buying the goddamn room well that's  true better about yeah and see yeah e Econ class premium Econ class is about  573 and economy class which is the poor people section from 447 the pole  folk. Yeah, but still, you can make it to Korea in about 14 hours. Yeah, I know it was a miserable  flight the first time. Yeah, but see, just think you'd be going as a billion. Yeah. It's a whole  different way. Well, yeah, you're exactly right. It's a whole different ball wax. I don't know.  There's a lot of places in this country. I still need to see like schedule same here.  Appalachian Trail. As far as my biggest bucket list thing is to travel the Appalachian Trail.  I'm sure not to, sure the fuck not going to walk it like some people do.  It's an Appalachian Trail, the next previous Appalachian Trail. Come on!  God, I would drive right next to it. I ain't walking fucking  I'm 1,392 miles or whatever the fuck  the distance is on that.  And now there are people my age that have walked the fuck.  I'm going to you.  You walk it.  You know what?  That 80 year old individual.  Yeah, what?  I'll drive by and toss you out of bottle of water.  Shoot.  Shoot.  That's not shake his hand.  Hurry.  Well, you're back in the car.  energy keep going. Well, you know, like I said, you know, toss them out of bottle of water.  Hopefully it doesn't hurt them too bad when it's flying 30 miles an hour. But I wouldn't  be that read. You didn't really get out and give it to him, right? Probably. Okay. I feel a  little better than you feel a little bit more. Yeah. Okay. Yeah. The reason why I was  late tonight is because I had to be the supervisor of the shit show.  Hey, my, my neighbor, the one that just bought the house across street from us.  He just got station here for good.  It's a younger couple, just like the neighbors that moved to me on the right  hand side who will shit all, all three of them.  So we'll have to write them here, young couples.  And then I'm going to cross the street from me as a younger couple as well.  but yeah. And now we are found out the other day that the MOS that he has was the same  of the OS that I was, which was the 13th Fox. Okay. So we got that in common. But yeah, he's  he purchased an older pickup truck because he has one of those 7.2 liter or six seven or whatever  the fucking, the big Chevy fucking motor is on that full side, jacked up.  Take some shit.  It's a little tough.  It did.  Okay, I believe you.  I don't remember what he said.  So he lives here and where obviously where he works.  Oh, it's about close to 40-mile drive.  It's about 45 miles or 45 minutes from my house to what my unit was back on Fort Hood.  So think how much gas that's on bitch eats.  That's 7.3 or whatever leader it is.  Well, it's exist where I was gonna say it depends on how hard he pushes on this.  Any pedal.  You are absolutely you are without a doubt correct. He's kind of a heavy slitted individual  of that unique pedal. So based upon conversation, I haven't seen him drive, but based on conversation,  his right foot is a little bit heavier than his left foot.  So he bought this, you know, little Nissan,  and not a full, you like the cabin a half, basically.  Hold and he's not pick up truck with the extended cab.  And he's trying to, you know, get everything fixed  because let's see, his daughter was born three days ago,  four days ago.  Ah, and he's deploying to, I think it's Poland.  just the quick reactionary force for  Coast where who the fuck are the Russians fighting right now Ukraine Ukraine so they're going to Poland and it's a  rotationaly quick reactionary force, but it's a nine-month deployment and  he deploys in  sometime in November  Okay  So he got this little pickup truck and he's trying to get everything fixed up his old one, but  Yeah, he said he's fucking his gas bill is like  30% of what he was spending on the big truck  No, don't die better. But he's trying he's trying to get everything fixed on it before he gets deployed  so  He's got he replaced the throttle body sensor  No, yeah throttle body sensor  But didn't replay and the map sensors on order  He has to go by the oh two sensors  But when he replaced the map sensor the car just went into fucking retard mode and just  lame. There you go. Ficking me. Yeah.  Ridden in the head. And I really. Yeah. And so now he's trying to figure out what  fucked up or what electronic sensor is not talking to this sensor, not allowing the truck  to run. So now he's got the map sensors on order. Just throttle body. The one that he bought  that was for that truck. If you look at the pins in them are completely different set up.  Now it goes, it clicks in, but the setup is just completely different. So we're like, okay,  That could be his name.  Rob right there.  Well, and we put the old sensor back in, but it's still running that.  So something has hit.  Dumbass mode and something isn't talking to something else.  Hey, how will we?  Right.  So yeah, the fuel filter that he bought today,  The one that was for that particular truck was not the one that was actually in the truck  So if then he had to go we had to figure out the number of the one that he had in the truck  Not for the Nissan and go get that one  Because the true one was a whole he did completely different set up. It's like  I think that's the thing.  So what a kind of truck did he get.  The one he's worked on, the one that he got was a 19,  92 Nissan extended cab.  His big truck is the fucking big Chevy 7.3 liter V8.  seven point three liter V eight fucking diesel.  One of the fucking big Chevy trucks.  It's got a six inch lift.  And this is all come from the factory like this.  Six inch lift, nice rims, 35 inch tires, $98,000.  Good. God.  Yeah.  That hurts.  I know he, okay. It hurts me. All the way to Louisiana and hurts. Or a Mississippi, or  I should say to Mississippi, if it's hurting you, man, it's hurting for quite a distance, yeah?  Yeah. $98,000 is what he paid for that pickup. He told me. I'm like, you know what?  and his wife is also in the military, so it's still military.  But it's like, you know what?  Yeah, I'm glad you got that kind of money.  Well, it is.  You know, honestly, if you asked me,  because I mean, when we were in, you know,  I mean, you could walk on any car ride,  drive off in anything.  Well, it's true.  I mean, literally, because they knew  they were gonna get their money.  Yes, there was no doubt in their mind because they just, they're going to take a right  out your check, you know, or story systems, whatever you wanted you could get.  And let me ask you since you was in a Navy, did you have access to stuff like that or  no?  No, I mean, you got, I mean, they would, they would offer your, your expenses if you were  were going from station to station.  Yeah, no, no, no, I mean, I mean, like, like,  when, uh, no, when, when you was on, I guess surely  is what it is for you.  Uh, did you all have the shops to where, you know, you  could go buy the big string TVs or the stereo's or.  We can out exchange because what we have no no I mean I mean I mean I mean was there but I mean  when you went off post  Because I  Okay, in the arm. No because in the wrong  that  What was the name of that damn  that  one of the one on the  kid, they're in the name of the day.  I don't wear parked on.  I mean, it was when I  got off, it was just, you  know, you were right there at  basically at the bridge.  So you didn't, you know, there  wasn't any other really  any stores around now.  You know, they met all the,  all the stuff back odd dealers  around.  You know, you go a little ways  down down the strip.  And yeah, you had the  You had the car dealers hanging out there selling you a car for you know 30%  Interest and stuff like that  Yelling because you know the government if you  If you the government will make you pay it back  They were they will will  Garnish your wages. Yeah. Oh, yeah. No. No. Yeah, but no you say I didn't know because they like in the army  every post is built near a town. If not, buddy, right up next to it, it's not  more than a couple miles away. Okay, and then in city he drove through  normally it's the back gate. That's where you had all the rent-to-own places for  anything you wanted. And then there was car dealerships and of course, everybody  be an intermediary. They'd be like, oh yeah, we've got the foreign will just, you know, process  it, sign here with this process and take it right. Yeah, you'll get everything you get.  You'll get what it would call you once. You can get blams making new, drive off to, you know,  100% financing. Wouldn't even put down payment. Oh yeah. Yeah, like I said, didn't mention that,  that there was a, that there was how much interest was and most guys being young enough,  they didn't even care. They weren't paying attention for it. Well, yeah, I mean, I mean,  if we were young, you know, we didn't have no, we had no idea about interest. Right.  No, no, reason I'm asking this because since you went on shit, where did you keep the stuff  to buy. You know, like, like, say that I'm, unless you had a, unless you had an apartment.  Okay. Did you, when you were not on the ship as a single soldier, did they have barracks room?  No. Nope. You stayed on the ship. Really? Yeah. Okay. So,  where do you call your personal shit at when? And you're in a cop and locker? Wow.  Yeah.  Yeah.  I couldn't have a lot of stuff there.  Now, now from time to time, if you knew somebody, there had a, like an air conditioning unit  in their space.  And they were clear with it.  They were bad.  They don't let you, they're what you stood there.  But you know, you had to be able to, you had to be able to put your, your stuff in  the, and it's the head just  bookstore. And it had to be able to be get put away.  Now you could point where when we were on the way, there  was actually a lot of times we would actually take, I  would utilize the overhead space and I would take like some extra  stuff that I had and I would stuff it up in to the up in the, in  the pipes and stuff that was over that was in the overhead,  because I was low band on the totem pole with me and I got the top rack.  Okay. So yeah, you might be able to set up, but you're going to be setting up your heads,  going to be at a bunch of pipes and things like that. So right. Okay. Yeah.  Yeah. I can't say we had actual rooms, you know, in buried. And so we could keep the stuff in  our rooms. Yeah. No, I mean, I mean, I mean, I went, I kind of asked a question in kind of a long  way. I didn't mean to just as this was. That's that work, man. Yeah. Yeah. You know, sometimes  we've got to ask it to ask backwards. Okay. So when you're back at your home base, you are still  Sleeping on this the ship  right  Yep  Okay, so  you didn't have  No big TV obviously  Nope, there you go. I only TV had was sitting in the  Sitting in the entertainment room  That's crazy  Daniel did you have were you single doing your life in the middle? No, I was I as married  Okay. So what did the single soldiers do with their vehicles?  Oh, you depart from, they had parking. You said, have base parking and you had to have it  and all that. So you know, you just had to have proper documentation and insurance and all  that kind of stuff. Right. Right. So I mean, that's all we really had to have. So because  several times where, you know, if we were underway, like when we were doing, when we were  doing our, our west back, you know, no one's out in the car for six months. Yeah, but  what it was it in a pretty much secured area. Yeah, it's a security. It's on base. Well,  Oh shit, we got on base too, but we fucking know secure parking areas.  I remember I remember I had a pair of Kenwood 6 by 9 and old old old bill and those  sons of bitch has got stole.  Oh shit.  And my car was locked up, arct and everything.  I always upset because they was like, I think I think it was playing all together 600  $1 and for two six point I  it's yep on that easy payment plan dude  I was all about that easy payment plan now  and and they what they gave you fucking huge rocks as  Lou bright  well that's all time I didn't feel it when  that guy's yeah I got to say because I  I started saving him, bitches.  I was not happy.  Well, I had, you know, he wasn't my roommate but lived in the barracks.  Yeah, the stereo system that he fucking bought.  And this was 80...  87.  And I mean, he had to freaking tower.  This was for room not for vehicle.  He had to tower speakers.  He had every fucking component.  it even had a reverb. Oh my God. Oh, so he went rare. He went annoying. He didn't just  go off and share his music. He made sure his music was knowing as possible. Sometimes, yes.  Yeah, I should pay for that system back in 1987. Uh, it's about 2,500 bucks, I think.  No, no, no, no, no, a little bit more than double that, almost $6,000.  I mean, it was, yeah, I remember too, because we used to have a, I used to love to go to,  I can't remember the name of the damn store in Amarillo. There was just a,  it basically, that's all they were about, was a stereo store. And you saw my couple times in the  movies. There were these clear, this clear radio. I didn't after see the CDs came about. And it was  this. It had a clear acrylic or glass cover that went over all the components. But what you did is it  actually had one of the first instances as I saw of motion activated. And you, when you want to do  something you went your hand in front of the, uh, in front of the, the panels and they would  slide apart. And then you could actually make changes and stuff like that. It was both  size of a large boom box. But I mean, and the, the speakers themselves, they were, they were  separated, but, and they were probably about maybe a foot and a half tall each one, maybe  maybe taller probably close to two foot. But it was all clear also everything all that was clear  with it. And so it was just that was way cruel. But yeah, that thing was like $1,500. And I was  just like, soon I look a bitch, damn it, I'll never be able to afford that. Someone's got to be  stupid rich to be able to afford that. Yeah. And then you find it. I'm a brand new. I don't know,  even back then I've one of the reasons the the finance gods have never liked  even in even whenever I was first out of school a lot of my friends they were able to go off get  get credit card things like that I would try from time times I got  scum sugar and everybody was like like yeah I get a credit card we'll give you t-shirts  So, hell yeah, I got free t-shirts,  because I'd go, be walking around Emerald College  and there'd be someone there,  growing t-shirts at you if you fill out a,  an application for a card.  And eventually I realized it's like,  yeah, they're basically gonna look at my credit  and go, hell, fuck no, and just laughing for you.  I'm okay, we'll ride on the t-shirt for him.  And I, I had a, one of those,  finally got one of those starter cards  where you actually have to pay you $500 first  and then they started up.  And so you end up with credit limit is half that amount.  Yeah, just a secure credit card.  It's a secure credit card.  And I tried that once.  And I mean, that was a big pay on the ass  because I was like, yeah, okay, well, you know,  and I've got paid and I was like,  all right, let's throw some extra money over to that.  What's have a secure credit card and yeah, yeah, that was that was the disaster and a half so I was like, you know  What now apparently whatever they whatever they're all the rhythm is that tells you hey this guy's not good at with money  No, they was probably good because  The few times I'll I even tried to probably the system to where I might be able to get something like that  It was like yeah, okay, that's why they said no. I mean that  I got spent a little time in jail for a hot check and so after that I realized, yeah,  I'm gonna pay him a check.  No more.  We're not gonna, we're just, it's all, I'm on a cash, cash per cash basis and that's  all we're doing.  Right.  The long time.  That's what it was and it's still basically cash, but it's just, I just use a debit card  now.  Yeah.  That was funny.  But yeah, you know, it's funny, you know, we're all sitting here talking about what  we used to do and everything.  You know, if there's any younger people listening to this later on, they're just going to crack  up.  They're going to be like, what the hell, man?  Life is hard.  And life is the same now as it was back then.  It's just people take it and what they're going through and they make it more personal  nowadays.  Right.  Right.  Oh, yeah.  How about woke?  Now, here you go. Don't woke. Wake the fuck up.  Exactly. Yeah, there's a different people being woke and wake.  And wake. Yeah.  It's amazing that one, they're allowed to breed.  And two, and don't get me wrong. You know, my neighbor just, their daughter is  almost a week old and congratulations, you know, younger couple, you know, but some of these  people out there? Yeah, I'm sorry, but some of them should not be breeding. Yeah. And I'm  sure my mom said the same thing about my generation. Yeah. Yeah. Yeah. You know, it's funny,  you know, all these, all these, all these New York kids there. I'm like, oh, this is so  know, you know, and they're saying all this. They don't realize that they're great, great,  great, great, great, great, great grand daddy. It's the same exact words. Yeah. You know,  I mean, back then back back five grades. The words might have been a little different, but  the meaning was the same. Right. Yeah, they didn't use skippity. Right. So the bell  bottoms. They just they just this generation just thinks they are the shit that they  have well bottoms. Oh my god. Yeah. Yeah. Back in fucking the 70s they had them then too.  Yeah. I I had a few paragins that was uh uh that were a bell bottoms late 70s I think.  I never had any PD or something.  I didn't like your money.  I think I wanted to pair and I didn't really like it.  Well, they did a really good job at school,  making it where we didn't want them anyhow.  Because this is back when first second grade,  just after the bell bottoms,  because they were talking about them there in school,  you don't want to use bell bottoms  small riding bikes because you might get your, uh, get your, uh, belt bottom pants, uh, caught  in there. And then all of a sudden you go to rack and, and die. And so, well, I don't know  that's truly you wind up going over to handle bars. So that's true. I know that, but it's  that that that is a proven fact. Yeah, we could do what did it. Yeah, once or twice.  Yeah, I want to tell you.  Oh my god. Yeah, that was yeah, it's that hurt. I'm telling you because I was normally riding on gravel  Not the road. I was riding on gravel when yeah, that man. Mmm. Oh  Fucking hearts. Yeah, that's why that's why I'm I am. I am right pantley was always rolled up  Yeah, or you had one of those bike or  a class for your pants.  Yep. Yep.  Or a clothespin or something, anything to keep.  I say, get pants on any.  Right. Yep.  But the men in the words of Archie Bunker, those were the days.  Yeah, right. Right.  But the most fun on a bicycle I had really with clothespin and a playing card.  Man, I sound is like a motorcycle dude. Yep. That was I agree with that  That was awesome and then when you put  Four on the front right spoke or the front. Yeah, right spoke of them or  Four I should say two on the left front fork  two on the back  On either side so you had eight  You know what that sounded like?  No, I never did that sounded like shit.  Now I just did one mate.  I think I tried two but went back to the one.  That one sounded cooler.  Yeah, eight sounded like shit.  One sounded cool.  That's the case where more is not better.  More was not better by far. Yeah, that's just sound like I  Can't even describe the sound really  That's how that's how fucked up it was you really couldn't describe the sound  That's crazy too much fucking chatter  Yes, but it was fun. Yes, it was  I mean, you get that.  You get those couple pieces of two by fours and that broken up piece of my would.  I would.  Yes, sir.  And you had a mother.  You had a motherfucking ramp.  Yeah, you did.  And you were cool.  Go.  And if you weren't careful, you crack your nuts on that center bar across the bike right  underneath the sea.  Oh, that's, yeah.  Yeah.  Fucking made me cry. I mean, I bought like a baby because I jumped the ramp. I was going good  I jumped the ramp and I  I caught air and I was root happening. I landed and and  The weld where where those bars come together on the on that  Main half you know going down the front tire the weld broke oh  and I was still standing up when I landed, so I didn't bust my tailbone, but the forward momentum  when I landed, I wound up missing the seat and I mean, I freaking balled myself right  onto that bar and just rolled off right there, cumbling.  goes running. I mean, I was mad because I couldn't write a bike no more. I had to go get it  re welded, which I had to pay for. Oh, yeah. Yeah. Yeah. I think it costs me like two bucks.  But two bucks was a lot of fucking money. You got damn right. That was 20 power bottles, dude.  I had to find that I was a kid to do bucks, you know, but I found them. I was back riding in a couple days  But I didn't I didn't jump the bike after that. I was too scared that hurt  That that well would fucking break. Yeah, I fucking believe that  Yeah, that yeah, I was not expecting that at all  And when you and I'm sure when you got home and you're still crying your mom says  shut the fuck up or I'm gonna give you something to cry about.  Right?  Or is like, well, you're dumbass, junk to bike,  and you weren't supposed to, so you got what you deserved.  Oh, yeah, there was no sympathy.  No, because it wasn't official dirt bike that you had, correct?  No, it wasn't.  Okay.  Oh, I know which bike you're talking about,  because I had one of those.  It was an old 26 inch bike.  I could be.  See how the yard seal,  and when I first got it,  I almost couldn't ride it.  I wasn't big enough yet,  but it didn't take long.  And I grew, and yeah, man,  I rode that bike fucking everywhere.  Yeah, because if you didn't ride that bike everywhere,  guess what?  You were fucking walking everywhere.  Yes, sir.  That's right.  That was a lot slower.  Yes.  Was the more time consumption.  And yeah, that just wasn't working right.  So I just tried to bike, be a lot quicker.  You know, and I had to,  and in high school, we did not have buses,  like they did school buses.  My town didn't have school buses.  What the hell, belt?  Yeah, we didn't have school buses.  What did you have?  That's what I mean.  We had fucking LPCs.  Leather, personnel, carriers.  So grade school for me was a block and a half from my house.  Junior High, it was a mile from my house.  house. And if you wanted, if you had the money to fucking ride on the public buses, you could  ride on the public bus. But you fucking walked a mile each way, every day to school, to high  school, that was more than 20 miles round trip easily. Yeah, you took the fucking, the regular  city bus or if you had a bicycle and you fucking got your ass up early enough in the morning  You get a ride your bike to school  But it was yeah, well one of these days I'll look up the distance from my house to the high school  but it was  10 15 miles one way  walking a half  for me  Yeah, I was in between out junior high and high the high school  And we were walking a half both ways.  Yeah, and I'm sure that in from kindergarten to high school,  your town was so big that you stayed in the same fucking room.  No, no, no, actually, we had a kindergarten.  Well, it's actually I didn't go to kindergarten in that town.  I went to kindergarten over in Maine, Oklahoma.  But about first grade, it's second grade, third grade,  grade their primary for 5th 6th 7th 8th 7th 8th, I don't know 4th 5th and 6th, they were in  so there was the primary that was the elementary junior high was the 7th and 8th and then  you went over to high school for the last four or nine, 10, 11, 12.  Oh, uh, I mean, we had a pretty decent school. I mean, we had, you know, to, but essentially  right around 2,000 people all the time. It was usually about 19, 50 to somewhere along that.  Nowadays, I think they're actually up, they broke the 2000 finally. But yeah, how many was it?  How many was in your graduating class? How did you? 42. Yep. Mine was little over 1300.  And the guy didn't have buses.  No, we did not have buses.  That is crazy.  I mean, in town kids didn't have buses, but the out of town kids were bused in.  Yeah.  Yeah.  No, we, uh, I didn't get that luxury.  Yeah, there was no school buses and Lincoln, Nebraska in any way she performed.  They still had wagons.  Close.  And that was a lot of fun walking in the wintertime to junior.  I bet it was.  Yeah.  That was a blast.  I remember high school walking.  Just walking the block in a half.  And by the time that I was back when I was, you know, it was cooler to go ahead and just  take a shower.  First thing in the morning and stuff.  So I'd get out, get myself all brushed my head and all that, and get by the time I got to the school.  If depending on how the wind was blowing my hair froze in some funky direction.  I would always, always have my hair in some weird position if what didn't want it to be.  Well shit, you did it.  And you just never changed, did you?  because your hair is just in all kinds of different positions.  Now it still looks windblown, but that's one reason why I'm now just basically just  Caesar and just get it as short on top as a possible can and shorter on the sides.  Yeah, see I like bold.  If I didn't have to shave, I would.  I probably like bald too, but.  Well, yeah.  it bad enough. I've been this summer. I've been shaving the old old face again and  Yeah, I'm a little bit more isn't it? Not really. It's about the same  All you could put says it was just what would collect in your beard and it would become you know it would be a  It was like a  An air conditioner it would keep it cool. Oh, okay  Yeah, no, can't do that. That drives me a little bit too much insane. Just like having  have an air touch my ears now. You are compared to what I had when I was in high school.  That'll never happen again. Right. Well, that is all received into my back now. So  I just I don't have long enough arms to break that.  But I could break my hair in high school.  Now of course I didn't, but I couldn't have.  Yeah, I tried going bald ones.  I could not see you with the bald.  I really can't.  Anyway, was you brilliant? I could not see a bald.  I've done, I mean, I've done the whole  the  West pack haircut.  Do where you just buzz everything off by the time you get to your first, your first  protocol.  It's usually grown out of nowhere.  It looks all of it.  But yeah, I know.  I lived that in basic training.  Yeah.  Yeah.  We got an AI team.  AI team to have iron kite.  Yeah.  I'll be back in a few minutes.  Okay.  All right.  to go I said I would show it's a and that high and tight.  Well, no, hi.  Maybe if you're lucky at quarter of an inch, was your high?  But you know, I have nothing.  And it just wasn't.  Well, I had enough.  I had enough trouble with the with the first class, but he also  thrown a shit fit about how whether I was shaved or not shaved. Well, if I ended up shaving  ever freaking day if they want you to shave, I'd look like I used the Bobcat shaving system.  That's where you take it and grab a Bobcat bites with a scruff of snake. Take the thumb,  ram it up. It's bright and use it. Use the foot. Yeah. Well, we had the fucking shave every fucking day.  the  all the rest of the birds. You know, I was never let, well, I wouldn't say fortunate.  I guess I'd have to say thankful right. I'll say once a day. Yeah, I shave. I shave at the  most I'll shave every other day. But most of the time, it's, uh, I will, uh, I will shave right  I'm like, these days I'll share about once every three to six days, depending on how lazy  I want to be with it.  Yeah, right now I share once a week.  Yeah.  Cause I can.  Exactly.  Back in those days you didn't have a choice.  No, you're not the one that got to, uh, got to make the decisions as to.  But it's a lot of facial style you wanted.  Yeah. And in the army, understand, you know, people that had shaving profiles  because they got bumps on their necks.  Right? I got that.  Yeah. And, but now all there in the army, there's a very, very loose standard,  The facial hair.  I mean just in common you can have a fucking tight beard in the army now.  Really?  Yeah, that's how loose the standards have gotten.  I think with this secretary of defense, yeah, I think you're a lot of shit is changing.  Right. They're taking the DEI out there. Oh, yeah, I knew they were taking the DEI out there.  What can that thing out? Thankfully? Yeah, they're taking a walk out. They're taking the transgender. Yep.  Yep. And we're going back to the old days. Let's get it. We need it. Yeah, they and even I can't remember.  I was watching on YouTube, but it was, I think it was a segment off of Fox that the  secretary of defense is now allowed the, it trashing of the barracks, like in basic training.  Oh, gosh, you're shit again.  Yeah, they can toss and they can also shark.  What's that one?  Shark is when all the drill sergeant's get around one guy.  Oh, okay.  Okay.  He's bringing that back.  Well, good.  So they're going back to some of the old ways of life.  No more stress cards, well.  And I haven't had stretch cards for some time now, but that whole fucking mindset is going  by by right.  Yeah.  Yeah.  And out of that group that I was telling you about earlier, that oh, said battery, that  that timeframe, they had stress cards and basic and AIT.  And that was their mindset.  And we were doing something.  I can't remember what I think it was discipline in a couple of the soldiers, but the whole  group was there.  And one of those soldiers pulled out that stress card.  I said, okay, let me read that stress card.  And D.O.  I don't remember what the hell said.  That's only been fucking what?  2000 and  Five  Maybe 2006 time frame  So it's been what?  19 years ago  So I got that stress card. Yeah, so I get that stress card from that kid and I tear it up into  Confetti and just basically throw back into his face in that he said what he said about it, huh?  And I said now you think about this  You're getting ready to deploy into a fucking combat zone.  Do you really think the enemy gives a fuck?  They want you to be that week.  Yeah.  You think they give a shit about your stress level?  They will fucking shoot your ass all the same.  They don't give two shits about that stress card.  Nope.  What's so ever?  That bullet is going to...  And it is not racially discriminative.  It does.  That bullet don't give a flying fuck.  What color your skin is?  What your religion is, what your background is, it don't fucking care.  It's gonna kill you all the same.  Plain and simple.  You really want to go into a combat zone with that mindset?  You better fucking think that one again.  Oh yeah, yeah.  Stress cards never came out again.  I said, I'm getting ready.  Yes, I'm an asshole.  And I'm getting ready to get you deployed over into a combat zone.  I have two jobs right now.  I told us to every single soldier that I had regardless if they were getting ready to  pull your come back.  I said, there's only two jobs I have right here right now.  One is a train you up for combat and the other one is to get your ass home back alive.  Right.  Anything else is fucking irrelevant.  I don't like to objectives.  So do you think I'm an asshole?  Well, yeah.  Yeah.  As I say, wait till you meet the enemy.  Yeah.  The whole purpose is to make you stress so you give up your shit.  Yeah.  So yeah, I don't that don't fucking fly here.  And sure, fuck don't fly in combat.  Nope.  Oh, yeah.  Leave that mindset here and now.  and it's the issue I had with a lot of the folks who wanted to run that style of military.  It's like, okay, well, it proves to us that you are not a, not a, a, a, a, a, a, a  friendly for the, for the United States government because you're too busy worrying about  what, you know, seeing how you cannot put us at a disadvantage for the, uh, for the enemy.  Yeah.  I would be not that have to be too busy yelling at, uh, that senators going, Hey, stop trying  to get us killed.  The, and that's the problem for a long, this wild, the senior command structure was all  about, you know, how many, how many times they could kiss the fucking politicians ass.  Right.  No, you're gonna fucking get somebody kill is what you're gonna do  Let the politics  Yeah  You let the politicians dictate  the fucking  military  You're yeah, you're just gonna fuck everything out and they did that sure the fuck did  but I  I am no longer in, so I don't have to worry about it.  That's right.  I don't think I could survive in the military right now.  Even going back in as my old rank.  Yeah, I wouldn't survive very well.  Because I am not politically correct nor am I politically...  Yeah, I would just say I'm not politically correct.  Here's a type that is NSFW.  you. Not paperwork.  Oh, say for work. I have never heard that one before.  Really? Oh, yeah.  I didn't know. I didn't know what it was for a long time, but you know, you see pictures and you see that in SFW and I'm like,  what's that? I had to look it up. And then in fact, oh,  And then I saw the picture and I saw the NSFW.  Yeah, I can see how that picture would not be safe for work.  Okay. Yeah.  No, my two favorites are LLMF and O-D-F-S.  Last like a motherfucker and I'm not sure.  I don't know.  Out there fucking flapping.  He got him and heard that.  He on.  Yeah, those are my two favorites acronyms.  Yep.  Now, I'm sure I could talk one of the drivers at the other day because he was supposed  to go one way and he messed his exit off of 35 to go to Athens.  And he had it in his mind that he was going to go to in us.  So I guess that's right.  I would go to Athens.  That's right.  It's not the right way.  And then and he had left before I did.  And there was an accident in the traffic  or in the construction area on 35 through Waco  because yeah, that's just a fucking mess again.  Right.  And so it was down to one lane on the highway going north.  And he was in the same traffic jam that I was.  I was just watching people trying their damnness to fucking squeeze in to get one car closer  or one car further up in the traffic jam.  That's always fucking just amazed me.  I'm fucking hilarious about people.  Want to try and get their one car soon.  It's like people were all fucking stopped here.  Why are you trying to?  Yeah, I just, I don't give up.  I just fucking start laughing.  So anyway, we were shit.  We were halfway between Elmont and Hillsboro  when I passed him I  Like why the fuck am I passing this guy?  It's supposed to be his exit was like down a wake up  area and  Already passed elban was that like about  20 miles no not that far. Yeah  From the southern part of wake-up to elban is about 20 miles  And we were north of Elmo and I passed him any, you know, and I get back into the lane in front of him.  He flashes his lights to let me, and then I turn on my hazards to thank him.  And at that particular point in time, he's like, why the fuck am I here?  Why did Ron just pass me?  Well, probably because I was going up to Grand Prairie, and you missed your exit.  your exit and you're lost and I sent him the test. I said, you're just a little bit L. L.  R. L. L. M. F. Because you are way in a fuck out of where you're supposed to be. And  then when he finally fucking replied, it was like, yeah, I fucking missed my exit. Yeah,  that was only about 20 years. So he got off at the next exit and got himself turned  around went back down south so he could get on the correct road to go over to  Athens.  But I was like, man, wow, you fucking lost like a motherfucker today.  That's for damn sure.  Well, well, I laughed at his expense.  So that made my day.  Absolutely.  So what mission since you are back home now, Brian?  What missions have you accomplished since you've been home?  Yeah, let's be here.  I have, yeah, I try to get something to accomplish each day.  See, my day, I got the, I got the cabinets underneath the,  I need to copy the product, I got them cleaned out and got started on the cabinet  that some of the other cabinets that have been needing to be just cleaned out because well we've got we've got stuff and stuff and more stuff that's that's been running around there and and it's just time to get time to get the crap cleaned out and it's just built up and you know just.  We've got, we've got, we've got for Christmas and, you know, and never used or used  wants and never, never touched again, top of stuff.  So we were like, all right, whatever.  You know, I just got to get that cleaned out.  Today I was going to get, I was going to work on the work, work some more on getting some,  some more of the trees knocked down and yeah, they just didn't happen.  I got myself kind of gumption dap. It was already 1230 and I was like, damn, it's already  90 something degrees outside. That's going to really suck. We'll do it tomorrow morning.  So that's what I'm going to try to do tomorrow morning.  But we'll get it all to do it.  Yeah, I got the dog guard mode again, which is one thing, one that I do every time I'm home  just so that the fleas and ticks don't get to out of control. Yeah. And I say we got when  off spent about $200 on the dogs because rain's ears was bothering her and Watson has got  scams on the top of his head. We were going to the hill. We come to find out more. But more we got  to watching him and stuff. He would go to scratch and he'd start off at the back of his neck and  work himself up to the top his head. And so we're thinking he's just got, and he's just  getting over exuberant and is gouching into his skull. So Doc went off and gave him a big  old shot that's supposed to basically knock all the, uh, the allergy problems that he's  got, not get down for about a month. Okay. So he does get allergies or is yes. Yeah,  it's brass.  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  one  like to hold the grass and everything else in there.  Oh, okay.  It's not uncommon to see him come in from outside and be dragging a, uh,  dragging a chunk of weed and his butt cheeks.  Just, just one day,  it's just,  it got more like that.  Like that's wrong.  It was like, they get, you know,  he got a plank or an hour or a year, but, but,  but again, that's just someone who's,  someone who's someone who's not all that smart.  He just tells us.  That's me, are you?  Oh, I'm talking about Watson right now.  But you know what the shoe fits.  Dang, that's cool.  But now it's just so in rain, her ears, she just  talks it. Yeah, just need to start taking a  a bit of just rubbing alcohol and a big old cotton pad and just wet it up and  start and rustler down to the ground and cleaner ears with that because the  alcohol will dry up the oils that are in the wax and so you can really give it  get it cleaned out pretty well. So there's you have a lot of hair in her ears as  Well, no, no, she's not she's done heavy doodle in her so that's there's not any uh  Not really a problem with hair. It's just she's got big floppy ears and so  They and and then you got Watson and his weird kink of black and loving to lick her ears  so  my phone  and so  So yeah, he has constant lick in and  and stuff just doesn't help it dry out at all.  So just come to help them a little bit of a yeast infection.  Thanks to all the crap that's built up in there.  And no, yeah, okay.  Gotcha.  Yeah, all the moisture.  Yeah.  So, yeah, there's, there's,  there's a front, a front of having cats.  Of course, our good old country doctor  that we have. He that's I think that's the most we have spent at one time at his office  ever. Okay. Most of the time, I mean, most of the time we go in there just to get like  shots and stuff like that and it'll come back on and it'll end up, it'll end up, uh,  not even a not even a hundred dollar bills.  That's it.  Yeah, I mean, that's always, you know, it's like $75, $80, which I mean,  stop incredibly expensive, but at the same time, you know,  I am good to talk about when they take their dogs to the vet and they're like,  God, he really brought a rabbit,  I've been spending $250, $300.  Why do you get a chance without much?  But you say that's the thing people don't don't realize you can tell of that now, you know,  what's there's something cheaper.  Yeah.  I want to talk to just that he's just.  But now we're not taking you to Fox.  It's okay.  Relax.  Well, no, he is staring on this.  He is a country that I mean it is.  actually taken whenever we'd taken him in this to bet what's him to see about his head.  We were expecting him basically to say, well, he's scratching a lot. That's what dogs  do. You get us kind of out of find a way of managing the scratching some. He's just  going to go over there just to just have a bet tells he's he's being a dog. So that'll  be. No, he actually he actually was able to educate you. Yeah. Yeah, he was and he usually  does. He's easily very good about that. Getting it, getting it all taken care of, getting  it nice and nicely resolved. And yeah, and it's not a, uh, it's not being a problem at  I mean he get I said just  Just uh there's what needs to be done and  You don't need to be smell my cotch so get away from it. Yes, you  Yeah, he's a fair and honest individual. Yeah, very nice yells  Yeah, anybody else the best very good any don't it's like name one is money  He's got to find that fair and honest individual. Yeah  Why it's so hard to fucking find a decent mechanic  Yeah, it can't be difficult there. Agri.  Because they're very cheap, fair and honest mechanics out there.  Right.  Yeah, what fucking the dealership around here?  I think they're at $180 an hour labor rate.  Ah, only.  But the one that I go to these, I think you finally raised this price.  He's at $130, $135, $140 an hour.  All right  But again, he they got a fucking charge you  Or something that you don't fucking need  We're gonna fix the problem  That you have it here  Yeah  So that's why I like you know this particular mechanic that I take my jeeps to or  Jeep  Well, all the vehicles actually  All right  What are you not wrong with that?  No, you're gonna start finding good mechanic. Yeah, we got our local mechanic. He's good. He's over. He's busy as all get out  So you may sometimes it may take him a little bit to get to your to your vehicle, but  Yeah, I had yeah, I had one of those shops in  Law and Oklahoma station at Fort Sill where if you had you know a major problem with your car  It would take you fucking a week we can have to get it in because he never did any advertising.  The only advertising that he had was obviously his name was in the phone book because he was a  business and he had business cards sitting on his counter. But other than all of his advertisement  was word of mouth.  Now that's exactly if it's if it's if he does word of mouth and he's a week, we can have  hell. He's a damn good mechanic. Yeah, because I had a Buick, I had a grand damn that I bought  it for brag. And then that's the car that we had at in Oklahoma. And it was when they started  transitioning engines from distributor motors into EFI. But the block still had that that hole  that you could put a distributor into.  Oh, okay.  And it was capped off and with it had a rubber-o-winged, well, the car was shit.  I remember how old at the time when I had the oil leaks that I could not fucking find.  And he was like, this year vehicle, it has this motor.  See that cap right there?  That's where in this trip here, you used to go to.  There's an O-ring in there.  Guaranteed you that it was, the O-ring was cracked.  Guess what?  The O-ring was cracked.  He had to basically take the whole top end of the motor off to get to that piece and charge  to me $98.  Oh my God.  Dude.  I would pay that gladly.  Yeah.  And that's why he was fair.  honest. He didn't give a shit. Well, he did give a shit, but he didn't give a shit about  what you thought the mechanical issue was. You explained it to him and he was going to find  the problem and fix the problem. Right. Plain and simple. Now, of course, if you wanted to buy  I said a fucking tires and rims.  Well, he would sell you tires and rims.  Yeah, he'd order them for you, but if that ain't  what is gonna fix the problem,  then why the fuck are you buying rims and tires?  All right, let's fucking fix the goddamn problem.  And that's the way this shop operated.  Okay.  And it was a bitch to find it initially.  No, it's one of those that's hit the way.  Yeah, there was a strip mall right on one of the main streets and he was behind that strip  mall and you had to go through the back end or kind of like the alley at the end of the  strip mall to get to his shop.  I don't know how many times when I initially was trying to find this guy.  How many times I drove past that fucking, you know, it wasn't a street.  It was just part of the fucking parking lot, but he was behind it.  And you could find that motherfucker to save your life.  Finally, part of them.  Once I did, yeah, he had all my business.  That's awesome.  Yeah.  Yeah, I'm still looking.  I went in.  I went into that shop that did my brakes because they did to do my ball joints and stocks  and all like that.  The quality give me and just revenue the wrong way and you're saying $3,500.  That's parts of the labor.  And I was just like, that's just too fucking much.  You know.  Yeah, we evolved the weights and what?  Shocks.  Oh fuck, you get the sharks.  fucking change those when I get down there.  Yeah, I can get away.  That long. Oh, yeah, I can. I can't.  That's it's not bad, bad, but I went in like last week.  And I told him, I said, dude, you need to rework that that, uh, that quote.  Cause I says that that's just that's just a little bit outrageous.  And it's a nap a shop.  And there's a nap of warehouse riding town here.  I found out.  I'm good. I can get all four shocks. The steering stabilizer and four ball joints for 800 bucks.  So it's like you went and it charged me $2,700 in labor. I don't think so.  Yeah. No. I told him to rework it and he said he'd call me and he hasn't yet. I think  up this ball. Yeah. The shots. Yeah, the sharks we can fucking do. That's easy. Yeah,  see what kind of sharks were you looking at? I think I think they're running. Uh, it  is. I can't remember. I mean, it's nothing fancy. You know, it's not as, uh, because  the guy I was talking to him and do that actually lied to me because the shocks that  he was looking to put on my Jeep or 250 a shot. And I said, dude, I said, that's the price  of Fox shocks. And he's like, well, this is Napa brand of Fox shocks, Fox makes these shocks.  Well, I got home and I started looking and that's not true. Bill steam and a few  other shock makers make the shocks for Napa box doesn't. So Fox makes for themselves.  Yeah, I know. And that's why I looked it up because because when he said that, I'm like,  uh, no. And it's like, you know, I don't need, I don't need $250. You know, time for  Yeah.  What about the boxes?  Yeah.  Well, if you're going to go there out, then fucking get box shocks.  Exactly.  Exactly.  Pay an price.  I want that fucking name.  Yeah.  Now, Bill steam, those are pretty damn good shocks too.  They're like a real close second to Fox.  Who's that?  The Bill steam?  Yeah.  Yeah.  Yeah.  Yeah, no, I would not. Now I would not buy red cheroes or hill country.  You mean, rough country or rough country? Yeah, I won't. I won't touch you.  It was those. Yeah. No, it just I was looking at it.  It's like, man, I, you know, you know, I'll spend 80, you know,  75, 80 bucks, whatever on stocks. But I'm not spending 250  because I'm not wheeling that much.  Yeah, I thought it was wheeling constantly.  Yeah, I would have  Fox Fox or something like that.  You know, yeah, we set up that is meant for that particular application.  Yeah. Right. Yeah.  So yeah, no, I mean, I mean, the shocks I can get any time because I mean,  They have it.  And yeah, it's not hard to change the shocks.  And yeah, that's why that's why Wayne praised me.  He praised me, you know, 15 little over 1500 for four shocks in it.  And 300 for a steering stabilizer replacement.  And I'm like, man, no.  I mean, I would, I would, I would suffer in pain and do the job myself. Now the ball joints,  you know, the ball joints are a little more involved in you need an alignment.  You know, when you do the ball joint, well, yeah, you're also going to have to get the fort  to unseat the ball joint. So that you have to have a clamp to resee them. Yeah. So yeah, that's  just a little bit more of another taking. Yeah. Yeah. And so that I mean that, I mean, yeah, I wouldn't  mind. I mean, but yeah, I shouldn't cost no 15, 16 hundred for that. You know, it's not. So that's why I  asked him to rework that because I told him. I said, that's what, that's what, you know, got me  old look as that quote you give me right I'm I'm not afraid to tell someone no I  do you can do better in that I know you can but I still haven't heard nothing  but I mean I'll probably wind up just buying stocks will do them when you get  down here. There's a ball joint saying, ain't bad, bad, bad. But they will make noise. Okay.  But I will send you a point of contact. His name is Dylan Nance. And he's a distributor for a lot  off-road parts. And like that box that I have in the back of my Jeep, right? I like paid  $420 for that box. That's not bad. New things out, you know, you go to off-road or some  other company and they're running, you know, over $600 for that box. Yeah, he gives a military  people discount. Okay. Yeah. So I mean, I've got to do something about the back of my Jeep.  I've got tools of back there. And I need to actually kind of claim it up. You know, you know,  I mean, it works for me. I mean, I mean, no one rides with me. Well, well, a belladow, they do now.  Normally, bellarizing the front seat. Now,  I was in Jeep today and I opened up the back and Bella jumped in on her own and then,  you know, jumped on out when it was time to go. So that was good. Yeah. But yeah, normally,  normally she sits off in the passenger seat and just lays down like, okay,  You don't want to see.  You don't want to see.  Nope.  I'm good.  Just drive.  8.  Yeah, exactly.  Drive.  Jeez.  Right.  I saw.  I just want to be able to hold the tires.  Yeah, that's actually what shocked me because, because, you know, when I brought her home,  I was like, you know, that's exactly what you did.  Got in front seat and laid down.  Okay.  Yeah, I was afraid.  You know, she'd throw up or something like that.  Nope.  That's cool.  Yeah.  I don't think.  Looks like it is about time.  Stop bringing this old bird onto the ground.  So guys, I want to say thank y'all very much.  We were the, the, I'm an attention in the, and the, and the work that, that people are trying to  kind of put in for the show. We started growing a little bit from what I was able to peak. It's not  much, but at the same time, I think it's more of the fact that it's, uh, summertime schools actually  We started to kick in now.  So I'm hoping to see that we actually gross more,  but anyhow, we are a value for value show.  And this is one of what this actually means is that,  you know, in the commercials,  the whole time we were here talking  and having the discussions that we were having.  And the reason why we don't do breaking  at the, uh, the, the player of the conversation up and, and stuff like that is because  one, if you're running a mattress, you know, to go to mattress firm or someplace like that.  You don't have to get to a, to get a mattress. You don't, we don't need to sell you a mattress  from Casper or someplace like that. We don't need to sell you a toothbrush or a razor or  or some new widget or a box of monthly subscription box of random items.  These are things that a lot of people do grow and they try to sell you.  This is just part of what a lot of people in the podcasting industrial complex,  like things that that's how you're supposed to do it.  If you want to make money, you get advertised.  Well, no, there's another way in this call value for value.  And what it basically breaks down to is how much is our show worth to you?  How much do you think what we talk about the community we bring,  bring together? How much is that worth to you?  Because a lot of people, they may say, I got a lot of value out of it.  And maybe I would, I can take a couple hours out of my day and help do chapter art.  All right. Take some time out of my day. And I can, I can work out chapters. I can  serve chapters instead of 53 different chapters. We've only need about 28. You know, we can set  you can, we offer the ability for you to help in either your time, your talent, or if you're able to  treasure and because what we're doing isn't free now we're letting the bill for the vast majority of  everything. But at the same time, if you wanted to help us to keep going, you're able to do that.  you can go to a modern podcast app like true fans or go to a podcast guru and each one of those has got a  feature that allows them to support what's called the funding tag. And when you hit the button for  the funding was support this show button or whatever you want the person calls it, but now  as it's support the show, you get redirected over to the PayPal page and you're able to  give any amount you want. It could be a dollar, it could be a thousand dollars, it could  be more. It could be on a monthly basis, on a weekly basis or just a one-time support.  the options are all yours. I hate just trying to state that there's, there's a lot of  people do little clubs and they're like, oh, and if we're selling dollars a month, you'll  get all the stuff. Well, I'm not working on it. I'll tell you. And if you think that's  worth anything, then you can, you can throw some money out direction. However, much is  all really up to you. And one of the things that we like to do here is if you got comments  questions or things like that, you can actually send that over to us and we will reply.  And you don't even actually even have to pay for it on that.  Again, we do everything that's free so that you can decide what we're valued at.  We're not requiring you to pay just $7 just to have access to the community.  get access to the community. You can, the, the, the, the, the, the, the, the,  the century is what do you think the community is worth?  And so that's how, that's how we're changing our way of doing our,  doing the show, help it try to fund the show. And that's what it's for. It's not,  so that we think we're going to get rich. We know, we're not, we're going to get rich doing  the show, but we might be able to get people to help the fund the show help paper for hosting  or if hosting starts getting too expensive, you know, we might have to go off and start  spending up our own types of servers and things like that. That's something, you know,  miles down the road. I'm not worried about that at all. But so we have different things that we  can do and you're able to provide that type of help. And so that's what I like, that's the value  value model that we use because it's a lot easier to  like cleaner and it's, you know, it's a it's a it's a  different way to where we don't have to sit there and and  probably to you with commercials that mean nothing to you.  They mean they don't have any significance in your life.  You know, you've got you just bought a new mattress and box  you don't need the cast for mattress and you don't need a you don't need a  quip toothbrush or anything like that. So there's a lot of different ways and  means that you can help and if you want to know how you can do that you can  always shoot me an email that a circle cast CIR CLE C A S T at gmail.com or  you can shoot rich in email. That's our  Chelsea and that's C H E L S O N at  gmail.com. And if you want to get a hold of  baby, hey, just send one over to us because  no one remembers how to spell his, his email address.  So let's just, we'll just send it over to us.  We'll send it over to him and we'll hear about it  the following week. So with that guys, I want to say  again, thank y'all for for listening. Thank y'all for  for contributing and helping in ways that you do. And Rich, what do you have to say?  Oh, not too much. I want to thank you, you two. Again, this, this, I, I enjoyed this podcast. It  was, it was a lot of fun. Talked about a lot of different things. And I just, I just enjoy that, you know,  where we mix it up and don't know what we're going to talk about sometimes. But, but yeah, I want  to think everybody else is listening and downloading our show is still gives me. But you know what?  Keep it going because it's a lot of you know it keeps us going too because at least we know  a couple of y'all are either laughing at us loving us hateness or whatever and you know share this  out with your friends your family you know people you love people you hate you know share with  everybody, you know, because believe me, in our topics, we can normally find something  for everybody, whether it's good, bad or ugly.  So just want to thank you for listening.  And yes, in this email, let us know what you think.  Or if you have a topic that you want us to discuss, leave, I don't mean send it to myself,  are  focus or yell at us. We don't care. And we're all gen experts. So yeah, they don't hurt our feelings.  Nope. That's about all I got. So do what you got, man.  Well, I appreciate, uh, and always being able to ramble with you guys  on about anything and everything. We decide that we want to  bring up and just converse about. And also, as far as you guys out there listening,  you know, please give us a jiggle or a shout out on something that you want to ask us about.  And we can debate upon it.  We can shout out at each other about it.  You know, just the topic that you think that even like the air is talking about.  Absolutely.  So guys, we bet Rich, Ron, appreciate y'all coming on and  love here talking with y'all having the discussions that we have.  Cause there's always something interesting that comes up and  get a, get a cool insight to somebody that we never fully had before.  So like I said, it's always fun to be able to,  to get to talk with y'all and that can't wait to do it next week, guys.  So y'all take care. We will see you all. See y'all next week.  All right.  All right, guys.  All right, till then, you'll make me safe.  Absolutely. Till then, you'll take care. See you.  All right. Peace out.  La.  Bye. Bye.",
  "created_at": 1755584392
}