{
  "podcast": "Ultra Green Alex Jones",
  "episode_id": 41350383870,
  "episode_title": "Episode 0342 - Aug 17 2004",
  "audio_url": "https://api.spreaker.com/download/episode/67261862/episode_0342_aug_17_2004.mp3",
  "duration_seconds": 10625.939,
  "text": " My show is owned by the world, but what is it they don't want?  It's because my older shows going back 30 years are ultra green.  They're not evergreen where they stay the test of time. They get more important.  And so the system knows that those clips are getting hundreds of millions of views, some of them,  where I lay out and predict hundreds of subjects and what's going to happen.  Mainstream media government cover-ups.  You want answers? Well so does he. He's Alex Jones on the GCN radio network. And now, live from Austin, Texas.  Alex Jones. Hello my friends. Thank you for joining us. It is the 17th day of August 2004 on this Tuesday edition.  I'm here Monday through Friday from 11 a.m. until 2 p.m. Central Standard Time back from 9 to midnight Central Standard Time.  But the rebroadcast for our affiliated stations from 1 a.m. to 4 a.m. Central Standard Time.  nine hours a day no excuse to miss the broadcast no matter what schedule  you are on again thank you for joining us the websites are  info wars dot com prison planet dot com and prison planet  dot tv  eric pratt the son of larry pratt who i've never interviewed  but i've heard interviewed a national radio  will be joining us  from don owners of america  the giverson overview of where the second amendment the bill of rights  period  stands right now and of course this is a real conservative organization  that has been outspoken against the patriot act and put out the tail  analysis  exposing how it's affecting citizens and has nothing to do with terrorism so  you'll be joining us  uh... coming up in the next hour were also going to have wide open phones  i've got all this news here in front of me but i've got three separate articles  today  whether training citizens to title tell on neighbors truck drivers  repair people to your homes all over the country and in every article it says  to fight terror and crime  the look for terrorist and criminals  now they couldn't get away with this just three years ago to quote fight crime  you know having everyone be recruited as a spy we know that's not freedom but  see using the backdrop of the war on terror oh we've got to stop the terrorist  things changed  ever nine eleven  well there's no real terrorist so they're just recruiting everyone to go after  the general public  very serious  will be going over those reports  also uh... they're not talking about pulling seventy thousand troops out of  asian euro  now frankly  i can see pulling trips  uh... out of europe  nothing but a european welfare plan  but pulling thirty thousand out of South Korea is insane.  Unless you're a globalist and you want North Korea to attack.  And so we'll talk about that in the Pentagon plan to get the psychopath  in the North Korean capital to attack us and we'll go over that. So  we go into Iraq that was no threat to America, no threat to Israel, no threat  threat to anybody  that's admitted by the government's own documents  but north korea threatens the nookas literally on a weekly basis in their  official publications  they have missiles thanks to bill clinton in the new world order  they can hit any part of the united states any city in the united states they  have murder  technology now so they can have multiple warheads at top the missiles  when they come into reentry into uh... the atmosphere  over the continental united states or the possessions  and we're not worried about that  people openly threatening to nookas you imagine if siddhana every day was  threatening the nookas  what will happen to this guy  for sure for rea is sitting on for trillion in oil and isn't the middle of  the middle east of all these other  well-producing countries around it  and north for rea is an a pushover  and so that's why they're not being invaded  but that is on the  i would say moving towards the middle burner from the back burner now to  still war going  with north for real  meanwhile we'll have israel attacking iran getting us into the middle of that  and uh... they're gonna have a national graph folks  so we'll talk about it we get back and then just so much more  huge broadcast lined up for its a day  be sure and stay with us  on your host Alex Jones and again the website's prisonplina.tv.  Two nuclear powers, rattlesabers over to speed an area.  Peace in the Middle East, the rail again is another way  of a suicide bomber's destabilized the region.  Here at home and abroad, our own war  against terror continues.  Important news, the news you need is sketchy at best  when it comes to the mainstream press.  With Gondeg's Yacht-Boy 400BE World and Shortwave Radio,  World News, news that affects you  will be at your fingertips.  The Yacht-Boy 400BE is rated as the number one  portable shortwave radio in the industry.  And for no small reason when you consider ease of operation and features like over 40 station presets,  both upper and lower sideband, as well as shift to short, letter and aviation bands.  The Grondigat Boy 400 PE is fully digital.  It comes with its own carry-in case, external antenna and headset for private listening.  Normally retailing for $249, the Grondigat Boy 400 PE is now available from Klitskat Enterprises for only $149.95.  Call toll for $1,800, 569, 4340.  That's 1-800-569, 4340, or visit Klitskat.com.  tune the world and stay in touch with run-neak short-way radios and click scan enterprises.  The bird-y light is your premier source of purified water.  Its portable requires no water pressure to even enjoy healthy drinking water, whether it's  during normal times or hostile environments like a local or national emergency.  That's because it can purify raw, untreated water from remote lakes and stagnant ponds.  The bird-y light is unique because it removes pathogenic bacteria, cysts, parasites, and  harmful chemicals to below detectable levels.  It also removes phthaltase and odors like the rotten egg smell of sulfide and it extracts nitrates  and unhealthy minerals like lead and mercury while leaving in the helpful and nutritional  minerals of your body needs.  The murky lights rechargeable LED lighting system is so bright it can be used as reading  light.  Get the murky light for only $259 by calling new millennium at AAA.  AO3-4-4-3-8.  And tell them Alex, you know, sent you.  That's toll-free, triple-late, 803-4438.  We're on the web at MergyWater.com.  I'll get available in Iowa.  Hey folks, Alex Jones here.  And the behavior of our police is a reflection of our government.  One look in the mirror and we know our country is entering a high-tech police state.  Here's just a sample from my documentary film, Police State 2 of the take-over.  In downtown Seattle today, the First Amendment ended.  The Civil Emergency was created by the police.  the police attack people on the street and just coming at like the medical fields are  going to be enormous for me.  You see them here with their hands, cut the hand, their backs.  They are being led into the sand point grid, the neighbors in that area, the sand point  naval air station were shocked to hear that the old brig was being reopened.  This information is absolutely vital for all freedom levers in the United States.  Order your video today.  Call toll free at 888-25.  The Genesis Communications Radio Network proudly presents the Alex Jones Show because there's a war on for your mind.  President Bush's plan to withdraw up to 70,000 trips from overseas bases  contained abuse specifics, particularly about Asia.  Some experts think the United States may leave much of its Asia force intact.  Though Pentagon report is discussing polling 30,000 troops out of Asia, and another 30,000  of bases in Europe, predominantly in Boygslan or in Germany. President Bush  yesterday said he wanted to move 60 to 70,000 foreign base troops back to the  United States over the next decade. The movie said would help make the US  military more flexible and would reduce costs. He gave no other details about  the plan and officials in Washington told reporters that most of the  the civics would be ironed out in the coming years in talks with U.S. allies.  It is not even clear of the figure of 70,000 includes the 12,000 soldiers at the Pentagon  said last month would be pulled out of South Korea in the next two years.  They already pulled 4,000 front line battle trips, actual combat trips off of the  the develitry zone.  We have all these top generals, members of Congress, the House and Senate, saying the draft  is needed on both sides of the aisle.  We have the draft boards being set back up.  We have selective service.  Getting its funding radically increased.  We have 12 separate pieces of legislation that have been introduced from the last two and  a half years.  for real estate national draft  three of the four services  uh... not gotten their quotas for recruitment by forty two sixty  percent depending on the service  the only service that has gotten its quotas after lowering them by the way  is the marine core because of its pre-decor  and it's history  people are still very supportive of that and they could find a lot of people  that want to join a new serve  and of course i've seen reports that the army has missed its  re-enlistman quote a trying to get folks are in list  by forty five percent as well  now that's just current troops drinks  and they went down to one hundred twenty five thousand iraq six months  together now boost that back up to one hundred and sixty five thousand  not counting the fifty thousand mercenary forces and those are actual combat  uh... forces there's another thirty thousand logistical  uh... truck drivers and technicians in the country so  we've got to all what is that two hundred  at that  two hundred forty plus thousand  uh... personnel in iraq and  a secretary of the army white who i know fan of by the way mister in ron scamer  uh... white though before the war when he got told a resign he said look up  talked all the general we run the computer maps  we're gonna need five hundred thousand eighty four hundred thousand  but five hundred is the uh... what's needed here  and they said shut up you don't know what you're talking about resigned  and there's been former heads of the marine corps and former top  well the head of the air force from the first all for his republican  has gone public on this is ridiculous this is a lot of work  but see it's not meant to work  it's meant to be a quack-mile uh... the pentagon office of p2 og  created two and a half years ago said this is public just type p2 og and  research engine  you get you p i associated press pentagon press releases  saying we want to go out and kill people in cause anger and cause more  resistance because they may get to widen the war  there's the military industrial complex the private companies are making  hundreds of billions of dollars a year  office and you think they want to stop it it's like the war on drugs  we look at the war on drugs and we say man we we we we double the drug war  funding every ten years you can look at a graph  a just department graph funding  adjust federally it it doubles every decade  and the last decade  uh... we've had triple the heroin double the co-cannar's  rich  and we've gone from one million people in prison ten years ago  two seven million  seven million and they're just building more prison can you go  well wait a minute the more we spend the more we get uh... boy the drug wars  failing i say no  if you look at the real aim of the drug war it is a resounding success  many of the private presence are linked to companies that are known drug  traffickers controlling the  two hundred fifty billion dollar year industry here in america  and then when your kid gets caught using drugs are bringing a house for  drug money they get put in the private present  and work for the drug dealers  it's quite a system they they bring in the crisis off of the solution and then  basically took over the entire economy and the very same companies that own the  private prisons and ship in the narcotics are also the companies that own the  surveillance camera systems and tracking systems that are going in under  billion dollar contracts in every major city they are the same companies that  issue the black scheme asking black armored uniforms of the police and the  the armored personnel carriers and the ground penetrating radar for the helicopters and the consulting and the training and  they're the same people that have the companies that are hiring the mercenaries for torture and oppression in the Middle East.  I mean, it's really, it's not hard to figure out.  So it's just like with the drug war. Same thing with the war on terror.  We had the World Trade Center bombing in 93 and the leave the bomb took by the FBI, the driver trained.  The informant pulled out and was told let the bombing go forward. He freaked out, recorded the FBI ordering to do this  Because he thought he was being shut up and they were trying to shut him up and that saved him. Mr. Salahm  And after that they got the anti-terror funding double. Double is always the magic term a magic number and then after Oklahoma City  They got their funding more than double slightly over double  Then after 9-11. They got their funding double and now the 9-11 commission has come out  one another thirty billion a year for a new domestic  uh... anti-terror is our  which will have the power to arrest citizens for any  terrorism or crime that's actually in the legislation terror or crime now we have  a new c i'd if i cry  and uh... there they want  roughly that will uh... be a uh...  but a twenty percent increase over the last doubling some of the other  doubling  and uh... so it's the same thing and you're gonna see more care i mean look at  the graph does the funding and graces of the terror and graces  as the anti drug funding and graces the anti drug funding and the uh...  the uh... the uh... drugs increase  and it's the same thing with the uh... not that we've now got the policy reports  were the at the almost meant to be a  police action  to go on for the decade  to be lost  to create a counter revolution here in america to bulk and i's the nation  and uh... they made hundreds and hundreds and hundreds and hundreds of billions  of dollars off of it during the war  if we would have gone in there in five weeks in the military had programs  and sent tank divisions up the road and smashed  uh... the north and taken over with we would have been in full control  mister  uh... stop military at that time  but uh... never happened in five weeks  uh... no  it never did because it wasn't meant to happen it was meant to be a cash  machine  and so now the same thing and i reckon p2o g states that  uh... that this is meant to go on forever and then to use our records of base to  go into all the surrounding countries  and our troops are going to leave your up and they're going to go into the  Middle East  and when our troops start leaving  uh... the Korean peninsula  well you can guess what's going to happen there and then we're gonna have  a national draft  and it's off to the races in world war three  which the global is actually now want to have  uh... with uh... nuclear states like no three of you will then launch a  missile hit the u.s. we've only got a couple  and the global is for love to have a couple smoldering cities  they could set up police state here domestically  uh... while then going in and taking over north or read  and don't think they won't do it folks because this is the program this is the  plan again in their own policy reports  whether it's p-nack or bresinski in the trial out of the commission it's all  public it isn't even hidden  but they know that ninety nine point nine nine nine percent of people  do not sit around until four in the morning reading p-nack documents like i did  they know you don't sit around reading bresig and bresinski's book for  branch out sport they know you don't do any of that  you get home at six thirty you cook dinner for the children  maybe a second little league baseball  they spent all day being brainwashed by the government  uh... you can you get home and not a clock at night  pop in a dvd watching action thriller  the kids are in the other room playing video games almost all of them were  you simulate being you and rich killing americans  they're being brainwashed in the other end of spending time with them because  your exhausted i don't blame you  and then you go to bed you get up tomorrow and don't even know how your government works locally  much less nationally or internationally maybe you watch ten minutes of  fox and  here house someone's liberal there is the war and especially with such a  paradigm  but uh...  really  the wrinkle in their argument for giving up our liberties for so-called  security is history you give up liberty you get to your needs i love to say  because it's true  that's my mantra  their mantra is give up liberty you get security it's a fraud it's a  lot it's gotta be counted  uh... but they claim that giving up our freedoms will make a save will  why the borders more open than ever  uh... why did you go after sedom who you put in power who you told to attack  iran who you told to attack  you go ahead and attack  uh...  polite  you know why didn't you assassinate why did you do this you know what why did  you put him in power  and  we're not worried about uh... him jung ill in north korea friend nucus on a weekly  basis  that our government help arm of nuclear reactors rums welled on the board of  a bb that made the transfer we are both hunting to trade which is both  hunting  this degree with the republican owners of these companies ship the weapons  as the rubber stamper  that's why republicans never really went after clinton on china gate nuclear  gait and all those gates  because he was just a client following orders  i mean it's like halleberg and it may be as a giant off-source of ciri  that does most of the business with iran  our government has sanctions on iran  and then only halleberg allowed to deal with iran because of the special  loophole they designed in law  but like for the twelve years of the sanctions against the government submitted  the one u.s. company that could be business with halleberg and they had a  loophole the bill clinton  did you know that's public  mean how sick is that  how sick is that  they tell us that there's this big threat  we had to go in and get some down but meanwhile or three of  is starting to do this on weekly basis  with weapons systems that we gave shine in the day gave to more threea  that our government gave back to them that they gave more threea  and now we're pulling groups out of there to go to iraq  already pulled out four thousand  We're going to pull out 15,000 more.  Some say 30,000 more.  From the real threat, the ghost of the oil.  Now, who are the traders here?  Where are they right by?  Our terrorist cells are prime terror targets located near you.  Where are military bases and hazardous waste sites located?  How do you find the best area for solar, average rainfall, fish contamination, advisory  and major transportation routes?  In the new interactive CD book, Fruit and Places USA,  We'll find the information you want with over 50 interactive parameters of U-Control.  Find everything from house increases and taxes to brewing environmental catastrophes.  Located billion dollars is after prone areas to stay for cities, ideal solar locations,  and much more.  Complete with over three gigabytes of detailed information on each of the 3,000 plus counties  in the US, including 550 high-resolution, full-color maps and full-color photographs as well  as detailed information and analysis that you need.  This hard-to-find information by ordering fruit and places USA now for only $29 while shipping and handling by calling new millennium at 888-803-4438 or order on the web at burkeywater.com  So what's in your shampoo sodium loll sulfate exposure can lead to coughing wheezing shortness of breath headache and nausea  Phenol ingestion of even small amounts may cause circulatory collapse paralysis convulsions coma respiratory failure and cardiac arrest  EETA may be irritating to the skin and mucus membranes and cause allergies such as asthma.  For ignorance, fragrance on a label can indicate the presence of up to 4,000 separate ingredients,  most of which are synthetic, symptoms reported to the FDA include headache, dizziness,  rashes and skin discoloration to name a few.  Now by contrast, here's what's in my Caled-N shampoo.  Well, like all of the products from the Caled-N-Pierso company, it's all natural.  It contains extra virgin cocoa butter oils and vegetable protein oil.  No harsh chemicals, no pour or beef tell-up.  So what are you waiting for?  Call now 1-800-340-7091 and find out how a family of four can save over $1,000 per year  on all of your cleaning products with Cal then PureSoves.  Call Cal then toll free 1-800-340-7091 or visit Cal then puresove.com  Forecasting the weather with any amount of accuracy takes a meteorologist with years of schooling and experience.  Forecasting with the financial markets will be doing it in the future takes the same thing.  No, not a meteorologist, a lot of schooling and experience.  Although most people check the letter forecast before venturing outside to avoid a good soaking,  it's amazing how few people check the financial forecast before they invest and end up getting so.  Before you venture into the financial world, check the forecast with the International Forecast or newsletter written by Bob Chapman.  Chatmons predictions are legendary.  Back by over 40 years of successfully forecasting the world's financial markets, Bob has held thousands of people make sense of their financial futures.  Midest resources is pleased to offer a subscription to the International Forecaster newsletter  free of charge with a qualifying order.  That's right, for a limited time, Midest resources is offering a one-year subscription  to Bob Chapman's powerful newsletter at the International Forecaster.  Call 800-686-2237 for more information or to place your order.  That's 800-686-2237.  Call today and avoid getting soap tomorrow.  Ever walk into someone's house and you can tell instantly, they own pets.  They've made them a stake of using a pet odor and stain product that only covers the problem temporarily.  We don't have that problem in our home.  We've discovered it's just better to use pods.  Pet accident wash of solution or pods is the quickest and safest pet stain in order  to make or to manage or manage best friends.  Pause is safe on any material, even directly on your pet's bedding.  Pause will work on the toughest stains and odors in your home.  It's guaranteed to lift stains that have been set in for years.  Proving again, it's just better to use pods.  It's only a matter of time until Fido or Fluffy has an accident.  Be prepared with pause.  Use pause anywhere stays in order are a problem,  like the laundry or the bathroom.  Try pause once and you'll quickly discover  it's just better to use pause.  Call 1-877-289-POD.  Or visit getpods.com.  That's www.getpaws.com  POD comes with a 110% money-back guarantee.  Use nothing to lose, but stay in the lower-case.  Welcome back my friends your calls are coming up in the next segment  at 1 800  2 5 9 92 31  That's 800 2 5 9 2 3 1 again. Thank you for joining us  So not only do we have now the announcement of 70,000 trips to be pulled out of Asia Europe and other areas  But there's no troops or is it folks?  We also have articles like this every day.  57-year-old veteran called for duty.  I see articles for this, say, 63-year-old veteran.  He's a 57-year-old afflicted with skin cancer,  partially deaf, and suffer from high blood pressure.  But the US Army still wants  master sergeant, Lewis, Jamie, for Vimeo.  On July 14, the Vietnam and Desert Storm veteran  received his third order to report active duty,  mobilize for operation i read freedom  i was very shocked vino said a member of the  army's individual ready to deserve i are  and not part of a reserve unit  do not get paid and do not attend monthly reserve training however because of  critical skills  they possess they can be recalled  the duty of needed  and this belief he called the army hotline listed  on his orders am i reading this thing right  at my age still want me to ask  But there was no mistake, Covino is the report to a mobilization unit, September 15th, and  Fort Jackson, South Carolina.  If I did not execute these orders, I will go to jail.  He said, Covino, a Rio Grande City NATO, served in the US Air Force during the Vietnam  War, and then joined the Army Reserve in 72, the former middle school teacher also served  during Desert Storm in 91.  And though Covino was willing to serve again, he wonders why the military wants him.  So this guy has served in two wars and been in the guard after that and that's what the  stock gap measures are doing.  You serve for five, 10, 15, 20 years and then you go, all right, I'm leaving.  I'm going to go start a business, spend time with my family.  Oh, sorry, you've got to stay another year and then the year passes.  Oh, you've got to stay another year.  that's a draft of the worst group imaginable they've already served  i mean even in world war two you just served uh... eleven months  and then you got out after your turn of duty  but not in the unknown you only have to go for a tour  but this new special proud is of those of our any sir those of our deep  it's amazing and every day  well there was one day a couple weeks ago i had like five articles about  fifty five sixty three-year-old people  uh... in a with her needs and and  and p  and  and pull trips out of Europe, I don't really care about Europe, for the Middle East,  where we put liberated everyone.  So how was Saddam a greater threat than Kim Jong-il who openly threatens the nucleus?  And then I've got other stories like this one.  Private property may become preserved.  Now all over the country, they're passing these, where, here in Austin, in about half  city  you can only build on about twenty to twenty five percent of your property and it  totally ruins people's property i mean if you've got an acre you can build a little  shock on  and then they force you to sell to the city to make a restrictions often  turned into a golf course  or uh... shopping mall hotel and pay for price  residents of king county washroom will only be able to build on ten percent  of their land  they didn't have that so the union according to a new wall being considered  of the county government which in acted will be the most restrictive land use law  in the nation  and uh... known as the sixty five ten rule it calls for land owners a set  aside fifty five percent of their own property  and keep it in the national vegetative state  or to the rule nothing can be built on the land  and of a tree can't be cut down for example it must be replanted  building anything is out of the question  and it gets into the actual reading of the of the losses that only ten  the land to be built on  and i've got the official federal match over half the country we're not even  gonna be allowed into  and uh... you we you already be told roads they build on interstates  they just walk all the old edges to small towns a small you just drive by  ghost town of for ghost town especially in Kansas  you might drive fifty sixty miles where you're you cannot exit  the McDonald's and gas stations are built in the middle of the road in the  government that's money on public  the whole country's going to be like this is the official plan and uh...  is  you're wondering how they're going to get you out of the rural areas of this  gonna kill your economy  and i know you don't believe it'll happen  here in Austin they're gonna build  not nine now but fifteen  poll roads every major street  uh... on the existing roads so it's all part of the freedom  we're on the march  the empires on the run  Alex Jones and the GCN Radio Network.  It's finally here.  Bring us a ride.  I can always tell because I get a flood of gardening and seek out lots.  This year though, I'm not even looking at seed catalogs because I don't have to.  I grow my own seed now from year to year and you can too with the help of the  Arkansas Duts brand new 40 variety non-hybrid, heirloom seed collection.  With arks, heirlooms, you can save seed from this year's garden to plant next year.  Next year, it's fun, it's easy, and your garden produce tastes better than any you'll ever find at the grocery store.  Arc's big 40-pack of collection is loaded with everything a well-rounded garden should have.  There's Aralum Sweet Corn, melon, squash, and tomatoes. Enough to share with your neighbor.  There's cabbage, beans, peas, lettuce, and carrots, beets, onions, cucumbers, eggplant, radishes, many other garden favorites, even popcorn.  Save money, eat healthy, grow your own delicious, secure food supply, and your own seeds year after year.  Call the Arkansas Institute toll free at 800-255-1912.  That's 1-800-255-1912 or visit arkinstitute.com today.  You ask for them and now they're here.  Hello folks, Alex Jones introducing you to the new BERT-E-P-F-2, fluoride and arsenic reduction  elements for exclusive use for the BERT-E-Lites Black BERT-E-Muravigation elements.  The BERT-E-P-F-2 simply screw onto the stem of the white BERT-E-Muravigation element.  use water flow through the purification elements where bathrooms in bacteria are harmful  chemicals, wait on to do heavy metals, nitrates, tile taste and odors are separated from  the water.  The water then flows through the P.F.2 elements where fluoride are sticking other residual  heavy metal ions are separated.  Your purified water is now ready.  If you have fluoride or arsenic in your water, you need the burkey P.F.2 host filter elements.  set of two for only $49 or get two sets for only $89 by calling New Millennium at 888-803-4438.  And tell them how it goes since you. That's toll free.  Printful 803-4438.  Somebody wants to sue you.  But if you keystrokes, anyone can find out your networks.  Everything that you've worked hard for can be taken away from you as fast as you can say for a list lawsuit.  Whether it's the IRS, a vindictive ex- spouse, or an average show off the street, don't let them have it.  The asset protection team can show you how to protect yourself from anybody that wants to sue you.  Simple, fast, affordable, and bulletproof.  Let the asset protection team show you how.  Call now 888-240-3337.  That's 888-240-3337.  Or visit assetprotectionteam.com. Don't wait.  Plan your strategy today before you encounter a lawsuit, bankruptcy, accident,  judgment, lean, probate, creditor, medical crisis, malpractice or worse.  Flash today before you are confronted with a false claim, divorce, audit, state agency,  federal agency, restraining order, and angry ex-partner or worse.  Visit assetprotectionteam.com or call 888-240-3337.  From his Central Texas Command Center, deep behind enemy lines, the information war continues.  Alex Jones and the GCN radio network.  Canada's Australian, Mark and Tennessee.  He's important.  Everybody else is patiently holding your calls or coming up here just a few minutes.  And then I'll get into towns all across the country saying, hey, you're only going to  be able to build on 10% of your property and that's all under federal grants.  This is your existing land, right for electively.  throwing land values taking total fuel control over the search  and also i've got other headline here this happened uh...  two years ago in a bigger hurricane he hit florida kill a bunch of people officials  were lucky to release death tolls of theres refrigerated  vehicles all over the place of dead bodies and i mean they admit that but  they're not going to release the numbers  very very scary and there's a thieves are plundering  uh... in uh... charlie's aftermath really sad that people will do that when  uh... folks are  down there looking serious things have happened  also police want you to pay for their wiretaps and special tax  and it says don't worry it's the fight terror and other criminals you were all  gonna be  randomly wiretapped now no warrants to fight  terrorist your product terrorist and uh... criminals always and criminals and  other crime  but uh... just briefly folks i'm a documentary filmmaker i personally have made  ten films and I carry the best films that I've seen bar none by other great  researchers on my website the best books the best books on tape we've got them  all at info wars dot com or prison planet dot com simply go to the secure safe  shopping cart you can watch clips of the different videos we sell read about the  different specials we offer at info wars dot com or prison planet dot com and  Of course, 9-11 is what they are pinning all their police state rollouts on, and it's so  important to shatter the myth of the official story of 9-11.  And that's what my 2.5 hour video 9-11, the road to tyranny does the history of government  sponsor, terror, the first World Trade Center bombing Oklahoma City, the second World  Trade Center attack on 9-11, and then the globalist master plan and the Patriot action,  all of it.  part two of that film which mainly just focuses on nine eleven not the whole  history of it it gets in some of that the next one videos well the  masters of terror  then i carry  for company video nine eleven the great illusion  in game of the women not today  and uh... it's on vHS or dvd nineteen ninety five and you get a free color  booklet  eighty plus page color booklet  nine eleven the great illusion ninety seven pages  uh... with that you get a second copy  and three color butlets so two videos in three color butlets  uh... for thirty four ninety five  that's a special we're running my videos twenty five ninety five a piece is  all over two hours twenty dollars if you order three or more of any of the  ten titles  uh... that uh... i have produced  so again info wars dot com or prison planet dot com or simply  uh... right to me alex jose three thousand and one  South Lamar, sweet 100, Austin Texas 787-04, or Coltsville-3.  It asks questions about different specials or about different titles, different films.  When you call, you don't even have to order it, you just call them good information.  At 1, triple 8, 2, 5, 3, 3, 1, 3, 9.  That's 888-25-3, 3, 1, 3, 9.  so please take action and  my videos are authorized to make copies of them and airmen access to even get  them out the folks  that's my goal  so again triple eight two five three three one three nine  uh... let's talk to ten australia  can we call this from the land down under  according from alban alistair before the  you've asked me to report info and  uh... there's a lot of news what i'm glad news to cover  what's up with  absolutely amazing okay  the uh... free credit agreement between australian the united states  uh...  it's actually  have gone through one uh... august uh... which is the blackest day in the  history  or australia and the united states  which actually takes away our sovereignty  because what happened is a lot of the uh... negotiations and uh...  war part of the gosh for companies will not be handled by parliament anymore  it will be handled by a body that will be elected uh... by  companies  now for those who don't understand there's a big trade deal  uh... and again the european union started as the economic community  they don't tell you work  creating world government they say oh it's a trade deal  and they've heard the social security the law enforcement  the welfare system the laws  and that's why sixty thousand people protested  and ninety nine in Seattle  liberals conservatives  because we were giving up our forty the world trade organization  also same thing with this agreement literally corporations create their own  board  that is above our government go ahead  absolutely right uh... the government have not said all  also what uh... they have to do the government do you know the forty agreement  to go through  they have to amend existing laws that was that was a mandate  and that was actually mandated by the w uh...  to help  uh...  they had to amend a lot of laws are copyright laws  uh... crime laws and the w we are only is only nine years old folks and already  runs the plan  absolutely  and also uh... along with that  we have those are general of a degree of uh... agreements on terrorism trade  and then now they have  uh... the free trade area of america's which they admit is the pound american union  that's right also what they're doing is they're going to use uh... the austral  pre-fair agreement  as a standard for the american so what that means is  the last time that i thought you were talking about the borders in uh... in  maksa car  that's going to be only a minor problem for you because once they do a  would america's the america's chilli and so forth uh... a lot of those people will  be able to come to the united states work  or cheaper wages now you're building a super high-way it's done from  counted in the maxa color building in the maxa car  and that's bushes and the st plan is total  complete anybody who wants to come here or who can get here is automatically legal  for six years  and the government is going to pay to bring more  unskilled labor here  and they say the layoffs in high tech  are gonna get seven times more severe  and bush in january of the shear said quote  this is our number one export is jobs we need to accelerate  absolutely now some of the things that are coming is  tech start clothing accessories fair parts and tools  uh... after cultural uh... victory chemicals  amendment the amendments to the one and brandy  uh... industry life insurance for neck positions  and take office uh... come all the parties and companies  and therapeutic goods uh... patent amendments  copyright  because what would have spectrum  it's amazing and  it's world government  we have the e you are emerging with the pan-American union and a  konnadian deal earlier this year and people don't even know what the e u were  the pan-American union is  or what the wt oh is  and just like congress came up to the authority over the wt oh and trade  uh... now they're gonna give up their authority to this tears are over internal  security  yes what an actual fact uh... the comments uh...  with the feet trade deals  don't have authority congress  uh... or else on it or whatever now recent  high court decision because of the free trade agreement  have to be made  uh...  in order for them to uh...  hold you  the government can hold you legally  in detention now without uh... any access to a lawyer  or  editing else really  chasse  lulian europe student same thing our courts for doing the same thing  yes it's great work comes out as they can secretly grab you and hold you  but you should be able to complain to a higher authority in the camp  and they were ooh  a victory for freedom  you can complain to the commandant of the camp  but also it covers the uh... report is too because what happens is a  for example  a reporter like you may or whoever we want to do a story on uh... terrorist  acts or whatever  uh... the guy could be associated with uh... terrorist organization  the reporter will be helped  charged an imprisoned  associated  now uh... last year  a a a a a uh...  professor at a college  and one of his students sent an email to the government  about  i think was the wt o meeting i have the article  on the website  and he was arrested because quote influencing government was an improper  use of his telephone to just into text message email  uh... sure you're familiar with that story  yes i am familiar with so so this is your freedom in australia is you can't  email the government it's not threatening but still it's it's it's  wrong the influence of the government  yet but not only in australia near not a state this is this is bad for  but i don't know if it's just to see australia that was a pretty free  country just a few decades ago  as to ten years ago to be losing all of your freedoms is so sad  well i think what's really amazing another blackest day in australian history  and yet not one single paper  or otherwise  talk  talk host  even coming to the back  well that's how they like  they lied by a mission  and they don't uh... the average person again  and but the average american doesn't know how many continents there are  they can't name five state capitals they can't tell you who the second  president was  they can't tell you what the fourth amendment is but they got their opinion  about politics though  and i guess it sounds like it's the same thing in australia because the news  doesn't ever report on this stuff so people just aren't aware  now i was doing my show and uh... i was going right through this and i had some  guests on and so forth uh... and i put some of my website which uh... by the way  you feature on there  you got your own page  well thank you  hahaha so bright  my pleasure i think you're a good guy you're doing it well  uh... and you know a lot of people are in here said  kid what are you talking about  what will we were a sovereign country you know we're in the country  i said not anymore and then uh...  uh... going up and uh... because i do show  twice a week sometimes  and i think i don't believe what you said what i said what i talk about is  document it  i don't care you know just doctor tommy he didn't say boys two weeks ago  there with your leader announcing all this  uh... no i saw bush uh... signing the free trade agreement he signed it and said  done. Now, please, thank you very much. Goodbye and there goes your freedoms, which is  United States and also Australia. But particularly one, one, I guided this guess or  the ball I had to the website of the Senate. He came back a couple days later and he said,  sorry, I believe everything you're saying, because he read for himself. And that's all  people have to do just got to be studying  well that's a little bit of a bit of a balance  that's really the power we have is that we can point people to the source  documents the problem is most people aren't like that guy  he'll just deny what you're saying and won't go check it out and won't  take your challenge if people would  take us up on the challenge of checking it out themselves we would turn things  around  but this process is happening there isn't awakening here  are you seeing any type of awakening in australia are people still in the  dark because of the media block out  well there's uh... there's a lot of people that i do know like you that are  like into it and not trying to do something about it  but you know i would say probably about it is the percent of the population are  asleep  and i think they just  well we've got our our work cut out for a stand i appreciate your call  there goes dead folks broadcast for it  on the largest cities in australia we appreciate uh... his work  teeth and florida teeth are on the air go ahead  Yeah, thank you for having me with all time and we'll call to it.  Well, I was just down a day for it to be toward it.  And we talked to the issue about people being prepared,  like the environmental disasters and stuff.  Yes.  And I think they have a birthday light and I think  all that.  It turned to be very quick.  While I was there, I did go for the vacation.  We were looking for someone.  And they were in a bad neighborhood.  But why?  I've been estranged for about 10 years.  That's not what I call.  there were derelict everywhere  people were through  uh... i was in a record of our  you know better not to park his car purchase  you know that i would have been  you know that i was carrying  also trying to get at it  what happens like a situation for the  where they can't do back no check for people were by firearms  because he could be too much for them to contact the state of forty the  handle it  what do they do  uh... they can't do back no check  what is the law  no i'm on on following part of what you're saying uh... look we need to go  back to the vermont style uh... law where  i agree  where where there's no controls  because criminals are going to get guns to begin with and it's only law  buying people who are restricted  all right i'll tell you  when they passed the kachil karaon florida your crime right within two years  drop twenty  five percent  right in the uh... violent crime right  uh... all those uh... uh... tourists were getting car jack all the problems now the  croaks aren't doing that like they were  because it's it's playing russian roulette they try to carjack the wrong car  you know when five percent of people are carrying firearms legally  uh... it's over for them  and so the you know that's the answer more guns less crime more guns more  freedom  we have a really great and uh...  but uh... you know what i'm saying uh...  those people you know what  it's kind of sad it's nice for us in community  and I think people were a drone through.  They were about to be social and they were on chairs  and you had to ask grills, cook and food,  you know, to know so power and stuff.  It's up like that and, and, and, and,  and when I drove it to the back of the room,  which where I had to go,  I guess that it was just people all over the place  and cops were like truckers, shoulders and me.  I didn't want any mask and drugs.  I have an article here about that.  It says thieves plunder the state  and aftermath and its poons of gourda  Out of the hurricane ended the looting began among the first targets official said was the Charlotte Harbor fire department. I'm in  Fire firefighters arrived early Saturday to find their computers had been swiped in the night Charlotte County Sheriff's Office  spokesman Robert  Carpenter said his office is getting regular reports of looting or residents of the areas many storm wrecked neighborhoods man folks 40 years ago  it things changed. I mean in the past, a hurricane hit, no one would lose. What happened  to Americans? We became evil and we got an evil guy. You know, that just goes hand in hand.  It's a symbiotic relationship. And then I've got another article here out of the associated  press. Officials reluctant to release death toll and they're keeping it very secret to  how many people have died. And I heard that not many people died. So I was like, oh, this  is good news, but now it looks like there's been a whole bunch of deaths. Do you have  out here how many people have died  i know i think i'm talking about back in what andrew  uh... what we know that  uh... hundreds died in the cover that up in andrew no in the near the new  uh... this is a new article  about charlie  carl i  it what i saw in the carla was  that there are a lot of structural damage  there was a lot of debris damage like trees uprooted  power lines for down  uh...  cars that know that you know a lot of a lot of satellite system down  that i think i don't know that other areas of the story  and that were a part by her  if what i saw a day kona  that i think that i had a great four  category four really is  i mean they must be devastated  i mean i thought  convoy after con boy from george uh...  legan alabama  about the power company  which is filed on  miles of them i mean  it  really bad  what is about what is about nice places to live in California got her  place you got her canes and florida  god bless all those poor people  yeah i think you thank you for the call he'd i appreciate it  barney and marin will another year up next we get back  one eight hundred two five nine nine two three one  we got job  uh... uh... uh... son of larry pratt joining us  about forty minutes so you know what miss that as well stay with us  Alex Jones here announcing the release of my new film,  Least Day 3 Total Encement.  Police Day 3 details the architecture goals  and operations of the new world order.  There is a chance to use this disaster in the new world order.  A new world order.  An animal.  The film documents does look confirmed cases.  A government sponsored terrorism worldwide.  We ripped the sinister Patreon act legislation one  and two of hearts piece by piece.  And reveal the error against someone asked her  all to say about your liberty.  You will lose your liberty.  Homeland Security Executive orders for vaccinations,  the new prison economy,  the total information society,  the Panamerican Union,  federal gun grabs government run  by slavery rings and much, much more.  If you want to understand what the new order really is,  then my new 2.5 hour video,  holding state three is for you.  Visit info wars.com or prison plan.com to order.  For call 2003, 1-888-2533-139.  That's 888-253-1339.  Order today and spread the word.  Black, burky replacement elements are ideal for use in any gravity filter.  These self-sterilizing filters can transform a raw pond and lake water into delicious crystal clear drinking water.  Ideal for travel to outdoor events and perfect in the event of hostile filtration environments such as local or national emergencies because they remove both harmful chemicals and pathogenic bacteria for water.  So powerful they can remove pathogenic bacteria and cysts parasite to non-detectable levels.  Trihalomethane and volatile organic chemicals such as atrazine, benzene chlorine, chloroform, and NTVE are removed to below detectable limits.  They reduce nitrate and unwanted metal such as lead, mercury, aluminum copper, and phylicylide chlorine and sulfur orders.  Yet the blackberry filter elements leave in their helpful and beneficial minerals that your body needs.  Normally $48 each get a 2-pack for only $91 or 4-pack for only $173.  get the powerful blackberry replacement filters now by calling new millennial at 888-803-4438.  That's triple 8-803-4438.  Herbal Healer Academy is a global supplier of the finest natural medicine that you may need  in these troubled times.  We specialize in keeping you alive and healthy.  We provide outstanding products like E-C-AC, colloidal silver 500 parts per million, olive  leaf extract, oregano oil, and hundreds of herbal oils, books, and educational materials.  We have homeopathic detox solutions for contrails, radiation, MSG, and aspartame poisoning  to name a few.  We also trade natural path acheulars via correspondence education.  For a limited time, you can sign up on the website and receive our 104 page catalog  and a current herbal healer newsletter free.  Simply log on to herbalhealer.com.  Check out our online member testimonials and our hundreds of exceptional products.  We have been working hard since 1988 to save the remnant.  your website for safe effective natural alternatives in education  Waging war on corruption  Alex Jones on the GCM radio network  You got Eric frat, some gun owners of the Maric, Elery frat sun joining us  in about 35 minutes  and there is just so much other news here  Big brother police state, new world order news  news and i'm sorry to be the bad news but at least it's good news that we're  on the year exposing it  that you'll be a lot worse than we're doing this  uh... but let's go back to the call was talked to Barney then dansio and  brian and others  uh... are all still in friend when to give out his website where he does  is ready to show twice a week  it's ninety seven zone dot com all right  uh... let's go ahead and talk to Barney and Maryland Barney thanks for  holding welcome  yeah i don't have a good my friend  uh... this is something that has to be addressed  uh... a lot of people don't realize how serious a problem is  according to american leegan magazine and other sources  most of our military equipment is obsolete and worn out and in the  by the american leegan is setting up national title tell squads to fight  terror and crime  the spy on this isn't that nice  you know what's good they've had a lot of government this particular case no i  know i thought i'd like to hear it  let me stop you i like the american leon is the problem  is there even been co-opted now everything's been co-opted go ahead  well you know america leon is not uh... good example of uh... the veterans  because a lot of times you got people  never seen combat in there  parties  and get my point is the american leon the members do some good work  yeah some of them do you know  uh... but according to that uh... american leon all the stuff is obsolete  and one example  out of a squadron of eighteen navy helicopters  eleven were grounded because they were no spare part  hey listen i've been out to these urban warfare training girls  and uh...  i mean the helicopters were in service and Vietnam  right i think they  i mean these are ancient uh...  you know the twin prop uh... different variants of those helicopters these are  ancient pieces of junk  it's right  yep  another example of colonel david hakburg  well in career watch the soldier was uh...  he take down  uh... and uh... if we got done  by hakburg went over and opened the hat up and it was forter inside the tent  that means that all the seals leaked it and let the water in  and uh... done only uh...  but the uh...  that's free state  and about a little more clearly couldn't be able to get into it  in wintertime  well let me  kind of bring this back to something i mentioned it's pretty important uh...  barney  we're gonna pull trips already have pulled some out of south korea which is a  real threat threatening to nookas again on weekly basis  to go to iraq for the next phase into iran or seria  i've heard this is this is crazy  i mean we're really not right for threats why are we pulling trips out of  south korea go ahead  well you know what makes it so crazy uh... all along the  if european countries no i went along with us  let them asleep the uh... flak  but now uh... they see that the uh... whole she's to bang a start in the fall apart  and they're gonna start these are not  and uh... it's gonna be a lot worse condition  well they've got the u in army a neto army a u army in afghanistan  and uh... i've had family that's been determining the last two years that the  Germans  are good at this they're building a giant secret army what's not even secret  huge submarines  uh... medium aircraft carriers battleships weapon systems jet aircraft  drones the Germans are rearming  and guess who else is rearming the Japanese yeah yeah well they see the hand  right on the wall united states came over the job you know  but anyway uh... not only uh... uh...  uh...  mechanism freeze up uh... it will let in bylaw to go in chemical  element and also uh... all the electrical equipment and ammo would corrode  up and it would break me practically worthless  in uh... time of war  and and and this morning bernie don't worry about that to keep america safe  you just found your neighbor okay if you reported your neighbor for something  i'm going to yell all the time  Good good. You're you're a good American man. That's what America is about when you do adopt the Russian model that we're good. Stay with  Hello, folks brother mainstream media  government cover-ups you want answers  Well, so does he he's Alex Jones on the GCN radio network and now live from Austin, Texas  Alex Jones  All right my friends  We're now into our number two.  We have Eric Pratt, one of the head guys  of Gun Owners of America, Son of Larry Pratt joining us  in about 30 minutes to talk about the state  of the New World Order, what the Patriot Act 2 is up to,  what's happening with the Second Amendment,  a lot of different legislative updates.  The assault weapons ban is not dead,  contrary to what people have been telling you.  So that is coming up at the meantime,  a bunch of international national news.  uh... your calls as well  right now let's go back to those calls let's talk to dan in texas and you're  on the air welcome  hang out i think  i'm not doing too well we're gonna pull seventy thousand trips about half of  amount of asia  on north korea threatens to nuke is literally on weekly basis  and and and has the missiles hit any u.s city  our government says they're not a threat  uh... no threat is uh... iraq we need to be there  lovely isn't it  i had to report on uh...  uh...  uh... prison planet uh... up in four or here  uh... course uh... one's in use related item uh...  uh... mire blingberg of new york city  uh... his decree yesterday that  the right  race feet and the peace of the assemble  and redress grievances against our government  he declared yesterday is not a right it is a privilege  now by the way i have that article and ever even got to it yesterday why don't  you tell folks about it  well uh... of course united for peace and justice a uh... activist organization  for freedom  uh... it has been for well over a year  uh... fighting  uh... have a rally in central park in the york city this uh...  coming sunday august winning that  and central parkers designed for rallies they have more on the top of  they say it might hurt the ground  yes it might hurt grass and even in in reports just within the last couple of  week  the company that constructed the new central park grass  uh... has denied the studies uh... report  that it would  do the damage to the grass that they say it would be  in the fact that they constructed it such that that damage would not occur  nonetheless uh... they have uh...  well over a year  were few  all of united for peace and justice and other  this is organizations  the ability to protest and you shouldn't have to have a permit to begin with the  courts of ruled you don't have to it turns right to a privilege  of this is your new freedom  yeah they get to protest miles and miles and miles away where no one can even  see them  uh... but hey uh... in Boston there allowed to protest in a cage in  side of cage under a  train station so  Oh yeah, well this is our new freedom when the mayor of a study can declare constitutional  fiat that your First Amendment Act have now been repealed and they are a little more  now than privileges and if you act, we'll just take your privilege away from you.  Very good, Mr. Bloomberg.  Now the second report that I was interested in having a safe deposit box for the normal  and usual reason that any citizen would want to take the positive  yeah and k she ever had a fire at your house you know that we could  document  you've got your will in there you've got to be the house another important  papers  uh... well of course i refuse to submit the rules of big brother  uh... so they could take it look at it well uh... so i went to the one bank  uh... which is close to my house  and i asked them do you have any state deposit boxes available they said they  I said if I apply to open a box, am I going to be required to give you my social security  number?  And she checked and she come back and she told me, sir, do you have the site deposit box?  You have to have an account with us.  And yes, that will require you social security number.  I said no thanks to them and don't down the road.  I went to the next bank.  Well tell you what, I want to hear about this when we get back because what does this  have to do with fighting terrorism. It doesn't. It's all about total control. Zero privacy  for the people. Meanwhile, the government is getting even more secretive. So we're talking  about the death of freedom. We'll continue to expose this and we get back with your calls  and news. Why continue to suffer from pain, illness and disease when natural health and  wellness therapies are within your reach. Hundreds of people report improved health and  Well this using rife frequency technology.  In the 1920s, research scientists Royal Raymond Wright discovered that disease organisms  can be destroyed using resonant frequencies.  The bio-solutions frequency instrument uses the same technology for relief or elimination  of pain and disease conditions.  There are no side effects.  Join others in discovering a return to natural health and wellness.  Eliminate the cause.  Don't just treat symptoms.  Bio-solutions has over 450 pre-programmed auto-sequences for various health conditions  and is very easy to use.  It comes with a 30-day return policy  and a one-year limited warranty.  For more information, call alternative technologies,  toll free.  866- 885-66-865-866-85-6625.  866-885-6625.  Hello, folks.  Alex Jones here.  You know, murky water filters  have been removing hot-the-genic bacteria for years.  But what about those unhealthy chemicals  and heavy metals in your water?  The powerful black murky purification elements fit most gravity filters and dramatically increase their power to attract waterborne contaminants.  Best of all, they filter much faster than ordinary gravity elements.  This means it takes much less time to filter your water.  Black murky elements only remove pathogenic bacteria, assist in parasites, but also remove  Phryhalomeethanes and volatile organic elements, such as Aphrazine, benzene, chloride and chloroform.  MTBE.  Right on to do too,  Foul taste in the box's odors  like sulfur, even nitric.  An unwanted, heavy metal,  such as lead, mercury,  and aluminum,  are extracted.  Cupre charge of gravity  filter today.  An order of two pack of  white,  mercury,  purification elements  for only $96 or a four pack  for only 175 by calling  new millennium at  Triple-late A03-4438.  That's Triple-late,  A03-4438.  Or order on the web  at berkywater.com.  Hey folks,  Alex Jones here  announcing the release  of my most comprehensive  of documentary exposing the new world orders  orchestration of the September 11th attacks yet.  In my new film, The Masters of Terror,  we chronicle the globalist master plan  for world domination.  The Masters of Terror details how the illegal user  using manufactured terrorism  to drive the world population into accepting tyranny.  Witness in horror, the execution of the September 11th attacks  and the ensuing wide watch.  The cash was society control grid,  and viable microchips, mass mind control,  illustration of fully concentration camps,  foreign troops massing on US oil,  USA Patriot,  Super big brother total information awareness network and much much more.  It is absolutely vital that everyone see the masses of care.  Only by exploding to perpetrators of September 11th and we stopped in from carrying out the next wave of attacks and destroying our constitutional republic order online now at infowarz.com or prisonplannet.com or by calling 1-888-253-3-139.  That's 888-253-1313-I  Meanstream media  Government cover-ups  You want answers?  Well so does he  He's Alex Jones  A Magician Radio Network  And now  Live from Austin, Texas  Alex Jones  Alright my friends thank you for joining us  Through justice the American way  Standing up against tyranny  Defending liberty  Monday through Friday from 11 to 2, Central back from 9 to 9. We'll go back to your  call turns to 2nd, but police want you to pay for their wiretaps. Now we already  have a surcharge in telecommunications for this here, but Canada is getting on board  to some of the globe and mail. Canada's police chiefs propose a surcharge of about 25  cents on monthly telephone and internet bills to cover the cost of tapping into the  communications of terrorists and other criminals.  See big random snooping.  Let's see, it's always terrorists and criminals.  Terrorists and crime.  Terrorists and criminals.  Terrorists and other crimes.  Other suspected crimes.  It's the same thing.  Over and over and over and over.  The front drivers are all being trained.  Look for terrorists and others suspicious criminal activity.  Everyone is being recruited, the exterminator, the phone man, the cable guy, the carpet  cleaner look for terror america's under attack terror but  got a percent of this course you're about to take and you're gonna be paid to  take  will be how to look for criminals  well go to will stop criminals oh sure we will  uh... turning america into east germany folks i can't believe this but it's  really happening  war news on the national i'd be carter i want to get to do but  i'm going back to the end of the  july and uh... ryan and telling others  dandy  uh... down the  down the  to get a safety deposit box one place  yes uh... out of the simple work and uh... now the first bank i went to  was a it is a small local uh... state charter bank  and uh... for stay indicated to me  i could not rent the safe deposit box without having an account  and of course open account must provide them so security number  I left that bank and went to the next bank down the street, which is among one of the larger  bank tanks in the nation.  And again, one inside asked the lady, did they have any safe deposit boxes available?  They showed me the various different sizes of the box.  As I indicated the one size that would be appropriate for money, then I asked her.  I said, do I have to have an account here to rent one of these boxes?  I said, well, if I have to rent one of these boxes, well, I have to give you my social  security numbers.  He said, yes, sir.  And I said, but ma'am, I'm not here to apply for social security benefits, nor am I here  to pay my taxes.  And she says, well, but we can't do that.  We can't rent you this box without social security number.  And I said, why?  she said because the pay for it act requires  uh...  do you have internet access i sure do i'm signed on i'm among your  uh... annual subscribers prison planet david well thank you for the support  that's absolutely vital down to the alics i'm on tag of the truth uh...  the don't you know don't get this in the butt to bad but uh... in my opinion  you're not charging enough  hahaha well no it's just enough so we can continue all the website cuz a  bandwith cost work where victims of our own success  i'm not really glad to have more than glad to be a subscriber  well thank you will have fifty cents a day people get the two books that i've  written and paul's written  uh... the weekly t-v report the audio reports the tax reports and a bunch of  other films all my videos but  the reason i mentioned the internet is  just type into a major search engine  hatred act compliance  last time i did it over a hundred and ten thousand links popped up  pizza change  grocery stores  banks  uh...  everything  everything is patreon compliance everything you do everything you buy  everything you sell it with the chain or a big business  uh... is control  and this is going to plug into the new national sales tax at the fake  conservatives  or pushing it'll go alongside the income tax  and then that'll bring federal control in every business  uh... but but yes sir and then these politicians get up on tv and say  you show me one example of words being used again in an on-terrication  and then no one's their challenge is they go see  the books every two days  well i just called report my personal example  every two days i see at least one article and i'm not looking for them  but every couple days where a pot dealer  uh... somebody gets an argument with their wife their punching each other they  get charged with it  uh... somebody overseas that all orders are charged with it  uh... again  uh... been rigging county commissioner people charging too much for concrete  and bids  uh... just  it's  i've got  i've probably seen conservatively fifty articles last two years  for state and county prosecutors say  oh i'm using it all it's wonderful  i have the testimony two years ago  uh... where the head spokesman for the just department told congress of course  we use it  and not a related cases  this is congressional testimony but still neo-cons all over ready  on TV lie and say it's not being used in the liberals only use examples of  Muslims out on their rights violated that then makes it some type of weird racial  debate and i don't think the average person knows how serious this is  well it's bad Alec and of course i would use to the the player for running the  bot uh i will not comply with the  error errors uh root and blue ones that you know that's sad i've been thinking  I want to say to deposit boxes to put deeds and documents and maybe a little bit of  gold in.  Yep.  And you know what?  It's not safe.  All the time now, the IRS, no jury, no judge, you're not charged.  Now how does this happen?  No due process folks.  They just take your bank account.  Well now they go.  I see articles probably once a month where they just go and look in your safety deposit  box.  And again, they just take whatever you got.  I mean, I'm post.  both of them ended our constitution by phi  uh... no man uh... has a right not be deprived of his uh... property without  due process it's not a privilege  and if they want to  the nine euro privilege they're afraid to do so  and then i can't even call a carpet cleaner or a terminator  without knowing and i don't know how  but but the point is it's my house my castle i shouldn't be paying somebody  for a service while they're spying on me.  And the government's all over the news here in Austin recruiting him to do this, the  fight terror and crime.  And they have these little symposiums where they get all these good old boys together.  And it's sick folks.  You're not supposed to live like this.  And then when your child goes to public school and now they're even doing the private  schools, I've got the local news cast and ads they run and you get $200 for reporting  a family member or a neighbor.  Anyone else in your school in a report, drugs, report violence.  and mommy's medicine cabinet  uh... school counselors are like  visiting confessors that you know spy will what will go on at home will tell me  uh... i mean  this is incredible folks  how it  up the good work  were behind you  are i appreciate your call and let me just a little going on for a long time  a lot of these carpet cleaners and people that work at post offices in the  rest of them  uh... so i'm not the last year about a woman  uh... working for an airline  and said she made about thirty five thousand dollars a year were for the  airline  but she gets ten percent in some cases it was more  of anything that customs gets when they bus somebody  and in many cases are just buses were having ten thousand dollars in cash you  know you're going to buy a bunch of potted plants or whatever you pay cash  to the discount  and that's what she finally got in trouble was for bus and some guy did  not have the wrong  the marshals come and just grab your cash and  it said that she was making over a hundred  go back in memory was over a hundred thousand dollars  a year  just in this ten percent of whatever with the  uh...  hahaha  all men  uh... i'd have friends  who've been pulled over just been paid cash or check at six hundred bucks in  the wallet  and they open up their wallet and bolding the cash to give the officer of  their job of license the officer says to them what do you have so much cash  well it's not in your business you know case  uh... every uh... i don't know weaker to us in article where  some old lady or some young man  to be can just could be texas could be california to be verma i mean it's  everywhere  and uh... a lot of people don't trust the banks and right to the social people  to be all people are seeing the old  sell some car get ten thousand dollars cash for it  and they're driving home  and the cop pulls them over and out of a search the car in the old lady says  well sure officer of the night  well you got a little little scrum box here can i have the key will  why do you want well what's it will money all i'm taking this you can't  prove it's not drug related  that's asset for the procedure  now we got a law passed in congress that they have to stop doing that but  they're not stopping  and then the ashcroft orders all those  copies of the law removed from the library  that was two weeks ago because they don't even want you have access to the law  now folks that's not freedom  and uh...  i can't get a safety deposit box because  my money  you know maybe a few thousand dollars in gold and some deans  art less safe in that safety deposit box  uh... then a little fireproof safe at my house  i mean it's ridiculous folks  this is the new america  i gotta get your calls here  joan and merrill and joan you're on the air go ahead  thanks alic  you're on the roll  uh... by agree with everything  and a little bit of more freedom taken away from us is  uh... what the bfw last night i don't  usually watch the news because i can't handle the lies paper  if they're there at the cf wn and talking about moving the truth out  all i think they should move through the bout and they can get away from  here and they can get them there faster and  while they're sitting there there and i'm thinking  really on the right face there mister you know he owns reeking your beer  well i hear these people the maul jover of nate be joan even holding  but i hear these people go good we've been paying your bills too long look  forget your  okay that's fine with me  but they're saying half of these trips we take it from south korea and japan  post  north korea and china really are a threat  and and and this illustrate how this is a red herring of the middle east  being a threat compared to north korea and china man there nothing  go ahead  that's true  um... i guess i should have said this first about the uh...  we're talking about  or right-taking away  i mean big brother is watching everything on the patrick under the patriot  act compliant  i got a letter from right-aid last week stand  where are you i haven't you haven't seen you for a while because i haven't been  to right-aid  and i'm not a prescription  take her anyway  and i want to hold over at the kia  Yeah, and part of the Patriot Act, I got a track.  Right.  You want some medicine?  No, we're at the report to the government.  We'll be right back.  The Perky Lights, unique design, combines the age-old process of micro-force filtration  coupled with modern state-of-the-art technology and the highest quality materials, bringing you the finest water filter available anywhere.  The revolutionary Perky Lights with its exclusive black-working filter elements remove pathogenic bacteria.  Assist and parasites can non-detectible levels.  Farm full or unwanted chemicals are reduced to below the detectable level.  And it reduces nitrates and unhelping minerals like lead and mercury, while leaving the nutritional  minerals your body needs.  Made of durable hexane.  The material used in making bulletproof glass, the system is durable, rugged, and yet attractive.  The burke light is transparent, so there is no guesswork when refilling the system.  The water level is always visible.  The rechargeable LED lighting system is beautiful as a nightlife and as necessary in emergency  situations.  Get the first U-Life, a transparent water filter for only $259 by calling new millennial  at 888-883-4438.  That's full free, triple 8-803-4438.  Did you know you've been cheated?  You owe no debt on your bank issued credit cards.  You heard that right.  You owe no debt on your bank issued credit cards.  You don't have to pay them off.  The banks are defrauding you.  Now is the time to fight back.  You can completely wipe out your credit card debt fast.  The procedure is easy and everything is done legally and within the law.  Almost no one has ever failed.  Check out 1-2-3.0.com.  You can also wipe out your mortgage debt and get a free and clear title.  Mortgage settlement is usually completed in 4-6 months.  It's done by an outside source found on our website.  Believe it or not, mortgage debt settlement has been done for thousands for more than  10 years.  Don't let the bansters cheat you.  Fight back America.  Stop the fraud.  Stop the rip off.  Learn the truth.  1-2-3.  No.  Come over and get our rock solid technology that wipes out debt without bankruptcy.  1-2-3.  No.  No.  Dot com.  Lift debt free now.  You lose nothing but the debt.  So what's in your shampoo, bath soap and dish soap?  Clorides, dies, ethanol, sulfate, sodiums from albaha, etc.  Read the labels.  The hearing exposure can lead to coughing, wheezing, shortness of breath, headache, and nausea.  Also, maybe irritated the skin and mucus membranes and cause you to seek medical help.  Perfumes, also known as fragrance on a label, can indicate the presence of thousands of  separate ingredients.  Now just by one example, here's what's in my Calbin pure soap shampoo.  It's all natural, earth friendly, it contains extra virgin cocoa butter oils and vegetable  protein oils, no harsh chemicals, no animal tallow or testing.  So what are you waiting for?  Call now.  300 340 7091 and find out how a family of work can save over $1,000 per year on all their cleaning products with CalBem PureSopes.  Call CalBem full free at 1-800-340-7091.  That's 800-340-7091 or visit CalBem PureSope.com.  Gold. It's like nothing else on earth from the Romans through the Renaissance.  From the industrial age to the space age,  Gold has weathered the test of time, where 6,000 years gold has remained the ultimate store of wealth.  According to the World Gold Council, the US Mint demand is at an all-time high.  The stage is being set for the re-emergency of gold as the commonsense alternative to a  fiat paper currency that gets weaker every day.  Midas resources is proud to offer the hard-hanging report that arms you with the true  you need to protect you and your family from the Fed's plans for your hard-earned money.  Don't gamble with your future. Call Midas Resources today and ask for your  free copy of as good as gold. Call 1-800-686-2237 for the report of Fed Hope you'll never see as good as gold can be yours.  By calling 866-2237 if you have ever thought about owning gold you must leave this report. Call Midas today at 866-2237.  Now that's another thing you can do.  Type in Patriot Act of Alliance Farmistics.  And all of the pharmacies by law are hooked into a computer system now.  My regulation I should say where they automatically upload all your prescriptions daily  to the federal government.  No judge, no jury, no subpoena.  but it's for terrorists and everything's for terrorists but uh...  joe and marin one going in finished up your story about a letter you got  from right a task in where you did it  i don't take too many prescriptions but uh... what happened i  was hit by it  pick and it was really embedded in we have line c c six time here in melon so  you were taking it in a biotic  seven days or whatever and  got to do that  here they are saying oh we're are you know we haven't seen your and then  act right after that i got a little card from domino's i had to know about the  uh... pizza thing  so i  patiently order a pizza  and so i got a three-dollar coupons they were you know you have been here for a  while and  they were here to three-dollar coupon for your next pizza for those of you  said you didn't know about the pizza for those who just join us u i said  today about three months ago that i had line  and domino's claims they are not doing it for the other big chains are  and she mentioned on the nose  automatically when you order a pizza that case you've moved they check your name  against an incident criminal database  and i'll get a twenty percent  uh... of any fees or anything your rep retention and instead of a pizza  they just spat your swap team  and this is even for people with uh... with uh... warrants for not paying tickets  so you didn't know that you were being spot on the order to be said  now i didn't you educated me on that one and i appreciate it  all part of the freedom  absolutely  i mean uh...  it's just discussed and you try to tell people that want to hear it they say  you're the coop you know not to vote you hide and why you're gonna have all your  freedom taken away you know well they're putting all this police state in  places are gonna take the pension funds are gonna take the jobs  and when you're right and protest they're gonna come out and  for the men in black uniforms in microwave  actually call and they got major cities they're pre-deployed home these with  huge microwave guns modern the top eighty-seven  years ago  uh... let's talk to brian and virginia beach go ahead sir  yes i think that mccall you bet  well i i get the couple things i want to address uh... mainly the area of  technology  uh...  my back one of course is an engineer in an aeronautics  and uh... i noticed i became a cross-maintenance and  marty uh... twenty  or sixty thousand two a patent that  uh... zero energy device  it's for energy for anybody  it's not allowed  in this country  and i want to know if you had heard anything about more if it was  that there's a little bit of some of the old  no more fun physics  uh... as far as the uh... the uh... the devices concerns the term  they're done  and i don't know if you've heard of him before i have interviewed  the people who back in the eighties claim that they had developed these devices  uh... and i'm not an engineer uh... but i have interviewed a lot of engineers and  they do have  uh... these technologies  the problem is is extracting the power  uh... but that can be done very quickly  i have developed those into usable forms  commercially  viable forms and there's a lot of technology that's been suppressed i mean a  good example of this is  eight years ago they had light bulbs at last in five years  fifty years ago they had panty hoes that would last for a year  hundreds of wherens  instead they will last  made he wants he can ask my wife about that  everything they just did it so so  at everything it's called planned  obsolescence  but more of the planned obsolescence they are  they've suppressed our technological development at a frozen level  all the elite has built a parallel  highly advanced technology above us  yeah and that's what the new world order is about and i finally found a  bunch publications admitted this  even though i instinctively knew it but that they go  uh... now i found this  just we've got a little bit documents on the subject  that's why they want to world government so they can done us down  start reducing our population numbers through uh... one child policies and  vaccines the rest of it  so the elite has access all this and we don't  well absolutely  and it's a little more than that  i mean i've been following uh...  russian technology  for  some years now  and uh... even for me to stop the american  but about either the super cavitation for people who are what's more scary  is a fit generation aircraft  and i've always scrambling to find figure out  how they did it because the entire trial and pilot  the navy  they said uh...  we expect only a uh... seven second  uh... what's expected to get to have nothing that can go in  but understand that's our pilots in thirty-year-old technology that don't know  about all the advanced technology that the government has to know that we  don't know how the Russians did it  that's because the Russians are developing things that we developed twenty-five  thirty years ago  and are now rolling these out new which new but it's really not new  it probably  you're probably right but you are pilots aren't gonna be part of that those  are all gonna be a real body  The black man is the auroras.  The, they've already photographed the large space space, robotic weapons, platforms that  are in space.  I mean, it's six or.  Oh, absolutely.  You know, I mean, there's a secret more now to start looking at the U-owned fly.  Say what, stay there.  We got to guess coming up.  If you want to stay there, I'll get to you another stage.  We're on the march.  The empires on the run.  Alex Jones and the GCN radio network.  Finally here spring as a ride I can always tell because I get a flood of gardening and seek catalogs  This year though, I'm not even looking at seed catalogs because I don't have to I grow my own seed now from year to year and you can too  With the help of the Arkansas to do its brand new 40 variety non hybrid heirloom seed collection with arks  Heirloom's you can save seed from this year's garden to plant next year  It's fun. It's easy and your garden produce tastes better than any you'll ever find at the grocery store  Arc's big 40-packet collection is loaded with everything a well-rounded garden should have.  There's heirloom sweet corn, melons, squash and tomatoes.  Enough to share with your neighbor.  There's cabbage, beans, peas, lettuce and carrots, beets, onions, cucumbers, eggplant radishes,  many other garden favorites, even popcorn.  Save money, eat healthy, grow your own delicious secure food supply, and your own seeds  year after year.  Call the Arc Institute toll-free at 800-255-1912.  That's 1-800-255-1912 or visit arkinstitute.com today.  Hello folks, Alex Jones here.  You know murky water filters have been removing path on a genetic bacteria for years, but what  about those unhealthy chemicals and heavy metals in your water?  The powerful black murky, purification elements fit most gravity filters and dramatically  increase their power to extract water-borne contaminants.  Best of all, they filter much faster than ordinary gravity elements.  This means it takes much less time to filter your water.  The black murky elements not only remove pathogenic bacteria, but also remove trihalo  methane and volatile organic elements such as aprosy benzene, chloride and chloroform,  MTBE.  Right onto two-two, foul taste into moxious odors, watch sulfur, even nitrates, and unwanted  heavy metals such as lead, mercury and aluminum are extracted.  Supercharge of gravity filter today.  In order to pack a black murky purification element, sprawling $96 or a four-pack for only  175 by calling new millennium at Triple 8 A03-438.  That's Triple 8 A03-438.  We're ordering on the web at berkywater.com.  Do you recognize any of these names?  Jungle Joe, Spike, Firma Queen, Shera Me, or G.I. Joe?  If you guess they're all American heroes, you guess right.  But these heroes don't belong to any crack-emilitary commando unit.  These true American heroes are American home-inspigens.  Right, registered pedigree to American home and pigeons.  Although the home and pigeon no longer delivers lifesaving messages on the battlefield,  they are engaged throughout the world at Seril's Resin exciting racing contests  that have become one of the fastest growing sporting trends in the nation.  Who races pigeons? Anybody and everybody?  There's no age limit to the excitement of pigeon racing.  I'll take the involved with this great sport,  and to call the American Racing Pigeon Union, toll free, 875-8RPU.  That's 800-755 ARPU.  The American Racing Pigeon Union has clubs in every state in the U.S.  For a great family sport and fun in your own backyard,  call the ARPU today.  800-755 ARPU or visit pigeon.org on the worldwide web.  He's the direct political talk.  Alex Jones on the GCN Radio Network.  We're going to be joined here in just a few minutes by Eric Pratt  works done as america doing a great job son of course  larry pratt  and we're gonna be talking about  an article as father has uh... put out to talking about  uh... how uh... the universities are schools of tyranny  also give you legislative updates about where the second amendment stands right  now under attack  how they're trying to resurrect the assault weapons ban  but we see some unfortunate shooting to get that reinstated  i wonder uh... even rush limbaugh's pointed out that the it's always curious  timing i could believe when i heard him said a few years ago  or the few good things you said in a while  uh... but uh... we will uh... talk about that as well and the pay for your act  to which  again being a true conservative organization on the sponey neocong ribs  his father wrote one of the best analysis  with their lawyers that i've seen  of and found stuff that i didn't find of just how horrible this pay  trade act to visit bush is trying to get  passed  of the smoke screen of reauthorizing patreon act one and quote  improving it  but before we go to eric prat and then we'll get to your calls on your holding  patient we have everybody  just briefly uh... i'm a documentary filmmaker as you know and i'm not listen  i can't imagine how any of you would not order my video  i mean i two nine eleven films nine eleven the road to tear any part to a  that film the masters of terror are pre-eminent  they cover the widest spectrum of evidence of government prior knowledge  and involvement  and the ensuing police state  you need to have those two  two plus hour videos each film over two hours long  also carried to a company's new video nine eleven the great illusion in  game of the limonotti  or customers film nine eleven painful deceptions  and his book nine eleven painful questions  my book on nine eleven nine eleven the city attorney  also covers a bunch of other key issues in whole watch of book order out of  k also the sponsored there  and the new world order a lot of big discounts when you get multiple  videos we have a lot of different specials  go to info wars dot com  or prison planet dot com  for who's the safe secure  online shopping cart  and look at the different films we have to uh... offer  and watch video clips of them and and decide which discount you want to  advantage of or if you want to  uh... or call toll free and you could ask about titles in different  specials  to order and that's 1-888-2533139.  That's 888-2533139 or just right to me, Alex Jones, at 3001, South Lamar, Sweet 100, Austin  Texas 787-04.  Here's just one of the specials.  Police state three total in slavery two hours 44 minutes long three or four films in one it is 2595  But if you order three or more of any of the ten titles they drop down to $20 a piece. That's an $18 discount of three-tape special  The entirely accurate that's 17 85  on the three-tape special  24 dollar discount on the four-tape special and so on  So please take action.  1-888-5331-39.  But we're joined by Eric Pratt, who I've heard interview  on the National Radio shows, haven't had the honor of having them on myself,  but it's great to having.  Anti-y's trying to rescue the semi-auto band from Death Row.  I guess that's probably one of the most important things  in the legislative update section of gunowners.org.  uh... arrick but a first off it's good to have you on with us  a thank you so much Alex great to be with you  you bet uh...  first off for those that may not know you are we all love your father and  appreciate his friend work it down on earth but  tells a little bit about iraq pratt what you do a gun owners  well i tell you it's tough shoes to uh... walk in uh...  uh... walking in his shoes but uh... the director of communications a gun owners  and uh... been with the organization for over ten years do a lot of the media  and of course uh... really enjoy this is a real heartfelt issue  uh... for me as well as my father's uh... you know this has been an issue that  has been near and dear to us for many many years  well it's good to see a son following his father's footsteps kind of the old  fashion thing that i can't think of a more important issue than being armed  slaves are disarmed folks it it it really boiled down to that when you cut  through all the garbage  uh... eric let's get into legislative updates  a lot of stuff happening right now with the second amendment a lot of  traitorous republicans working with the democrats at the state federal  level uh... we've had uh... whole neighborhoods with their guns being  confiscated  uh... up in uh...  Oshkosh was constant we've got  go down the  line for us of some of the most egregious threats to our second amendment  right now  well certainly you mentioned the Oshkosh situation where because of a shooting  uh... they cordoned off a whole section or third town uh... part of the town and  just went door to door confiscating firearms to see if they match the  the ballistics are just simply outrageous invasions of privacy  uh... at the federal level  uh... we have this ban which uh... thankfully  uh... we will probably see sunset on september fourteen  now that doesn't mean that the uh... that the battle is by any means over  uh... senator dian fine sign who was one of the primary authors of this band  uh... has been chomping at the bits and is looking for all kinds of opportunities to  offer  an amendment  that would reauthorize the band and probably most of people out so from  familiar with with the details of this but  uh... in case there's anybody who's not  in order for fine sign to get enough support in nineteen ninety four when she  initially proposed this man she stuck a sunset in  uh... quite frankly i think that's a great idea for all legislation they should have  a sunset and there's a hey let's look at this legislation after five or ten  years and see if it's really working  uh... i think most legislation we would just rather say uh... let's just let it  die  well she stuck this uh... sunset in for ten years and so here we are on the  verge  of the uh... the tenth year at the twelve hour  on september thirteen th this ban is gonna some sunset and she and others  like her fighting furiously to try to get it reenacted reauthorized and she's been  trying to throw it as an amendment onto must pass bills on the spending bills  on on you name it and so far we've been very effective thank god at beating her  back on that and and preventing that from happening and I tell you it's been  through a lot of grassroots efforts that this has happened we we fought a  battle on this in March and unfortunately Senator Frist, the majority leader, did absolutely  nothing to keep her from offering the amendment. And obviously as the majority leader,  there's all kinds of parliamentary moves that he could have used. He simply refused to  do it. Well, we hit him real hard. I had a lot of people emailing him, calling him, faxing  him. When the next go around came around this summer, he had finally seen the light a  little bit and he uh... when they brought up a class action lawsuit bill  uh... we were much interested in other than the fact that diana and fine sign wanted  to offer her amendment to that bill  and uh... that's when we hit him pretty hard and uh... he finally did the right  thing and he uh... gerrymandered to the bill in such a way with parliament  to lose that actually prevented her from offering that amendment so we were  very glad to see that  now that shows  republicans time and time again try to work with the democrats and  treacherous  bashions do this  but it does show that still  say you're republican you're supposed to be conservative  you know that eighty seven percent of program candidates were elected  reelected  in the last two elections  uh... you guys better watch  because we'll just give you the democrats if you don't back off  that is still having a fact and those phone calls really do count  unfortunately the alright  has been kind of passively fighting this only gun owners and jpfo have been doing  uh... decent jobs and obviously jp f uh... always in his biggest gun owners doesn't have a cloud  uh... all the members but  this is part of a pattern  uh... number one bush is said i have a whole file on this of mainstream news  that he will reauthorize that sucker  if it hits his debt so don't think bush is gonna save you folks  uh... also  and and and and and please give us a caveat to that air can be seen here in a  second but then i want to get into the the uh...  federal case there in d c earlier this year where the n r a  uh... lawyers said we are for registering guns and not leaving the house with  and they go well that's just for d c but the point is that would set another  precedent  we have the n r a all over the place we've been catching up  uh... actually uh... supporting bills that would restrict the second amendment  i don't know you don't want to do a bashing fest here  but we really have to  uh... go down the line we know where is bush now under all the pressure we put  on him  if he does get this bill  uh... if somehow it gets slipped in  and then examples of what the n r is up to eric  well you're absolutely right last year uh... through two different  but presidential spokesman uh... bush indicated that he would sign  the semi-auto-benefit came to him and of course that's very concerning to us i  I think not only was it the wrong thing to say constitutionally but even politically and  pragmatically it was a stupid thing for a republican to say I mean after all this is the  piece of legislation that president Clinton has admitted on numerous occasions and by the  way this is an admission against interest so this may be one of the few truthful things former  president Clinton said that he said it was this ban that he signed into law that caused him  control the congress in nineteen ninety four years repeated that over and over  again good morning america recently in his book uh... you know this is  something that that is really stuck with him in and so i find it very ironic and  and almost politically suicidal  that uh... a republican president and what would have come out and said oh yeah  that bandial all sign it if it uh... if it lands on my desk now  if there's good news in a silver lining in this i think uh... since then we've  applied a lot of heat through the grassroots  uh... to the white house and people have grabbed his spokesman figuratively  speaking and really lectured them up and down and and uh... they've really  felt the sting i don't know your dad told a story of a member actually uh... grabbing  kroll robo by the arm exactly exactly  i don't body  yet so figuratively and literally  and i i think what we have gotten from that is i i i i'd unfortunately i don't  think we have a change in the white house position however they have backed off  to the point where they are not at all pushing it  and i think that's one reason why it hasn't gone anywhere only had something  to this and get your strategy on it because you're more in the game than i am and i  try to stay in it but it changes by the middle second  bush was against arming the pilots  right that infuriated everybody it didn't make any sense right  uh... and so then he goes okay if you can jump through ten hoops right  uh... will do a test arms you percent of you and that never really happened  and we've got bush saying oh can't find it for four more don't worry bush won't  sign it bush signs it  don't worry the supreme court won't uphold it the republican court they have  hold it  i mean this is why i don't support bush because time after time  he does this  and it's it's it's part of a larger pattern and  i wanted to get your take on  uh... the take what sheriff mack did with you guys back in the nineties  he said no it's a ten-minute violation i'm not going to be back ground checks  on people to  by firearms  so that law was not constitutional but we still have  uh... the background check now an instant registration check  so larry taking those two points  maybe it's that i've heard some discussion that  it may allow  but the police are still just going to enforce it  well what what you had with the max situation was the part a of the  braidy law which uh... during the waiting period  uh... during that initial five years there was a waiting period  and the state police or local police were required to run the background checks.  And it was that part of it that was found unconstitutional.  Because now what you have is you have this system which unfortunately, you know, piece  by piece, nicks.  Yeah, yeah, one brick upon another.  First you had registration through gun dealers.  And now you have the gun dealers phoned it into the FBI.  So really it's bypassing in many cases the state police.  so there's no longer that that argument that they're being required by the federal  government that is the state police are being required by the feds to perform this  unconstitutional check and there are some that that's still doing they just  don't care but in most cases you just have the the federally licensed dealers  contacting the FBI so they've they've done the end around the police so  claiming is not a registration no it registers you as the gun owner but you are  absolutely correct that's right but but i mean you get my point though  is what type of event if it is repealed  uh... come up  uh... you know September 13  uh... i don't expect the gun grabbers at the federal state level to stop i mean i  i think i'm just gonna continue doing it saying well it's not a law but  you're you're well you're absolutely right and and what you will probably find  is that at the state level  uh... you'll see a lot of the legislators next year  uh... try to pass laws banning of these types of semi automatic firearms  certainly at the federal level they will continue  uh... fine signs not gonna go away she says it if we lose on this today we will be  back tomorrow and then be back the next day  uh... so they're gonna continue hammering this uh... this is an issue that's not  gonna go  of course she has our bodyguard to the king of well there's the irony in fact all  these guys really live in some you know some of the most secure sections of  washington d c there's more cops per capita  around capital hill  uh... certainly anywhere in d c let alone the uh... the rest of the country so  they passed these laws in the comfort and security of their little uh...  uh... well it's like rosio donald yonder a little cocoon  they have donald got people with machine guns but we can't have guns  that's right  that's right by the way you know it's interesting you you named off the three  issues that really have gun owners on edge  uh... the semi-auto ban  also that incumbent protection legislation the so-called campaign finance  reform  and uh... and of course the other one is is the arm pilots issue and and those three  issues uh... bush has certainly been wrong on  and i tell you you know that not only has he been wrong  constitutionally in all three of those issues but  but politically speaking you know we're all told arrick that they do what they  do to get elected and that's a bunch of bull  we've got  eighty seven percent of americans just like with the ganesh you against the  open borders  but the but the democrats republicans are trying to get rid of the  borders i mean it's just  they have a elite policy that they want to carry out  that's right and you know for bush what he's gonna find is that a lot of these  gun owners that crossed over a lot of the democrat gun owners  who voted uh... didn't vote for gore in two thousand in the ones who crossed  over in nineteen ninety four which clinton has lamented for the last ten years  uh... that they would rather stay home and vote  uh... democrat and if there's no wish note no difference on the gun issue  they were just as soon stay home and vote democrat rather than crossover and  vote for republican and so  he's really shot himself on the foot in this and on the gun issue carry in bush  in many ways uh...  a lot of people don't see a big difference  well the gun issue is paramount for me and uh...  we get back at a bunch of callers here will probably on multiple issues but  will all tie back to this  you know not just those three issues you mentioned the way right  or that i mentioned that you elaborate it on uh... your father wrote frankly  what i think is the most detailed analysis of patreon act to  he found stuff i didn't find with your lawyers  and uh... you know that's an anti gun piece of legislation in itself  and again there you have it i just it's i wish we could have a real republican  president  and uh... not to this guy  well i wish that to and i don't know if uh... one could really get elected  unfortunately  uh... but you're absolutely right uh... in many of these ways  uh... many of the issues were talking about that there there's not much of a  difference uh... you know certainly i mean kerry is awful  uh... you look at his voting record he's one of the most anti gun  but i'll send it to carry it selected you guys are going to get more money  more support and be able to fight and conservatives will be more white  with bush and office it's sleepy time  well people do think that went when there's a republican congress republican  president hey we've died in gone to heaven and you're right people do fall asleep  a little bit not realizing that some of our most intense battles have come under  republican administration  yeah so  look either way i i don't want to get elected folks but it doesn't even  frankly matter and i think overall  if carry is elected you're gonna see a bigger awakening in this country  fortunately is gonna use a victory act against us  so get ready for that  will be right back we're talking to Eric Pratt your calls are straight ahead  right here on the t c n radio network  Alex Jones here announcing the release of my new film, Leastate 3 Total EnslAmen.  Police State 3 details the architecture goals and operations of the new world order.  There is a chance to use this disaster for the new world order.  The new world order.  And the murder.  The film documents does as a confirmed cases of ever-monstratorism worldwide.  We rip the Senator Patriot Act legislation 1 and 2 of hearts.  He's by peace and reveal the arrogance of what Ashcroft has to say about your liberty.  You will lose your liberty.  Homeland Security Executive Orders, or vaccinations,  the new prison economy, to the total information society.  The Pan American Union, federal gun grabs  government run by slavery rings and much, much more.  If you want to understand what the new order really is,  then my new 2.5 hour video,  Public State Three is for you.  Visit info-worrest.com or prison-plan-a-dot-com-dot-order  for call 2003-1888-2533-139.  That's 888-253-139.  or today in spread the word.  Nuclear reactors provide economical energy, but would you be prepared during an accident?  During nuclear disasters, great amounts of radioactive iodine are released into the atmosphere,  which are then readily absorbed into the body.  Medical course potassium iodine gives you virtually complete protection from the most feared  consequence of a nuclear accident.  Radioactive poisoning, potassium iodine can protect against radioactive poisoning by filling  the thyroid with good iodine. This shields the thyroid and prevents it from absorbing the harmful  radioactive iodine. The potassium iodine is better than the iodine form because it is not as likely  to cause upset stomachs in children, the elderly, the sick and pets. Order the official potassium  iodine for only $24 and save $5 by calling new millennium at Triple 8 8 0 3 4 4 3 8. Call now and get  free shipping. That's triple eight, eight, zero, three, four, four, three, eight.  Herbal healer academy is a global supplier of the finest natural medicine that you may need  in these troubled times. We specialize in keeping you alive and healthy. We provide outstanding  products like E-C-AC, colloidal silver, 500 parts per million, olive leaf extract, oregano  oil, and hundreds of Herbal oils, books, and educational materials. We have homeopathic  detox solutions for contral, radiation, MSG, and aspartame poisoning to name a few.  We also trade natural path at healers via correspondence education.  For a limited time, you can sign up on the website and receive our 104-H catalog and  a current herbal healer newsletter free.  Simply log on to herbalhealer.com.  Check out our online member testimonials and our hundreds of exceptional products.  We have been working hard since 1988 to save the remnant that's herbalhealer.com, your  website for state effective natural alternatives in education.  If the national rifle association was not a compromise organization,  we would be back in the old days of the NRA just building shooting ranges  and having educational programs and promoting the Second Amendment.  They're bought and paid for, they're Trojan horse, they're controlled.  Eric Pratt won't say that, I'll say that.  Dun owners is no compromise, that's why I support them.  i know the callers of the whole things before eric out here so just  try to make it for the squeak somehow on topic  but it's all interconnected but i don't want to get into the patreon  the colleges being turned into schools of tyranny in the next hour with a  but uh...  and and go over this claim to the patreon act as an effect citizens when it  does every day every one of us  uh... but uh... we were talking to brine and virginia b to be talking about  technologies in advance technologies in the military  uh... and then just go ahead brine and then you're saying  uh...  thank you  i don't mean to help  well i was also looking into the uh... uh... scc following the different companies  and  uh... but really interesting the so far as they are  the rain corporation  makes a lot of technology goes into  and people at the distance talking that or the watch from one track society  that was made up  they're not  uh... part of what they say i  you're using the watchtower track society  owns with a lot of stock in a weapons contractor  please email me that i love to see that thanks for the call  but tips and info war stock com  uh... eric that leads me to another point we have the government deploying  humvies with microwave guns here in the u.s  we have  all this so-called less than lethal or non-lethal weapons  we have the government gearing up against the people at a time they're trying  to get our guns  isn't it more important now than ever that we'd be armed as a counterbalance  against her any  well absolutely and you know we we have so far gotten away from the vision that  the founding fathers had that the way you secure peace in a country  uh... is a that the people remain armed and be i mean they they thought that  the greatest threat to liberty work was large standing armies and yet we have  them uh... you know not only at the federal level we have them in in federal  police we have them really in police in every state in every county and they  would really be abhorred at that idea and shocked that we had so given up on  our self-government and really just turned over the whole issue of protection  over to paid government agents rather than really exercising self-government  and self-responsibility. Well now Eric we have General  ever heart that had a north comp general frank's out going out of  sitcom going  well it's sad to say but for security we may have to have martial law and  set aside the constitution and  have martial law  i mean they're really floating these ideas really gearing up for it it's hard  to believe but it's  really happening  and that's outrageous uh... that that there's no provision uh... in the  constitution for uh... for saying that the constitution aside  and uh... that's just simply outrageous and and uh... you're right i think  they they float these ideas to slowly get people conditioned to the the thought  of it and i tell you that's something that we should really react against  and i thought the military sworn up to protect and defend the  constitution but  you posted on your site you guys have written about it  you know the f bi training fliers saying report dot owners report people that  quote  make frequent references to the u.s. constitution  uh... i mean what is wrong with these people  Well, you know, it's a problem that we not only face here. I mean, we face this, you know, all over the world and that is how do you protect peace  and give government the power to do it without giving it too much so that then it becomes the monster and  The founding fathers saw that the best way you did that is you kept short tabs on it if you even needed standing troops  you would only do it for two years and then you would have to ask the question  again should we continue keeping these standing troops in that hole you know if  a founding father were to appear today and say these ideas they would be  considered to be on the far right end of the spectrum you know that those ideas  have been totally lost unfortunately well look at the Swiss they don't even have  a military it's the citizens and they never get invited now the highest standard  of living in the lowest crime right in Europe that's actually the vision I  I think that most closely resembles what the founding fathers had absolutely.  Yeah, we'll be back with the third hour with Eric Pratt and your call.  Shh.  Like a mainstream media.  Government cover-ups.  Do you want answers?  Well, so does he.  He's Alex Jones on the GCN Radio Network.  And now, live from Austin, Texas.  Alex Jones.  Alright, if you're just joining us, we're into hour number three. I'm here Monday for Friday from 11 a.m.  to Bm Central Standard Time. Back from 9 to midnight, we blast out on the A&M dial from Los Angeles, California to Providence,  Rhode Island from Austin, Texas to Kansas City, Missouri, from Denver, Colorado to Pensacola, Florida.  We also simulcast on Global Fort Wave on WWCR during the day.  and that is of course during the day from 11 to 2 on 94 75 and at night from 9  to 9 at 32 10 we're talking to Eric Pratt of Gun Owners of America.  Of course of Larry Pratt is put on this program about 50 60 times over the year.  We're about to go back to your calls get some of these collars out of the way  that they're holding forever but we're going to get more into the brainwashing  of the young people with the colleges and Patriot Act 2 and what's happening  with the second amendment.  uh... let's go ahead here  and uh... talk to kelly and texas you're on the air welcome  hi Alex  you may have already covered this but if you have a one-year-old let you know that  the uh... a c p v board  uh... meeting  yes i had five thirty p m  yes and i don't even i don't think that's open to the public i think it's a  very first you can go and sign up for citizens communication  and uh... eleven forty three north western  and tell them that you don't like their plans for the first amendment  and i will be there  uh... at five thirty today  and it would be good to see everybody else there as well and i appreciate you  reminding me  course i'm going to see a lawyer  right after this broadcast today so  we're also gonna be giving some new surprises very soon  uh... anything else going  that's all thank you  thank you  eric on glad she brought this up you know i started out ten years ago in  college and i actually tell that  uh... we've shown uh... speeches at your father and uh... and and other  groups have given  uh... we have defeated legislation using the channel it i've won best  he be shown often  in the readers poll it's very very popular is the point  and they got a new board in there that's saying you're not allowed to  criticize any group or have any political speech on these uh... channels  on eleven and sixteen  and uh... we're gonna have to soon  and they say well  things have changed in america we just can have this type of speech  and by the way austin is the birthplace of access television it began here  the idea began here  and we see the first amendment we see preachers being arrested  in pencil vania for reading bible passages during citizens communication  because they say it's a full and hurtful in the comments  what to show that it's the only have the freedom of speech as long as it's  politically correct speech right  that's just simply outrageous and this is the kind of thing you mentioned  uh... like atoms who's at the uh... you the university of north carolina this is the  kind of thing that  that he's been dealing with he was a little liberal  uh... a few as democrat  uh... a tenured profession uh... professor at the university there  and uh... what he has found is that truly he was free to express his views  uh... as long as he was telling the pc line  fact he says it is funny because he says that people the university works  were excited to hear that he was coming out of the closet  uh... but they were disappointed when they found out that it was the seaward  not the g-word it turned out he'd become he'd become a christian it wasn't that he  was announcing he was gay  yeah that's how you come out of the closet  it's more shocking than a governor coming out  that's right  uh... incredible will will break i want to come back and then we'll go to your  calls but i first want to get into the story of  uh... tyranny in the colleges  and you know i want to tell the left out there you know we defend you when  yours five hundred bush supporters  and one of you stands up with a side that says no blood for oil in a  street corner  and you get charged with a felony that's wrong  but it's also wrong with a pastor can't read out of the bible passage without  being arrested  for that is outrageous that that is really uh... oh yeah that was an  source  it of course that's just an extension of what we've had in the schools now for  thirty forty years  Well, Eric, you're free to have free speeches long as it doesn't hurt someone's feelings.  Absolutely.  Not that we've been told now that with access to television.  Well, you don't, you have free speeches, don't hurt anybody's feelings if there's a complaint.  It'll be off the channels.  That's not taking your freedom away.  We'll be right back with Eric Pratt Gun Owners.org's the website.  Why continue to suffer from pain, illness, and disease when natural health and wellness therapies  within your reach. Hundreds of people report improved health and wellness using  rife frequency technology. In the 1920s, research scientists, Royal Raymond  Life, discovered that disease organisms can be destroyed using resonant  frequencies. The file solutions frequency instrument uses the same technology  for relief or elimination of pain and disease conditions. There are no side  effects. Join others in discovering a return to natural health and wellness.  Eliminate the cause. Don't just read symptoms. File solutions has over  453 program auto sequences for various health conditions and is very easy to use.  It comes with a 30 day return policy and a 1 year limited warranty.  For more information call alternative technologies toll free.  866-885-66-865-866-885-6625.  Hello folks, this is Alex Jones.  You know that bird-y water filters have become the standard of excellence by which all other  water filtration systems are measured.  The bird-y light gives you the freshest cleanest water possible from the world's most revolutionary  water filtration system.  The self-sterilizing black-burgey elements remove pathogenic bacteria, cysts, parasites,  volatile organic chemicals, pry-halomethanes, radons, tutu, and much much more.  It's rechargeable 8-lamp, right-white LED lighting system, provides the ideal source of emergency  light.  and run all night on a single charge and it is brought enough to read by.  This provides a relaxing and ambient night light that allows for optimum use to your emergency  conditions.  The Virgin Lights Revolutionary transparent design takes a guesswork out of refill and  makes you can see the water level at all times.  Get the bird key light, the standard of excellence for only $259 by calling New Millennium  at 888-80348-80348-8048-0.  All in Alice Jones, didn't you?  That's toll free at 888-8034-38.  Not get available in Ireland.  Hey folks, Alex Jones here.  And the behavior of our police is a reflection  of our government.  One look in the mirror and we know our country  is entering a high-tech police state.  Here's just a sample from my documentary film,  Police State to the takeover.  In downtown Seattle today, the first amendment ended.  The civil emergency was created by the police.  I am pleased to have people on the street in the tournament late.  The medical bills are going to be enormous for me.  You see them here with their hands, come behind their backs.  They are being led into the sand point bridge.  The neighbors in that area of sand point naval air station were shocked to hear that the  old bridge was being reopened.  This information is absolutely vital for all freedom levers in the United States.  Order your video today.  Call toll free at 888-25.  3-3-1-3-9. The number to order the takeover again is 888-25-3-1-3-9.  Put on my website infowarz.com.  From his Central Texas Command Center, deep behind enemy lines, the Information War continues.  It's Alex Jones and the GCN Radio Network.  Yeah, just a side note for Austin listeners  this evening at  530  At 1143 North Western Street to stop East 11th  We're gonna be there for one of these board meetings which it's just good to let them know that we're aware of what they're doing and and their own admission that  It'll be restricting free speech and so we want to come down that's important the real fights are coming at the City Council here in the near future  But we're about to go to Mike and Leon and Melissa and Phil and others.  But before we do that, going back to Eric Pratt of Gun Owners.org, Eric, this article  your father's written, Larry Press written about the tyranny in the schools and the colleges,  go over that story for us and some of the examples because this attack on the first amendment  he is directly connected to the second the two are intertwined like the wings on  eagle  or you're exactly right and in fact it was  his eventually becoming  pro-gun that actually  really led to uh... his political transformation  uh... what what it happened was that some friends got to know the story for those  who joined his market down  yes some friends of his were murdered and uh... as it turned out he had to  drive past the spot  uh... where the murder took place almost every day  and uh... he you know as he got the thinking about that he thought you know  that they didn't have a firearm to defend them so well he went out and  bought a firearm now he was still a liberal still in the first uh... still a  democrat now describe his  what he was doing at the university who he was  uh... he's a uh... professor of criminology at the professor  and uh... so his comments and started working on it  absolutely  okay you can use a tenured professor  well he said it was actually that act this act of taking responsibility for  self defense into his own hands that eventually led to the crumbling of his  worldview the world view that says that  that we have to rely on the nanny state for all our needs and and as  it turned out he eventually became a christian and a conservative republican  to boot  uh... but this  but when this got out of course uh... infuriated  uh... and just shocked uh... the rest of the faculty course they can't do anything  now now that he's tenured  uh... but in fact you know he has these frequent sparring sessions with uh...  other fat faculty one of his fellow colleague  poker finger  in his chest and called him a dangerous man  because he had an inner a sticker on his door  uh... you know this is the kind of open mindedness that we have at the  university another time the same lady got in his face and yelled at him that uh...  George Bush is a buffoon. Regardless of what you think of the president and what's interesting about this is that this is the same lady  Who's conducting a study at the University of Estu whether or not there's a liberal bias at the University  So you know it's interesting  How does calls for tolerance come from those who are quite intolerant?  Well, of course. I mean they want their speech not ours. That's right. This is all gonna be  Selectively enforced and he's been through quite a lot  but i mean this is tayman comparison i interviewed a clinton in turn  who is a conservative  uh... and uh... this is about four years ago at temple university  uh... they were having the corpus christy  uh... play were christ is a is a gay prostitute  the christians were insulted by this in a match they had a thing where mama was a  you know gay prostitute right or whatever  and so they want they were a big christian group they were allowed to have their  own uh... rally they were gonna have their own time  they said no this guy had no record uh... top score in the school  he went into the principal's office and they when he refused to withdraw his  request for the meeting  uh... for the rally they tackled him  cutting put in a uh...  in a ambulance and taken  to the  this is the faculty yes to the university run middle hospital and the doctors  said we refuse to drug him and there's nothing wrong with this guy  but but the windows of the time that they were going on these people are on  such power trips that they think challenging them as illegal  uh...  all that that's horrendous now you know i gotta say my cattles as a great  uh... he's got a good sense of humor when he gets attacked  he says that he goes out and buys a gun that that he doesn't need just to make  the mad and of course he tells his opponents this you know thanks for your  views i'll go out and celebrate by buying another gun  so thanks to them he's gonna end up with a huge arsenal  uh... but uh... you know good for him for kind of keeping a good attitude  well it's a good investment  yet absolutely well and if he has kids and grandkids uh... you know it'll be  good to pass them along to them too because one day uh... they may not be able to  buy them as  as easily as we can today  but you know i'm not making the story shop  pastures reading  passages it's to be council meeting during the three-minute communication  of being arrested  i mean this stuff is really going on i can't believe it but it's really  happening  well that's a shame and uh... and you know  it's uh... i i i i i plaud what you're doing and getting the word out and  letting people know because people need to know about this and uh...  well i appreciate all the work that you guys are doing let's go back to the calls  i guess something that's just my turn on one of the things for holding mike or on  the air go ahead  yeah i i call the touch-based about instance that happened i had to take my  uh... sisters kids to the public school i'm not gonna private school  but real quickly i want to tell you that i have a thirty-odd six rifle and uh...  i moved uh... cross-pound last year and my daughter started new school here  private school but she made a lot of friends in the neighborhood  and she went and have a sleepover she's ten years old and uh... the parents  got win that i had a rifle  because my daughter had said that we have a gun to protect us in case someone breaks  in our house  her parents and now basically about four five other people in the room  won't even let their kids affiliate with my kids because i have a rifle in  my house  you know what what they need to realize is that they would have actually been  and greater danger driving their kid over to your house  then by staying in the house with the firearm  yeah you're twelve times more likely to be killed by a car but this is an  emotional thing it's like it is  i know people who won't go swimming in a light because they have fear of  shards  uh... i'm serious people but i don't think i want to tell you that i took my  dot my sister's kids to the third register for their public school as we  care about that a lot of times  and i'll tell you some that's unbelievable they have all these pollsters in  school talking about riddle and i mean riddle in advertisement uh... is your  child have a touch of the sort of  i mean they're advertising this stuff like the advertising candy  well sir under the new freedom initiative  they're gonna forcibly  psychologically test them twice  each year and the drug companies admittedly written the guidelines  and i'm gonna try to put them on any side college if you heard about that  earth  no i hadn't but uh... yeah that's well wow what what a problem that is another  wonderful thing what's fresh the democrats are gonna just  i think we don't you know i think like whether bush or carry get in there  a like you always tell exit the uh...  two sides of the same coin i think they know that i got it you're failed uh...  and i'm not voting  and i think people always say you know people who don't know what to speak out  and i disagree with that or hardly  uh... when you're not given a choice why would you make a choice if you're not  given a choice of somebody  uh... then boy the boat and independent results yourself and i'd be better off  well i would say this fight the electronic voting machines vote locally that's  with the real powers that in the congressional elections count but  uh... you know you're mentioning  what's happening in the schools  uh... what somehow we've got to take the schools back i mean  uh... josh sugarman of the violence policy center three years ago in the local  paper said  we've got your children we're going to ban guns that that's a paraphrase but  he said that  work where you'll wear those types of comments here  you know i was in alex and i'd like to if you'd email that to me i'd really  because I tell you we are really taking the battle to the schools now.  And education is an issue that you know normally you wouldn't think of a gun organization getting involved in issues like that.  But for that very reason that you just put your finger on we see there's a tremendous battle.  And unfortunately the textbooks and the teaching in the schools you know is chipping away at our national sovereignty.  It's praising dependence on the United Nations, downplaying the vision that the Founders  had on the importance of federalism, desecrating the Bill of Rights, especially the Second Amendment.  And he, unfortunately, this is an area where I agree with sugarmen that if things aren't  changed, they will have the hearts and minds of our children, and they will be banning  guns.  so uh... you know that this is a or a real key battleground where we really need  to you know in fact we were successful in this year in killing a bill  uh... that was going to expand  a lot of this education and and it was gonna like federal guidelines for  civics which we're gonna be all anti gun  exactly thanks for the call my  uh... leon leon where you call this from  uh... call riddle welcome sir go ahead yeah thank you and hello erica  Hi, Leon.  What I called about was that I took my work to the state  Republican convention, and I took my copy of the Constitution.  And one of my county commissioner says, what kind of H.E.  Double are you going to give everybody, because they know  and rather outspoken?  And I said, Jim, I said, well, I'm going to ask all of you  and their results, our county commissioner's off work.  I said, tell me when this was repealed.  This law was repealed.  It was enacted by the Continental Congress, I believe, in 1979.  Can you tell me when it was repealed?  I don't know, it just all looked at me.  That's the dumbest look.  And I said it wasn't.  And it's basic law.  And all the rest of this other stuff that you're passing  is legislation.  And it says right in here that it prevents anybody  from doing that.  Any congressman or anybody from passing any legislation  that is violating any of our  uh... bill of right  yeah that's the point is that they're violating the big supreme laws and why are  you doing it and then i went around to my representatives in my senators and i  have them the same question it was really fun to look  watch the dumbfounded look on their face because they had  answer  well what did they say to that  nothing  they were dumb found that they were just say it  they said well no it hasn't been repealed and i said well then  why are you passing legislation that violates your own  that says you are not to do this  and i can read in here it's it's an alleged  proceed  the bill of right says you  this is to prevent you from doing that  why do you do it  and they just  looked at  yeah this is the same kind of a you know leon brings up a great point and this is  the same kind of debate that ron paul gets into uh... represented from  taxes with his fellow legislators they look at him like he has two heads  uh... but you know he points to the after that's right that the supremacy  clause clearly says is the constitution  and laws passed pursuant to the constitution that are the supreme law  the land  and if a certain law  uh... doesn't correspond to the constitution and it's out of whack with it  then it's not truly law  all right they need to be reminded  thanks Leon Melissa and Phil but others are up next  with Eric Pratt, who also gave you the phone number for gun owners.  Ladies, for healthier, more radiant skin and hair,  you need to start flipping it.  Do you flip it?  When I first started flipping it, I couldn't believe my eyes.  Once you start flipping it, you'll never stop.  The next time you pick up one of your beauty products,  flip it over an examining ingredient.  You'll be astonished by what the packaging reveals to you.  Many mainstream beauty products are comprised almost entirely of synthetic petro-chemical.  for more natural approach to looking and feeling great, visit naturalskinandhair.com  or call their friendly and knowledgeable staff toll free at 1-866-339-SK-339  skin.  Start flipping it today because you really can look great without all the synthetic chemicals.  Once you start flipping it, you'll be glad you did.  Visit naturalskinandhair.com for more information on natural beauty products.  The U for this call 866-339 Skin that's 866-339 SKIN or visit natural skin and hair.com today.  Skyrocketing oil prices, the economy on the brink, the plunging dollar, terrorism, the government spending a dollar, 80 for every dollar in collection.  Never in the history of our country have we faced so many threats to our freedoms, rights and individual security.  How long can we continue without a fracture recovery?  We've recently rocked the elections in Spain, what will happen as we get closer to our  own elections?  Now is the time to begin preparing for such trips.  Ready Reserve Foods has been helping businesses, government and individuals for over 32  years.  No matter what your preparation needs, Ready Reserve Foods offers virtually the finest  in dehydrated, nitrogen-packed long-term, stormable foods and has food units to fit your particular  needs.  Get a deluxe three-month food supply for one adult, normally 498, for only 2.49.  by calling Ready Reserve Foods at 1-800-453-2-02.  Paul now and say 2-49.  That's 1-800-453-2202.  And how long now looks Jones sent you?  Jack Brown, for Midas Resources.  Last summer, we did some two-year comparisons  to junior equity markets in gold.  Let's update.  January of 02 to January of 04,  the Dow was up a whopping 2.2 percent.  The NASDAQ and that same timeframe is flat.  Two years ago, the US dollar was worth 17% more than a year old.  Today, the US dollars worth 28% less than a year old.  Guess which one has gold backing?  January of 02, gold spot was 283.  January of 04, it's well over $400  into 13 year high up near 40%.  Gold is moving, equities are trending water.  To say little of the billions lost in market scandals,  put your money in a safe payment,  physical possession, private gold.  Remember, gold cannot go bankrupt.  Call minus resources today.  800-686-2237.  Protect yourself.  Protect your loved ones.  Call 800-686-2237.  New hair guarantees your regrowth thicker,  fuller, denser hair, or we will refund your money.  Any time within a one year period,  here's what real customers have to say about new hair.  I've been using new hair for about three months  with some excellent results.  Around the second month, I noticed my hair was thicker,  had more body and a vibrant color.  This is a great product that I will continually use.  Since taking new hair, I noticed darker and less green hair.  My hair is growing phenomenally.  It looks and feels healthier.  I'd strongly recommend new hair.  Stop the clock on your hair loss  and regrowed thicker, fuller denser hair,  guaranteed with new hair.  Call now.  800-800-  8060432, 808060432.  Creshing through the lies and disinformation.  The U.S. Alex Jones, only on the GCN Radio Network.  I folks for final segment with Eric Pratt, the website's gun owners.org, or give them a call.  It's 703-321-858, and we'll give you the toll-free number here in a few minutes as well.  finishing up with collars quickly here  uh... let's go ahead and talk to Melissa informa less attention holding go  ahead  high-elects and iraq  i'm a listen  and we all know about the union grove and skilling bones and what the evil  ones carried out on nine eleven  and i just wanted to point out another example of how satanic our leaders  and get them really are  throughout the take our guns away  the congressional metal of honor is the highest award which can be given to  those in the military  or valor in action against an enemy  and this metal is an inverted pentagram  and it has one use only and that is the call up power of state and  and bring the kingdom of the devil  in the manifestation on earth  and it's a lot of the same that means that those that get it know that are bad  but i mean you know washes laid out in a cult masonic stuff and  a lot of the symbols are bizarre and why is the congressional metal on her  upside down star that's a  that's an interesting point  yet it's in the last of the back of that and the go to the end of the  two are in reality satan and i agree that you know the one thing awarded to  may not have any idea  that that's what it really can be a lot of the but  but i just want to let your audience know that you can do a google search for  congressional metal on her  and click on search images and you'll see this they can get all  and this was shown in the maybe the main jury and candida  and for anyone who wants to study  that occult symbols used by the new world order  there's a great book called uh... masonic and occult symbols illustrated by  doctor cathy burn  thank you for the call i appreciate it molesa  and uh... let's go ahead and talk to uh...  fill up in virginia go ahead you're on the air  thanks Alex green few uh... and air clear  this a programing note about your program uh... it's brian and virginia beech  still listening uh... you can catch out  on at saturday  on saturday evening at eleven o'clock  and sunday afternoon at two fifteen  well that's wonderful yes uh... tell folks that the station  uh... nine forty a m w k g m  and uh... right there in virginia beech where uh... i was arrested for  preaching on the street which kind of does tell to what you were  mentioning to eric about uh... the you can't read scripture in uh... this  great state of pennsylvania  uh...  the uh... center uh... on the subject of the our  uh... right to hunt  uh... with firearms and protect ourselves  uh... what was the  significance i never saw the movie what was the significance of the movie  bowling for combine  well they  go ahead.  No, I'm sorry.  Go ahead.  Basically, Michael Moore was making the point even with that title that just like those two  criminal hootleham kids had gone bowling shortly before they carried out that massacre,  that that could have just as easily have affected what they did as say the music that  they were listening to or things like that.  mean you know when you when you're dealing with michael more you're  dealing with a uh... really warped  uh... mind shall we say and uh... you know half the movie was uh... either just  out and out lies or deceptions or or didn't make sense and i agree with that i  mean it is his bowling for column by is a disgusting  tragedy  uh... is not eleven film is is a lot more truthful but then he acts like oh it's  just a republicans the democrats are gonna save us  it was just a hack job on  against gun  i could barely watch it it be it was  i'd say more than half lives i'd actually it's worse than what uh...  and what are you access  uh... are you also aware of how i'm i'm there and uh... with the assembly in  Tennessee they the blunt county has a new program called saturation enforcement  where uh... it when you were talking about the  shooting up in the midwest where they shut down the whole time and just  started confiscating guns  well they have this program saturation enforcement where no lot no crime even  that have to be committed and they just go  uh... you know it's like reminiscent of uh... you know the at that storm  yeah were you aware of a saturation enforcement arrick  uh... sounds like something out of the movie minority report where they'll uh...  crackdown on crime before it happens  hey i tell you what fella talk to you after the right we'll go to bob broken  everybody else's patient holding but i'm gonna let  uh... arid prag it back to his important work websites gun owners dot o r g  and uh... how folks call and uh... join your organization  well certainly they can do it online uh... by going to the website of gun owners dot  org but if they prefer to call uh... they can call his toll free at triple eight  double eight six guns six g u and s that's triple eight double eight six guns  all right well uh... eric say how do your father for me and this year your your good  There's the Head of Communications at gunowners.org and please keep us abrass if any  developments. I sure will. Alex has been a pleasure. Thank you sir. Great  American. We'll be right back. Stay with us. Your calls morning. We're on the  march. The empires on the run. Alex Jones and the GCN radio network. We all have  busy lives and sometimes that causes us to miss out on the things that are  most important to us. Well when it comes to Genesis program you'll never have  to miss out again. For only $19.95 plus $3 shipping and handling, you can receive an entire  month of recorded GCN programs. That's right an entire month for only $19.95 plus shipping  and handling. The recordings are an MP3 format and compact disk. They're playable on computers  along with most newer CD and DVD players. All you need to know is the name of the program  you'd like a copy of and the months that it aired. Don't be left out of current news  at information that affects our lives every day. We all want to stay informed so visit our  website at gcnlive.com and click on the gcn mall or call 877-996-4227 extension  150. It's easy and convenient hurry and get your copies today. Again visit the gcn mall at  gcnlive.com or simply call 877-996-4227 extension 150.  The Burkey Security Pack is your one-stop solution for unexpected emergencies. It provides  you with purified water, light, power, and communications ability.  The security pack includes a burkey light water purifier and LED base, two burkey sport filtration  bottles, the burkey battery adapter, the burkey MP solar charger, as well as a backup set  of two black burkey purification elements.  The burkey security pack is important every day and a must during emergencies because  it provides purified water, long term low energy lighting, backup battery power for your  Burkey LEDs, free long-term solar power for communications devices such as  radios, walkie-talkies, and cell phones, as well as power for small  applications, yet the one-stop solution for your emergency and everyday needs.  The Burkey Security Pack, a retail value of $518 for only $399 by calling  new millennium at triple 880-3, 4-4-3-8. Not yet available in Iowa.  It's finally here.  Spring has arrived.  I can always tell because I get a flood of gardening in seed catalogs.  This year though, I'm not even looking at seed catalogs because I don't have to.  I grow my own seed now from year to year and you can too with the help of the Arkansas  Institute's brand new 40 variety non-hybrid, air-loomed seed collection.  With arks, air-looms, you can save seed from this year's garden to plant next year.  It's fun, it's easy, and your garden produce tastes better than any you'll ever find at the grocery store.  The grocery store.  ARK's big 40-packet collection is loaded with everything a well-rounded garden should have.  There's heirloom sweet corn, melons, squash and tomatoes.  Enough to share with your neighbor.  There's cabbage, beans, peas, lettuce and carrots, beets, onions, cucumbers, eggplant  radishes, many other garden favorites, even popcorn.  Save money, eat healthy, grow your own delicious secure food supply and your own seeds  year after year.  Call the ARK Institute toll-free at 800-255-1912.  1-800-255-1912 or visit arkinstitute.com today.  Waging war on corruption.  Alex Jones on the GCM Radio Network.  Alright, we're going to go to Phil and Brock and many others that are holding at 800-25-9231.  Also cover some other news I haven't gotten to yet and recap.  Some of the top stories.  But before we do that, just for a few minutes, I wanted to bring Mr. Simbly up from Ready Reserve Food.  are food. It is the longest continually operating the hydrated food company in the United  States. I ordered a huge year food supply. I am extremely impressed. I've got affordable  food before and then consumed it later. This stuff, they produce it all in America, put  together there in beautiful cans high quality and it just took a couple of weeks for me to  get it after I ordered it. I'm very, very, very impressed and they've got some specials  running folks and whether you're worried about earthquakes or hurricanes or whatever or  a financial collapse or you want to put something out at your, you know, camp house  on your land in the country  this is a system where it's all in can's  and it is high quality  there that this is the oldest continually operating  company  in the United States and for good reason  not a fly by night operation i cannot tell you  how impressed i am with the quality in the taste  it is amazing  uh... day to do to have you on with the sir  how excited  you bet uh... tells a little bit about your company and some of the different  packages and specials you're offering right now and i hope people will take  advantage of it  well we've been a business is our thirty third year continues here  uh... we always try to get the best quality food we can  uh... we can we can find  work out my dietitians constantly hunting and packing looking for  for new supplies or something that's better we've made mistakes up and down  the line we've learned from our mistakes  that was years ago with  with pretty much got a dialed in  we're very proud of our products  and uh...  i'm glad you're happy with your your food  they look at charlie what happened in charlie is just looking at the internet  just a few minutes ago  people are frustrated waiting for help  now we get it with the major terrorist attack  this entire country will come to a grinding all where they help gonna come from  you're gonna be a federal the federal commission saying  it is more likely that we will be newton we want it's more dangerous in the  cold war and you have a little bit of a third behind it  uh... we have a saying nerve gas all this stuff  that will cause a break down in society biological tacky worse  but folks exist in insurance policy at inexpensive  insurance policy and we have found a great source  for you to get that insurance policy  uh... with  there are no supply problems at the moment uh... sure everybody in their dog  want to  began to get prepared all at once kind of like what happened in white to k  there's a like time so your listeners need to start preparing  now you have to be the first ones literally to the lifeboats  tell folks about some of the special  what the mobile we have a year supply deluxe  your supply  uh... normally fifteen hundred ninety five dollars for one adult  and uh...  it's on special for  uh... god i'm sorry can't  or the data in front of me  we're also continuing this was very popular we ran a special  uh... three months apply for two hundred forty nine ninety five which is  normally  uh... four ninety nine  and we'll continue that through this month if any of the listeners were  to  tell you're continuing that special when you have another  i've got a somewhere here to do so many people call in the Alex everybody  money is tight  people  want to know if they can they can uh...  you know wait a month or if it's gonna be available next month they've got  money coming in tax returns  uh...  uh... so we've decided to continue to be in the this month  give people a little bit of breathing ok so it's dead of  uh... four hundred something dollars it's two hundred and forty nine dollars to  get a deluxe  three month  food supply this is high quality food folks  give them a call it's good to have three months that's better than nothing  uh... you can get a six months apply your supply got a lot of different  specials  give  day of call at eight hundred  four five three twenty two oh two eight hundred  four five three twenty two o two or go to ready reserve foods dot com again folks  you need to give them a call at one eight hundred four five three twenty two  oh two their great sponsors of the show the food from right here in america  thirty plus your old company  and i am so impressed compared to other food i got this is the this is night  and a folks and i paid more  i mean the prices they're offering are lower than what i've seen anywhere else  i don't know how you do it day but eight hundred four five three twenty two  oh two  or ready reserve food to dot com there's a banner forum at the bottom  of info or shot com anything else day  thanks for changing changing rapidly alexa i'm gonna have to tell you you know  it's going on  uh...  something  any little thing can send us over the edge economically  tourist wise  and a people think that the government has just strategic warehouses  get around this country waiting to rush to your aid. They're sadly mistaken that does not exist.  Now that's what's for land or Russia. That's not America. They do have the most extensive  bunker complex on the planet, but they don't tell you where those are and those aren't for you.  Those are for the elite 1-800-453-2202. Dave, thanks for coming on.  Thanks, Alex. God bless. All right, going back to the calls and then into more of the news,  We were talking to Phil in Virginia and I know Phil.  I've met Phil.  He's come to Austin.  He's a great guy.  Phil wasn't aware that you were street preaching and that you were arrested every couple  days.  I see a new article of this.  Well, you offended someone.  We're arresting you.  I mean, in a country where preachers don't have a First Amendment, we're in deep trouble.  Can you tell us what happened?  Well, yeah.  I had my bullhorn going first and the man came up.  the police officer came up and naturally they call for reinforcements.  But they said that I needed a permit for that.  So I told them that well I've been down to there so they're all trying to get their  permit and they don't know what I'm talking about.  So I said, well I'll just put the bullet horn down and just continue on.  Well no, you can't do that either.  so it was just uh... you know reminiscent of the uh... what i've heard you  cover  on your program about uh... you can't read the scriptures there and uh... the  state of Pennsylvania  it's pathetic  now  there was a case last year now a bama in a parade  no one was allowed to have the  and so the battle flag now whether you love it or hate it folks  it on the public street you should be able to walk around with a small flag  if you want to  or big flag if you want to and then the federal courts have ruled and bad in some  cases but good and most  and it's common sense you do not need a permit a permit is if you want police  for the block of street  if you want to march for the thousand people down the sidewalk  or ten thousand it is your right  and we won court cases right here in texas  uh... against governor bush when he arrested three separate groups of people  protesting on street corners of these were groups one group is handicapped  folks  and they're just on a  on the sidewalk they kept arresting them and now they don't do that because they  lost three one hundred thousand dollar  uh... lawsuit which is what they finally settled in court for  they can't do this but they still keep trying to do it  i thought we're not right to bring people freedom will then we'd operation  american freedom  uh... now were you arrested  oh yeah i was prevented from uh... uh... i had to produce uh... my identification  and all of that so yeah and technically that is an arrest so yeah  and uh... you know they threatened to uh...  they threatened to take me downtown  if i didn't produce a  uh... some identification  but uh...  yeah i mean i knew that uh... you know it was just uh...  uh...  uh... a ruse and that  you know it's just uh...  uh... but that's the danger of this uh... step story code system you know a code  violation in this country  is a death sentence  uh... well they got code violations where they take your house  they got these laws in the mexico  your twenty-year-old summer downtown has a beer party the cops bus you take  your house  but you can't get a jury or trial because  oh it's just a code violation where we're gonna take your two hundred  dollars dollar house  well they had uh... they they  uh... stop the man here in north all  uh... for a uh... trumped up charge  uh... and uh... by the end of the encounter the man was dead  this for a hanging license plate which uh... the evidence showed  was bogus. They were, man, had a leaking roof, another code violation. He ended up getting  shot six times. I mean, this is, we're not waiting for the police state. We are in it.  I was in crew, Virginia, went to a traffic violation. And I was parked on the side of  the road. Cops, this comes up. I wasn't in no parking zone. Nothing. No breaking, no  You demanded to see my identification.  And this is all about trying to find illegal people, or those who have a criminal outstanding warrant.  That's all these things are. These seat belt laws.  And they're all excuses to set up a checkpoint and search your vehicle.  that you have a warrant excuses  letting us know that they're the boss that they're god uh...  i tell you i would have let them take me to jail i'm not  i mean i should be out there preaching on the street corner of san your doing a  great job but uh...  it's it's a sad day in america when they are freaked out because  guys out there street preaching with a bullhorn  on a sidewalk  and uh... maybe you should get a good with some friends and have them arrest all  of you and then sue them individually for what they've done to you  Well, well, yeah, it's coming to that and  You know that you better have witnesses of the video camera or bad cops will grab you and then claim that you resisted  You're gonna have to have it on video. It's one of their favorite practices claim that you resisted  Well, I've learned a few tricks from you and I always like to have a video camera on hand  Well, you're doing a great job feeling  I'm sorry that this happened to you and and so I and then you go to the city and they say there's no permit for straight preaching  Yeah, or the loudspeaker, you know, and you try to play their game and you know, they just give you to run around  It's just ridiculous. I wonder why they came up to you. I mean, I wonder why they're freaked out by your first amendment  Probably because they just had some  Complaint  But it was in the middle of the day. We're not disturbing the piece. You know you want to be live peaceably with your neighbors  but yeah, they just don't like the message and  and all right well out criminal fill I appreciate your work in god bless you  yeah let's take care we're gonna go to broke in others here in just a minute but  but  definitely I want to play renegades because  this will make you think about how far we've come in this country what we've  turned into  and there's this whole backdrop of well it's the war on terror but it has  nothing to do with terror  so I want to play renegades for all of you out there like fill this is for  you fill  we're out there standing up doing a great job and just god bless you and I  love you  and i'm sorry this is happening to you  and whether you're concerned with the real liberal  you're losing your freedom step into the hammer engage  again  america is an america were not a free country  and so to all of you out there who love freedom this song is for you  we come back will take some more calls and cover some final days day with us  for everybody out there standing up against your any will break come back  to talk to brook recap of the stories  uh...  even in Jesus Christ time and Yahweh's time.  You were allowed to go out and preach and even in some cases criticize the government.  And that's what He was out doing.  And finally, too many people listen so they grab Him and they kill Him.  But in Germany and in Russia and in China, you can't do that folks.  And that's already what's happening here.  Third, in cases where people are denied permits dozens of times, they finally go out and  have a protest, they get arrested.  This isn't freedom.  I don't know how I have to explain that to the police and others out there.  If you've given an order to go arrest the street preacher, stand on there on the  street corner, I don't care if people don't like it.  The first amendment is what you have sworn up hold.  It's incredible.  And it is sad to see this happening in this country.  You know, we told you all this political correctness and this attack on free speech was  coming and this was going to develop and it'd be hate crime and all this.  now it's here  every couple days i see these articles  and it's getting worse and worse and worse where what we're what you're  plus three years ago there more advanced now we're gonna be there in three  years  and uh... didn't matter at George Bush or john carries an office because the  people become decadent  and forgotten what it is to be americans we lost our country now we got a  set about getting it back  but we've got to be honest with ourselves about how far we fall in  We're gonna get this country back.  And now they're trying to shut down  free speech and access to all of these  and then they're saying,  well, if it's criticizing it brief  or something or hurts about his feelings,  you're gonna be off the channels.  But that's not a violation of the First Amendment.  Oh no!  You don't have a right to hurt somebody's feelings,  Mr. Jones.  Let's show him here announcing the release  of my new film,  Leastate 3 Total of Slapen.  Leastate 3 details the architecture goals  and operations of the new world order.  There is a chance to use this  disaster they knew world order a new world order  hand-em  one and two of hearts piece by piece and reveal the  area of what Ashcroft has to say about your  liberty you will lose your liberty homeland security  executive orders or vaccinations the new prison  economy to the total information society  the pan-american union federal gun grabs  government run by slavery rings and much  more. If you want to understand what the new order really is, then my new 2.5 hour video  button state 3 is for you. Visit info wars.com or prisonplan.com to order for call  toll-free. 1-888-2533-139. That's 888-253-139. More than 700 chemicals have been found  in our drinking water and did you know that you can have greater exposure to these chemicals  by taking hot showers than when you drink the water? That's because many chemicals  are inhaled when they evaporate, and others are absorbed through the skin.  The KDF shower filter is designed to reduce chlorine, lead, mercury, and iron, and it inhibits  the growth of bacteria, mold, algae, and fungus in your shower.  The media is non-toxic, environmentally sound, and is recyclable.  The KDF shower filter will typically last 10,000 gallons or one year, whichever comes first.  Hospitals, restaurants, and water treatment facilities use this media to reduce chlorine,  iron, heavy metals, and bacteria.  What are your KDF shower filter normally $49 for our special price of only $35 of $14 savings?  Call now to order at 1-888-803-4438.  Order today is a $14 by calling 1-888-803-4438.  Erbil Hilar Academy is a global supplier of the finest natural medicine that you may need  in these troubled times. We specialize in keeping you alive and healthy. We provide outstanding  products like E.C. Act, colloidal silver 500 parts per million, olive leaf extract, oregano  oil, and hundreds of herbal oils, books and educational materials. We have homeopathic detox  solutions for contrails, radiation, MSG, and aspartame poisoning to name a few. We also  trained natural path acheulars via correspondence education. For a limited time, you can  sign up on the website and receive our 104-H catalog and a current herbal healer newsletter  free.  Simply log on to herbalhealer.com.  Check out our online member testimonials and our hundreds of exceptional products.  We have been working hard since 1988 to save the remnant.  That's herbalhealer.com, your website for safe, effective, natural alternatives and education.  9 of a night central back tomorrow, 11 to 2 central, global shortwave during the day,  seventy five at nine thirty two ten  or on your local a mr fm station got blossom  alright i know we got a bunch of phone callers will try to get to a couple of  you  broken robert in least but uh...  all over the country is fox and is private property may become reserve you  may only be able to use ten percent of your property that's the federal  initiative  uh... also we have the fed's announcing a little about seventy thousand trips  many of them out of europe which doesn't matter but out of asia does  north for he is a much greater threat than the middle east  they don't have all that oil  very serious situation  broke in a road island you're on the air thanks for holding welcome  thank you alex it's uh... good to know you're still on live  uh... our stations kind of in havoc here  uh... i have a couple points to make and i know there's not much time so i'll try to be quick  uh... the first one is i don't know if you heard rush limbaugh on friday  but he was emphatically defending the governor of New Jersey.  I almost was gonna call Rush and ask him what degree  Mason he was.  Well that's your new conservatism.  Yeah right, that's number one point.  Number two point was your lady caller  that called earlier regarding the Masonic symbolism  was very fascinating to hear.  And I think she mentioned she was from Tennessee.  And I was wondering if you guys are aware of the fact  that the Tennessee State Capitol is laid out identically to the one in Washington, the  Senate's a giant pentagram. People say, well, why is the congressional level on our pentagram?  All it's just an accident. Folks, this is symbolism. Great thought goes into this.  Yes. And the last thing I wanted to mention to you was, I believe the last time I spoke  with you was about two or three weeks ago and we had a conversation about Rupert Murdoch  and the New York Post.  And I called because I wondered if you heard this story,  tycoon's son, let's guess the kink for a day,  that was headline news in the New York Post  about a man named Richard Quadrucci,  the son of a billionaire printing company, mobile,  who runs a private sex club in a family building  in Grammarcy Park.  and his father  uh...  what is  the largest printer in the united states and he prints for time magazine  and news week  and why i remember my reporting on that no i i didn't see that it's you the new  or post article about  it is a hard-to-service in the leaders you know that this is unbelievable  alic and then this is this is a mind-blower  uh... he has a guy one of the escort is called  catch this  master justice  alright email me the story tips and for war's dot com to hear from you  brock  or uh...  uh... rocker was broke excuse me  robert in uh... telefornia real quick went to shop  i got i just wanted to  it's your take on this new book by micha almicha  the uh...  indie fence of internment camp  you're up the name of the book  yeah indie fence of internment camp  i think it was a little bit of a bit of a bit of a round on them  and i think  and come show  and it's a so proud that she used to see the light down written this book on  got our our forefathers did have a right we just need round everybody up  for the car i'm gonna call about it yah book  i heard that called a defense of interning the camps  it's in your face well tommy rinses as it said but maybe need it  I thought we paid these other people off and said, well, if we were wrong, that's, you know,  we paid to get the deaf and these people who we interned.  Well, it's just for the Arabs though, with the citizens need to be put in these two.  This is the going downhill.  I'm out of time.  God bless you.  I'm going to talk about them and try to get around the show.  Prisonplanted.tv, folks, 15 cents a day.  All my videos, the books, everything there on the site.  Prisonplanted.tv.  I'll see you this afternoon.  530, it acts as television for another board meeting when I come down and speak about that.  And back to 9.9 to midnight, but don't forget, prisonplanted.tv.  Yep, good ol' prison cams.  Concentration cams.  So far the new freedom.  Camps equal freedom.  What's wrong with you?  Not the guy bless you all.  We'll see you later.  Bye.",
  "created_at": 1755547209
}