" It's the Lock-On podcast network.  Your team every day.  Thank you for making Lock-On your first listen every day.  For your second listen check out Lock-On NFL scouting.  As training camps get closer and moves are being made,  whose Kyle Prabs and Joe Marino will make you the most informed NFL fan this offseason.  Find Lock-On NFL scouting on YouTube or wherever you listen to podcasts.  Part of the Lock-On podcast network.  Your team every day.  Chiefs have a lot of corners could they make a trade before week one today on Lock-On Chiefs.  From the land of the three and the home of the Chiefs, this is the Lock-On Chiefs podcast.  You're welcome back for another episode of Lock-On Chiefs.  Your daily podcast covering the Kansas City Chiefs.  Part of the Lock-On podcast network.  Your team every single day.  Thank you for always making Lock-On Chiefs your first listen.  Don't forget we're free and available on all platforms including YouTube as well.  Go check out another show.  Go check out Lock-On NFL or there's going to be some Lock-On AFC West that will be apparent  and very necessary to be catching up on before the regular season starts.  Today we are going to be talking about the corner room.  Who is going to make the roster?  Who could possibly be a big contributor in that corner room is going to be the next segment.  But we're going to start talking about could they make a trade before week one?  And really this comes about we've talked about the corner class being or the corner group being very deep  for the Chiefs for the past couple of weeks and probably a month to be quite honest.  And before I forget today's episode is brought to you by Game Time.  Download the Game Time app, create an account and use code locked on an NFL for $20 off your first purchase.  The thing when you start looking at this corner group is they have, we think their three starters probably pretty set right now.  It's a question of is there value that they have left on the roster that other teams are going to be interested in?  And the name that's going to come to mind for most people is going to be Joshua Williams because there was a big trade that just happened last week between the Pittsburgh Steelers and the Miami Dolphins and Jalen Ramsey is now in Pittsburgh.  It's a weird world. I put something out on NFL 33 about it. Make sure you go check that out. Check out Chris Casey cheese corner and hit our GR football while you're after it as well because I do some crazier things over there.  It's not me if this sounds familiar. McDuffie Watson Fulton Williams Williams, the law firm, Roland Wallace, Nas Johnson, Covington, Eric Scott.  I don't know enough about Eric's time to tell you whether he's got trade value, but Darius Rush might.  Malcolm Smith could Kevin Knowles even could like that's how deep this group is. And like you said, you know the top three we're going to talk about them.  Ad nauseum in the coming weeks.  But it's about who could show a spark in relief of those guys because you don't need to run Trent McDuffie this preseason.  You try to make up and plays more than 10 snaps in a given preseason game. I'm going to lose it because you know what you need to know.  He is an elite corner no matter where you place him.  If you want to make the most of him. Yes, you want two outside corners. Let him play in the nickel. Don't get me wrong folks. If there's only two corners on the field.  One of them will be Trent McDuffie. That's not what we're saying. But like that makes life easy.  It's all about who fits where wet and how they fit the puzzle behind him. And if Jayden gets hurt again or the Christian Fulton takes a little while to get up to speed or maybe he gets hurt. You never know.  It's all about fitting into the mold that is this secondary.  Yeah, and the big question is you start you look at the roster. You look at they've had you know they've had nosy Johnson. They've had.  Joshua Williams. They've had.  Trim McDuffie and they've had Jalen Watson on the roster for the same amount of time. Four years they know each other well. They've been going against each other for a very long time.  You can add Brian cooking that that was a huge draft class when you start start talking about the secondary.  But the reality is that you're in a situation now where you go and draft a guy in the third round in no Williams.  You're not you think he can be a starter this year isn't really even relevant. It's a question of whether or not you think he's going to contribute on this roster. And if he's going to contribute then you have to look at it and go okay well if no Williams is at worst corner number four.  What are you going to do with Joshua Williams what are you going to do with nosy Johnson.  You have all these players and you start talking about Joshua Williams you start talking about nosy Johnson. That doesn't even get into a guy in Christian role law.  So I thought played really well at times last year and was a rookie and needs more time to develop in my mind.  And the chiefs have got a lot more vision and see and have seen what he's been able to do from year one to year two. We'll get a lot better idea of what he looks like when training camp picks off here in a couple of weeks.  Yeah I agree all those guys are valuable. The law firm of Johnson Williams and Williams might get broken up.  I think they are probably the three names on this corner. That the most value in a trade. I don't think anybody's trading for Melton Smith but he might show you enough to make one of those guys.  I think that's a lot of people who are available and another team might pick them up.  I'm not super high on Covington but I do think no one has some value and I do think Rush has a lot of upside if he can figure out technique and the defense.  You think there are a number of possibilities of guys that are now.  seven, eight, nine on the depth chart.  It could bump up and push for six.  And maybe that makes somebody a trade target.  And Kansas City is going to potentially be getting  some cap space of back if they're able to trade off  one of these corners.  And that could be something that you need to take into  consideration.  The salary cap is going to play into all of these decisions,  whether or not it's a big part of the decision or not,  it's going to play into it.  The reality though is you had your top three guys,  and I would say you probably had your top four in reality  with Jalen Watson, Trim McDuffie, Christian Fulton,  and I'm gonna throw no Williams in there,  not necessarily because I think he's a top four corner,  but because he's not going anywhere,  I can't imagine that he's going to be cut.  So those are the four guys that I would say  are pretty much guaranteed to be on the roster as of week one.  And I know some of you are saying,  oh, they just cut a draft pick last year that was a corner.  Yeah, but he was a six round pick.  Third rounders are not getting cut,  even if they have some trouble getting used to the city  and the center of the city.  Yeah.  Right.  John Dorsey, don't work here no more.  So that's true.  That's where that's coming from.  But there are stranger things that could happen  of guys that show one spark of possibility  that grow into that.  And I agree with you.  We'll talk more about who can step into those roles  come up here in a minute, but there are plenty of options.  Yeah.  And that's exactly what you want.  We talked yesterday about potentially needing  to maybe add a running back because we think  that maybe they need to add something different.  Corner, I don't think that they really need to  make any additions.  I think that they have a very big supply  of what they like at that position.  And they know what these guys bring.  So I do think that that's going to play into how this roster  is built.  And the reality is that you're likely only going to be  able to keep six because of other positions  that we've talked about as Nazian.  Yeah.  Two, two sellers not buyers this preseason.  Yeah, absolutely.  When we get back, we're gonna talk about the chiefs  corner back group and the core contributors right after this.  This is it.  If you've ever decided last minute to head to a ball game  with your family, your friends, maybe it was for fourth of July.  Maybe it's game game you suddenly realize that, you know,  you just want to be in a stance.  You know, you want to partake of a beverage.  See a ball game.  It's exactly what game time does and where they come in.  It's the easiest way to grab last minute  and take it without the stress.  With the money that you save on those tickets,  you can splurge on food and drinks and merch  and do all the things.  Even invite a bigger group to come with you.  If you're feeling generous, game day makes that all possible.  So game time makes buying the tickets fast and simple  and that helps as well.  Prices on the app actually drop the closer you get  to the first pitch and they're incredible last minute deals.  Seed views, the lowest price guarantee.  It all goes into one thing that helps you get the most  from game time.  It's the official ticketing partner of the,  immediately baseball makes it easier browse all the games  whether they're on the road or they're coming here.  You're waiting for somebody to come to town.  Take the guesswork out of buying tickets  with game time download the game time app,  create an account user code locked on NFL  for 20 bucks off your first purchase.  Terms apply, but again, all you gotta do  is create an account, review the code LOCKEDONFL  for 20 bucks, super simple.  Down the game time app today,  it's last minute tickets, it's lowest prices.  And it is guaranteed.  Core contributors at the corner room.  This is gonna be a little bit interesting  because we've already talked about the guys  that are gonna be starting,  but it gets a little bit deeper now.  You start looking at, let's just say the top three  of Jaylon Watson, Christian Fulton and Trim McDuffie.  Then you have to look at who are the next three  that are probably gonna be on the roster.  Joshua Williams, Nazi Johnson and Noel Williams.  And that doesn't even take into account Christian,  sorry, Christian Roland Wallace.  I, this is a tough group and I argue,  and I'd argue he beats two of those three guys  to the field to tell you the truth.  If Noel Williams, who I feel is an outside corner  almost predominantly, say 90%,  if he becomes the guy that does the backup  for the outsides, then that's number four.  Number five becomes the backup for the nickel.  And I think right now, Chris Roland Wallace  has the edge over Nazi Johnson playing on the inside.  The Nazi got experience, he's kind of a gritty vet,  he's been through the injury and I think he's tough as nails.  So he's not going away without a fight.  So as he'd been working, this offseason,  and in particular this last like month and a half,  on being more of a nickel,  because maybe he sees more of an opportunity  on the inside to fight for that backup role with CRW.  If that's the case, then we might be in  for a training camp that is tooth and nail the whole way.  Yeah, and the thing that's really gonna be crazy to me  and what I don't know is I know we're talking corners,  but the reality is is that you have a guy  that's a safety that plays a nickel roll  and they've been putting Chamorri Connor at that nickel roll.  That's going to play into who's going to make the room  at the corner room.  That's just the reality of it.  They could be going in a different direction  because they keep Chamorri Connor  and they plan on him playing predominantly nickel.  Or they wise up in the late Miss H. Ray Belance.  We need to talk to you.  We need to talk to you.  Please.  Let's hope, we're gonna talk about safety's  on a different day folks.  We know that they intermingle.  It is one secondary,  but that is part of the deal.  So that leaves a significant roll.  Josh Williams isn't playing on the inside.  I don't think no Williams can play on the inside  a whole lot either.  Maybe in a super pinch.  But for me, it really comes down to  how many outsides do you want?  Do you have to have a dedicated nickel backup?  And if so, can C or W hold off,  Nas Johnson if that's the path that Nas he wants to fight for?  Because quite frankly, I don't think he's gonna beat out  no, and I don't think he's gonna beat out Josh.  Yeah, and Nas he is one of the most expensive corners  that they have on the roster right now as well.  Obviously Christian Fulton isn't going to be in that  question because he's $10 million a year.  Trim McDuffy is a starter.  I'm not gonna care about that,  but when you start looking at the money,  Nas he is getting almost $4 million this year  because he is on the,  he's a restricted free agent that got a deal for almost $4 million.  I mean, that is going to play into potentially  playing to whether or not he's going to be on the roster  just because that is a little bit more money  than you would expect them to be paying a guy  that may not play.  Yeah, you're absolutely right.  That does play a significant role.  For one year, that's, I don't know, that's pretty tough.  Yeah, I especially get in the structure.  Yeah, right.  I mean, they have nothing that they can really do with it.  That's the problem.  You have, you just, you have to pay that money.  And it's funny, I'm sitting here looking at different things  and of course some websites still list Nas he jumps in  as a safety, it happens, which is funny,  but it makes it tougher for him.  It does.  The justification that's required for that is definitely difficult.  $3.4 million, I was a little high,  so I apologize on that.  But still, that's pretty good.  That's more than, what's the capital?  It's a capital that you're just like.  Well, that's more than Joshua Williams is gonna be getting.  So, you know, if they're neck and neck,  does that, does that go into who's going to make the roster?  You know, with Christian role and loss,  Christian role and loss isn't gonna make hardly anything  in 2025, is that gonna play into  whether or not he makes the roster over Nas he jumps in?  You know, the other thing when you start looking  at the core contributors is to Nas he come in  and the thing that we should have mentioned already,  Joshua Williams, whether or not he like him,  has been a core contributor on special teams.  That has been a huge part of his role for this roster.  And so I do think that that plays into,  if he makes the roster or not,  he has had problems with penalties in the past.  That's definitely something that you wanna get cleaned up.  But Nas he jumps and also has an injury history.  Last year was his first year where he played most of the games.  That is going to play into how this is gonna play out as well.  I know the fans are down on Nas Johnson,  but just the total, let me put it this way.  It's fourth of July weekend, last weekend I watched  one of my favorite all-time movies, Fight Club.  There's a whole series of things about how you talk about things  that as if they're the third person, right?  Dave Tobes caring about the fan base's opinion  is absolutely uninterested in what they care about Nas Yijats.  If he can play for them, Dave Tobes total lack of disregard  is right here for it.  Now absolutely.  And that's the other big key is when you start looking at this,  it's gonna come down to just a matter of who's going to be  a core special team reform, because we've already talked  about the top four that are gonna be on the roster.  And no Williams, well maybe not the fourth corner  coming on to the field is going to be a special team  or in my opinion.  I do think that he's going to be a core guy  that they're gonna have playing on special teams  and that's probably gonna be his biggest part of his role.  At least that's the way I see it right now.  It could change with a good training camp.  We'll see if he can change into something else  where he becomes a piece that they use  other than just special teams.  But the reality is it's gonna come down to,  you know, you got three guys vying for probably two spots.  That's a problem.  It makes it difficult if you're.  And that's if it's just three.  Sorry, it could be more than that.  It could be.  It's a good position for the team to be in.  Given that they feel they have what they need  in their starting row and then you're talking  about plugging them back up for when you need them.  I think that for us to league may find it very interesting  to see who's there and who isn't when it comes to cut down that.  Yeah, and to cut down day is going to be,  I will say this, one of the things  that NFL has done right and they haven't done a ton  of things right that they when it comes to rosters.  But one of the things I love that they've done lately  is making cut downs one time.  I love the fact that you get all 90 guys  for the entirety of up until your final cut down day  because that makes it so much easier  to not have to play guys in getting week three  in the preseason and give you more time  to really evaluate some of these players.  Because the reality is that some of these guys  are going to be playing for their chance on the roster  in week three of the preseason this year.  You're not kidding.  There are a lot of changes.  A lot of changes that could come in honestly.  I think the Chiefs might be in a position  if one of the veterans isn't making a big let them go really  just to get ahead of all that rush.  Yeah, and they've done that in the past  with several different positions.  So it wouldn't shock me if they do that  with the corner position.  Although I do think that a trade is more likely  because the league needs corners.  And I would imagine that they could get something  if it's even if it's just a six or seven-th round  potential pick in the future.  I think that that's possible for some of these corners  that they have on the roster.  But when we get back, we're gonna talk about the run  for the roster in the corner room right after this.  What did you account before we'd started the show?  Was it 12?  12 corners that they have on the roster right now?  What's some asterisks?  Like you said, Chabirak honor.  He can be a number of spots, you know?  Right.  I actually think rolling walls is in a similar position.  There's a lot of safeties that can play down or play in this lot if they have to.  Yeah.  And Nazi Johnson on some sites is still safety as well.  So there's that too.  I mean, you know, you could look at multiple different ways.  So if you take out the top seven-ish, then you get to the back five.  You have your Darius Rush who has been in Kansas City before.  And is back in Kansas City.  I've been throughout the league.  Kevin Knowles, Melvin Smith, Eric Scott, and Jacobi Covington.  All guys that are probably going to be trying to push and make a name for themselves.  I'll be honest, I don't know.  Maybe there's a guy or two that could make some plays and make his name possibly be showing up for the roster.  But the guys that are going to be on this roster at this position are going to be at this point.  At this level, are going to be guys that can show up on special teams and make themselves indispensable on special teams and show an ability to step in and play defense if they have to.  I like the way you put that indispensable.  Like you have to play.  You're not going to make this roster as a seventh corner or even a sixth corner as, oh, he can play some special teams. He can help us a little bit.  No.  If you're not on the field on defense, you have to play special teams to make this roster because there's too many other roster spots on both the lines and a couple of other key positions that I don't think they can afford to go.  They can go six and four in the secondary for the safety's six here.  But I think five and five might be even more likely depending on where you're listening right.  Well, yeah, I guess that depends.  If you list tomorrow Connor is a safety. I still think it's going to be six and four. I just don't see them keeping five safeties.  But which tomorrow Connor being even being a safety.  So to me, I think it ends up being still 10 DBs.  But that makes it really hard at other positions if we've kind of talked about that a little bit already.  But when you start looking at some of these other guys, you know, it's just a question, you know, can an Eric Scott or Jacob becoming to an or Melvin Smith or Kevin Knowles.  And even Darius Rush to an extent, can they do something in the first two preseason games to give themselves a chance.  And I did say it specifically for those first two preseason games, because it's if you can make a name for yourself in those games, you get a chance in the week three game.  But that's how you get the week three game chance.  And you have to do something in week one and two. And obviously training camp is going to play into this, you know, OTA's all that it all plays into things.  We only see a small portion of it.  But the reality is is that they have five or six.  I would say you can probably even say seven guys that they really like. So any of these guys that are lower down on the roster really have to make an impact of some sort to have chance.  It's a tough road. If I had to pick a couple, I would keep an eye on Melvin Smith probably.  I think he's probably the corner that has the most upside of this group that isn't Darius Rush.  And as you said, she's no Darius little bit. If somebody's going to break out of this group, I think it's rush.  But he also, you can make the argument has not taken advantage of those opportunities to this point.  So who would be next up for me? It would probably right now be Smith followed by null.  So it's the guy that I have a good feeling about right now. We'll see how they look in St Joe and especially when the pads come up.  Yeah. And the bigger thing that really is going to stick out to me when you start looking at this is Darius Rush has been here.  He's a little bit older. That also plays into how this is going to play in talked about.  Knowles or just sorry, Melvin Smith is 23 Darius Rush is let's see 25. So he's a little older. I mean, it's not too much, but that does start to get to a point where you start looking at it. Okay.  So maybe he's already hit where you think he's going to hit as a player. Does that change your thought on Melvin Smith who maybe still be on the upswing versus a guy who's been in the NFL for a couple seasons and not been able to stick with the specific team.  And the thing you got to remember.  So that's just six foot two. Both the other guys that we're talking about are 510. So there are paradigms here within this roster and everybody can shift around a little bit.  But if you're going to take a guess or you're going to take a chance on keeping a guy around. We know that they like six foot plus corners with long arms. That's it's Steve's bags typed.  So what Rush might have is a smaller banjo if it's time to feel even though that their best corner is not.  Which I just I just I'm not. I know I just I find it funny. It's just funny. The reality is though, like if Trimig Duffy had the physical build of Rush.  He wouldn't have been available for Kansas City to draft him. That's the reality. Probably true.  So you look at this in what was that.  No, there are crazier things. Yeah, you have to fit and be available.  Yeah, this corner group is going to be very hard for.  for us to figure out what they're going to be  so many different players and one of the bigger things,  you start getting into a point where you had the short season  in OTA, you had the short season in mini camp.  Now you get the pads on and it changes everything  because you can do the hand fighting much more.  It changes the way that you're gonna be able to see corners  when you get into training camp  because you're gonna see a lot more of the releases  and how they fight through, fight with wide receivers  on releases, how they really do drops  with their pads.  Can they sink differently or sink as well as they were  without the pads because that is going to change things.  Everything changes when you start talking about  these skill type positions especially corner and wide receiver  once the pads come on.  And there's so many of them,  you gotta try to keep them straight.  Things will change, but the number one day  and I say this every year for those of you that are listening,  both of you.  This is early, early in the preseason.  We know it's the low, but I'll give you the hint right now.  The most important three days of camp  are those directly following the first preseason game  because you're gonna see the changes  that they feel they have to go make right now.  And these corners are gonna be among them.  Yeah, and the other thing that won't be very curious about  and this goes for every position, not just corners,  but one of my favorite things to learn at training camp is,  okay, who are the guys that are the backups?  And what I mean by that is,  and I know we're using corners,  but I wanna use offensive line  because it's an easier description.  But if you say, okay, Creed Humphrey gets hurt,  who's the guy that's coming in for Creed Humphrey?  Because you will see that in training camp.  They will bring in guys at those positions  and you'll figure out who they think that next guy up is.  That's what you need to be watching for.  Watch for that type of reporting.  If a tramech Duffy was to go down, I hate saying that,  but if he was to go down, who's the next guy up?  Who were the net?  Yeah.  Yeah.  I understand exactly how you're feeling on that one.  My point is, training camp is a lot of fun.  You get a lot more information.  I cannot wait to start getting some of that information  because the reality is, is you get to see  where the coaches feel these players are.  And then once the preseason game start,  you get an idea as to how these players fit into the scheme  that the coaches are trying to run.  Yeah.  And that's what all comes down to.  That's how you make ball games.  Now, how you make rosters to play in ball games.  Yeah.  It is hard to believe we are a little over a month and a half  away from the kickoff of the regular season  that will not even be in the United States  for the Chiefs this year.  Yeah.  Yeah.  But it is coming.  Oh, welcome to good.  Welcome to what?  Welcome to Rio.  Well, not Rio.  It's not in Rio.  Is this a pile of those?  OK.  Yeah.  I don't know.  I'll ask Matt, he'll be with us tomorrow, folks.  Don't miss Matt.  I will he'll set it straight.  Because yeah, I can't keep it all straight these days.  I don't speak Portuguese.  It's going to be crazy to see Kansas City starting that week  on a Friday night in Brazil.  That's how the regular season is going to start off.  We're going to have much more for you this week.  Thank you for listening today.  And we will talk to you tomorrow.  You can listen to this locked on podcast ad free on Amazon Music.  Download the Amazon Music app today.  Thank you for making locked on your first listen every day.  For your second listen, check out locked on NFL scouting.  As training camps get closer and moves are being made,  those Kyle crabs and Joe Marino will make you a good one.  This is the most informed NFL fan this offseason.  Find locked on NFL scouting on YouTube or wherever you listen to podcasts.  Part of the locked on podcast network.  Your team every day."