" Hi everyone, welcome to our show Chief Change Officer.  I'm Vis Chen, your ambitious human host.  Our show is a modernist humility for change progressive in organizational and human transformation from around the world.  10 years ago, during the summer term of the executive MBA program at Chicago Booth,  I had the pleasure of meeting today's guest, Wafley Dodge.  She taught one of the stand-all courses in the executive program called Beauty New Ventures.  In just a moment, I'll let Wafley introduce herself.  The first, I would like to share a memorable memory that really sets her heart.  Through all my extensive MBA studies at both Yale and Chicago Booth,  where I completed the full-time and executive programs respectively,  I've set through countless lectures taught by highly intelligent scholars and well-experienced practitioners.  Yet Wafley is the only professor of encountered who dared to use the word love in a business school classroom.  In the field of business education,  dominated by discussions of numbers, strategies, formulas and models, all the logical stuff,  the concept of love has never surfaced in any curriculum or textbook I've come across.  Yet she brought it into our discussions on Angel Investing.  Next you wonder, how does love let into building a business,  advancing a business career and fulfilling a life's legacy?  With that in mind, I've put together a three-part series called Love and Logic,  featuring Wafley as our special guest.  She would be sharing and exploring from three perspectives,  how the intricate balance of love and logic  shapes our career decisions and life choices.  Today's episode zooms in on Wafley's personal journey,  the love and logic that have guided her career paths and experiences.  In our next episode, which is about her being a teacher and expert guide,  will dive into a major chapter of her career, 22 years as she called Wafley.  There she taught and coached a sharply focused group of highly logical talents,  all deeply engaged in the passion for innovation change and entrepreneurship.  From that structured academic environment,  she has transitioned to her current role as a coach for a more diverse group of entrepreneurs.  In the third part of our series,  we'll come full circle and focus back on Wafley herself.  She's now more than a coach.  She is an entrepreneur herself, actively building her own new venture,  is a fascinating mix of her ever-changing experiences.  Good morning Wafley, welcome to my show.  Good morning, Vince. I am thrilled to be here.  Usually, I kick off our interview with a little introduction about my guest.  Today, I'll like to switch things up with it.  I was browsing through the website of your new venture, Wai's heart.  In a specific sentence, really stood up to me.  It said, as a young person, I had an enormous love for the theater and a passion for logic.  Love and logic, what a fascinating combination.  Wafley, can you unpack that for us?  Tell us, who are you really at the intersection of these two worlds?  Wow, what an interesting question to start with.  I think a lot of people gravitate towards one or the other.  And what I mean by that is we are taught that we have a right brain and a left brain.  A right brain is rational and our left brain is emotional.  But people have both sides of their brain and they're using both sides of their brain.  So for me, the way this man accounts to do, as a child, I fell in love with theater.  I fell in love with performance.  I fell in love with acting.  I fell in love with theater.  My mother and I would go to the theater together.  It was a very special time for us.  But at the same time, I was good at maths and logic puzzles and people would say,  you're good at computer science.  You have to remember, I'm fairly old.  We didn't have computers when I was growing up.  As I was approaching my college years and really thinking about what I wanted to do with college.  I'd done so much in high school with theater,  it's so much in high school with many other subjects,  economics, psychology, math,  I went to an excellent high school,  and I was approaching my college years thinking,  I still wanna do theater,  but I recognize in myself that I don't necessarily  wanna have the kind of career where you have a job  and then you don't, and then you have a job,  and then you don't,  that I wanted something that would create stability for me.  So I approached college saying,  I'm gonna do a dual major in theater and business.  And ultimately what happened was  I had a conversation with a guidance counselor  in my freshman year of college.  He said, don't do an undergraduate business degree.  Companies want MBAs and MBA programs  to teach you their methodology,  do something, do a deep dive in something  that's related to business,  that you can leverage in the business world,  but would also be a good foundation  for going to business school.  So I said, okay, I will take the computer science class  for computer science majors  instead of the one for business majors,  and I will check out computer science.  And again, being a child of the 70s and 80s,  this is the very early 80s.  I had that been exposed to computer support,  and I fell in love with the logic of computers  and how it was incumbent on a programmer  to break something down into its fundamental elements  to teach a computer how to do it.  That's programming.  I ended up with two majors, one in theater,  and one in computer science.  Computer science was starting that an impact on the theater.  I had to learn how to program a lighting board, for example,  but they were really very separate disciplines  that I was bringing together in my own life  and in my own mind.  As you indicated, that was late 70s and early 80s,  there must be very, very few females  in a computer science class.  How did you navigate this deeply men dominated world?  You're 100% right.  That in the early 80s, the late 70s, early 80s,  I was one of three or four women in my classes  in my computer science classes.  Women of course.  One, oh sorry, you're saying one of the three or four women  in the advanced computer science class.  Like how many students were in that class?  Anywhere from 20 to 35.  Oh, okay, yes, you're 100% correct in thinking  that it was very male dominated.  I think today in college classes, in computer science,  in STEM, you'll have a higher percentage of women,  but it still won't exceed if we'll reach 50%  in a lot of cases, but it was 5% that best  when I was studying computer science.  I was very lucky in that the head of the computer science  department at the University of Pittsburgh  happened to be a woman.  So I at least had visual role models  because of course in computer science,  most of my teachers were also men.  Mm, so I did have a female role model to look to  when I was a computer science student.  I got along really well with the nerdy guys.  I've always had nerdy guys as friends.  I have my nerdy side.  I'm a science fiction fantasy fan.  I cut school in high school to go be the empire strikes back  on its very first day in release with my friend,  Michael, who we called Zonaar.  I am a nerd and I got along really well  with my nerdy computer science classmate.  I also got along really well.  I have, I don't want to bride,  but I have what I think is a fairly well developed  EQ from my mother.  I got along really well in theater.  And I got along really well with my much more,  artsy, feeling theater friends.  They were two totally different worlds.  They did not overlap at all.  The question of gender, I think is a really important one  in the conversation that we're having  because you're talking about love and logic.  And very often love gets attributed to the feminine  and logic gets attributed to the masculine.  And they have always been a blend in my life.  And I fundamentally believe that they are a blended humanity,  that we artificially separate into have to be honest  and making this is a little too much information  for your podcast audience.  But I do not comply with gender norms.  I never have.  I was a tomboy growing up.  I am tall for a woman.  I wear my hair very short.  I have a deep voice.  I frequently get mistaken for a man.  I identify 100% as a woman as female.  My pronouns are she, her.  But I have always felt this blend of the masculine  and feminine in my life.  And it goes right to this question of love and logic.  So as a woman who had common boy characteristics,  that's what they would have been called.  called in that day.  Even when I grew up, I'm younger than you by about 10 years,  Tom Boy was still a commonly used term in my generation.  Don't forget, we're now in June, 2024.  One of June is the month of pride.  So we are proud of our identities.  Yes, and I love that you bring in pride month  because I think one of the amazing things  to watch over the last several generations  is how the younger generations have embraced this gender  ambiguity, gender fluidity that when you and I were growing up  was not really available to us.  Nevertheless, let's go back to this conversation  of how I did as a female in the computer science department.  I was accepted by my male colleagues and I thrived.  I did very well.  You asked a follow-up question,  what then took you back to theater?  Yep.  So I loved computer science and I loved programming  that I got a solitary person on social groups.  And when I was thinking about what I wanted to do after college,  I was pursuing a couple of different tracks.  I had the good fortune during college to be awarded  twice the Provost Scholarship to teach.  And one of the times I taught in theater department  and one of the times I thought in the computer science department.  I knew that what I wanted to do was teach.  That was truly my calling.  And if you think about a marriage of love and logic,  if you think about a marriage of theater and computer science,  being able to structure a subject in a way to present it  to people but then to present it with a little bit  of the actuality, a little bit of entertainment,  a little bit of humor to make it more interesting,  more intriguing, more engaging as a subject for learning,  this is where these two things came together in me.  So as a senior in college, I was applying for graduate degrees.  I was applying fellowships and I was applying for jobs.  And I was offered jobs in the computer science department  on mobile in the leadership training program  of what was then met life insurance  in the computer science department's digitally web incorporation.  But I won a Mellon Fellowship of Humanities  to pursue my PhD so that I could teach.  That's what took me back to theater.  I really wanted to teach.  And I thought that the way to be able to teach was to do a PhD  and I ended up doing a PhD in theater history.  MUSIC  Teaching has always been your calling.  But I was wondering during this journey  from PhD to teaching,  it's something called for Rister.  I believe you joined this burn and helped it grow  from a fatigue into a major institution over a couple of years.  You joined as employee 20 something,  27, I believe that's what you told me.  So with your calling for teaching with your PhD degree,  you could have stayed in the university,  building your academic career from assistant professor  to associate to a tenure professor  of very well-predicted career paths.  Then what happened in between?  Well, talk about Chicago.  Your teaching career, 22 years teaching careers in Chicago,  but before that, let's talk about what happened in the 90s.  Yeah, my career is nothing but a new table for twists and turns.  It's an excellent question.  How do I end up at forest?  Graduating with my PhD,  we were at the height of the late 80s, early 90s recession.  And the baby boomers kids hadn't reached college age.  College enrollments were plummeting.  I was at theater historian.  That's what my PhD was in, theater history.  And colleges were cutting theater programs.  You had to maintain your acting program.  That's what students came for.  But you could shave down classes like theater history  and allow the English department to teach Shakespeare.  You could use the English department  to cover some of the theater curriculum.  And so there were no jobs.  I was, every job I was applying to is 200 to 400 applicants,  many of whom had been tenure track faculty  would lost their jobs.  And so they were applying for the few available jobs.  At the same time, I was realizing that  while I loved the teaching part  and I had taught at Tufts University  where I got my PhD, I had taught as a graduate student.  I loved that part of my job.  I did not love the research requirements  of the theater history discipline.  You, in the humanities, you have to publish  on things that nobody has ever written about before.  And you end up getting very esoteric.  My dissertation is on the career  of a woman named Laura Keene,  who was a 19th century theater manager.  She was the most successful woman  to run a theater on Broadway in the 19th century.  She got her own true.  It was in fact her true.  It was playing our American cousin  in Fort's theater the night lake in was shot.  She was the person who identified John Wilkes Booth  and no one has ever heard of her.  And you get into these very esoteric topics.  What does it mean to have been a woman's theater manager  in the 19th century?  And what happened to women theater managers  as theater changed in the 19th century?  And I started to realize these are not really impactful  issues in our day-to-day lives.  I wanted something that was more current, more contemporary.  But when I couldn't get a job as a junior faculty member  in theater, I said, I am not going to stay in the world of academia.  I am going to return to the world of technology,  which is much more pressing, more relevant now,  again, the love and logic.  I love the theater.  I love teaching.  But I don't love academia.  I don't love a career as a humanities academic.  I will go back to technology.  Now, this is the early 90s.  This is 1990, 192.  So technology is in a boom.  It's in the very early stages of the internet bubble.  In fact, it's a little bit free bubble.  It's as the internet is becoming part of our daily life.  We're really using dial-up AOL or Compute, Compute-Serve.  And I'm having a conversation one night with a friend.  And we're out to dinner with my partner and her husband,  my friend's husband.  We're having this conversation.  And she turns to her husband.  She said, she'd be perfect for poorest to research.  And I said, I'll buy you what's a forest to research.  I had never been in the business world.  I had never thought about careers in business.  And it turns out he was an analyst for Forester.  They were a tiny little boutique market research company  that looked at the impact of technology change on big business.  Their tagline was helping companies thrive on technology change.  So why was this an unbelievably opportunistic moment?  I call it lock, karma, fate, the world just throwing open a door  when you need one.  If there's one thing a PhD proves that you can do its research.  That is the fundamental thing that you do, right?  As a student.  Yeah, I was doing.  And I had a technology background.  I knew how computers worked.  I knew how to talk that language.  I could very quickly learn the modern technologies.  And I joined Forester as the first research associate  that they hired directly, the woman who preceded me  had created the position she had been an admin on the sales side.  She created the position of research associate.  I was the first person they hired into that job.  I went on to experience a growth company  with the entrepreneur founder CEO still in place.  We were less than $10 million in revenue.  We were 20 people.  I was employee number 27.  There had been a little bit of modest churn.  And we went on our rocket ship.  We had hired a new VP of sales out of IBM  and EAT revolutionized the approach to go to market  in sales and the company took off.  And we were the first company to tell Fortune 1000  chief technology officers, chief information  officers, you have to pay attention to the internet.  And that was what put us on the map.  We were working in the early days that I joined with their  transition from big mainframe computing to client server  computing and the PC and the role that the PC would play.  And we were establishing ourselves as a leader in technology  market research, but it was really our call around the internet  that took Forester to the public company that it became and is  today.  The founder CEO, still the CEO personal friend, lifelong  relationship.  But I got to work very closely with him, see his journey,  see what it means to steal a company, see what it means,  take a product idea and turn it into reality.  And that's where I fell in love with the entrepreneurial process.  While listening to you, it felt like we were having  coffee together.  You story, having, noting, loving and utterly fascinated.  You present this blend of strong analytical thinking  with a very human social side.  Considering your career shifts and external pressures,  you faced, even mentioned some kind of luck or perhaps  camera, it got me thinking, how aware are you when it comes to  making what you call calculated decisions.  This ties into a theme of love and logic, the heart and the  head.  When you reach a critical point in your career path, how much do  you lean on your analytical side?  I'm not just talking about money or job titles, but evaluating  the broader prospects of a position, diving deep into the  industry.  How much of it is a calculated assessment?  Or perhaps, is it more about a gut feeling that tells you, hey,  this is the right move?  So do you consider yourself primarily analytical when making  your decisions or do you tend to go with the flow or maybe you  have your own unique approach or system for navigating these  decisions?  How does that work for you?  I love that question and I think that it for me changed very much  over time.  The moment in my life, I was 29 years old when I graduated with  my PhD, the moment in my life where I had the opportunity to  join for a stir.  no analysis was involved.  Though examination of the job, the market size,  the career potential, no analysis.  It was a gut feeling that this was an entry  back into the world of technology  that I wanted to get into.  And a real sense that I could learn a ton  from the people I met in my interview process.  I could learn about business.  It's not that I hadn't been working.  I had only been doing a PhD.  I actually taught for Stanley Kaplan test prep  for 15 years.  It's 15 years.  Oh my goodness.  No, I guess who.  Yeah, it was about 15 years.  From about eight pain to about 29 to 11 years,  teaching people to prepare for the GRE, the GMA, the SAT.  I had been working in the office at Stanley Kaplan.  So I had been in the world of business education.  But this was an entry back into technology.  And there was no, is this the right job for me?  Let me look at the market size, due diligence on the company.  This was, I am so lucky to have this opportunity  presenting itself to me.  Fast forward, I leave for a stir in 1999.  And I take a much more strategic approach,  a much more logical thoughtful approach  to what I want to do next.  I see a career coach, get some skills assessments done.  I evaluate some jobs and realize  that I don't want any of them as full-time jobs.  But I enjoyed the people that are coming to me.  So rather than take another full-time job  after recovering from my stint at Forester,  and I say recovering because we were growing so fast.  We were working 50, 60 hour weeks.  It was very stressful.  We had gone through an IPO.  We had reached 200 million in sales and 400 people  in the company all in the seven and a half years.  I was there.  So I took a little break after I left Forester.  Instead of joining any one company I decided,  I would create a small consulting company  and work with all of these companies,  an independent consulting company,  work with all of them at some level.  They're large companies on their e-commerce strategy,  internet companies on their go-to market,  technology companies on raising funding from venture capitalists.  I did some consulting to see what kind of work  I really liked and to see if there was a company  that I wanted to grow in with all time.  So I went from, as a 29-year-old, leaving one field  that I had deep experience in the academic field  and getting into a new field  and literally just taking the leap,  based on a leap of faith,  that I had this opportunity to join this company  that I really liked to these people  and do I could learn a lot.  That's four or 10 years, almost 10 years,  and I'm taking a very different approach  to what I want to do next.  They are two other words that perfectly capture  the essence of love and logic.  They are hard and head.  Can you recall a pivotal moment or a situation  when you were torn between following your heart  or your head?  What ultimately guided your decision then?  Wow, I want to tell you a story  that I haven't actually told a lot of people  about when I learned how to manage the conflict  between heart and head.  And so the time at Forrester,  with the entrepreneurial CEO George Colony,  was fabulous and I learned an enormous amount  and I grew enormously.  But it was also when I had to confront this hearthead challenge.  Many of us hate confrontation.  We hate having to deliver bad news  or have a difficult conversation.  We hate it and when I get frustrated,  when I have to face confrontation,  I get teary and I was having an incredibly hard conversation  with George about my role at Forrester,  my future at Forrester and I started to cry.  And George didn't know what to do  and he wanted to end the conversation.  And I literally said to the man,  George, I can cry and think at the same time.  We can have this conversation.  Yes, I am having tears because my emotions are involved  in this incredibly important logical conversation.  We are human beings, we have emotions  and we have logic and I can think and cry at the same time.  And for me, that was an extremely liberating moment  because in the past, I had always tried to get  through the thinking situation and then go off  and burst into tears.  That had happened to me when I found out at Tufts  that I had passed my exams, my PhD.  He exams and I was going to be awarded my PhD degree,  the way that the head of the department presented it to me  was hateful.  He said, we expected much more of you than this.  And if we could give you a task, Linus, we would give you  a task minus.  And had been taking care of a partner  who was suffering from chronic fatigue.  And I had been working a job at Stanley Kaplan.  And I had been studying for my exams.  And I was emotionally exhausted.  And I said to him, did I pass?  And he said, hope, yes.  And I said, thank you.  And I ran downstairs into the bathroom in first-ended tears.  To be able to have the confrontation with George and to cry  and to have logic and to have a successful outcome  was an amazing moment for me in learning  that both things can happen at the same time.  And both can come into play at the same time.  And I think a lot of people, especially women,  our emotions tend to be a little bit more  at the surface than a lot of men, one experience.  Although, believe me, I've known a lot of men  have sat with me and cried.  That this gift of being able to say you can have your emotions  and we can have this important logic-driven discussion  at the same time was a really critical moment for me  in my evolution as a professional and as a human being  to tell you the truth.  Growing up, I learned a straight group,  no crying at work is simply unprofessional.  That was the norm in order places at work and study,  both in the US and the board.  But let's be real.  Whether you are a man or a woman, we are human.  And humans have emotions.  Pride is simply one way we express those emotions.  I believe that, as a views on gender roles,  continue to evolve, is becoming clear that we also  need to rethink our attitudes towards showing emotions  in the workplace.  I think that just to comment on what you said,  I think one of the biggest myths that we created  in the world of businesses is, hey, it's not personal.  It's just business.  Right?  But people, this isn't a made of people and people  are human and they have the motion.  And I also think it's, we're learning  that a lot of our emotional sense is tapping into some,  subconscious knowledge that is actually  leaving us in a better direction than the purely analytical.  So no entrepreneur has enough data  to make a purely analytical decision.  You have to go with your gun.  The one time that I accepted a job based on the logic of it,  the title, the career path, the money, the benefits,  the moment in my life where I needed to establish myself  in Chicago because I moved from Boston.  But there's this little red flag in my emotions,  saying, I don't know about these guys.  There's this little tickle in my gut  that don't know about these guys.  The one time I went with head, it was a disaster.  And last, six months, I parted ways with the company.  The, my intuition about the guys was right.  Ultimately, the VCs that backed the founder of the company  had to remove them and CEO and go back some of their money  and allow the business model to change without them.  And the one time that I actually made a career decision  with my head rather than my heart, it was a disaster.  And I think I learned a lot from that.  I think ultimately the emotional side of you,  the intuitive side of you, what Malcolm Gladwell  writes about in blank, is accessing the fact  that our brains are firing off billions of neurons.  We take keep up with it at a conscious level.  But our gut can and our gut is telling us  things that are important to listen to.  And that's the thing that drives entrepreneurs  is the need, the emotional being, to do this business,  to see it that will work, to bring this value,  to improve the world with a service or an innovation  or a technology.  And I am firmly in the camp of do all the logical analysis  and don't do something that is clearly stupid.  But when ultimately faced with that choice,  if your gut is telling you, this is where I got to go.  And if this gut is, if your gut is telling you,  this is a bad idea, listen to it.  There's a piece of the love and logic puzzle  I haven't talked about much yet.  So far, I've discussed following your heart  as a standalone element.  But I'll talk.  They are heavily influenced by our peers,  the people around us, and the social environment  we're in.  Take my MBA classmates, for example.  I'm on my classmates.  I am the all-liner.  Most of them are in finance.  CEO, CFO, senior bankers, senior management consultants,  managing partner at PE and VC houses.  If I had stayed long enough as starting companies, I would have ended up in those roses as  well.  But I make different choices along the way, dyed it by both hard and head.  The reason I bring up my own story at this juncture is that I've noticed many people struggle  not just with the emotional versus logical decision making, also with not seeing  role models who reflect their aspirations.  That's also often a deep-seated fear of judgment and fear of failure.  These fears influence our hearts and ultimately impact our decisions.  I'm curious about your experience.  How much have external factors like peer pressure, societal judgements, or even social norms  influenced you?  You mentioned earlier that you aren't found by gender norms.  But what about other societal expectations?  How have you managed to filter out the noise and make your laws of change along your  career path?  I think you're a hundred percent right that our emotions and our heart are influenced  by the people around us.  And in fact, there's a lot of evidence that community is one of the primary sources of happiness  in life.  So, being able to find a community that supports you and that accepts you is one of the  big challenges of people's lives.  And the way that community views you, right?  Being accepted by that community, like you said, by your peers in graduate school or in  the career world or, you know, that's an important part of life and happiness.  I would argue that it doesn't just affect the heart, that it affects the head, that the  very value systems that we're using to appraise things from a so-called logical standpoint.  And calorie, title, right?  Career potential, use of our talents.  All of those are based on societal judgment factors that are all driven by society,  peer, upbringing, community.  So I 100% agree with you on the incredible importance of other people.  Humans are social animal.  I might disagree with you on that it hits the heart and not the head.  I think it defines a lot of book.  Being said, for me, one of the things that I think gave me the kind of resilience that  I've had in my career and my life is the fact that I grew up in a fundamentalist Christian  household.  And I had to separate from my community, the community that I grew up with, the people that  I grew up with.  I had to accept myself as non-conforming with what I had been taught as a kid was right,  normal, appropriate.  In fact, made into a life-regat decision.  And by doing that, by having as a very young person, a young teen and a teen, having to  give up community, give up, even give up family for a while.  It made me more resistant to heavy influence by outside community forces.  It made me more able to listen to my own values, my ethics system, my moral system, and  be less judgmental about things like my career, to be able to leave a career in which  I was experiencing some success and make a huge change where I had to go back to the beginning  again.  Not something that was supported by my graduate school friends, my people who knew me as an  academic and as a thought leader in a particular field.  And I think that having to lose a community and having to rebuild the community gave me a sense  of not a complete inoculation to what other people think about what I'm doing, but much less  strength in that particular pressure on me and my one.  We begin today's interview by exploring Waverly's personal journey.  Intricured blend of love and logic that has guided her from her undergraduate days all the  way to retirement.  To our listeners, I hope today's episode is by you to integrate your own love and logic  in whatever paths you choose to pursue.  In our next episode, which is the second part of our three-part series, Will Dig Deep into  a significant chapter of Waverly's career, her 22 years as Chicago Booth.  There she told and coed a selected group of highly logical talents, undergrads, full-time,  and executive MBAs from around the world.  All of whom were passionate about innovation, change, and entrepreneurship.  Yet despite the brilliance, these individuals faced their own challenges.  Waverly has learned to tailor her coaching approach, sometimes offering a bigger dose of love  other times, amping up the logic.  How exactly did she manage this?  Stay tuned, we'll explore that in the next episode.  Thank you so much for joining us today.  If you like what you heard, don't forget, subscribe to our show, leave us top rated reviews,  check out our website and follow me on social media.  On this channel, you're ambitious human host.  Until next time, take care."