" And I, of course, am your John Jacobson, enjoying us once again is Anne.  Who's Anne?  Anne.  Anne.  Who's Anne?  This is the time.  Oh, it's Anne.  Right.  It's our community.  No, no, no, no, that's a cell.  I was nickname.  It's Anne.  I decided it's Anne.  Yeah, it's Anne.  Yeah, he's, he's, he's gender swapping.  I don't know.  No, he's flipping sides tonight.  Yeah.  Yeah.  So Anne, are you doing?  We need more feminism on this podcast.  No, we don't.  We definitely don't.  We've got John.  He's our girl powered tonight, John, because you're super excited  about the switch to Eve Eve, right?  You're like bursting at the same time.  I can't believe that it is switch to Eve Eve, honestly.  Right.  This is a holiday, right?  Oh, okay.  And Michelle has reminded me many times that I might be dead by the time the next  switch comes out.  It's true.  This could be your last switch, much.  So you have to enjoy it.  But Jensen, you know, all the juice has been confirmed.  I don't know if you guys have been paying attention to what's going on with this.  No.  This is a proud moment for all of us at NVIDIA.  Juice.  The trip inside Nintendo Switch 2 is just like anything we've built before.  The most advanced graphics ever in a mobile day.  Are you excited?  Full hard.  Are you guys excited about this?  No.  I was excited about the one real tech demo they showed, which are an  architecture tech demo, which was crazy.  You're a tech demo.  I'm a processor tech demo.  Are you guys listening to what Jensen is saying about what are you talking  about?  This is fucking the most advanced graphics ever.  Isn't this like a 10 years old?  No, this just came out as a PS4.  I'm not going to tolerate this.  What are you going to do?  Ben, you over here, and spanking.  I always did.  This is just disinformation.  Okay.  Because it's beautiful.  Yeah, because it's cool.  It's cool.  It's not cool.  It's cool.  Yeah, it is.  That's what you do.  I'm not going to calm down.  No, I'm right.  On your side.  He's fine.  I'm more excited to talk about night rain tonight.  We're going to talk about alternate night rain.  The trip is not your range, too.  The night rain.  Anything we've built before.  The most advanced graphics ever in a mobile device.  Are you going to say this?  The whole hardware.  Are you going to say that?  They're stuck.  This is crazy.  Oh, sure.  When Jensen comes out of his jacket and wants to talk about our tech  video card, you're just gushing.  But now, no, no, I didn't get a fit in an idea.  I think this is going to be real tough now.  We're not gushing.  It's also low power.  We optimize the semiconductor process.  Hey, listen, this is Michelle.  I do have stuff that I know when he went back and started  because we have a picture that we're going to talk about  alternative night rain.  Of course, it's a little of a performance.  It's how I'm going to do some beauty in the palm of your hands.  Tripping, the juice, which, too, is more than a new concept.  And by the way, come on.  I've been saying this for like one, maybe two years that this  next system is going to be all DLSS.  All the juice is going to be in there.  No, no, no, no, no, I've been leading the chart for this.  No, I've been leading the chart.  And now Jensen is coming out with his jacket and saying how  amazing and the most advanced gravity ever in a mobile device.  OK?  Did you hear what you said about the take my word for?  The most advanced gravity.  The most advanced gravity.  And a mobile device.  So, right.  Are you getting one?  I'm going to try.  I'm going to try tomorrow night and on Thursday.  I'm going to send out the troops to go to the stores for me while  I'm at work.  Good.  Yeah.  I see normally I'm way more excited.  Normally I'm like calling everybody, trying to get  pre-orders.  I'm in head over heels for the console.  I wasn't as hyped leading up to it.  But like the closer it does get to release,  I am getting more excited.  The more I am.  I'm in 10th of July.  I haven't seen enough gravity and no.  The most advanced gravity.  They're going to reel me in.  If I get it tomorrow or Thursday, what I think  I think this game's going to be a run away.  A lot of people are saying what's the launch game outside  of Mario Kart, if you have other systems, probably not much.  But are you excited for Mario Kart, both of you guys?  I know, John, you were excited about being excited.  OK.  So yeah, hopefully we'll be talking about that next week.  John, you will maybe be doing a boxing with me on Switch,  on Twitch, if you get it in the afternoon.  Because you may not control yourself if you get it in in the  morning.  So yeah, because he says Mario Kart, VGO Gang is taking  members.  Yeah, come on down to our Discord.  And if you're hooking up for people to play the Mario Kart  Open World game with, because I don't know.  You guys are very excited.  It's a thing.  The advanced graphics ever in a mobile device.  I'm definitely going to have Mario Kart.  I'm definitely going to have Mario Kart.  But yeah, I'd also love a stack squad.  We are giving away a copy of Elden Ring Night Rain,  which we're going to talk about tonight.  And that is from our sponsor,  cdkeys.com.  Check them out to save a few bucks on Night Rain as well.  They are going to be sponsoring our show  for hopefully the foreseeable future here.  So we do weekly giveaways from them on our Discord.  You can also support us in Discord  to get weekly bonus shows, the 20 year back catalog,  as well as ad-free VGO.  And you can come on down and talk to all of us.  We're all in there.  And also hook up and find people to play Night Rain with.  So it's going to be a good show tonight.  It only has graphics ever in a mobile device.  All right.  They're flossering in the middle of a mobile device.  I'm just telling you.  OK.  Well, because you said that nobody cares  about Elden Ring Night Rain copy.  Because copy pasta is exactly  4 million copies of the couple of days.  People care.  Oh, oh, switch to isn't copy pasta.  No, and Mario Kart isn't.  All of us at NVIDIA.  Mario Kart is definitely copy pasta.  Nobody can even talk about the graphics difference  with Mario Kart.  OK, there is a lot more features.  They've added a lot more features to Mario Kart world.  So we'll get into that later.  Well, next week, we will fully cover this device.  Yes, it's going to be exciting.  We're going to do a big roundtable next week.  And also talk to Amali who toured Valve  and maybe he'll give us some top secrets  about what Gabe smells like.  OK, so let's just jump right in then.  I think we're ready.  Any other housekeeping?  No, I think we're ready to go.  I'm good to go.  Good.  So Ryan, I know you played Elden Ring Night Rain.  And I did as well.  We both probably played way too much.  They were probably like over 20 hours already  of the game.  I know some people have clocked in like 30.  So I had a great time.  I love the game right off the bat.  I think you do too.  So we're kind of both right.  I did.  I think that it's interesting for me.  I did.  What's interesting for me is that there  are some negatives I want to just get out of the way,  as far as being a multiplayer-only game,  and then they didn't have cross play.  And for the PC port, it's 60 FPS.  There's no ultrawide.  So the typical stuff you still experience with Elden Ring  and with most from-style games, right?  So it's not technically perfect,  but putting all that stuff aside  if you just look at the gameplay  and just if you're having fun,  I think it's a complete blast to play.  So what it is is basically PUBG meets Elden Ring.  I mean, it's somewhat of a battle royale.  You are timed.  There are, there's that sort of map closing in on you,  like a battle royale.  It's the night closing in.  It's done in days and there's bosses to kill  and relics to get and gear to find.  And I mean, how would you even describe this game?  Because a lot of people are very-  It's PvP-only.  It's PvP-only.  PvE.  PvE.  Oh, so honestly, that's been caused driving it to everybody  as a robot.  Yeah, roguelike is a good way to put it.  I mean, risk of rain people have been bringing up,  but it is a PvE battle royale meets Elden Ring.  I mean, it's still a battle royale in the sense  because you're timed, you're constantly moving.  If you're stopping to live something for too long,  you're gonna lose levels.  You're losing time on the map.  You have to move, move, move, go, go.  It's completely frantic.  It's the total opposite way.  A lot of people play Elden Ring,  which was sort of slow and methodical.  You are non-stop moving here.  There is sort of like,  and I want to shout out to Ted and homeless  who I played a lot with.  And, you know, if I didn't have people navigating,  like, go here, go here, marking the map  is so important, John, you're constantly like,  okay, stop at a church, upgrade your flask.  Okay, go here, go there.  You have to be like, knowing where you want to go  and moving fast.  It's not just because like the night is closing in,  it's because like you have to get the levels.  And if you die, you lose them and all that stuff.  So you've been describing it,  you're saying as a roguelike,  do you want to kind of explain how that works  for people?  Yeah, how that works.  Sorry, how does what?  Well, I was gonna say like the meta progression outside  with the relics, but then like the progression  is mostly contained within each run, like a roguelike.  Yeah, so you're basically going in level one  with no gear.  You start with your starting weapon,  one of the eight or yeah, eight classes that you have.  And you go in and you progress within each game.  There is a bit of meta progression with the relics  and each relic can tie specifically to a specific character  or it can be well-rounded for everybody.  And like you said, in the discord you mentioned,  it's the meta, there could be more with the meta progression.  It's not quite enough to call it, I would say, a roguelike,  but it really truly feels like it.  Because during the network test, it didn't grip me.  I don't know if it was because I wasn't that good yet.  And other people weren't that good.  You used the first match too.  Like the first couple of matches,  you don't really know what's going on.  Yeah, absolutely.  And you find that very fast  with the very first boss, the three headed dog there  where everyone's like, oh no, you never know what to do.  But that first day, if you beat that boss in the first day,  as soon as you got to that second boss,  it feels like your teammates dramatically increased in skill.  And I don't know, I was hooked instantly.  The after the network test, I was like,  oh, I don't know, I'll check it out.  But after playing this weekend, I'm totally hooked.  21.  hours in, I'm on like the six boss did most of it solo queue with random teammates. And  it's been a blast. It's incredible.  We should talk about that. Like they just did a patch where it's easier to play solo  period. Like if you want to go in a loan, okay, you can also solo queue with randoms. But  playing with your friends on voice is the best way to experience this. Like it's loads  of fun playing with people. But even alone, I think people could still get a lot out  of this because they have this whole remembrances thing with each character. And you can  go through sort of like a story mode in a way where there's like lore and there's relics  that you get. And that's sort of another way to progress outside of just doing like the runs.  But I agree with you that there could have been more. And it seems like they're committed  to doing more. They just added a solo patch. They said they have duos coming soon. So yeah,  so the solo patch added like self revives. I don't even think it changed anything else.  You're basically just getting self revives. And I was talking to a friend that plays a lot  of solo. And he was dying and dying. He couldn't beat anything. So we played as a trio.  The patch dropped. He went and played solo. And he did beat it. And the only thing that  he complained about before the patch was the revives. He's like, I wish I had some way to  get a second chance in the boss fight. And that was his only complaint. And they added  that he beat two bosses now. Like I think solo might be fixed. That's good. I'll try  it solo.  So, you know, they may not add cross play, which I think has been a big complaint. But  just having the way to like play alone, you know, if you don't want to mix with people  or even just the duos, a lot of people were like, look, I just want to play with my friend.  Why does this happen?  Can you do trios? So like, can you do, can you do no squad feel? Can you do no squad  feel?  You can play solo.  Yeah. No, but can I know if I can do duos before? So now you can, they're going to be adding  just duos.  But what I'm asking is like another game could set a multiplayer passport and just do  too. Yes. Right.  No, we'll start the game as far as I know it. You can't say no squad feel like another  game's like more zone or whatever.  Yeah. So basically, what I love about this, my favorite thing about it are the different  characters. And these classes which aren't directly from Elden Ring, right? Ryan, they're  kind of like inspired by them or like a, they're inspired by like all the popular classes  that you would use in Elden Ring. Like, like a tank, a mage, a, like a high decks character,  right, a summoner and all these different classes. And instead of just focusing and building  the one that you know or the one that you like, you have these pre built base forms of  all these classes. And you go in, you don't have to worry about where to dump your stats  into each character levels, according to how, um, from soft wants you to level them. So  you just dump your runes in and they progress in that category. So if you're on the map,  you're in five, six degrees. And you just spam on your points.  I just understand the gameplay. So, uh, you're running around killing, killing mobs, right?  And you have to to progress to, right? And you're trying to get to somewhere.  It's time. So in days, so it's like a day to the first day, you kill a boss. If you kill  that, then the next day starts. And then it's time you kill it. So you're like, okay, so we,  everyone dies. Now what happens the next time I play, you lose every side while you're  progressing. Yeah. Yeah. If you die while progressing, like in the middle of a day, you  all respond. But if you die in a boss fight, you go down and you can get revived. But  if you all die in a boss fight, it's over. You have to start from the beginning. You didn't  beat that boss. It's so. You'll take your relics out, John, which are sort of like perks  you put into your character. And then you'll also get currency that you can spend, but you  lose everything. I mean, somebody technically could play for five hours and make no progression  really, like other than just like being able to buy. Like you, there's no guarantee you're  going to get stronger just by playing. Like you have to get, you do earn relics at the end  of every run, whether you won or not. But those relics may not make you better. And they  may not even be good relics, right? They might be for the character you're playing or the  minute. So that's the real kind of thing. Yeah. But you can like dump a lot of hours with  no progression here. If you're not yourself getting better. And I think I've been getting  better, you know, as I've been playing and as I've been learning, I think you will  get better by playing. Like don't be intimidated if you're running around right now and  you're new to the game. I'm hearing from some people like, well, I'm confused. I don't  know what to do. I'm watching these videos. There's these go here, go there. Like you just  have to do it. Like every time I play a match and maybe you're still at this point, Ryan,  or maybe you already know every time I play a match, I learned something. Oh, this point  here, you know, like you're constantly learning. And it's sort of one of those games.  And for me, like I love, I don't know what let's talk about your favorite character in a  second, but I love Revenant. I had to unlock them. That's basically like a necromancer  John, but they're full. Like I have them like full support. So I run around and I  think that fight that unlock fight. Oh, I wasn't that bad. I struggled. I use the hunter  dude, but with his mark that just like ticks away. But so I basically heal. I res. I have  like spells that I use. I have three different ghosts. I can summon. And I've just really been  enjoying his class. Like if it wasn't for her, I'm not sure which one I probably would  just stick with the hunter dude. But like there's, there's a class for everybody. And I  feel like what I'm hearing from people is like people like multiple, like they're not  just like sticky.  one. It seems like everybody's like, oh, I really like this guy. And I can't wait to play more  with this guy. I think they nailed sort of the class and character feel where people want to get  on them. So who are you, like, what are you mostly playing? So in Elden Ring, I was always  decks and, and like magic. I would hit from a distance. I would come in really fast with like a  katana or something. I was always so scared to go tank or like heavy. I played around with a few  other ones. And I ended off playing, what is it? The Raider was my last choice. And I love it.  I love being up front, smashing things with big swords and big anchors and whatever you got,  it's great. It honestly is fun. And yes, I've been telling you. It does have its problems,  but it's just addicting. It's fun. It's very addicting and fun. It's one of the games you're going to  keep thinking about when you're not playing and you just want to play it and you don't want to play  other games. He gets its hooks in you. Like, I didn't expect to enjoy it as much as I did. Like, once you get  going, once it clicks with you, like, I really, like I love this game. I can say I really do love it,  but it's definitely flawed, kind of not just technically, but just they didn't do a great job of  being a multiplayer only game and giving people enough things to feel like it's a multiplayer game  or it's a roguelike. But that being said, I think it's still a blast. It's priced. They can get it for  35 at CD keys. I mean, it's priced okay. Could it have been like a really badass Elden Ring mod,  maybe. But I've been sort of trying to tell you and other people who really like this game  just because they played Elden Ring. Like, you've got to try Monster Hunter. You've got to try Remnant  too. Like, a lot of the boss fights, even John. And it's a feeling like an MMO boss fight sometimes,  like a lot of the boss fights. If you like this, you need to check out other games where you're doing  so sort of like co-op boss fighting because it does make me think about, especially because I'm  playing as a support character, just feeling like I'm killing like a world boss or something like that  in any of these other games. So I really hand John's board to keep spamming. It's switched to  Eve. Badger, we're doing the Elden Ring review at the start. John didn't play. And I think he's  very uninterested in the game. This is every time I was playing this game. Like this is so  un-John. John would not be able to play this game. He would lose his mind within the first minute.  Yeah, I agree. And it's just the most un-John game I think that ever could have been created  is Elden Ring Night Ring. But yeah, honestly, I really do like the game a lot. I mean,  if you guys are out there playing Commodore Discord and hook up, we're giving away a copy and  in our Discord. And I don't really know what else to say about it. I mean, it's just like, it's just  fun. And I can't really know why. I don't know. It's funny because like it has all these little  things that all the other multiplayer games have, like the cross progression, the cross play,  the duo queue and like the matchmaking was bugged. Like even when I wanted to just play with one  friend and queue up for a third random, it was broken. We had to find a workaround for it. Like  there are a lot of little things that hopefully we'll get fixed soon. But once you're in the game,  it like I did not expect it to grip me. And now I'm hooked. Like I want to play it. Why am I on  this podcast? I should be playing Night Ring right now. I know. Maybe playing while we're doing this.  Maybe well, well, John talked about Mario Kart. But no, I had a really good time with the game.  I hope to play more. And I want to kind of go through and do those remembrances.  Like I said, for all the characters, just to kind of now that Solo is maybe a little bit easier with  res is because you do have to go in and out of some of the boss matches with them. But there's also  like different settings. They take you to. There's like some lore presented. There's relics that you  get upgraded for your characters. A lot of people don't even know about that. They're like,  I've been playing 10 hours. I haven't done one remembrance. I'm like, well, you got to go do some  because you get really good relics for your characters. So I like to do my first remembrance until like  15 hours. I know. See, but they're very good. And like, I feel like they could have invited  people to your round table. Like at your hold, like your whole sort of base could, you could see your  friends are on the table or they could be like, they should add some more. Like if it's really  truly like a multiplayer-only thing, add some more ways to kind of make it more seamless or  feel better. You could see everybody at the table ready to go. So anyway, check out Eldenering Night  Ray. And I think Ryan and I really love it. We've been by 50 hours combined here with the game. And  it's a good time. All right. So moving on, I did play Hella's Us. And this game is getting a lot of  buzz comes out in September, I think, or a couple of months. It was on my list, but I don't know  what it was. I was like, this kind of looks cool. And I added to my wishlist. And it's a third  person action adventure game. Some soulliness they're saying with sort of the actual combat.  But I know you played for like a little bit Ryan's who jump in, but like everybody seems to love  this right off the bat. They're like, this game looks so cool. This game was awesome. So you can play  the demo right now on Steam. I don't think it's out on console. And the game was like a lie,  because they say it's a unique exploration system. They said, no map, no compass,  use writing. And they give you compass. And they get, I know, compass, that's it.  Yeah, I'm saying it's a lie because you get a compass within one minute. But the promo  written on their page is no map, no compass. You have to hold the compass out. It's not like  but they see no compass. Yeah, they did. They did. They did. They did.  So I was like, okay, but honestly that compass wasn't enough for me. I did find for me  Hell is big hell is us name the game for me. Hell is this game because you don't know where the fuck you're going  I ran down the road a compass  I don't give a sham all they do is they go west and you have to go west  But if you go too much north west is in west anymore and yes, you don't know where you so rest the game  What is it? It's a pretty different things. It's different things in one  It's like a puzzle game like silent hill meets like a souls like with combat has some like reverse new thing  Going on because you can like stack a heel instead of like a stamina regen like it has all these different things going on  At once in your explore. I don't know how to define the game to you  I don't know what the investigations are they they really kind of they were talking about  It's an investigation you go on the vestigations. What am I investigating?  I don't know well you were adopted or something and then like you you were taken from a country  And then you're you're going back to that country to find out why you were like taken from it or something  And they say the central theme of the game is that human violence is a perpetual cycle fuel fueled by human emotions and passions  Like this the director had this whole theme. You wanted to present like I didn't get any of that  My money and yeah, I didn't get any of that  I was running around this creepy super natural town  You couldn't jump that was driving me crazy. They're really like a pebble and you couldn't jump over  I'm like I need to fucking jump and why aren't I playing Elden Ring right now?  And so like I don't know everybody's like this game is badass. It looks so cool. I love it  My experience was like frustrating for me  I did see a couple things of like later progression in the game and what really kind of rubbed me the wrong way was  It's like mixing different  I don't even know aesthetics like you have like the grungy open world like days gone  Yeah, I saw that there's crazy lightsaber sword and like cyberpunk gear that you're putting on and it doesn't fit with the environments  It was it really threw me off. It looked really cool  Like they're super natural enemies, but it's post-apocalyptic town like in the middle of like  I don't know like some of Russia, but yet you're talking to people and then their art styles different than but  I don't know like people overall are kind of hyped about this and really like this demo so for me  I'm saying the demo didn't sell me on what the game is, but I think if you like a  Souls-like silent hill type thing with a lot of talking investigative walking slowly through the woods and getting lost  And not being able to jump  That might it this might be something a look at it's game comes out of timber on everything, too  Yeah, but the demo's only on steam. I believe  Maybe it'll drop on more places, but yeah, you can I played the demo for an hour  And I think some people have put it in longer. It just I  Think for me. I don't know. I didn't like the fact that I couldn't tell where I was going and I couldn't jump and it just like eight away at me  So I think you can't jump by the way. That's a pet peeve  When you clearly should be able to jump I just you could there could be and and I'm running up to ledges  Maybe since I was playing so much night rain like I'm running up to ledges  And I was trying to get to this puzzle like a foot above me and I couldn't get to it  I had to run all the way around like this you're telling me I can't jump or step on this  I've got to run around this whole path  You know like the navigation on them and not just because you didn't have a map or whatever  Just being able to get around the environment didn't feel good to me  The combat felt pretty good. You have this drone with you and there's puzzles to do and stuff  So I can't knock that I think it's just a personal we lost Ryan so when he comes back in pull them in  It's just it was more a personal thing for me that it's just don't think it's a game for me  Just because of navigation. Okay, really quickly what I did enjoy that I played a lot of  That I hope to play when it comes out is stellar blade the demo dropped on PC ahead of the PC launch next  Yeah, what did you think of this? Well, what I liked right away is you can carry your saved data over when the full game comes out  So I wasn't like worried about putting in time  Great PC port right away ultra wide has DLSS 4 out the gate. It looks amazing. I love the music  It's a lot like near. I think it's the same person amazing in this game. Like seriously you  It's the mods are already out. There's nude Eve. There's outfits or whatever  It started people are you going crazy? There's chubbier thicker Eve  There's everything you could want like this game if you love to this game on PlayStation  I'm hearing from some people saying they're picking up it up again on PC and John you said you might as well  We may have keys come and see might have to  But I I like to scheme a lot. It's not necessarily like I didn't like bayonetta  I think you compared it to bayonetta John  Like I never really played bienes  But I did play near automata and I do see some similarities there not just with the music  But just like the feel of maybe I said that more because of the girl, you know, maybe yeah  Yeah, no, I had a good time with this. I mean ever we reviewed stellar blade before and I'll bring it up again next week  But I just want to say like the I was really impressed with the PC port apparently it's 60 FPS on steam deck John  You may want to look at that  If you want to play deck mode with this game again, but  Stellar blade seems like a great game so far  So I look forward to playing more and that's also a demo out on PC right now  Because you like a guy remember liking like some of the exploration and platforming and stuff like that's  But it didn't, it wasn't like annoying platforming.  You know, she can swing and hang from stuff and get around.  And I like the exploration.  I like the sort of cyberpunkish,  like you would call it John world, like sci-fi.  Like there were nods to the matrix.  I've heard Eve may be the one you kind of save or travel  at a phone booth.  Like it has this sort of cool feel to the story in the world.  Like I think people mock the game that haven't played.  They're just like, oh, it's just the hot chick game.  No, I think it's actually a good game.  The concept felt good.  It's quite reducing the hot chick game.  Yeah, I know, just the hot chick people were mad, though,  because she was pretty or her butt or whatever.  Like that was stupid.  Yeah, it's very stupid.  Because like I'm excited about collecting her outfits.  It's not just like, I know paced out to you saying,  it's just a game for gooners.  That's not true.  I don't, I'm not gooning on a woman.  But like I love the game.  The game was fun.  I like the gameplay.  I think it's cool that you can collect outfits.  The mods are funny to me.  Like I'm not going to put on the Eve thick mod.  But like it just kind of makes me laugh.  Like it's, it's great that people are already embracing it  and the game's already like, there's a lot of hype  around this demo even.  I think this is going to be a major hit when it comes out.  Well, remember, remember when the PlayStation demo dropped  like shadow dropped and it came back.  And it was all the hype around that.  I think there's a lot of hype about this again.  Like coming to the game to that he's exciting.  He's excited about all the mods that the community is  going to make.  Like he's totally open to it.  He's fully supports it.  Yeah, apparently like they're social.  They call this guy a perv in the beginning.  Anyway.  But why?  I mean, it's just because he likes pretty girls.  It's all the shit I've seen for years, too.  It came out of time where there was games where there weren't  pretty girls as the protagonist.  And then this one came out and was this hot, volumptuous woman  with the protagonist.  And it was like very contrasting to like what was going on  on the news.  Yeah, it's so silly though because they never left like, you know,  it's our, it's fiction.  It's, it's coming from someone's mind.  And if that's what they like, then that's what the game is.  I mean, you guys want to play as like  dorky dudes in games.  You want to be some like key man guy.  Well, I want to be a way to wait to get to my game.  Okay.  Well, I mean, I don't want to, I want to be for myself where I want  to play an attractive woman in a game.  I want to look like a better person of myself when possible.  Like if I'm on a character creator, I try to make like a better  version of me.  I loved playing Laura Croft when I was a little girl.  Like this idea that women want to play these front  b characters is completely dumb.  Like I never met a woman who wanted to play as a front b character.  We like shoes.  We want to collect outfits.  What do you think Infinity Nikki was about?  Okay.  Were we collected dresses?  Like there will be women playing stellar blade and appreciating  Eve.  It's not just a gooner game.  Actually, it's actually a good game.  Like the combat felt good.  The story was awesome.  The music.  The like, no, the hate was unwarranted.  Yeah.  I was born to hate as far as I can tell.  And I know John, you said much of the same because you actually  played on PlayStation.  So I'm excited for stellar blade.  I think it's a good game.  I don't think it's just about Eve having a nice ass.  All right.  And I am just drinking some sand Pellegrino,  chow, blood orange, sparkling water.  John.  All right.  I kind of had no direction this week.  Oh, no.  Do you ever have direction?  I know some weeks definitely.  I know what's going on.  But like, so I played like stupid shit.  Like I played spray paint simulator and game pass.  Thinking it might be some house slipper type goodness or something.  It's so bad.  Like I basically had a classic car in my driveway.  And power wash your simulator because I've heard some people  say it's like that.  What do you think?  I figured it was like that.  Yeah.  Or some acid slip, sweet game is what I figure I was getting into.  Right?  OK.  It's made by North Star video games.  Let me see if there's Swedes.  I don't think that's about the game.  Oh, so this is why it wasn't this is why it was in good.  They're in Maryland.  Oh, no.  No, is that?  No, maybe not.  Hang on.  How about you just talk about the game?  Who cares where they're from?  I do because I always want to know  what these type of games, these like acid flips.  So it's on game pass.  It's on steam.  It just came out.  And basically, you have the spray painting business.  You have like some uncle or someone that's like funding you.  He's like, you know, I'm going to get behind you.  And you're going to start this business.  And I'm going to give you some money.  So you go to a store and you buy spray paint tools  and paint and masking tape.  And my first job was to basically paint a car  in a someone's driveway.  And you have to like mask off all the windows.  You have to remove parts.  You have to basically prepare the whole body  and then paint the whole fucking thing.  Now, I'll tell you, on the Xbox,  with the joystick, this game's fucking torture.  It's absolute fucking hell.  I hated it.  I turned it off so fast.  I don't like it.  And then I go on the Xbox.  And I'm like, and also besides this,  I was playing flight simulator.  I went back to that.  And I got to tell you,  I really have neglected time with that game.  I had so much fucking fun.  And I also figured out that if I go into windowed mode,  I could drag the screen across all my...  all three of my monitors and holy fuck is that immersive because before I never wanted  to play it unless I pulled up the VR and that's such a pain in the ass.  And I have a cheap hotel set up and I was like, and I found this pro tip, like there's  a plane called the Grumming Goose and it's an old plane, like a pontoon plane, but with  also wheels, so you could take off from an airport and then I was flying like around  my house and I was landing in lakes that I knew and I was just blown away by it.  How can a game be that detailed like everywhere?  And I would land and it looks just like it and I'm like, holy fuck, how they do this?  It actually met McCarthy was here last night and we did the same thing.  We went to, by his house, flew over it.  I need to start doing more of the missions, right?  Have you ever played flight simulator?  Are you into that shit at all?  I think you dropped from back in.  Are you serious?  Yeah.  I don't know.  I mean, they did that big update with the jobs, right?  John?  I know.  I need to do that.  That's what I was curious about.  I never played flight sim.  No.  Maybe back in the day on like the old Mac, but I think that was it.  Yeah.  It's honestly, it's unbelievable that game and it runs better than ever by the way  on my PC.  I did try it on my Xbox with the cloud streaming and that was a pile of shit and the Xbox  controller is not good for that game and I don't even know what the mappings are.  But with the whole toss, it all makes sense and it's, it's fun as shit.  And also I know a couple of weeks ago, my friend Matt McCurr thing and I would made an announcement  about gray zone.  And Michelle, I found out is trying to sabotage my coverage of this game by spelling gray  wrong.  Michelle, do you want to comment on that?  I prefer GREY.  I don't know why.  I mean, I just, I'll, I'll put it as gray zone in the notes for you this time.  Gray, GREY is the British English version.  Whatever.  That's what we use in Canada, by the way.  Yeah.  GREY, but the game's been a gray zone.  So, so we're still loving you up trying to to satisfy all the vendors and shit.  Now, right.  I know you played this, right?  Cause I wanted to hear your take on it.  Which was it?  Gray zone warfare.  Oh, gray zone.  Yes.  He was so forgetful for me.  Yeah.  He didn't.  He hated it.  He hated it.  I didn't really.  First of all, it didn't perform.  Very good apples.  It was very poor.  It really reminded me of Tarkov, the whole menu system, the whole swap in items and attachments  on your weapons and ammo and all that.  You're looting.  I didn't really ever get to the end of a match.  So I called it an extraction, which it does feel like an extraction sheet or you can't  tell me it doesn't feel like an extraction sheet or those, it's not an extraction sheet  or those.  You're on the map forever.  Yeah.  And you don't have to track.  You just need to get to your base somehow.  Be it by foot or by helicopter.  So you can put stuff in your stash or sell stuff.  So isn't that technically extracting?  Is it that extracting?  Yeah.  Then I guess World of Warcraft is an extraction shooter too?  No.  Everyone's saying it's extraction to your base instead of a helicopter.  You have a goal in mind.  You start off with all your gear that you close with your own run.  There's bases.  There's bases all over the map, okay?  You spawn into the game and you can play the game for 10 minutes or 10 hours on the  same map.  You never leave.  Right.  There's 13 screens.  There's no instances.  There are some new like dungeon rate things on there now.  But basically you have bases which are where the vendors are just like World of Warcraft.  You have your stash like your bank.  Well, I'm saying it's the same, yes, it is.  It's the same exact model.  It's also like the division, like, yeah, well, yeah, with the safe, yes, like the safe  houses and the vendors are there and your stash and your bank and all that, yes.  The division ran at like at least the solid 60 FPS.  It runs great.  I'm over 100 frames, almost always in that game.  Maybe I think I was hitting 100 frames, but I was chugging along at times.  Like it did not.  Well, when the game first came out, like when you're in the helicopter, forget it.  You're like 15 frames.  That's no more.  Don't worry.  Don't worry.  Don't worry.  Don't worry.  I know you don't, but I don't care.  What else did you play?  Listen, that's my game right now, and I'm into it.  I did try another game, Michelle.  All right.  I hope it's good.  Yeah.  Oh, we'll see.  So, okay.  So I played a game called two a T. Okay.  Look at this game.  This is a proud moment for all of us at NVIDIA.  No, don't go back to that, just because you played this game.  All right.  This is a game called two a T, and it's made by the guys that made Katamari Domacy, okay?  Sounds like this.  Sounds like this.  Now listen, it's dope.  Wait, wait.  Is this the song in the game? Yeah. Yeah. Hey God. But I want you to listen to some alerts. Listen right here  It's an ad pretty stoster  Were they too lazy to code in a pose other than the teapose?  Is that okay?  This is okay. So you are a kid which I thought was a boy by the way. It's a girl  But I made her look like a guy. Oh, I listen. Okay. It's a girl. Apparently. Okay, and I was confused by all this  Because I made because when the game launched it, okay, it's not important. It's not important. It's she's a girl. Okay  Her name is teen okay  Teen I  Ringing your plan to a team just just hang on. Okay. So it's made by the guy to make kind of marie domicie  Which is what interested me in it now? I have to say not popular opinion. I think kind of marie is overrated  Really a lot of love that game. I know they do and I played it bunch in every time I get excited  When there's some new version or piano perna game. They make shit  Okay, so this game  You you are a child a third-year-old child and your arms have a rigamortus  Okay, and you're you're just you're in a tea you're in a tea you are a tea. Okay now  It's what's interesting to me is that this is a Japanese developer. My brain was confusing  Wild, okay, so you are a tea, okay, and everything you do in the world is different because you are a tea, okay?  There's only other game ideas  Going to the bathroom put it on your clothes opening doors  Of course. It's a girl. How do I hold this dick with a tea?  It's a girl  So is a boy  You have to go to the bathroom. Yes, you have to go to the boy. You have to go to the boy you have to go to okay  So it's a narrative story game with mini games  Okay, and you're going through this very vibrant world as a child who's stuck as a tea, okay?  You're just your your arms are in rigamortus. They never come down. They're always is that a part of the story rigamortus  Is that no, no, but something bad has happened to this kid and I'm not really sure what, okay?  What's that that people's arms being stuck straight out like how do you get here?  Here's what's interesting to me about this and maybe I'm overthinking it  Okay, I'm assuming this is a Japanese developer, right? Yeah  The letter T they don't have that character in their language. Am I wrong? I don't know like  Anyway  Okay, so you are stuck as a tea  You're navigating the world as a tea and basically everything that you're doing is harder because you're a tea like eating cereal is very hard  Openedores or a pain in the ass  You ate the cereal. Did you put your face in the bowl like a cat? How did you eat? No, so okay?  So to eat the cereal, Michelle, I want you to take your arms and put them out  Like a tea. Okay. I got it. Here we go now. They your elbows. Do not function nor do your shoulders  Okay, so now you have to pivot you have to pivot your hand to the cereal box and the other hand goes up because you're a tea  Okay, right, and then grab the cereal box and then you have to like dump it with  I hate the person  You have to use you have to use your other hand to grab the milk  And then this is playing with a child disability that doesn't exist  Okay, now here's the thing. Okay  Eating as a cereal with the tea arms. There's no way to spoon bends like that  I know okay. Well, I think the kid has special utensils like a big giant spoon  Okay, special needs like oversized spoon. So it can get to the mouth. Okay, so that's one thing  I had to go to the bathroom. There was all kinds of grunts and sounds  I was doing mini games to get shit out of me  Then I had to flush the toilet and then I had toilet as a little girl with tea arms  Yes, but it was she was behind a wall. I couldn't see  All right, and then and then I and then I got to school after my mom tells me I got to brush my teeth  And that's a whole fucking mini game with my giant fucking tea arms  And that and now I got fucking eye boogers. I got to take care of what this game is a fever dream  Okay, here's the thing I'm playing it and I'm like what the fuck is going on here  And this kid's like some crybaby kaiu like Charlie Brown character like I mean, you might know kaiu like he's a little fucking whiny bitch  We know kaiu up here in Canada Canadian whiny little kid  So like so like you're like just whining crying about going to school and you go to school  And you find out cuz the bullies are all beating the fuck out of you and they're making fun of you walking down the hallways  Doing the tea at you like a higher tea  Right, so he's bumping in everybody so basically you're living this kid's hellish life, right and and so  And there's so much dialogue.  The world the way they present the map,  like this weird static camera,  but it's very vibrant and colorful and looks okay.  But you can't see where the fuck you're going.  You do eventually get a unicycle  that you can, that's like your vehicle.  You can't get somebody with a chopper with a high handlebars,  maybe.  Well, he will think about it.  She has to have a unicycle,  because she can't put her hands on the handlebars, right?  Is she a bad hair?  Because she can't do her hair.  John.  John, how many hours did you put into this game?  A couple, two to three.  I'm on the floor chapter.  There's eight chapters.  You put in more hours into the game  than you did Expedition 33.  I did actually.  Oh, my.  But there's something about it.  OK, so there is some exploration.  We were his speed.  He can't play.  He is.  He is.  OK, there's no skill when your arms are stuck out like a T.  That's what it means.  You need to kill the play of that.  OK?  John, I can't let you play this game with your arms out.  That would have been creative.  Like, you have to play.  Yeah.  Right.  But here's the thing.  So the kid figures out, and this is why I was getting  confusing for me, because I thought I was a boy the whole time,  because I chose a boyish hairdo.  So she figures out that if she spins around  like a ballerina, she can fly, right?  And so she, she ends up saving one of the  bullies, and then the bullies start liking her and stuff.  And then there's a draft that makes my, my lunches every day.  As I have to go visit the draft.  I'm going to like the girl who's armed or stuck straight out.  You're getting a good action.  So.  You can't even hug somebody, kind of soulless creature is this.  She jerks off you bullies.  Listen.  What did you put in?  What did you put in?  What did you put in?  Listen, what I realized what this fucking game was.  I'm like, I, I have to play this.  I need to talk about this.  It's fucking ridiculous and weird, and it is.  I don't like this at all.  It's well executed, but God, it's not well executed.  Let me face it, it's not the execute, but it's got seven years of views.  Okay, nobody's playing this.  It's a bit torturous to play though.  It's so you have to sit through all this dialogue, and then you get like  minutes of gameplay, and then you get to cut seeing and minutes of  the gameplay.  Let's put in the reviews for this.  Never forget you're the perfect shape.  Do they say that in the game?  No, in the song, in the song.  Oh, my God.  I, you know, the reviews on steam are mostly not real, man.  Yeah, I don't want steam real.  You're, you're shooting on a nightmare and call it a copy pasta, and you're playing  tea.  This is not, this is not a copy pasta.  Because nobody would copy this.  You could be brain damaged.  Oh, my God, it's, it's comparing this game to Hogwarts legacy and expedition 33 on  steam.  This is not, it's similar, similar games that you play with, no, that means that they  couldn't find a gap.  They just picked like two games you played a lot of, you're the perfect shape.  I would have respected it more if she was in a, oh, there's just a fat egg rolling around.  I, I don't have any, I mean, too much like out of my, yeah, that's true.  Oh, that's true.  He just plays games where you were your shapes.  That's all this guy can do.  Yeah.  Yeah.  Oh, you're a ball.  Your tea.  What's next?  Triangle the return.  This guy is a talent.  Let's hack.  Holy crap.  All right.  So, it's a ton of tea on steam.  Yeah.  I played it on game pass.  It's on game pass.  Uh, people like it on steam though.  Sure.  They do 70 people like he his family.  No, seven people.  All right, I could put a game on.  It's got all agree reviews.  I don't know.  I don't know.  I don't know.  I don't know.  I don't know.  I don't know.  I don't know.  I don't know.  I don't know.  I don't know.  I don't know.  She's got a big following.  Sure.  Of course, you told me nobody cared about night rain.  You tell me.  I can't talk about it.  So then you're getting to a tea.  That's where we are.  Okay.  Oh, yeah.  Blame me because you're playing shitty games.  We're very aggressive.  A tea to a trash bin could talk to you.  Now tell us about tempest rising.  They sent us a key.  Yeah.  So, okay.  So I played that exclusively on my steam deck on my deck with a mouse on a tiny screen.  Oh, that's not a good recipe.  So when I started the game, I immediately knew and I didn't know this going in.  I'm like, this is command and conquer.  And this is a command and conquer is a game I played like 20 something 28 years ago, you  know.  Red alert.  Yeah.  So like, you know, command and conquer was an early RTS on PC, like in late 90s, that I  owned that game.  I played that game.  And I could.  how right away that they were going for command and conquer. And this game takes place in 1997  and so a fictional world, basically the Cuban Missile Crisis has gone bad. It did not go the way  it did as we know it. And there's two armies fighting each other, one's very Russian, one's not,  and kind of like command and conquer. And-  I see a certain that nerve views a lot of people say, and if you like command and conquer, play this.  Yeah, so it's an RTS based building game where you're spawning troops and vehicles and just  taking on armies and trying to, you know, gives much land as you can. And it's really everything  you'd think it would be. The presentation is very 90s. Lots of like Windows 95 style windows.  They're popping up all the time with exe files running. There's a lot of like 3D pre-rendered,  like cutscenes and stuff with the bad guys talking to each other and taunting. There's something  going on with this tempest thing where they're just like some hole that they're trying to control  that, I don't know, goes to some dimension or has some resources in it. But it's kind of  exactly what you think it's going to be. And they executed it pretty well. Now I played on the  steam deck that controller does not fucking work at all. But I basically just grabbed a Bluetooth  mouse and I was able to play the entire game, which is the mouse. Just clicking on everything.  And I think if you like these type of games like Starcraft and and Command and Conqueror,  you're going to want to check this out. Like it really delivers that. And if you have the  nostalgia, I think an EA, like promised to re-release that game numerous times and they would start  and stop and start and stop. And I think the studio just said, fuck it, we're going to make it.  And they did it. I mean, it's pretty popular people like it. So check it out.  The visuals are really nice. Yeah. I think I was on a tight screen. I did play like for a minute on my PC  and I went to the steam deck. But yeah, it's made by a Danish developer, Slipkate, Ironworks.  I don't know what else they made. Do you like these two kind of games? Either you? Starcraft,  you like them. I used to love Command and Conqueror, Warcraft. I like Warcraft. Yeah.  Well, Warcraft 3 and yeah. So yeah, a lot of Age of Empires. That's a little bit different.  Yeah, I like stuff like that too. What are you drinking, John?  I'm drinking a athletic upside dawn. All right, right. What did you play at the  then-night rain? All right. I played quite a few games actually this week. Starting off,  I played Splitgate. Splitgate too. Honestly, I had a blast with the first one. It was  back when I was streaming. So I had a good community playing in and out with me. And I loved it.  And ended up flopping a couple, I think was like a year or six months later, whatever.  But this one, it's the exact same thing. I fell in love with it again. It's fast pace. The  objective base game modes are really, really fun. They really get yourself into it.  It's just smooth. The game runs great. If you're looking for a good first-person shooter with a  little bit of a mix of portal in it where you're hopping through. And like, I don't know,  it's very fun. It would be a lot more fun with friends, but none of my friends are playing it right  now. It's pretty popular too. I mean, do you like that mechanic? Because when I played the  first one, I was just kind of like, yeah. I talked about this last week where people were here.  It was a downgrade and I couldn't compare it enough because I didn't remember. They lowered the  places you could put portals. They were saying it's too monetized. I didn't really notice that it is  very monetized. It was fun though. I mean, it was fun. Like for all the complaints, I just, I mean,  people were saying it might be DOA because it's already got mixed. But where is this fit into  the landscape though? That's the problem I have with it. Like, I'm not going to get into this.  It's in between like a, like a CS type game, like a tax shooter and a, and a call of duty, right?  But with the ability to use portal. It feels fast. Yeah, because you don't really ADS. I mean,  I played the first one. We talked about a long time ago. Yeah. So my strategy with the portals,  it really just off the bat off spawn. I put a portal. And then when I'm in some trouble,  I put another portal beside me. And it's like a get out of jail free card. I just hop into my portal  and close them and you kind of get stopped shooting. Or I put a portal like behind somebody around  a corner. And I kind of stand and look through it. But like, I find, yeah, you could shoot through  your own portal. You can see through your own portal, but you can't see through the enemy portals.  It's a really fun game. It's, I don't think it's going to go very far in the FPS scene, but it is  something fun to pick up. It's free. It's in the beta right now. I think the beta is going on  until the release, the full release of the game. But yeah, it's just something fun and still  is it's going to be free to play? Yeah. I believe it is. Yeah. Okay. Yeah.  Like, we're bitching about monetization in it because it's like, if it's free and they're just  doing cosmetics, like if it's not paid a win, I couldn't see if it didn't seem paid a win.  Yeah. They're doing, no, it's not paid a win at all. They're doing the thing. The valor  goes. So you buy the skins and then you buy currency to buy upgrades for the skins. And it  does get expensive. If you go that route, I didn't do that. I did the Twitch drops and I bought  the battle pass for five bucks.  And I've already finished it.  It was, it's a good experience.  I think if you like that kind of thing,  if you enjoyed Split Gate one, pick it up.  It's a fun little pick up and play the games  last about 10 minutes each.  Yep.  Next game on the list,  I played nice day for fishing recommended in the Discord.  And honestly, this game, John,  I think you love this game.  You like that other fishing game?  I think it was called Cast and Chill.  Yeah.  Wasn't you talked about it a few weeks ago?  Yeah.  This one is hilarious.  It's like a 2D side-scroller fishing game.  And the fishing mechanics are like individual battles.  So every time you cast,  you find the fish that you want to grab.  And it fights you on the way up.  You parry, you attack, you can use spells  and you eventually catch the fish  or you lose the fish.  And you go on these little missions across the top,  like the overworld that's set up kind of like Terraria.  And the longer your fishing line is,  the deeper you can go into the water.  You craft boats, you move around, you do missions.  You fight these like Cthulhu-like monsters  that have taken over the world.  Very fun, very charming, very funny.  There's this one scene at the beginning of the game  where it's kind of like,  it's kind of pretending that there are other people  in the game and they call them NPCs  and everybody on the earth is an NPC.  So you think that you're with other people  and then they get obliterated.  This is like in the first 30 seconds of the game.  They get obliterated, but they start talking to these people  and they're kind of resembling humans,  where they're skipping the dialogue.  And so the main character's talking  and the other character's like, skip, skip.  Yeah, so the trailer is all like funny too.  Like they tried to put sense of humor.  Like you see that like real like video trailer  with the guys and stuff?  Yeah, yeah, yeah, yeah.  They filmed like a whole like people out in the woods  with a stack and a little more movie.  Yeah, it's very charming.  Okay.  Yeah, I played on a steam deck.  I'm going to continue playing on the steam deck.  I bought the full version.  Great pickup.  It's very chill, very relaxing.  Other than like, yeah, okay, the fishing  can get a little bit tense  because you wanna catch the fish,  but you're battling them.  So you got to level my idea that there's like spells and shit  as you're bringing them up, right?  Yeah.  Trying to wear them down different spells  and you have like a mana bar and all that.  And the perries are like, you can get a perfect pair.  You're just a regular block.  And yeah, I fell in love with this game.  So it's just like a big world that you're exploring  or is it just kind of like,  I've only played, I think about five or six hours.  I've gotten pretty far.  Like it does get pretty big, like horizontally.  Like you're going back and forth  for quite a bit of ways.  Like I'd say it's pretty big for the type of game  that it is.  All these different sceneeries and stuff.  It's cool.  Definitely pick it up if you like these kind of,  it's like, it's like,  I don't know if you call it a road.  It's like an RPG adventure.  Yep, there's a demo.  Okay, yeah, I'll look at this too.  Yeah, check that out.  It's really cool.  All right, what else?  What else did I play?  I played a lot of night rain.  That kind of consumed me for the week.  I know.  If I didn't have to work so early tomorrow,  I'd be playing it as soon as this podcast ends.  Yeah.  Ah, what was it?  I tried hella's ass.  We talked about that earlier.  And yeah, I think that's pretty much it for me.  Yeah, it's hard with night rain,  but I will show you.  Yeah, I played a ton of night rain, we found it.  Yeah, I mean, I don't know if we covered it enough  or if we said everything about it,  but yeah, I hear you.  That's great.  Play with us.  How's the most keyboard support in that game?  It's not great.  I don't do it.  Yeah, I'm one of the crazy people who do it.  I know you said you have a friend who does it,  but I have a friend who only plays on it,  but he loves it.  Exactly.  Yeah, I actually kind of like it now,  but it took me like a day to get my key bindings right  and trying to figure out what the hell I was doing.  The lock on targeting is not my favorite thing.  But if you do it to tab, you can just tab target on and off  and it's not so bad.  They have it like middle mouse to start.  But anyway, yeah, you're supposed to use a controller, John.  Basically, I played with my buddy on control  or on keyboard or mouse and he didn't know how to ping  and it was pissing me off  because we couldn't get anything done.  He's like, oh, come over here with me.  Go to this direction.  And I'm like, where do you want me to go?  Just pings.  I can't ping.  I can't ping.  I'm like, bind it to your key lines, man.  Just ping for me.  The key, it's not everything that you like,  menus, everything is not set up.  Provost and keyboard, John, but you can do it.  And that's how I'm, so I'm okay with my character now,  like doing it, but it took me some time for whatever.  That was the main reason I refunded Elden Ring on PC.  And I bought it on PS5 is because it just,  it didn't perform the keybind for crazy.  I think I was getting like Xbox controller inputs  when I was trying to use a keyboard and mouse.  It was just a mess.  Technically, it is not a good PC game.  And the technical standpoint of like the 60.  But a lot of those Japanese games all do that.  Like they lock in at 60, there's no ultra wide support.  Yeah, I don't know if they do anymore, honestly.  Capcom did that a lot.  Yeah, but you can run them up.  And like fix it, they're, you know, like, this is like, you can't do anything to it.  There was a Nexus mod to unlock the frame rate, but they took it down.  It might be, it might be coupled with the parrying window or something like that with the frame  rate.  So it doesn't look the way they've designed the game.  I'm just hoping for the next Elden Ring and the next, you know, whatever that they do update  the engine and change things and start to see things a different way because it's like  the one flaw.  Like when I first put on Elden Ring, it's like console first.  It's like console first.  Well, I remember playing the Elden Ring and I realized right away, oh, I need my controller  for this game.  I can just, you know, all this stuff is just kind of like antiquated at this point.  So I'm hoping for them.  But I mean, it does make me want to go back to Elden Ring, even though I watched it a bit.  I'd like to play more after playing Night Rain.  So we'll see if I actually do, but I just love my character so much.  I'm going to try to recreate it in, in Elden Ring.  I'm trying to make some of them and they are.  That's a great idea.  Yeah.  It would be kind of a fun challenge.  So anyway, Eric, what are you drinking?  I'm currently drinking a Bud Light strawberry lemonade.  It was all that was in my fridge.  You know what?  That sounds crazy.  It's like a...  I don't know.  It's not sweet.  It's not good.  It's not good.  Not right.  All right.  What's going on out there, Michelle?  All right.  Well, EA cancels the Black Panther game, closes cliffhanger games.  Yeah, I mean...  That was like a week or two ago.  Yeah.  We didn't get to talk about that.  Yeah.  It's from Wednesday that we didn't get to talk about it on Tuesday.  I look, the reason why, as his EA said, they just, it was four years in the making.  They were pumping money into it and they weren't very far along at all.  And I've looked, the lead developer was a woman who came out at a video saying she won't  hire white people.  So I mean, kind of karma, I guess, he goes around, but EA, this was not the reason why  they shut it down because of her statements.  It was because they said after four years they weren't, they were still in pre-production.  So they were basically funneling money into this game and nothing had been done.  So they cut it.  They called it.  So...  A lot of games.  I feel like a lot of games got canceled there.  Well, that Ubisoft was defying...  What was that game called?  Extra-fiant.  Extra-fiant.  Shut it down.  Yep.  That game was okay.  Okay.  Okay.  Yeah.  That game was chainsaw.  Okay.  They're not getting any more updates for that anymore.  It's a hard world right now with shooters.  I mean, I know, John, I told you I wanted you to try to concede X launches next week on  the 10th.  Yeah, I know.  You try it again.  And I mean, I'm...  Siege is still going strong.  They're like redoing games.  So I may have to look at it again, too.  But it is a hard role out there for shooters.  But Extra-fiant, yeah, went by by, which was, I think, we all kind of knew.  Well, Ubisoft is just one blunder after another.  Yeah.  That one was kind of an okay, COD thingy.  But I guess not enough people playing.  So what do you do?  Yeah.  Also, canceled Xbox, right?  I said, our first party handheld has been sidelined for now, John.  What's going on with this?  Yeah.  Well, basically, it might be in response to these, someone, who did that?  Someone did a bunch of comparisons of Steam Deck with Steam OS versus Windows 11 on handheld.  And the differences were staggering.  Yeah.  Like 10 to 20 FPS better on...  Yeah, Microsoft said it was a performance thing across all their gaming stuff.  Like PC, their game bar on PC, like everything they want to focus on dialing in  the gaming before making their own, yeah.  So they want to make a handheld OS, they're saying, listen, the hardware is not the problem.  We're going to shell that for right now.  Let's get the software, right?  Let's get the OS, right?  And honestly, that's why Steam Deck probably does perform so well because it's so fucking  lean.  Yeah.  It's so easy.  There's not shit running in the background.  I mean, like in my Windows PC right now, if I go in there and look, it's probably a million  process.  I also think they want to work out because this is what's going to be in the next Xbox.  It's going to be Windows.  Of course.  So they're still doing their ROG ally, X Microsoft thing, like that's still going, or game  as well.  Sure.  But that doesn't count to me at all.  It just doesn't.  Here's the question I have though.  Okay.  I mean, the reason Windows on our PCs is slowing down our gaming is because we have all  these processes in the background.  You know, I've got Adobe shit and Google Drive and...  Yeah.  I mean, I need to shut off a lot of shit.  Yeah.  So there's shit running in the background.  And I guess on the handheld, there's all these processes that are running even if you didn't  install stuff that's not happening on Steam Deck.  So the question I have though is if they...  do do that. And they do make it super lean. Does that mean you can't install anything,  except for the games they say you can, but it's still Windows somehow? No, I don't think I  would have had that.  No, because even with the steam deck, you can boot Windows, right? Yeah, I understand. I  talk about this, but they're curated, you know, steam OS experience is what it's all  about.  Well, they're just going to strip down all the shit in the telemetry and windows that  is garbage and trash. Okay, we'll see how you install. I don't even have the game bar installed  on my PC. I mean, you're nice, but I'm saying if you can install Windows, you can  laugh.  Yeah, I want to say those. You can install every Windows app in the world. Well, then  that shit's running in the background. Well, this happened at the same time, steam OS has  pumped out to everything. I was just going to say they got it. They got to work quick because  steam OS is out. Yeah, it's out for everything now. So they're competing now and saying, look,  we're losing. We're 20 frames less than steam OS. We've got to do some battery life is significantly  different too. Like dead cells was like two and a half hours on the Windows 11 versus six  and a half on the steam deck. Yeah. And going back to what Jensen said, um, but that's  why the battery life is worse on the new switch than the old switch. And an architecture  that supports.  Yeah, it's only like dedicated AI processors to sharpen anime and enhanced gameplay in real  time. I think right now, the best handheld to get is a ROG ally with steam OS. I think that  would be like the cream of the crop, getting best performance, best battery life. It's you  cut the bullshit, pick up and play anything on steam, anything anywhere else. That's your  hand help to go to right now. I agree. I'm not. I don't. I think the next steam deck.  The next steam deck is a thing to me. I'm definitely probably going to get one. I think I'm  no rush is they want to wait for that leap. You know, of that generational leap, which  people are saying the switch to isn't the general international leap. That's been like  the buzz thing you hate, John, that you've been saying.  No one has a switch to there's no reviewing it. So it's all hyperbole. But like, but like, okay,  Valve has done an amazing job with steam OS. You know, going into the into the steam  deck. I was so skeptical. And then switch to becomes more interesting. Can you imagine  if they bypass Microsoft like that? That's so skeptical of Linux running all these  Windows things. And I don't need to still stay on my maze. Everything fucking works. You  know, like it's crazy talk. And it's just getting better. I mean, it's so much better  than the day I got it. Yeah, their driver's stability has increased like exponentially.  They've done amazing work with their drivers with Linux and every time I turn it on,  there's a fucking update. And I turn it on many times a week. I am in the experimental  like beta shit though. So I'm probably getting. Yeah. Yeah. Yeah. I'm excited to see what  happens with the next one whenever it happens because, you know, John, like I said, you were  concerned. It seems like everybody's sort of adopted this. Everybody's been like on board.  Like, right. We're saying steam OS is going everywhere now. I don't think it's going away.  And the handheld PC market is heating up and switch to as a part of that in a way. And  don't discount it. Don't discount the idea of someone taking the steam OS and making  some kind of a console out of it. For the living room, that's way more powerful than the  handheld. That would be really compelling. No, not a doc. Yeah. Just a box. I just know that  you can't wear for the box. It would be a bit more expensive. Like if you want to like,  because graphically, the ROG and the steam deck are up there with the switch, right? And I know  people have like external GPUs that they keep in their living room. They dock their steam deck  or their ROG. And then they run through like a 3080. Right. You can do that. That's expensive. But  yes, you can dock like that. That went into like a 30, like a, like a dock to like GPU. But I think  that's like, John is saying is the answer to the future. If you truly want to dock something  and have it be more powerful, you need to have something behind it more than just more power.  And right now you're just kind of giving it more power. But yeah, I'm just saying they make a box  that doesn't have the screen. It's twice as powerful. It costs 500 bucks. I understand this, but  but that was so far ahead with this. I'm just saying like, that would be really compelling.  They do have something special with Steam OS. Like when I first picked up the steam deck, it was just,  it's seamless, right? It's made, it's idiot proof. It's seamless. You're a library transfers over  and even if you don't have a library, they make it very easy to make an account and start buying  that they want to be able to get in their game pass games. They want to be able to get in their  uplay games. They want their battle. But I've done all that. You just put windows on an SD card  and you want to go. But a lot of people don't want to do that. They want pick up and play for everything.  And so what's annoying is the SD card so small. I lost it. They can do a good team.  They'll talk about that again. I'm press it and I'm right.  to collect Nintendo games. It's way smaller in a switch card.  I was playing World of Warcraft and Call of Duty on it.  And my mom and dad's house.  But you lost an SD card.  And I'm like, I'm not doing that shit again.  I'm not putting that on there.  I spent like a couple hours of my mom's kitchen table.  Cause you're down on it.  Well, I'm only down on it because it's not gameplay.  The head game play.  It's not game play.  It's a tech demo.  It came out.  It's a tech demo.  They were walking around in the world.  It's a tech demo.  It's not game play.  It's going to be and that was like gameplay with like over 60 FPS.  And they purely focused on performance for Unreal 5.6.  It was really mostly about that.  And then once they get the performance down there,  they're building all this other stuff with the high fidelity  character models and the visual effects.  Yeah.  And it was really,  the Witcher 4 gameplay is a tech demo and not the actual game  as confirmed by CD Projekt Red.  Yeah.  But it looks amazing.  Yeah.  It's not like how to see how to have a series.  She looked good.  They changed her.  She looked great.  Oh, do you like?  Yeah.  Yeah.  I think bitching about her face.  Her hair and hair bottle of work will look a little bit better.  So yeah,  so they have this new tech with the trees where they like they have.  I can really understand it, but they have like, they load in pixels  and they change as your perspective changes.  And whatever the heck they did, they said it's going to be able  to run on anything like very well because of how they provide a memory  efficient way to achieve high density and fidelity foliage.  I mean, the trees look amazing.  So I don't know.  I'm hopeful.  I'm excited for Witcher for a period, but like after seeing this,  it's definitely piqued my interest here.  I know John is down on it.  He's not just a period, but well, it's it's it's it's a tech demo.  It's not gameplay.  So sure, but I think it's capable of it because then you have  far off.  You have developers who can do good stuff with Unreal five, like the WooCon devs  and then you have developers who make trash with it.  So this is saying in the right hands, this is the potential of it.  And I think that that's what you and as more people switch to it and start using it.  I mean, we have more and more games are using it.  So exactly.  So it's exciting as somebody who loves good graphics.  And then look, there's a lot of things coming up this week.  Xbox showcase, PlayStation state of play, summer game fest.  The ball for digital.  Yeah.  Like what are our predictions?  We asked people ask, I know there's a rumor right now, right?  John, where they got a war 2D game.  Yeah.  Which again, I kind of predicted that.  Thank you.  Okay.  I did say, boy, I said they need to go back to the old, I know this is not quite  the old games, but just make a bite size, got a war game.  And this sounds like it's going to be a tune.  That's a metric video, but you would have deep, it's going to be two and a half  D though, which I guess is kind of like the old, like first got a war.  Um, I'm excited about this.  And they're going back to Greece.  So what is this?  It's just great.  It was.  I was kind of hoping though they would go back, I don't, it's to be seeing  though what the game play really is.  So is it, is it just a stripped down 2D side scrolling game?  Or is it like more 3D?  I mean, the rumor is 2D side scrolling action platformer,  much like the first of last crown.  Um, so yeah, people will probably be super super this.  Yeah, that that's a rumor though.  We don't know yet, but a lot of stuff could be happening.  No, don't do that.  Why not?  I don't want that.  You don't even like better.  Vania is you're always bitching about them.  Um, summer game fast.  Yeah, like I don't know, we're probably seeing more stuff out  of there, maybe some more stuff about this Star Wars Jedi  director is now working on a D and D video game.  So it's a single player video game in the work from the Dungeons  and Dragons world.  So I mean, maybe we'll see more stuff about that mystery game that  people have been talking about.  But do you guys have any predictions for what you want to see?  We'll probably see more of the the first light James Bond game, which we  saw a picture about.  Um, yeah, we talked about this on our little, uh, Discord  podcast.  Yeah.  And they say they're remaking GoldenEye as well to play on Xbox or  something again.  They were doing something with GoldenEye.  This is a new James Bond game called First Light.  They showed a guy with feathery hair and a trench coat.  I don't think it looks like James Bond.  I don't know what's happening.  The colors too big.  The colors with the hair is definitely, yeah, the hair is it's definitely  Rick Astley, the flutey haircut.  I don't like it at all.  So, but we'll probably game reveal this week.  So that's going to be happening during events.  We talked about this in the switch, right?  No, they said they were making a that James Bond, I'm  not, we're during the direct, it was the Nintendo Direct or the switch  Direct where they said it was announced that James Bond game was being made  for the switch to.  really. Well, maybe you'll be able to play it on it, but I don't think it's just that.  Maybe it's, yeah, maybe similar to what they did with interact with soaksong, where they  announced that. They announced that they showed the game. They're like, on the switch too,  but everybody knows it's going to be everywhere, probably the same way.  They've been doing a lot. People have been trying to figure out the games that are just for  switch too, but they're like, they're not really showing, they're taking claim for a lot of  games that aren't theirs that are everywhere, but they're like, sure, that's what everybody  goes these days. Like, because exclusivity outside of every award show or whatever Xbox showcase,  they show stuff that's everywhere. We're supposed to go, thanks, Phil. Right. But,  anyway, my concern with this game, we talked about this was, I just, I hope it's not hit man with  James Bond or hit man with hair. That engine is not the right to hit man. This can't  feel like hit man. You already have to hit man with hair. No, I don't want to hit man with hair.  For a half hour, right. I don't.  All right. We'll see the trailer. I'm deeply closeted. I know you are. You totally played to a T.  There is no man who is not deeply closeted. Just played to a T.  Speaking of closeted, I want to bring up this article. I know we don't try to avoid drama here,  but in gadget had an article kind of picking on Grand Theft Auto, saying that the men were  presented as toxic masculinity. And there weren't enough. There wasn't enough certain types of,  oh, God, I don't know.  It's a trailer. What do you want? Like flap fights in the streets?  They said, they said men in GTA are portrayed as violent. And largely, there are the LGBT people,  sex workers and women are portrayed in a bad way. Dr. Callover said,  no, I got disagree. Typically men are so much variety.  Welcome to GTA, go away. Well, but listen, what they said about typically men in the game  conform to almost these traditional masculine stereotypes that we expect of men around violence  and aggression. You're playing fucking criminals. Like, what are you expecting them to do?  Like, why are they famous called Grand Theft Auto? You're stealing cars. Right.  Right. Like, you're getting felonies. I thought we were done with articles like this. And I  I thought we were done with this bullshit. And to see it on end gadget and not like, you know,  polygunner Kotaku or something, why is this shit popping up? Like people are, why are we talking  about the fact that criminals are violent? Like in a Grand Theft Auto game. I don't know. It just  struck me as like, we're not done with this, this bullshit yet. Like there's still people writing  these shitty articles and talking about this stuff. Don't force them into a Saints Row,  dilemma. I know. Well, we'll see what the next GT actually is. Video game consoles are dead.  And article here, while Nintendo is still focuses on console exclusivity. The rest of the video  game industry is changing. I thought this article was funny just because they're saying that  the are dead thing. And I figured John would say, yeah, I invented that. And Sony's dead and  blah, blah, blah, blah. But I am seeing a lot of these extreme headlines with dead  recently. This is dead. That's dead. Um, but this is where everything's dying. Everything's dying  and dead. But to me, and I think we've been saying this, I think so gaming has never been better.  Do you both feel that way? I agree. Yeah. Okay. Good. No, I think that gaming's different, right?  The triple A star. There's so much. It's different. It's different. It's different. It's  stuff. It's really finished. It used to be a AAA once every two years. Now it's like the same thing,  but there's no. What's different though is triple A once every two years, everyone played that  triple A and everyone just about it. Now we have triple A all the time. And there's all these  pizza valleys. And then in between all that, we have all these amazing indie games that just come  out of nowhere and take over our life for a week or two. And that happens constantly. Like just  constantly. And that didn't happen before. Now there's literally a new game. I want to dive into  every single week. I know it's it's it's pretty. I don't think I've done this much gaming in a  while. And it run a role right now. And I was just saying like what's going to be coming out. And  then I'm like, okay, I've got doing awakening early access on the fifth here, which I'll be talking  about next week. And then stellar blade to PC. And it's like every, you know, there's too much stuff.  So people that are bitching about gaming, it's bad. I just don't think they're trying enough things  or something. I don't know. I don't get it. But I know they're not taking chances.  The triple A. They're just there just Fortnite and car. And that's all they play. Yeah. And then  they're excited about the switch to interplane Mario Kart. That's why you guys hate gaming. You're  play Mario Kart. Come play some other stuff out there. Ryan, I need to ask you a question.  Yes. So according to this article, milk in a bag is a long-standing tradition in Canada.  It's not a tradition. It's how we get our milk. It comes in a bag. Yeah. So it's in like a rectangular  bag about the size of your forearm. I think it's a one liter bag. This is now this is this is gaming  related to what I'm doing here. So you don't pour it in a jug.  There's a specific jug you have to buy that fits the bag, and you cut the corner tip of the bag, and it just pours over the bag  I want it to throw it out. It's great. I don't like that. I haven't bought milk in here. This is a knife. Okay, so you do. I don't think it's bad for you anyway  You cut a little corner in the bag and then you dump it and then how do you close it?  You know  Don't the fridge and the hole in the bag stays open. They force you to buy your way. Oh my god  Yeah, like you buy three bags at a time. They stay closed until you want to drink one and then when you open one  It's open. So you have to drink it  Now I've never had to go bad in my entire life like you I don't know that back when I was a kid  I used to drink a little bit more milk, but yes, okay  So you just all right now Phil has come through for you because the Xbox series X milk pitcher  Comes in white or black and it can hold up to one and one point three leaders. You can buy an Xbox branded  Milk pitcher. Do you want to get this you need to get? I might have to do that. You gotta send me the link  Let's think I just posted it in the Disney. No, I don't like the look of this bill. All the things you could be selling  powered by a hundred percent Canadian innovation  Exors the toaster and the fridge  Wow, they have a big trailer video. It's loud  So I did want to bring up  this week actually a couple months ago  Team Cherry took down a few things on silk songs steam page. It took them off gone trailer gone  And then suddenly last night late in the night they uploaded a bunch of stuff like oh that means I'm pretty sure  They uploaded like achievements and maybe the game and like a bunch of stuff  And everyone's thinking Thursday when the switch comes out shadow drop silks on it'll break the internet  Really, I think it's gonna come over a release date  Part of me. Do you think it's gonna come up for everything on Thursday?  If it if it does it will be on everything. I guarantee. They will miss that opportunity people will go nuts for that  But uh, yeah, I'll be hyped. That's a good one. That's definitely they'll do a demo at least watch  Or something they might they didn't for all night  But that was when Hollow Knight was still small and indie and they didn't really know what it was gonna do  So they may do a demo. I can see that  Yeah, that's interesting. They do have a demo out there floating around. So yeah, it might might work out  Yeah, for them to do an update like that  That probably means something's coming during these events  Yeah, demo or a pre-order or something like that add to wish  Yeah, we might get a bunch of demo touching their steam page  They haven't touched their steam page in years and all of a sudden landing last month  They did something and then last night so  Yeah, that's a sign something's coming this week  So yeah, Xbox showcase PlayStation state of play summer game fast. We're gonna be seeing demos trailers  Switch to is coming out this week. Like it's kind of gonna be a good fun gaming week  I think with some exciting news now john. What are your plans here?  You have a Walmart pre-order. You were worried. They were gonna cancel it. Yeah, the unboxing stream badgers asking about look Thursday  If it comes early john's probably gonna rip it open, but I don't know  We're gonna play it by here. That's all I'm gonna say  Head to twitch that he's on a Michelle follow John do something recording my order is still safe  Okay, I'm checking right now. When do you usually get to live hearing if you have like if you it's all  We have like a little baggy beside it or a delivery car like there's certain times that it's yeah  Yeah, of course lead yeah, if you have a truck delivery worker if you have a truck next to your order  It's coming like FedEx or something and if you have a bag then it's coming local door dash style  I have a bag  Oh, so that could come early. That's the earliest delivery. Yeah, you're gonna get that right in the morning then because they're not dropping it off  Okay, so  Um, but I mean, there's no guarantee of that time though because those deliveries come  Spratically throughout the day. There's never. Yeah, but how many people are gonna be getting a switch that day  But I mean, I do one more plus all the time so and I have the one guy delivering all the switches  They're gonna go missing  Well, yeah, but yeah, so mine has not been canceled. I was you know, there's a lot  All these stories about people's orders getting canceled  I think some of them had maybe issues of the credit cards. I don't know. I did get charged on Saturday  Um, did the for more than it was right. Did the hold go? Yeah, okay. Yeah, like I my wife's phone like Apple pays connected to my amex  So it popped up on there. Okay, then a charge went through. You said it was more than  570  It was for 570 and it should should have been 540  Yeah, that's weird. Oh, sorry. It's a cheap and USD. Yeah, the total should be 540 79 with tax  So I don't know the guy right the driver  Don't you get the camera or  or a controller or a...  No, I purposely did get, I did not do any of that.  I got the Mario Kart bundle.  I decided not to get the controller.  I will get the controller, you know,  in a week or two or something,  but I see no rush,  because I actually like the Pro Controller currently.  Right.  And...  The Wii confirm that the old controllers work.  All joycons and the Pro controllers.  No, no, it's different about the Joycons  the little controller handle thing.  It looks different, like they change a shape of it.  The Pro Controller or the Joycons?  No, the Joycons in the holder, not out of it.  Oh, in the holder, I never use that shit.  It looks different, because I didn't mind that  on the regular Switch, but I have smaller hands on you.  The only time I use that is if I need a second controller  or a third controller that I don't have,  and then I'll do that, like,  to play some multiplayer game,  like Mario Party or something,  actually Mario Party won't you do that?  Are you sure the price didn't go up on the Switch?  It did not go up.  I don't think it did.  But why the hell are you really, did they charge you extra?  I still want to get to the bottom of that,  like that would bother me,  that they charge you.  Transaction fee.  Well, I'm looking at the actual order on the Walmart app,  and the prices do the taxes and everything,  like not to be smart ass, but the taxes 3181,  just subtotal 508.98.  Why was it 508?  Yeah, so I'm saying, like,  what's going on with your pricing here?  Did Nintendo?  It says $4.99.99.  Then tax, there must be some delivery fee  or some, and you got a tip for it right there too.  I have one more plus, I don't pay.  You don't tip them, though?  You're supposed to tip.  Is it your membership?  Maybe your membership expired, and they're charting.  It comes with my card.  Well, they charge you extra, but yeah,  so we'll play it by you, or John.  John will unbox if we can.  I know you're super excited.  That means next week you've got a Mario Kart review.  What else are you excited to jump into?  I don't know.  I'm like, I've been trying to figure that out myself.  Like, I was asking Kevin when he was on there.  Like, what else is people getting?  Like, what are the games?  And he was saying, like,  like, here's the kingdom and shit?  Yeah.  I mean, I already, I'd be curious to try maybe Mario Party  just to see how they use the mouse controls with it and stuff.  Do you think they should have launched with more stuff?  Yes.  I don't know.  There's supposedly like 14 different games or tech demos  on the device when you get it,  you know, like this little chair of shit.  That's not a good stuff, things.  I don't know.  I think of the pay for some of that shit.  Like, oh, okay.  The one game that should have been on the console,  the one where you like explore the joy con  and like persistent insides that should have been on the console  is a charging, it's like 20 bucks or something.  When is the Pokemon game coming out that you want to play right?  Legend ZA, I think they got a release date of October 16th.  Okay, so that's fun.  But the old one has a free upgrade.  You don't need Nintendo online and you don't need to pay  the DLC upgrade.  The developers definitely felt bad  for the condition that the game released in four years ago.  Or three years ago, whatever.  But it does look good.  You get many more textures and things spawning in  and Pokemon spawning in on the screen.  It's running at 60 FPS, which it actually does look buttery,  smooth.  It does look much better than it is.  So if you guys would jump into that,  like what would you do?  I would 100% play Mario Kart,  but I would 100% start a new game on that and see how it goes.  I may not play the whole thing,  but I would definitely play it just to experience that upgrade.  Okay.  And what about like even like Xenoblade?  Like, because whenever they had like some hidden option  to turn on 60 frames and shit,  people say that.  Yeah, I don't know.  It's that we're like borderline will run better.  I think I think they're definitely worth a pickup  if you've never played them before.  And you want to play them a mobile  because they'll probably run better  than like something on the Steam deck.  It's gonna be great for people new to the Switch world.  There's gonna be a lot like,  and especially people with nothing else  because like I saw like split fiction is going on there.  And like games that have never been on the Switch before  that other people have maybe played on PlayStation or PC.  People on the Switch now are getting access  to a bunch of games that might be new to them  if they're Switch only people.  I mean, these are the people that are gonna have  the most fun with the Switch too.  Right.  As far as like you, Jon,  you've probably played a lot of the stuff,  including Cyberpunk or Elden Ring  or whatever else is gonna pop up on there.  But I think if people are new here's Switch.  Which is similarly to what happened with the Wii U.  A lot of people didn't really like it.  And then they just transferred all those games over.  And made them run better on the Switch.  Yep.  Here's the launch titles.  Arcade Archives to Ridge Racer.  Okay.  Bravely default, flying fairy, HD remaster.  I'm gonna go faster.  Civ 7, Cyberpunk, Dell Terune.  Stop me if you want to talk about anything.  Fancy life.  We will.  Oh, Dell Terune.  Got a release.  Yeah.  This is Nintendo Switch 2 Edition.  This is Nintendo Switch 2 Edition.  Yeah, but that's not a launch title.  Like, it's Nintendo Switch 2.  It's Nintendo Switch 2.  It's Nintendo Switch 2.  to addition of the game. Yeah, but that's not a launch title. And if there's already a version,  okay, well, I'm just going to say these games. Fast fusion for night hit man for tonight.  Actually, Fortnite's going to have mouse support, supposedly. Oh, you need to try that. You need  to try that talk about this week. You better try mouse. Uh, hit man ruled of assassination,  signature edition, Hogwarts legacy. Uh, canoe to Kunutsu, gummy, path of goddess,  breath. And while out here's the kingdom, Mario Kart world, switch to welcome tour. I'll definitely do  that. I have to do that. And you're playing a shooter with the mouse. That's that one I was talking  about. Yeah. No boongas ambition, awakening, complete edition. Puyo, poo, poo, pet, Tetris, uh,  rune factory, shine, post, be your idol, sonic X shadow, split section, Street Fighter six.  I was going to say a lot of those games have already released. They have no launch. Other than Mario  survival. Yeah. Yeah, kuzu. Well, I mean, in the Nintendo world, like Cyberpunk never existed, right?  In Hogwarts legacy. Right. Yeah. But who only has an Nintendo Switch? Hogwarts did.  Was Hogwarts on the first? Yeah. I think it came out. Yeah. Yes. This is just too version. Yeah.  And I'm wondering if the mouse pointer will work as the wand or something stupid or other.  I don't know. I want to hear from you about a review about the mouse pointer. Before it  night or something. I got these are the things you got to check in on. You got to play the  legless simulator. Okay. So I will absolutely do that. I hope the weather better be nice.  I would love to do like deck mode, bring a keyboard in a mouse. You know, I'm my deck and play Fortnite.  What's the point? You care about it in a mouse. We're talking about using the joy  con as a mouse. You have to test that. I want to try both. I'm going to try both. All right.  I can't wait till they release like Mario and you just hold his head and he's a mouse. And they'll  just have all these different Nintendo characters as mice. Yeah, or where is Mario paint? Like John  said, like you have Mario paint was a no brainer. Like they didn't, they showed that you would  tech demo with all the stuff you can do with the joy con like paint.  Yeah, I'm sure that's coming though. They're going to have something just like they did with the  the infrared stuff on the switch. They had a huge, they were plastering that everywhere for months  when the switch came out. Yeah. And the way you could connect to switch screens on a table together  and play the game like through the screen. Like, you know what I mean? You can transfer something  from one screen to another. There was very, very few games that use that technology, but they did  advertise it. Oh, I know. Like Labo, I know you put together for six hours, one of the last  couple. Yeah, I know. Labo 2 is going to be cutting out of CNC steel. I mean, I've said this before.  Like they always do this on launch. I remember like, I got the 3DS. They, they showed the AR  stuff that you could do. And I had the AR cards and you know, Mario is on my coffee table running  no one ever did anything with that ever again. Like, you know, it's just like in the tech demo. But the  model is short lifespan. Yeah, but they do these tech demos. Like, like, they just think about like  even the switch, like that fucking boxing game that arms, like, you know, like, you know, everyone's  going to box with the joy cons and none of that shit ever happened. I haven't seen anything about  marathon tomorrow at the Sony event. I think it's dead. I think it's dead. Marathon fans convinced  game will be canceled as Sony halts marketing plans. It was supposed to be shown. If it's not,  it's not, yeah, if it's not dead, they're going to hide it out for a bit because of the controversy.  They're going to wait it out and come back with like a big plan and like a big, big,  extravaganza for marathon. I mean, I'm on the website and the look of the game hasn't changed.  Yeah. I mean, they probably removed some assets that were direct, you know, ripoffs. But  it still looks the same. I don't think it's going to,  I don't know. They're fucked. Yep. You know what? I'm getting, I was getting a vibe initially when  I first got my PS5 and there was no games. There was like one or two games. I think I played Elden Ring  and COD, Black Ops Cold War. And that was it. I didn't buy a single game for the longest time.  I think about it takes two. And my PS5 has been sitting dormant for months. I haven't played it.  I think I played split fiction. That was the only game in the last two years that I played on it.  And I was worried Nintendo was going to do the same thing. Like the switch to was going to come out.  There wasn't going to be anything. But they have a year plan of tons of releases of their main  IPs. I think they're going to succeed. I think people are going to want it. They're going to want  to play their IPs, their favorite IPs. Mario Zelda, Pokemon. I think they're going to do well.  I think it's going to be a good release. I saw people, I saw people. I saw people. No,  I was a normal person doesn't even know that. The screen's like way bigger and more vibrant.  No, no, no. It's a fucking OLED. No people don't know. New LCD technology.  Like just because Matt Bradford didn't know if he had a 4K TV or  not does not mean the average gamer doesn't know that John people understand technology  more than you think, especially younger people. You know, maybe not a 50 year old guy that  you're, whoever you're portraying in your head, but you're telling me a 29 year old doesn't  know what an OLED screen is. I don't think it's part of everyone's lexicon on it. Like  no, I don't. I think the average shopper at Walmart or Target doesn't know. I'm just  speaking about like just people, the general public shopping for shit, you know, they're  in a Best Buy and it's showing some fucking demo on the screen. They go, that was good  honey.  You should be surprised how stupid people are. It's not wrong. I think it's an old  person thing and out of touch. I feel like, no, honey, I said if I do. All right. Apparently  you guys said it. We got 58. I think now we're going to get the angry emails from the  the others. Again, that you're using them for your dumbers. Piss them off. No, that's  a very nondescript thing.  The shopping desk. Is that even still exist? Yeah. Okay.  We go to the hills coming back. That's gonna be great. Apparently Hank took a trip to  Saudi Arabia for like 10 months or something. And he comes back. Yeah. I think though.  OLEDs are at the entrance of every Costco for the past five years. Everybody knows what  it means. I think people do. Yeah. I don't know. Every cell phone made in the last five  years. 10 years has been OLED. No, we're some four. Why are you talking about that? We better  move on.  Your phone is not OLED. I got L.G. Thank you. Not my L.G. Yeah. I guess I'm just, I live in an  area where there's not a lot of dumb retards because I live in a pretty much, it's a pretty  tech friend we see about. I don't want this guy. I don't want this guy because I think  people know what OLED is. No, I just think people are people that are listening to a gaming  podcast and buying gaming stuff probably have an I'm talking about. I'm talking about the world.  You're talking about the world. Whatever. Whatever. Whatever. You know what? I said I think a lot  of people are going to wait for the OLED because that's what I'm hearing from our listeners  listeners and maybe our listeners have a little bit more tech knowledge than the average  guy in Sri Lanka. Okay. Sri Lanka. Yeah. Cause you're saying you're talking about the  world. Like I got to be concerned about what's happening globally with people's knowledge  of OLED. Most people cave in what like what?  Listen, the screen's bigger. It has HDR. It's 120 Hertz. It's probably a much better LCD  technology than we have now. Yeah. I think it's gonna go care LCD to that screen. It's  gonna look a lot better. But I said, but people like John, we've heard them. Ryan, you were  just one of them that you were probably going to wait for the OLED. I don't think that  that's an absurd thing either in case you have a round. Okay. To make that declaration. You're  saying I'm not going to play any of these games for five years. Cause that's what we're  talking about.  Maybe they'll emulate them on their PC. There's five years. Okay. I'm telling you there's  no OLED.  There's no, there's no OLED. This Christmas, I assure you, that I'm going to just go  on my own.  Oh, that's good games out there. You're telling me to go on my own highlors and wait  for two years to play games. There's all kinds of games coming in July. I want to play  the Donkey Kong game. It looks fucking fun to me. But some people don't care about about  our other side lines. They'll pick up free some people. And if I was to switch to, I would  wait for an OLED in the next Zelda game. I don't know what OLED is. So, yeah, I don't  get a shit about that. Listen to this podcast. I'm not waiting two years for this to happen.  I mean, it's not, I know you're not this Christmas, but not everybody is. Some people are  like, I'll wait for the Mario platform game. There's going to be other games.  Okay. So you can't mock these people and say they're stupid because look, I get what  they're saying. They're waiting for the next Mario platformer or a Zelda game. And by that  time, it might be Switch OLED time. I get why people are holding off. I don't think that  was originally my plan to wait for Pokemon and the OLED. But if, whichever one came first,  that was gonna buy. So people may not care about Mario Kart or may not care about the Donkey  Kong game. They might be like, show me the next Zelda, show me the next Mario game. Then  I'm going to pick one up. But there's Metroid. There's everything else is coming out this  year. So it's not just the Metroid looks like a game, cube game and some people may not care.  But look, some people are like Zelda and Mario. Well, sounds like they don't like anything.  So why are they even considering it? Okay. So everybody talks. They hate everything. They  don't like Mario. They don't like Mario. They don't like Mario. They don't like Zelda.  Why are you taking what will Ryan? Why don't you not? He's not though. He's not because  he has a Jewish fucking tunic on right now. Yeah.  He said he was waiting for an OLED, one of the people that told us that.  I don't think that makes him a non-Nintendo fan.  It means that he was waiting for an OLED.  People are also skeptical of buying it now.  John wants people to buy this stuff.  They want people to buy it twice.  Maybe not.  I want to buy it twice.  Three times.  Listen, bring it on.  Let's do it.  You're a fan.  If you're a fan, you'll find a way.  If you're a fan, you'll find a way to buy the Switch twice, guys.  So if you want to...  No.  ...if you want it for the OLED, you're not an Nintendo fan.  But tell people to wait for the OLED is bad advice.  You're telling them...  Just wait.  Sit in the corner and miss everything for two years.  That's bad advice.  That is bad advice.  Waiting for the next Zelda.  And finally...  You might have an OLED in your living room.  Do you have an OLED in your living room?  Did you know you could plug that into it?  I thought people didn't know what that is.  They don't know what it is.  Well, you do.  I'm just telling you.  Nobody knows what it is.  He's telling me you've ever heard of it before.  You said that you don't play him in his living room.  Okay.  So I got news for you.  One of my...  ...plug it in your TV.  Okay.  First of all, I can emulate any game I want.  You tell me what I play right now.  I'm going to play Mario Kart fucking bumper cars for toddlers.  I'm going to play Donkey Kong.  You hate everything.  No, I don't.  I like Zelda.  Yeah.  And I like Animal Crossing.  And I don't see them out.  Do you?  Okay.  So then just wait for years and miss everything that's coming out this year.  Doesn't make any sense.  I know.  I'm waiting for you because I'm not going to get a Switch.  I'm talking to our listeners who have said, I'm waiting for an OLED.  And you're saying they're dumb and not Nintendo fans.  And I'm explaining their special.  I didn't call anyone dumb.  I was saying that most people are in the world don't.  Maybe know what OLED difference is when they see something at a store.  What do I care about most people and talk about our listeners that some are waiting for an OLED?  But you're blank and saying that you're hearing that people are not buying this.  From our listeners, who do you think I'm communicating with?  I thought you were talking about the general public.  I don't speak to the general public about the Nintendo Switch too, John.  But I'm using your comments to the world right now.  Okay.  What world that can't hear you?  I'm talking about people listening to our show.  So what do we care about the general world?  You're paying this picture that it's going to be a dismal failure because it's not OLED.  And I'm telling you, I disagree with you because most people don't have a fuck.  And the people that want are going to buy it.  No, I think a lot of our listeners are waiting for OLED.  I haven't taken a survey.  To when?  But till when?  Till when the show.  What are your instructions for them?  What is your best advice?  John, hold on.  Okay.  So when is it?  Why are you blaming me for the things they're saying?  And I don't have instructions for them.  But if I was going to give them an answer to it.  I've seen the habit.  Why is this one still ball?  John, if you were in our community at all interactive with people instead of being in your ivory tower  and just coming down into our page channel once a month, maybe you'd have more of a pulse of what's going on,  including one of the hosts we have here who said he was in himself probably waiting on planning for the OLED.  But he's not waiting.  Well, it's not because situations have changed in his life.  So, you know, just to pull back the curtain, John.  It's not my idea.  It's just things.  What people are saying.  Yeah.  So because Ry is going to be our third host and we'll talk about that in the 17th,  he's deciding to look for a switch now, John.  His situation has changed.  So what are you doing?  Yeah.  Congratulations.  Congratulations.  Congratulations.  Because people didn't already know because he's back again this week and is coming back on the 17th.  But I'm just saying, you know, be if people are waiting for the OLED, including Ry,  that doesn't make them dumb or not.  You're child.  You know that honestly.  Thank you.  I'm a child, but I'm the one buying a switch to him playing Mario Kart and calling people to do that.  I do a video game podcast last time I checked.  I mean, OLED, not fans.  Because it's bad advice.  You're telling them to sit around for a year.  This is not my advice.  This is what they are saying.  I didn't say this is my advice.  My advice is to sit around if you want to play.  It's what our listeners have told me about waiting for an OLED that they're waiting for an OLED.  This is not my advice.  Okay.  There's nothing to do with me.  What is that?  My advice.  How is the fact that Ryan was going to wait for an OLED?  My advice.  That's not my advice.  Okay.  And like, like he is piecing, John gets upset when people call Grey Zone a Tarkov clone.  Okay.  Maybe that was fun.  Maybe it was funny.  I mean, people all week about this.  Okay.  You're very sensitive.  You're very sensitive about it.  It was it was funny.  But John, stop blaming me for listeners saying they're waiting for an OLED.  You're telling people.  Okay.  We're going to have round tables.  John and I are going to play on this.  Michelle's going to play emulation.  Oh, my telling people to wait.  I know.  You're waiting for the OLED.  Yeah.  Boom Tapu can't last in our Discord board that a day without coming and going because he's  fucking unstable.  Let's get advice from this guy.  Okay.  He's a troll perpetual troll.  All right.  So tell people how to find this.  Well, if you want to find us and congratulate Ryan as our third host.  And by the way, we're going to do an official announcement on the 70.  But you guys already knew because he's the only guy who's been back like three or four times and he's coming back again  17th, but next week we're gonna be talking to a Molly. We are going to be talking about his valve trip and John switch to which you should not  Wait to get okay. You should not wait to get my advice is go buy it now and then go buy it again  Even if you don't want to play Mario part and you don't want to play  What else is out? I don't know there's the switch to version of a split fiction. So that's my advice  wheelchair basketball will tear basketball go out and buy that switch to right now  buy it twice by it three times and  Congratulations Ryan for our third host. Thanks. You. We will of course. I do a big celebration on the 17th  But I think it's good to announce this now because get to know him come on down  He's been gaming with people  We optimize the semiconductor  For high performance in a handheld device  Come down live and support him on the 17th. I if you want to say hi and you're  Happy that you're  So yes, so come on down live on the 17th and let's have like a good walking welcoming for right as well  I'm push at TV slash John and Michelle I'll be water sons of his and then of course next week  We'll be John which to give best the trip inside Nintendo switch to is unlike anything. We've built the forge  The most advanced graphics  No, it's been spamming right the hard lines and deeper shout out to you  That's a port backward compatibility  dedicated AI processors to shark  You want to find us during a week on the video  Elder and I read in our discord play with us shout out  We're not we're not we're not nobody really listens live. We have  This we we're recording a show for people that download it the next day like all of our listeners  So you want to find us during a week come on down to video game outsiders calm  We've got a discord contest from CD keys to an elderly night rain and of course  Let us know are you waiting for switch OLED? And if you are why is that my bad advice?  All right, we're done  I'm using up all of my oxygen  Can I plan to get you back again?  Treat her gonna please get our heads to  I know how to get  I  Know you sense the change in every day  You can a straight way  time  Feelin' weak in the knees, Forget our history, cause  I know how to get you back again, ooh  We never let alone, we never listen to our hearts, we never take charge  Until the one we want is gone, we never let go of the lovers that we've lost  We never take the voice to ours, but I'll get you back again, I'll get you back again  Feelin' weak in the knees, and I'll get you back again  Feelin' weak in the knees, and I'll get you back again  Oh  Oh  You  You"