" Hello, lollie. Hello Reini. How can you believe that we are in person? We are coming  to you live from the Gold Coast Reineys here and we are dumping in two. There's a lot of  dumps and today's episode. Oh shit. Apparently there is. We are jumping in the wild the crazy  Aaron, Patterson case, the mushroom trial, the deadly beef.  Wellington.  Ah, I'm so excited.  Look, it's a terrible crime, but oh, it's good to talk about.  This case is everywhere.  We're gonna talk just a little bit about it  in the beginning because I'm having some caseings  on it today, Rani.  Don't worry, I'd say I'd have a bad account.  I can't.  I have consumed hours and hours and hours and hours  of trial content.  There are three amazing trial podcasts out there.  I've listened to all of them.  I've done all the research.  I feel like I have Aaron, Edison scrambled brains for eggs.  Scream on eggs with brains.  But I'll say one thing.  You've got all this knowledge that's just sitting in there  that's just gonna ooze out during this podcast.  All of a sudden it's gonna ooze.  A lot of things ooze down in this episode today.  So I just came in with a lot of shit in today's episode.  That's a real poopy time.  For someone who doesn't like to talk about poo,  I'm gonna be talking a lot about poo.  I'm going to be talking a lot about poo.  I'm with you on that one, Molly.  I don't really.  I don't actually do pooze.  So it's gonna be really old, but I'm gonna talk about it.  I know.  It's a real life thing.  Can't really lie down my lady.  I'm gonna jump on it.  Show me.  Take it away.  Take it away.  Take it straight to the door.  28th of July, 2,023.  In the little town called Lee and Gather,  just near Mallon, Victoria, Australia,  Aaron Patterson, or say he's a takes message.  It's from her Australian husband, Simon.  And this takes message reads,  I feel too uncomfortable about coming to lunch with you.  Mom, Dad, here they're an Ian tomorrow.  I'm happy to talk about your health and implications  of that at another time.  If you'd like to discuss on the phone, just let me know.  Aaron is a little pissed.  She's been preparing for this lunch for quite some time.  She replies, that's really disappointing.  I've spent many hours this week preparing lunch for tomorrow,  which has been exhausting in the light  of the issues I'm facing.  I've spent a small fortune on beef.  I fill it to make beef wellington's  because I want it to be a special meal.  I may not be able to host a lunch like this again  for quite some time.  It's important for me that you're all there tomorrow  and that I can have the conversations that I need to have.  I hope you'll change your mind.  Your parents, Heather and Ian are coming tomorrow at 1230.  I hope to see you there.  Oh, manipulation isn't it?  Wow.  These two have been separated for a little while since 2015.  They shared two children together.  For a while, things were pretty good.  It was an amicable split, but things had turned pretty nasty.  You see, in 2022, just the year prior, Simon decided  that he was gonna file his tax return  and list himself as separated instead of married.  Oh, dear Lord.  Although these two have actually been separated for some time,  they've never divorced, but this is the first year  that he's decided, you know what?  I'm gonna list separated.  It's about time.  It's been seven years.  But unfortunately for Aaron, this causes some problems.  What are the problems?  Does she not get money?  So with him filing a separated,  it will change her tax situation  and she'll have to pay more tax.  I see.  It'll also change the child.  What's that word?  Child support?  I can out.  Also, it'll also change the child's support she's getting.  So really, in Aaron's eyes, it kind of fucks her a little  and she's pets.  I wanna just go into a little bit  about Aaron's financial background.  She inherited some big dollars.  Wow.  Her nan passed away long time ago,  before she met Simon, early 2000s,  and she inherited two million dollars.  Ooh, that's a lot of money back then.  Unfortunately, her mother also passed away in 2019.  She inherited a lot more money.  So Aaron is financially doing okay.  But with Simon adjusting his tax return,  she's gonna have to be giving more money  to the tax department and her child support  is now gonna go down to $40 a month.  Well, that's about $18 more than I get.  Sorry, it was.  Oh, not anymore.  Ha ha ha ha.  What do you do with $17?  What do you do with $40?  $17 is enough, Lolly.  It's not enough.  It costs you $300 to leave the house every day.  I know.  Aaron's pissed.  Things haven't been great,  but she wanted to put on this lunch for Simon,  Simon's parents, Don, and Gail,  and also Simon's aunt and uncle, Heather and Ian.  A real family affair.  Wow, isn't it?  She really wanted this to be an opportunity  for them to all get together, have a lovely time,  a lovely family time, but also Aaron has some health concerns.  Oh, dear.  She needs to share a pretty serious health updates  and get some family advice on how to move forward.  Well, fair enough, she's got no family of her own.  So she does.  Between now, the July, 2023 rolls around.  It's a sad day.  And Aaron is busy away in the kitchen,  prepping B-Fwellington.  It's a big meal to prep.  It's a fancy fucking sausage roll-ups.  Ha ha ha ha.  It is.  I've made it a couple of times.  It's actually really nice,  but it is a big jar of salsa drop.  This is a meal that she wants to put on  to impress her guests.  Now she's using the recipe 10 Eats Cookbook,  page 252.  I have the cookbook.  It has a six-page recipe for it.  For goodness sakes, well, six pages on this.  There's right, six pages on how to make a saucy roll.  So she is busy.  She has been spending all week buying ingredients.  This recipe contains eye fillet, lovely delicious pastry,  and you make what's called a duck salad,  the same mushroom paste.  A duck salad, yeah, you're simmering away, you're cooking away,  and you make it all delicious and yummy,  you're smeared all over that leaf log,  and you wrap it up in pastry,  and you cook it to perfection.  Yep, for few more steps in there though, I must say.  Six more pages of steps.  So Erin is cooking away.  She's got her two kids at home.  She decides that she's going to send the kids away  for a little movie date.  They don't need to be for this boring lunch.  Oh, how old are the kids?  There is a teenage son and a pre-teen daughter.  So, a teenager.  That's right, a teenager.  I can't.  As I make a bit of an age.  I mean look, my child is perfect.  So no.  But I'm in the pretty cute ol' ages.  There's a c 50 pages still ages.  Yeah, me and everybody in all ages, we're all a bit c c c c c.  I can be c c c c c c e all the time.  I don't shitt.  Me too, my bad, just so you guys know where Fersey is in the room today.  That's why I'm feeling a little awkward.  I'm like, ooh.  She's performing for the first time in a life, Erin.  life. Aaron had a hard time rainy finding a giant log of beef, I feel it. Oh, it's not that hard to find.  Well apparently it was a bit tricky this day. She found some mini packs of logs of I feel it.  So it's just pieces of steak. Well yes, I guess so. I guess that's what it is, right? Just an  eye-filling at the end of the supermarket. So it will worst she'd found some two packs of I feel it,  so she decided she's going to make some adjustments to the six-page recipe and do individual  beef, Wellington parcels. Little pockets. I mean it's a bit more work for yourself. Just go down to  the butcher lady, find yourself a log. Yeah, it'd just be the easier thing to do. Not fair,  the supermarket sell I feel it logs to. Well Aaron doesn't have time for their loves. She's making  six individual beef, Wellington. It's going to take a few weeks.  Lunchtime rolls around, Randy. 1230.  Ding, ding, ding, ding, ding. Hungry. Hungry.  Up the driveway. Aaron can hear the crunching of gravel underneath the car tires.  The car pulls up and lovely, gal and Don. These are her in-laws, slash X in-laws, and  Heather and Ian. The car pulled. They've all come together. Just a little update on ages guys.  Aaron is in her late 40s, about 48. And Don and gal are 70. Heather 66 and Ian, he's nearing 72.  Oh, they're not there all now, they. It's pretty old loves. Oh no, man, 66. I'm sorry to bring you to your  love. It's pretty old. Oh, man, I apologize. Well, listen, I mean, look, think about it. If you're  lucky, you're going to give another 20 years. If you're lucky, I thought they were their eighties.  So they want to mean five? No, fine. No, it's five. Yeah, he's the end of your run anyway.  That's expired, you know. I've got a good run. I reckon we need like, see us and say because my  parents, they're very young loves. They're still got a good like 10 years in you. Until you get  in your eighties and you're a bit more decrepit, you know. There's no point making it to the 80,  you're fucked. You might as well just tap out. Now that the night has you fucked, yeah,  make it to eighties. I reckon the good age is like, you probably like 85. You're like,  I'm out now. But we're the buzzer. I'll do you and you do me. Little tricky.  What does part of the photo? Together. That's that perfect. One, two, three, go.  So the guests have arrived and look, it's just a lovely family time. Aaron has recently been renovating  the pantry. She's got a Butler pantry situation going on. Heather and Gail being the lovely older  ladies. They are curious. They're interested in pantries. This is like a scalary or what is a Butler's  pantry. Same same. A hidden pantry we can keep with your mask kind of thing. So you know,  a bit is always like little plastic containers. Everything's got its own label.  Oh, dreams do come true. I don't have to try it. It doesn't work. The container's coming into  my bath. I can't be bothered keeping it in this bag. You know, you want to make it all nice and  pretty. But that's got time for that. No. So Aaron's giving the ladies the tour of the pantry  are checking out the garden. It's a lovely time. It's a rural area. There's land and nature everywhere.  Possibly. You know, let's pretend. We'll say this chickens. Okay. If they're not into a house,  that definitely around the vicinity. The lunch is almost ready, Randy. God knows how Aaron  timed it because she's got individual pockets. Pockets. But they are ready to go. The lovely  ladies, they come into the kitchen. Aaron Dowling, honey. Do you need some help plating out the lunch?  No, no. You're my guest. I've got her from here. That's your call. I'll be out there in just a minute  where they all like initials on them. Mine. Well, the guests are all seated waiting for the lunch of  delicious beef Wellington, outside of mashed taties, green beans and Aaron ran out of time,  so she's got a little packet gravy on her hands. Oh, Aaron. That's the real crime, which  ladies and gentlemen. Don't take your own gravy, sweetheart. God, you can't be eating packet gravy.  You can't. It's not right. It's terrible. Mom, you can though. We love you.  That's right. Mom's a good packet gravy. I know. Just boil the jug and  dig, dig, dig, dig. Where you go? That's lovely, man. It's easy. Aaron comes out. She plates.  Don, her delicious meal. Served on a large white plate. Gale, her delicious meal. Served on a large  white, slightly grayish plate. Here they're, and Aaron also get their lovely.  Mill served on a greyish white plate. Finally Erin goes and clicks her mill and she sits down.  And the guest noticed she's got a slightly smaller plate, it's orangey in colour,  she's obviously ran out of her fancy lovely serving plate so she's just going to skim  out and have one of the ship plates. Sometimes they only come in and sets of four.  That's true, it's weird isn't it? So we're like love's mismatch plates.  Do you? That's why I've got nothing matching loves. Oh no!  They sit, they eat, they have a gay old time, they're gay old time. That's lovely.  The guests are scraping the delicious food off their plates,  and the minimum number they are eating it all up. That's delicious.  Gayle, the mother-in-law, she is struggling to get through her whole portion.  She's feeling a little full. This beef Wellington is filling. So Don,  not wanting to leave anything behind, says I'll finish that for you, Don.  And Don proceeds to eat another half portion of a beef Wellington.  Well, well, well, have a bit of a giggle because he's helping his wife out.  It's lovely. Now they've finished their meals and it's time to get serious, Rani.  Erin has brought her guests to the slunch to share some pretty sad news.  Erin has been facing some serious health concerns. She has been in another hospital,  getting tests. Her mother-in-law is aware of one recent test that happened on the 20th June.  She had a little lump on her elbow and she was in for biopsies and MRIs.  She's been a terrible time. Well, the elbow, she has just found out she has cancer.  Elbow cancer? Well, I don't believe the elbow lump eventually went into cancer,  but it's of the cervical or ovarian kind. Oh, dear. Now she needs some advice on how  she should go about this touchy topic with the children. Should she tell them the truth,  or should she just go through the motions of treatment and not tell them just yet?  That is a tricky question. While all of the lunch guests suggest to do the right thing and be honest,  yeah. So I haven't just closed this, but this family is incredibly religious.  Pritions. Love the Lord. Family of God. That's right. Ian is actually the local pastor.  The Lord is the Lord. The Lord is the Lord.  The Lord is the Lord. We are in a training. Ian would like to say a little prayer,  and so they all hold hands. Maybe I'm not sure what it's just between they do and they bow the heads.  I always think that's the best option. Hold on. Something's wrong. It's just to pray.  Oh, yes. Okay. This option is the whole day is to pray. Yeah.  Dear Lord, please watch over. Lovely earring. And sure she gets the care that she needs.  Give her the strength and wisdom to tell her children.  So nice Ian. Does it ever work though? Well, in this case, it's not enough.  So they finished off their lunch with a little dessert,  here they're gals did bring a fruit platter and an orange cake,  but they're quite full from the lunch. They'll have a little nibble,  and then the lunch comes to close and they all part ways.  Now that's that. The kids come home from their movie.  Aaron does a little cleaning. Now that is where the store should end,  loves to sineys little Saturday lunch. Saturday, the 29th of July.  Don and Gail. So Aaron's in laws. Her strange husband's parents are at home.  They're starting to feel a little unwell. It's not like a sign is it?  Sine sensations of nausea. Tummy cramps. Oh, that first little new wheeler.  Where's the sky? What was that? Is it just a freak crap?  Or are we in it with a long walk?  Is it a star of an eruption? I would never have never ever been.  I never have either. Oh, I guess.  Oh, she was sorry later. Maybe Mark can come and tell the story.  So Don and Gail are not feeling great. A little queasy in the tummy.  They think it's just got to be hopefully nothing that eventually.  Midnight symptoms become pretty bad.  I mean, you're going to know straight away what it was.  It was the orange track.  They begin to suffer from bats of diarrhea.  Doesn't tree. Do you know that?  I always shouldn't talk about it. But I think this is a bug, but diarrhea is like,  you know, maybe like, really bad.  So Don and Gail are suffering from bats of diarrhea every sort of 30 to 45 minutes.  They've got two toilets.  Well, then the vomiting starts. It's coming up at each end.  One of them is running to the laundry.  One of them is running to the bathroom. That tag teaming. It's really bad.  Oh, no, they've only got one bathroom.  Well, I don't know. I guess so.  Wait, there's a laundry and a toilet involved.  Well, who knows, maybe the laundry was closer.  I don't know the land of the land, right?  But all I know is that the laundry was involved.  That's bad. They're poor laundry.  Jesus, you're hopeless. Sorry. Let's just start.  Here we go. No one's shitting in the laundry tab. All right.  They totally are.  I can't get away.  No, because some people don't want to, some people don't want to vomit in a diarrhea toilet.  Oh, we don't want to shitting the cake.  Talk about that.  They're symptoms began at midnight.  And now it is eight o'clock in the morning and things are not getting any better.  It is getting worse. They are running to the toilet every 10 minutes.  Holy shit.  Dawn is doing quite a lot worse than gale.  One, do I?  That's the only thing that this is pretty serious and we should probably get to a hospital.  They call an ambulance and an ambulance would come and collect  Dawn and gale around nine in the morning and take them to the local hospital.  Now these guys live in a regional rural kind of areas and not in the big city.  They're put into hospital immediately. They're hooked up to fluids. They're severely  dehydrated. But the nurse there is noticing that Dawn is really bad.  He is super gray in color. He's really lethargic. He's really struggling to just even keep his head off the pillow  They're really really concerned now at the same time  Simon has been notified how his parents are doing and so he decides to check in with Heather and Ian has  I'm thinking he goes over there now. There's two are on the couch  Clearly in a really bad way. Oh, yeah, they've been up all night diarrhea vomiting  No, it's just honestly it's just gas roll food poisoning. It's got a pass. Because it always does 12 hours  Yeah, you know, it's fine. You can get through it. I mean at this point. They're gonna know like it was the lunch, right?  Well, I'll think they're all putting the pieces of the puzzle together Simon is really urging them  No, no, let's get to the hospital just to be safe. Mom and dad are doing so bad  So let's get you there. They decide to call an ambulance as well, but the triple zero operator says  It's about an hour wait for us to just drive them to the hospital  So Simon being the good-niff you that he is puts his aunt and uncle in the car and takes him to Liam's hospital  Again rural regional his parents are in a different different hospital  This is a small medical center. They don't have a lot of staff and you need to go on buzz to be led into the urgent care and  Dr Chris Webster is on the shift for the evening. He is quite the character  He's got a bit of a mohawk hair do he's probably wearing a scrubs, but in this normal day life  He wears bright colors and patterns. They've got slowed booming voice and he greets hither and in at the front door  brings them in chicks all their vital signs hooks them up to fluids and is thinking this is probably a case of pretty bad food poisoning  Sounds like it this poor guys working a 24 hour shift. Oh, no 24 hour shift. It's not the safest thing is it  We were already about zooming hooked up to right Sunday rates is pretty good paid for in a box now  Now this is just the next evening from the lunch  So let's see how Aaron is doing Aaron to his being suffering from some gastros symptoms rainy. Oh dear  Aaron was suffering all night bouts of diarrhea  Do some vomiting initially it was about every 10 minutes. It was pretty bad things started to settle  Symptoms were improving the next day. She's got a few things on so it's quite good  That she's not gonna be shitting a pants out in public. No, so it's a problem  Is it one of the things that she has to do rainy is her son is learning to be a pilot?  Huh  Absolutely not how old is he? It's like 15. Oh, well, he's getting some flying  lessons and she used to take him to a flying listen the instructor actually called to try and reschedule  But she insisted they needed to come for this lesson. It's a 90 minute drive  I mean a good opportunity to cancel because you might  She's a pants you don't want to shoot yourself next to your son and confined space  You know, oh, so it's put you went down  but she needs to take her son so they hit on their way and she's obviously got very good but whole muscles because she's holding in a  And they drive it's a long time now. They're in our in 10 minutes into the drive to the location where the blind listeners  to cool  Hi, Erin  Unfortunately, we're just getting a bit shit out there. We're gonna have to cancel the listen  Ah you'd be pissed you would be pissed areas is driven in our in 10 minutes with severe diarrhea symptoms  But she hasn't poo to pants yet, so it's totally fine  She turns the car back around and she heads home  20 minutes. I mean it's a long way. You're not going anywhere for two hours and 20 minutes at a car when you've got diarrhea  You're definitely not your bang arm with that one. Should we tell my story?  Story time  Mark first you give me permission to talk about your gastric story. Oh  My god, this is one of the most horrific things I've ever heard and I've heard a lot of bad stories on this podcast. It's not right  Randy we are just going about alarm smart as a gig is in this classic rock cover band in the bloody fantastic  They're called the filthy animals  who marks one of the singers and they have a sold out show on Brisbane  So now it's drive away and I'm at home just mum and you know and we've had a few  Gastro bugs just a few not too many but a few mark gets it real bad because men always get way  So good because I'm fucking posse  So I am at home  I actually vomit last oh god. Are you okay? I?  I I know I am actually fine. I just one vomit. I was like Jesus  I was like  Oh  Sorry excuse me, and then I went to bed. That was fine now Mark is on stage. He's rock and rollin got that crowd going  They run swiggling and cheering and dancing and doing the rock horns and he's having a great time  The rock horns as it was cool. Yeah, he fucking crushes us up there. I like I'm telling you to do that on stage  Do you?  He takes a little break a little half our break Mark begins to give some little tummy cramps  And he's shaking up cross  All right, so another whole set together. I'm gonna rock and roll. I'm gonna be a goddamn rock legend  I can't be able to shitting my pants  Hey, those I'm sick. I didn't shit myself because I don't do that  But Mark had a guest or a stop to stop the symptoms as a pill and some pill. Yeah  So here's a pill and then he gets back up on stage and he rock and rolls away  And I mean you think he's sweating up there can lose off, but he's really sweating out there because the symptoms that he is experiencing is getting pretty bad  So many cramps  Oh, he's done with us. Flushes and he is really too unliket on a toilet bottle  I'm sure the finish is he's sweating these  You know tints and a smile  Like trying to just like get through it and then of course everyone comes up to like be like yeah, there's amazing  And then he rushes off to the bathroom  I mean it is all go. There was no guy really bad just vomiting. He's a little scared. I know but like  Dan doesn't tell us like  What the fuck is like giving birth to crap fucking satia than there?  So he is vomiting away and he's like right. I just got to get home gets in the car  It's an hours drive he is praying to baby more than jeez  I just got to get through this hours drive 10 minutes down the road  He has to pull over and he starts feeling his gaps out on the side of the ride  You poor poor man. He feels a little bit of a head get spaking the car  He's like we got this  On the freeway he's going 100k's an hour. Oh  Christ here it comes again. He pulls over he jumps over the railing and like there a car zooming past four five lanes  It's probably also like snakes and god knows what out there  But he doesn't care about that because he's got a vomit and he is vomiting away  And then he is a car pull up and someone gets out the car and it's like a roadside assistance  And I'm like you ain't made has a going and obviously looks like my drunk spewing  My I'm not drunk. I'm not drunk. I'm just I've got a gas turbine  The guys is well look mate. You can't stop here because every time you stop one of us is gonna come behind you see  So he's like oh Christ this guy's on and on and on he's driving a few probably a hundred meters down the road at this point  Pulling off his feeling and then rainy the pulling begins  The guest will stop has stopped working  So he now has to try and find somewhere because it is  Next to do explosive diarrhea and vomit he goes to a petrol station, but it's nighttime the night windows are  You can't go ahead. He's like what is I need you to buy a thing?  There's always street you to surround the light you can't go many a hunched over  He's up and back to the car he pulled off down the road. We managed to find a bus to me release about  Yeah, it's about at this point. It's hours later like it's probably two hours later a severe hour drive a  few more stops a few more emptying up the bowels  Couldn't find a toilet  Pink falls into a car fight. That's a came up five-year mark lumps lots of open space big street lights  CCTV  You need to take a bow again. There's only one thing you can do in that moment any holes onto the front of the sky any drops  Out in the open street lights  CCTV  And he just starts doing bumbies to develop it same time and it's funny and he's bumbying  For all the way to say he finally rocks up home for an hour of hours later  And that was probably one of the most traumatic things that ever happened to him. Oh god  I just need to share it because here you've got Aaron who is  Experiencing some pretty severe gastro sometimes and she's managed to a two and a half hour drive round trip and hasn't pooped anywhere  For anyone to see this but  She is not doing great. She's come home. It had a little bowl of cereal, but that did flare the symptoms up  So she's thinking I better get into hospital and get some  Fluid checked out. Yeah, she's thinking she's a little dehydrated  So she's gonna take us out of hospital at this point  She is aware that all of her lunch gets are in hospital with some pretty severe gastro symptoms  You feel pretty bad one. Yeah, you would feel pretty bad  But you know, maybe I was contaminated meat not her fault. Okay, so she's gonna hit into hospital  But she decides she'll go the next morning. She's just gonna sleep through the night  See if she's any better in the morning back to Don and Gail. They're not doing great  Don is very bad  He is so bad that they need to transfer him from this regional hospital to the Dandenong hospital  And this is at 10 o'clock on the Sunday night the day after the lunch. Oh  There is more tests done on Don to see if they can figure out what's going on some of these tests show severe metabolic acidosis  This is pretty bad organ damage specifically the liver. Oh now  The doctor is feeling super concerned because when you have food poisoning  You're not typically seeing your organs fail. No, this seems like it could be a poison  So this doctor Morgan rings a doctor Mark Douglas who is a hospital toxicologist to discuss these test results  This toxicologist see  Is it possible that they have  Consumed a toxic mushroom  Wow straight off the bat straight off the bat  They know that they've had beef well into they know that there's a duck-soul mushroom mix  It's obviously not the meat could it be that they've been contaminated with a deadly mushroom mushroom. It's a poisonous rainy  Yeah, many kinds can kill you  Dr. Morgan isn't really sure because she knows that Gail isn't as bad as Don so maybe Don's got some underlying health concerns  This doctor tracks down the other lunch guests here there and in so Dr. Morgan from Dandenong Hospital is  contacting Dr. Chris Webster at the Lane Gather smaller regional hospital and a little like he's still awake  He's cracking on she wants to know how here that an a in are doing and explains we suspect  They've ingested toxic mushrooms. Dr. Chris Weber is startled. He cannot believe it  We bit it get here and in to a bigger hospital as well  So he goes into here there and ends room and it's a big rush  They pull them out of their room and they start getting ready to transfer them to the dandenong hospital  Shit they are preparing a charcoal drink  So with mushroom poisoning it does affect the liver so they're trying to detox the liver  So they're getting here they're in activated charcoal drink and they're getting ready to transfer them to dandenong hospital Monday rolls around  I guess for August August August August August August  I got the dog.  Erin wakes up.  She's still not feeling great.  She's like, I beat it, go to the Ling Ethos bottle.  She takes her children to the bus stop.  They need to get in South to school.  And then she heads on in.  She walks up to the door.  The door is locked.  So she does the little bus.  Alad, booming Dr. Chris Webster comes on out and says,  How am I now?  What can I do for you?  She explains.  I myself a little bit of gas joint.  My name is Eora Patterson.  And Chris is like, how are we beggars, Lani?  Not another one.  I'm expecting you.  You are the fifth lunch guest.  All of your other lunch guests are in pretty bad condition.  And we need to get you in a fit treatment as soon as possible.  We suspect you have ingested a deadly toxic mushroom.  What are the chances?  He leaves Erin with the nurses to get her ready to be admitted  into hospital and he heads on his wife for a few minutes.  Dr. Chris Webster is startled when he returns.  Just five minutes later to learn Erin has discharged herself.  Oh, well, you would.  Well, would you though?  No, you wouldn't.  Before we decide what we would do in this situation,  let's dive in to a little.  Science of the crash.  Is it too bad?  Give it to me.  Toxic deadly mushrooms?  What could this be?  I've only heard of magic mushrooms.  Now these doctors are suspecting that somehow these lunch  guests have ingested an amort-neeter mushroom.  Specifically, the amort-neeter for Lloydease mushroom  that is known to grow in the area.  Also known as death cap mushrooms.  Just a nickname.  It's scientific name is amort-neeter for Lloydease or for ladies.  Also known as a death cap mushroom.  So this is just one of the amort-neeter mushrooms.  There's quite a few.  One that you would actually recognize  is called the amort-neeter mascara.  And then it's a little red mushrooms with a little white dots on it.  If they did let, they are deadly.  Do not consume.  They're everywhere with a crush.  Really?  Yeah, they're just like in the middle of the island road,  the other day when I was driving.  Do not touch those bad boys.  I know they're not supposed to touch them,  but they're just growing your backyard.  Yeah, they just growing your backyard.  They do.  So these innocent looking fungi are actually among the most poisonous  in the world.  Wow.  The amort-neeter for Lloydease mushroom is known as an ectomycorr,  ooh, an ectomycorrazole, an ectomycorrazole.  An ectomycorrazole.  Fuck.  ectomycorrazole.  My core has out.  These long words, you know, they give me every time.  These are known as ectomycorazole fungi.  And this means they form a symbiotic relationship  with tree roots, especially oak, beach, and pine trees.  They exchange nutrients for sugar.  So the trees will give a glucose made from photosynthesis  to the mushrooms.  And an exchange, these mushrooms will give the trees water  and minerals that it pulls out from the soil.  So far.  A loving relationship.  Harmonius.  Working together.  Beautiful.  Now beneath the soil, these mushrooms form a vast web  called mycelium.  Now this acts like a brain or a nervous system  and it communicates along its whole web.  This covers massive amounts of ground.  It's as beautiful and intricate web.  And then it's certain times of year,  the little mushrooms will pop up above ground.  So when you see these mushrooms above ground,  just know they are part of this huge network  beneath the surface.  It's incredible.  And these mushrooms will pop up out of the ground  around March 8th, May in this particular region.  Amongst these fascinating facts, they are also,  as I said, the most poisonous mushrooms in the world.  They contain a deadly toxin called an amatoxin.  Now this is so powerful, it can kill you  with just half a mushroom cap real.  Cooked a lot of mushrooms, either, are they?  No, and the aminita for Lorde's mushroom,  they are quite distinct.  They have a bit of a whitish yellow dome.  And it's a regular stem.  So that you look at them, you could potentially think  that they look like a normal mushroom,  but they have quite a big bulb on the bottom,  like a little knob end, down the end,  like a little bowl be knob.  The end of the stalk.  Yes, so there's the earth, the little knobby bulb,  the stalk, and then the dome.  So it has a bit of a distinct feature.  These deadly mushrooms will target your organs.  Their first point of call is the liver.  They will head to the liver and slowly kill  your liver cells one by one.  Wonder why?  The terrible thing loves is the body  tries to get rid of these toxins via bile from the liver,  but then every absorbs it back into the liver,  repeating this toxic cycle over and over again.  After the liver, it heads for the kidneys, the bowels,  the colon, everything starts to turn to go.  All your symptoms are nausea, vomiting, diarrhea.  All of your cells are turning off, dying, frying, cooking,  and flying.  Too many.  You start to go, jaundice, you'll head into a coma.  Your body is hemorrhaging.  Sips as kicks in.  Wow. You will potentially die within six to 10 days.  Wow, I go.  Oh, all right, I go.  It's a sneaky little mushroom too,  because after consuming, let's say you're out  in the wild, frolicking around.  Ladi-di-ladi-dah.  You see a little mushroom, you're feeling hungry.  Don't do it.  You decide to eat a little mushroom.  For next six to 24 hours, you feel fine.  Not a problem, but then the norda, the vomiting, the sweats,  it all begins to kick in.  Your organs begin to fail, and you will die.  You need to seek treatment.  Immediately, they will use things like activator.  a charcoal ivy fluids, a liver transplant would be your best bit at survival.  Good luck, get on the list. And it's about a 50 to 90% chance of dying after consuming these  mushrooms. It's very bad. See, I don't really like raw mushrooms, so I'll be fine.  You'll be fine. It's not going to go out and pick a mushroom and eat it.  Let's go on those cheesy things. You dip the food into the chendau.  As you can see, they're all fondant. They're fine.  Oh, no. They put raw mushrooms with fondant on my rice. That's right.  So, Erin, she's not too concerned about all this, loves. She leaves the hospital.  Dr. Chris Weber's very concerned. He's like,  What is happening? Come back. Your time. He rings Erin three times because he's like,  What's the best? You need to get back to the Amazon.  Oh, she does an answer as calls. She's too busy. The third call here is a voice mouse is  Look, lady, I'm really sorry you need to come back here. I'm calling the place. I'm  this concerned about you. I'm sending the place off to your welfare chip.  Oh, maybe she's just in denial. She's got to think about her other illnesses.  Almost two hours later, Erin does return to the hospital.  Oh, and she says, Sorry, I just had to go and pack my daughter's ballet bag.  And she ended up having a little snooze. She felt so relaxed. She had a little snooze.  So, Erin is also moved to a larger hospital. She is kept in overnight. They're checking  all of her vinyls that making her do some little poopy samples in the little puddle.  Oh, she's giving multiple samples. When she comes out, she says it's quite watery.  It looks a bit like we and she says to the nurse, it's not we. It's definitely poets.  It's just very watery at this point.  Okay, lady, let them figure that out. Everything is looking pretty good. Vital signs come back  normal. The liver's looking fine. Potassium levels fine. Everything's looking fine. So,  she's discharged. But unfortunately, rainy, her lunch guests are not so lucky.  Don is doing so bad. He is rushed in for a liver transplant. This liver is  turned enough. It's gone offline. Really? How do you just get a liver transplant? There's a list.  Wow. It's an emergency. They must have a back fridge or something. Yeah, they can only get it from  dying people. Well, that now they've actually moved all these guests to another hospital, the  Austin hospital and Melbourne. And this is actually where they do a lot of specialised liver care.  So, Don has received a liver transplant. And now Heather, Ian and Gail are all put into the ICU  and put on to life support. They're all doing really bad. They've been intubated. They are  also going into multiple organ shutdown. Why did he get the liver? Don got the liver. So,  why was Don? Well, Don was so bad because he'd eaten an extra half portion, obviously.  But so he obviously was way worse. He was way worse. Prioritised. Yes. They were going to give  the ladies liver transplants, but they're too unwell. They know if they put them under and try to do  this procedure, they're not going to make it. Really? Oh, gosh. Now, at the same time, Aaron has been  lead out. She is lucky. How did this happen? She must be having a very powerful liver and immune system,  reaction to these potential mushrooms. She's also thinking, how on earth have I consumed  deadly mushrooms? This seems very, very strange. Yeah. At this point, the health department has  been notified because they need to understand. They need to know what is going on.  Sally Ann from the health department has contacted Aaron initially. Aaron's been super, super  helpful. They're asking, where did you get the mushrooms from? I've got one from more  with. She also says she has a little dried mushroom packet in her cupboard that was from an Asian  grocer. So now Sally Ann is singing, well, fuck, maybe there is going to be a potential like public  outbreak. Maybe somehow these contaminated mushrooms have ended up in these dried mushroom mixes  at the Asian grocer. Oh, they do look quite scary. Do this dried mushrooms? I will say that  the doo-o-o-o-o-o-o-o-o-o-o. Yeah. I actually ran out the door. They're just so like, they're just all  these different shapes and you know, like, what is this? Sally Ann is like, listen, Aaron, where did  you get the mushroom mix from? And Aaron's like, uh, baddebri, baddebri, I don't actually remember.  It was, uh, it could have been clean and waverly or listen up for these Melbourne suburbs. It was  definitely Melbourne, South, South Eastern Melbourne region somewhere. Sally Ann's like, oh, okay, I need  you to think like, we're with what crossroads for around. What was the packaging like? She's asking all  these questions. She needs more information, but now she's finally hard to reach Aaron. Aaron's  not picking up her calls. So she's sending a list of questions to Aaron saying, this is super  important. I need to know, but unfortunately, she's not getting any response from Aaron. At the same time,  the police are looking into the situation. They've got four people that are potentially about to  lose their lives and they think there's a mass food poisoning situation on their hands and the  homicide squad is notified. Oh, this is on the second of August. So things are moving quite quickly.  It's on the Tuesday back to the hospital and unfortunately the guests are doing really bad.  Chase, they're not good. Their conditions are critical. Don's liver transplant is not taking.  Heather, Gail and Ian and Don, they're all on life support. Oh, God. And on the fourth of August,  Heather and Gail, both sisters would lose their lives. Same day, same day. Oh, yeah. I mean, look,  if I was going to die, I'll like it to be on the same day. Me too. Little wee silver lining. On the  fifth of August, Don Patterson would also succumb to his beef Wellington lunch and would pass away.  Ian is fighting for his life. He's in the ICU. He's on life support. He's hanging on by a thread.  At this point, Rainy, there are three people dead from a lunch, one person on life support and  another person doing quite well. Police are investigating and they attain a search warrant and head  to Erin's house who lean together.  home where she hosted this fatal lunch.  They're the obvious choice, wouldn't it?  Erin's home, she's present for this.  The kids of the air, they've also managed to extract  bank records and phone records of Erin  and they're starting to look through everything  to see if there's any suspicious behavior going on.  In the bank records, there is something that  peaks their interest.  A transaction.  On the second of August, so four days after the lunch,  there is a transaction at the Curumbara tip  at the dump.  Erin's been doing a bit of spring cleaning.  Ah, Erin, you just cash girl.  I don't know about you, but if I just got out of hospital  or never around me as an critical condition,  probably not going to the dump, I'm not going to the dump.  Oh, it's just a real hassle, you know?  So the police are trying to figure out  who is at the dump,  disposing of something on the second of August.  They're also at the house doing their full search.  They're going through the kitchen,  they're looking at the pantry, this beautiful pantry.  They find the cookbook, the six page recipe.  It's got some splatters of gravy on it.  There's a napkin bookmark right on the recipe,  so we know that this is what she's used.  Erin is just sitting there at the dining table,  while the search warrant goes on for four hours.  At one point, she asks, can I use my phone?  I need to go and make some arrangements  for my daughter's ballet.  She must be a really good ballet class.  They're so special.  They literally go, she's gone for about 20 minutes.  And they come back and as they are concluding the search warrant,  they ask Erin to hand over her device.  And she says, not a problem.  There you go, she'll say good, slowly fine.  They ask, does it have a pink coat?  She says yes, let's just say it's 6, 3, 2, 1.  She leans over the table and they go to put in the passcode,  but it opens without the coat.  And she's actually visibly a bit shocked.  Like, oh, that's weird.  It's a little weird, Randy, because Erin,  when she ducked off to make that little phone call  to the ballet teacher, she also accidentally,  oh, she wasn't accidental.  She managed to do a factory reset on bone.  Oh my God.  She's just a little wipe and clear of all the data on this phone.  So when she's handed her to the place,  it's clear the pin number two,  she wasn't prepared for that.  And then it's opened and it's like, English?  She's playing her.  Hello, and she's all so managed to remove the SIM card  for another phone and put it into another device.  She's doing all kinds of things going on.  But why don't the police even let her wait with her phone?  And I'm sure, because at one point,  she was being escorted to the bathroom with a police officer  so that they did let her go on her own for 20 minutes.  At the conclusion of the search warrant, they say,  we do need to bring you in for some questioning.  You are allowed to have a lawyer present.  Otherwise, you can come with us.  And she said, oh, there's five, I'll come along.  So they head in for a little chat chat.  She's so done.  They sit in the interrogation room.  The take of eping stall sits down, looks Erin in the eye  and just says, look, I'm trying to figure out  why does that four of your lunchlists are so severely ill  and you are not?  He also at this time discloses to Erin that,  Heather and Gail have passed away.  Oh, does she not know?  She was unaware at the stage.  Wow, this is used to her.  I'm sure she's quite shocked.  She's not saying much.  They have some questions that they need to know.  Erin, have you ever forged mushrooms?  No, no, she has not.  They ask her, does she own a food dehydrator?  No, definitely not me.  No, they also ask her.  Well, how come we found a manual for a dehydrator  in your drawers?  And she says, well, I just like to collect manuals  and have a thermodynamics.  She starts talking about thermomexers  and getting interested in thermomics.  She just have a thermomex manual without a thermomex.  She's rambling on about thermomexers.  Yeah, she's never, she's never far-aged  and she's never had a dehydrator.  So they wanna know all about the lunch,  the Asian grocer, where these dried mushrooms have come from.  You see, Erin has said that when she's made her recipe,  she's had these walworth mushrooms,  but she left the prosciutto out of the recipe  and it just tasted a little bland.  And she had a little Tupperware in the cupboard  with these dried mushrooms from the Asian grocer.  Yeah.  So she's added them to the recipe  just to give it a bit more robust flavor.  The mushroom flavor.  So that's what she's used.  and she's thinking, well, maybe they were contaminated.  I don't really know what to tell you.  So I'm gonna look a little dodgy.  Erin, she's allowed to go home.  And this thing turns into a media forensics.  Yeah.  It didn't take long for this story  to circulate throughout the world.  Everyone was talking about this beef Wellington lunch.  This middle-aged woman, heavier set, plain Jane.  Nothing to see here has become the center  of a worldwide scandal.  I was captivated by it.  I was so intrigued.  Always googling for updates.  Oh, this is good.  You know, that's right.  Unbelievable.  Looking at this lady, you wouldn't think  that she has poisoned her family.  Has she intentionally poisoned her family  to kill them or was this a tragic accident?  The media are part of outside of her house.  She's trying to get in there.  Literally up the drive right at the front door.  I don't even know how to do that.  I know the video is just so wild.  At one point she gets out of her car  and she decides to talk to the media.  She shouldn't have done it because it sounds like  she's a tear-lactant.  But she says, this is a terrible accident.  I love them.  I love them.  I love them.  The investigation is underway.  There is so much public interest.  So the investigation team have together right.  They have seized two phones and a laptop.  One worth of factory recess.  We have three people dead and one person hanging on  by a thread in is still in the ICU.  And he is not doing well.  They begin to look into the area to see  is there any death cat mushrooms in the area?  Good question.  They also manage to obtain CCTV footage at the current bar attempt.  and rainy. They would discover Erin Patterson on the second of August. Pay a little  visit to this dump. They can see her getting out of the car, holding what looks like a black  kitchen appliance, chucks it into the rubbish dump. Ah, Erin. She's not very smart. And  lucky for the police for the investigation team, they would head to this location and recover  this kitchen appliance. And it was in fact a food dehydrator. This is so strange because  Erin said she didn't own one. Look, she wasn't lying. She didn't own one anymore. No,  that's right. She wasn't lying. She didn't have one. It's pretty hilarious. They are doing  a little forensic scientific data extraction. They see in this dehydrator off for testing.  I want to see can they pull any fingerprints off this? Probably because we can see her  filthy little mitts are all over it. And they want to see if they can pull any evidence  of toxic mushrooms inside the dehydrator. It's a bad time just to go check your dehydrator  out. Like for a full store. Just on a spring clean. She's just got a new pantry. No room  for it. That's right. They are looking into if there are these specific mushrooms in this  area. Now there is a website called the eye naturalist website. Now this is a public website.  Anyone can go on there. A lot of food forages and scientific nerds will go on there and  talk about weird naturally science things. So really. So far. I know what I'm talking about  guys. People that want to go live off the land. But this is where a lot of people that  will find these mushrooms will do public posts just to give a bit of a public alert.  But just so happened rainy that a few months before the lunch there were some posts on  the eye naturalist website of sightings in the region of death cap mushrooms. Well, the  suspected mushroom that was used in this beef Wellington to show you subscribe to this  website or is it does anyone can go on it? Anyone can go on to it. Wow. And it's also  I think worldwide as well. So you can do it. Oh, right. Yes. All kinds of public sightings  around the world looking into errands phones. They are pulling some very interesting data.  Can you like look into a factory reset phone? No. Can you not gone forever? Oh, so first of all,  they want to see is Aaron looking on her devices for this specific mushroom on the computer  they see from the house. They can see that she was in fact on the eye naturalist website  back in May 2022. So quite some time ago the year prior and she was specifically looking  for death cap mushrooms in the area. It's a bad look that one isn't it? It's not good. They  are putting out the ping loves. They need to see was Aaron in the vicinity of this region  where the mushrooms were found. Well, ding, ding, ding, ding, ding, ding, ding, ding, ding,  and April a doctor Tom May. He was one of the posters on I natural set found these death cap mushrooms.  He posted his exact location and a few days later it seems that Aaron's phone was pinging in this  region in an area called lock. About 20 case from her house, I believe don't quote me on that.  They also can see that after she's visited this region, she's headed straight out to buy a food  dehydrator. One of the chances of an act like fast forward a month. There is another sighting of death  cap mushrooms on the eye naturalist website. Now it's a woman this time she is in a particular  location. It's an out trim. She's actually on Nielsen street the very next day. Aaron's phone  would ping in out trim on Nielsen street. And it looked like she was stationary in this location  for a good 30 to 40 minutes. Perhaps just enough time to farage for death cap mushrooms. Oh,  oh, it's incriminating. It really is. How do you explain your eye out of that? It's going to get a  lot worse for Aaron as they are looking at all of her phone records. They can see that Aaron has done  a little swapper uni. Aaron has a phone that she is used. We're going to call this phone phone A.  She's used it for about four and a half years. But this phone is not the phone that the police  have ceased. They cannot find this phone. It looks like Aaron has swapped phones and potentially  discarded this phone. They cannot find it. She also has done multiple factory resets on a new  phone that she's been using. So on the 12th of March, so long before the meal she's reset her phone  and then she's done a factory reset on the first of August. This is the day she's gone into hospital.  The 5th of August, this is the day that three of the lunch kids are now dead. And also she's done  one on the 6th of August. And this is when the police actually have the phone in their position.  She's managed to go online and go into her account and do a factory reset from afar. Wow,  she's really into factory resets. It's got a lot to hide. So this investigation is turning up some  very interesting information. The investigators would have enough evidence to make an arrest and  they would arrest Aaron Patterson in early November, 2023. And charger was three counts of murder  for Don, for Gail, and for Heather, and get this rainy. And five counts of attempted murder.  Oh, one, four, and four for her strange husband Simon, four, four. What? Why? Yeah, yeah.  As they are looking through their timeline, they discover Simon had been severely ill on multiple  occasions. Oh, one specific.  would be in May 2022. The same month, Erin was actually searching for death cat mushrooms on the  Iron-Actress website. She crazy. Simon, we're end up in hospital multiple times over a few years.  And one specifically in May 2022. And he made a post on his Facebook page when he got home.  And he wrote, I collapsed at home, then I was an induced coma for 16 days through which I had three  emergency operations mainly on my small intestine. My family were asked twice to come and say,  goodbye. I was not expected to live. She is said he had serious gut problems, but they don't  really know what it was. So we're gonna fast forward that. She's been arrested, Erin has played  not guilty. Erin's fucked. We're gonna fast forward to May 2025 and we are now just a few months  ago getting ready to head into this mammoth trial. As the trials back to begin, the prosecution  would actually drop the counts of attempted murder against Simon. They just didn't have enough  evidence. So the jury were asked to wipe that from their mind. And unfortunately, look, did she  did she not? We'll never know. She told her. And they would leave that off the table. But the three  charges of murder would still stand and the one attempted murder of Erin because miraculously,  Erin made a full recovery rate. Four things to steal. How the hell did that happen? He was in  hospital for three months and in September, 2023, he would finally get out of prison.  Well, sorry about just a prison. He would get out of hospital. He's obviously learned the fate of his  poor wife. She's gone. His family's gone. And now he is ready to attend this trial. Hopefully,  justice will be served. Imagine surviving that and speaking this old man knowing that  she's purposely gone to kill you. He's a man of God. So, you know, he's probably forgiven her.  So this trial was still underway guys. As we record this, we're waiting for the verdict. We're  gonna insert obviously at the end. But I want to just give you a recap on what we've heard over  the past seven weeks. It has been a mammoth trial. The net Rogers. This is a bad ass bitch.  Oh, she's a little bit older. She's probably like right now, mom's age. And she is this great.  She rocks up to the trial every day. She's got a little backpack on and a coat and a scarf and she looks  so sweet. But she is fierce. She's fierce. She is not walking around. The prosecution would claim that  Erin is full of shit. She is. There wasn't there words that's mine. But basically, they've said  that she lured this family to the slunch under the disguise of a fake cancer diagnosis fake  and ordered two poison them. She was gonna wipe them out.  Prosecution would explain that the health department was seen on a wild goose chase looking for  this Asian grocer that was selling these the small bag of freeze-fried mushrooms. It didn't exist.  They're all large bags, you know. They're not small. They're massive. Erin had made individual  beef wellingtons for all of her guests so she could control the amount of poison she was going to put  for each guest. She has foraged for mushrooms. She's dried them up, cut them up, blitz them up,  and put them into the slunch. She has served all of her guests on one particular plate and given  herself one that doesn't match in order to not poison herself. That's right. They're wrong. Be  wellington. Initial. You know, you could just initial them. That's right. Prosecution claim she has  thrown out her phone. The phone she's used for four and a half years because obviously, guys, we're  using our phone all the time so there's probably a lot of things on there that she doesn't want  you to know about. While she's smarter than most, she didn't get as sick as her guests. But she had  to pretend that she was a little bit sick to not put too much suspicion on herself. She panicked  though because she didn't think that the doctors would get onto this mushroom poisoning so soon.  So she's gone and thrown out the dehydrator. She's lied to the investigators and she is panicked.  They don't really have a clear motive. Sometimes in these trials, they don't really know what the  motive is because sometimes people are just fucking crazy. All right. Just angry at the  the excitement. There was text records of Aaron having conversations with some online friends about  how much this family was fucked. That's where we're fucked up and fucked them. There was also  message exchanges with the parents of Aaron expressing her frustration over the child support.  But the parents were almost siding with Simon wanting to stay out of it to say they're going to  pray for the children. It was not enough to like go and burn your family. There was a  animosity building against the family and Aaron has put these plans in place. She's poisoned her  family. They say she did not expect for Ian to survive who has come out of this lunch. He has  detailed these different colored plates. His detailed her full cancer diagnosis and chemotherapy  treatment. She thought her lies would die with the guests. But the defense say this is not true. Aaron  has been telling lies because she panicked. Aaron in fact would take the stand and she would be  able to explain it away. All of it. How was it? How was she? She starts to talk about the lunch.  She talks about the individual eye fillets. She just couldn't find the full size log. So that was  the reason why she made them all individual portions, not to poison them. She does admit that,  yes, I did forage for mushrooms. I enjoyed it. I got in 2020. In fact, I'd become quite good at  it. I became quite good at distinguishing toxic mushrooms and mushrooms that were okay to eat.  Clearly not. Oh, dear. She is saying it must have been a tragic accident. She's obviously picked the  wrong mushrooms. She's dried them.  And she's put them in this top aware with the mushrooms from the Asian Grocer,  and she's put them in to the beef, Wellington, Rispy, not knowing that she was actually putting  in death cap mushrooms. Oh, right. She says, lies! I never said I had a cancer diagnosis,  but I did apply it because...  Oh, oh, boy. I was actually going to get...  I was actually going to get a gastric bypass surgery, and I was embarrassed. I didn't want to tell  them so I made out that I was maybe having some treatment done, and I would need help with the children.  So, and that's why she's going to lose weight. So, she said E- in this line, and I never said that.  I just applied that I had cancer. I had also applied it in the past to Gal and Don because I liked  the sympathy and the attention I'd get from it. Oh, she also has an explanation for why she didn't die.  Why should I suffer the way her lunch gets did? You see, Aaron has had trouble with her weight  over the years. A bit of bulimia here and there. Oh, R- and when her lunch gets left, she had a  delicious slice of orange cake that the lunch gets left behind. She had another one.  In fact, she finished off the whole cake raining. Wow, it's a lot. And she then felt sick,  and it's jammed. So, she proceeded to have a bulimia episode and bring up the lunch,  and in turn, it was very lucky because it would have also brought up the deadly mushrooms she'd  also consumed. Imagine if all that was true. Yeah, unfortunately. Oh, that does really.  Wow. She's also said, I did in fact have to pull over and take a bush poo on the drive for my  son on the Sunday. Wow. Okay. She said that she was driving and things were getting serious.  She needed to pull over on the highway, run into the trees and do a little poo, little diary  about she had explosive diarrhea in her, in her words, did the son say this to her? Well,  unfortunately, the son didn't recall this. I'm sure you would remember, but apparently he didn't  recall them stopping on the drive and his testimony to the police back to the hospital. She's  talking to Simon in hospital when she's there. There have been a little conversation about how  she's actually put dehydrated mushrooms into her children's muffins before to try and hide  the mushrooms and get someone nutrients into them. That is talking about this in the hospital room.  Oh, Simon says to her, I was that how you poisoned my parents. Oh, this has put Aaron into a panic.  She's thinking, well, fuck, I've got the dehydrator home. I need to get rid of it because I'm going  to think I've done it on purpose. Oh, my God. So she's rushed home and she's gone and taken this  dehydrator to the dump that'll explain it. Simon denies this. Never said it. Really? He said he  never made that. He's never made that comment to her or asked that question. It's false.  And the kids test the money they have said the next night, the Sunday night, they have eaten  leftover beef Wellington, Aaron has scraped off the mushroom mix and the pastry and thrown  that in the rubbish and fed the children the beef log. Oh, okay. And that's why the kids didn't  get sick. This is very interesting. That was because when they have done testing of some of the  ingredients, it is impossible to extract the poison out of the meat. These mushrooms are so toxic.  You can't cook out the poison. It seeps into everything it touches. Like it's physically  impossible. So the prosecution is saying, well, that's lies. She's obviously just had some beef  Wellington's that were toxic that have all been consumed and some that aren't. She's also admitted  to receding her phone. Yeah, because she panicked because she thought, well, if I've got to think  that I've done it, she had pictures on her phone of this food dehydrator with mushrooms on the  trays. She's taken photos and she had to get rid of it. She did it in a panic. You wouldn't know  what you're doing this scenario. The prosecution did ask her, well, why when you've decided to  realize that potentially there are death cat mushrooms and this recipe, why don't you say anything  the doctors? Because at this point, they're speculating. If you loved these family members so much,  why don't you do what you could to help them? She probably said she panicked and she didn't know  what to do. The prosecution has also come back to ask a couple of questions for Erin. When she said  she was having this gastric bypass surgery and this was the whole point of the lunch was to talk about  this and so legit. She did actually have an appointment at this clinic in September. The prosecution  said the whole time that was where she was going. Then all of a sudden, Erin was confused. It  must have been liposuction that she was going to have because that clinic did weight loss surgery,  but it was liposuction. There's a lot of confusion going on. The prosecution and the defense  have done the closing arguments. The defense is saying, you cannot convict Erin as a murderer  because she lied. She panicked. She lied, but that does not make her a murderer. The prosecution  is saying, the evidence is clear. She poisoned her guess. I've got questions for you. What  was in the container she poked in? What do you mean? Oh, I never found out if it was weeds or poops.  It's been a burning question on my mind. I wonder, did she take down? Did she poop in the end?  They just put some water and shake it up? Maybe she went and got some laxatives or something  because I think she was having some bowel movements, some more free bowel movements, but you would take  something. I will add really quickly when she left to go pack her daughter's ballet bag and she said  she fell asleep. There were some phone pings of her a dark, nor round town. Really? The prosecution  said, this is you panicking. You're taking care of business. Yes, that's right. Who knows what she did  did. Did she go and get a little wee made a musical? A little wee laxative chocolate. Who knows?  Yeah. The dehydrator today. What's his came back for that? Thank you. Yes. Did they?  scientific testing, they were able to extract all of Erin's fingerprints obviously,  and they were also able to extract the amortoxin from the death cat mushrooms inside this food dehydrator.  Yeah, well. But Erin is saying, yes, you got me. I lied. It was an accident.  Yeah. But I didn't do it intentionally, and that's what they're trying to prove. And I will say,  I mean, I do think she's done it clearly. I also think she tried to the husband clearly. Yes.  But I think that if she has done this to the husband, a bunch in the past,  and they never found out, I reckon she just thought it would just get masked as a food poisoning  incident. And she was hoping Simon was going to be there, and she did have a six-beath Wellington  ready to go for Simon. So the hopes that he would arrive. And I guess maybe she was just hoping  that they would all have it and she'd worry about the whole family, be done with a lot of them,  or just make them very sick. Well, she gained from the more dying though. Well, that's,  that's what the defense is saying. What's why would you do this? Apart from like out of anger.  Yeah, but some people are just fucking nuts, loves. Honestly, it is horrific the way these people died,  and they did not deserve it. They were just lovely old folks just having to live in their life.  It's like, it's like your mom and dad, you know, your rural regional Victoria living just one in  their own business. Godly people. Far out. I did hear that it's quite a terrible, horrific  painful way to go. So you're organs just one by one. But the jury has to find a guilty,  beyond a reasonable doubt. Will they be able to do it? There's a lot of doubt because she has  come out and said, yes, I did do all these things and it was an accident and it wasn't intentional  and it's not my fault. I just panicked tonight. That's what I'm thinking about. They had they  created a reasonable doubt. I wouldn't be surprised if they have.  All right, friends. The verdict has finally come in. We recorded our episode about 10 days before  the jury came back with their verdict. Finally, after seven days of deliberation, we have an  answer. This mammoth trial has come to a close. Rainy, are you ready? Oh, I'm so ready.  Aaron Patterson on three counts of murder has been found guilty, guilty, guilty, guilty. And on one  count of attempted murder, Aaron Patterson has also been found guilty. Stuck on that, Aaron.  I have listened to some of the updates from the courtroom and when the jury was read aloud,  there was pretty much no emotion shown from Aaron. Super, super stoic. She had been very emotional,  very animated. A lot of tears. She didn't answer for everything, but they really did turn out to be  lies. And he reached this verdict and it's nothing. There's no no emotion. Nothing. She's  actually all that loves. You know, she put on a show now she's this real pest. Performance did not pay  off. Now she's got a prison. She should have given the performance going to the very end and  she's going to appeal. But no, overall guys, it's it's a real tragedy. It's just such a waste.  Aaron's children, no, they have their mom. These lovely older people lost their lives in the  most horrific way. So evil, so dark. So rainy. Can you handle this shrimmy, crime and scandal?  No, no, no, I cannot those poor innocent old people just living their lives. They had some good  years left in them. They did. And we're a brutal way to go. It was probably the husband that was  probably the number one target, but she's like, fuck yeah, I'm gonna get all you. And she didn't  manage to get the husband. She just got those other people. So I feel bad for them, but you know,  you give what you deserved. You have cooked your fake girl and you will never eat beep well  until again. Good rips. Can you handle this crime and scandal? Definitely not. Nobody can. This is  just so sad. And I just think Aaron is just quite the evil woman. It's so dark. No, nobody wins in  this scenario. And it was so premeditated. She had so many opportunities, you know, from when she picked  the mushrooms she could have bailed out when she made the duck's owl and put the shrims in and  she could have bailed out when she was bringing the lights to her gear. She could have bailed out  and she didn't. Just such a waste. We're gonna wrap things up. rainy is on holiday again. She's a  nuisance. So it's a bit weird. She's face-toming in the morning. We had to get the verdict. Of course  it would come back when she's on friggin holiday. But I will tell you we were together yesterday when  the verdict came back, which was quite cool because there's been so much build up trying to wait for  this morning to come back and we've heard it together. So that was cool. Just want to say, Lolly,  did an incredible job on the planet. You have been keeping us all up to date. You've been doing  so much research. So thank you so much. I'll be entertaining. Well, thank you loves. I appreciate that.  And we appreciate each and every one of you guys for tuning in for being here every week. We can  week out. We're back on YouTube. We're over at the on Instagram at Karnell the Crime and Scandal.  Come and say hi. Come and see what we're doing over there. It's a bit weird. It's a bit funny.  And if you are loving the podcast, a rating and a review helps us so much to reach more  amazing people like yourself. So please feel free to jump on down and give us a little  five star. And we will love you forever for that. And just be careful guys, if you are out for  dinner and someone has different colored plate and things are feeling a little off. Just don't eat it.  Don't eat it. Just play a little musical chance. Swap the food round. That's right.  Snaysave. Take it easy. Have fun. We'll see you next week for another juicy episode.  We will. Alright, let's take care. Love you guys. We'll be back.  And love you guys. Have fun at this a bit. Thank you.  Have fun.  The lamp. Why don't I get like a drip, you know?  I do this stuff.  Why do I do this stuff every time I do a podcast?  Yeah.  But things did become two things did wow.  So fuck.  Yeah.  He was in hospital for three months and in September 2023 he would finally get out of prison.  Well, very much as a prison.  He would get out of hospital but there was this amin' acid animosity.  And a mausolee.  And a mausolee.  I don't know.  And a mausolee.  And a mausolee building against the family."