" Cash Daddies is for entertainment purposes only.  You'd be an idiot to listen to anything these degenerates say.  Ask your own risk, do research, but seriously don't listen to these ass clowns.  Now enjoy cash daddies.  Welcome to Cash Daddies.  We're banking faddies.  Hope you had a great July 4th weekend.  We're back.  Sorry about this.  I had some technical difficulties because you know that's just the way it is.  How are you boys?  Good.  Good.  Good.  And had probably the best week in a long time.  And last week, June just crushed.  We're off to a good July man.  Nice.  Yeah.  Made up for me.  Yeah.  Last week.  Holy shit.  Between Uber over 100% Apple.  Would we do like 70% on Apple.  Then we tossed in Pepsi, which we DC I made about 50 60% on Pepsi.  Then I got crazy in but.  STZ.  It's not a disease.  That's mojello.  Yeah.  Yeah.  That's mojello the beer company we.  Took STZ went into earnings earnings were great.  We didn't didn't go great.  Didn't matter.  Stock went up.  We banked on that.  We bought some SQQQ on Friday.  Market's taken today.  So right now we're on fire.  Not going to lie.  We're on fire.  We are on fire.  And the best way to get a part of that fire is to go to the very exclusive.  The very elusive.  Where the bangers bang.  That's right.  The patreon cash daddy's patreon.  Go to patreon.com flash cash daddy's.  People are doing numbers going up.  People are joining.  I had people.  Hey dude, got any good tips.  I go, dude, just join the cash daddy.  Yes.  Patreon and it will pay you back instantly.  Obviously, that thing is a risk.  But you know what?  It's good to go.  You got any good tips.  Yeah, join the patreon or ask how he.  Yeah.  What are you coming to me for?  What do you come to me for, dude?  What do you come to me for?  I mean, the patience is paying off.  You know, the guys are just chomped at the bit.  When you have a crank and week like that, that, you know,  it's just human nature.  You want more.  You want more.  You can't.  You got to lay back.  We waited.  We bought some Ali Baba calls today.  We waited.  Wait.  Was it one?  Okay.  How are you just folks?  There we go.  Doing his Rayleigh Oda right there.  Says Rayleigh Oda.  Oh, that's more like a like a de Niro.  That's de Niro for sure.  Oh, that's a de Niro.  Yeah.  I hope he comes back.  Let's hope he comes back.  Oh, boy.  This is a completely different show without how he.  Yeah.  For sure.  You know, how long he notices frozen.  It'll take a minute.  Yeah.  The only person who could replace how he is AI possibly.  I'm short notice on this.  Yeah.  Going to be honest with the AI.  How he's very important.  If not essential to the show.  And that's why why we're waiting.  Let me tell you about our good friends at wise wolf, gold and silver.  That's why wise wolf, wise wolf, gold and silver.  Okay.  Let me see if I can find it.  Silver dot com slash Sam.  He said he's rebooting it.  Okay.  Okay.  Let me tell you about wise wolf, golden silver guys.  Listen guys, has it?  Oh, nope.  That's a that's the crypto read.  She hasn't sent me the other one.  Okay.  We do.  Johnny.  What?  We're doing that one here this week.  Yeah.  No wise wolf on here as well.  That's how it's going.  Okay.  That's how it's going, dude.  I think, you know, so this trillion dollar bill.  I'm going to step in for how to show you dollar bill,  bazillion dollar bill just passed.  Go to destroy our dollar.  I think gold, silver and crypto is a good play.  What do you think?  I totally agree.  Maybe for different reasons, but it's I mean, gold is, you know,  coming off of those great highs, but it's it's always been a  refuge in times of uncertainty.  And I see it that way now.  Crypto, you know, make sure you have somebody who knows what they're  talking about.  giving you a chance.  You know, make sure you have somebody who knows what they're talking  about.  You got to find somebody who knows what they're talking about.  We'll get into that to a little later.  I know we want to do it now, but while we buy some time, but  but I wasn't trying to cue you for that.  The truth.  How he's still is and on.  He's there in a zombie rectangle.  It's just really awkward.  Yeah.  Yeah.  Really.  You guys get to somewhere you are.  Nope.  I was getting away.  Is it standing by that joke?  It's unbelievable that this guy has been podcasting for so  long and he still doesn't know how to podcast.  How we through there.  WTF.  Yeah.  Yeah.  And then crypto, I, you know, like I said, if you're going to dance  outside the big boys, you know, Bitcoin, ETH.  Selana maybe.  Uh, then have somebody hold your hand I guess if you don't know what you're doing.  Like me.  I am so sleepy dude.  I can't tell you how sleepy I am right now.  Can how he hear us?  He's not, I don't see him.  Yeah, he says he's on.  There we go.  What?  We see it.  We saw a little bit.  Hello?  Hello, how he?  This is a story of our life.  He's muted now and unmuted.  What's up?  He's muted, he's unmuted.  I'm just accidentally clicking a hot chick  on the comments.  That's how I do it.  Yes.  That's, it's because.  how I do it.  We're just going to highlight hot women in here.  We go hot black.  Hot chick.  I find we go.  Look at that.  Yes.  Dude, what are we doing here, Holly?  Johnny smoking dabs?  No, dude, I don't mess with that shit, bro.  Johnny, when you think you're rid of those boxes?  That's the, my room is kind of the last one that's  going to get sorted out my office.  There we go.  Oh, he had to switch this phone.  Now we're back into how we lift.  And then we're going into how we lift mode.  Oh, yeah, there we go.  Well, we get better numbers when you lift.  We get the gay crowd.  Jesus Christ.  How do you love these texts?  Somebody commented the other day, asking if, and this  was like a couple of months ago, I saw this comment.  Actually, I can't remember what I saw.  But they were like, did how do you have a stroke or something?  I just know that he's, he's listing like a,  no, he just come out of the closet.  I hope I'm not listing on this right now.  I really do.  I didn't notice it.  I'm frankly so I don't know.  So talk normal right now, honestly.  Talk normal.  I'm talking normal.  I'm talking very normal.  I'm talking normal.  Talk normal.  Talk totally normal.  This is his normal is I can talk.  All right, I got it.  He's doing it.  He can be.  He can be funny.  He's doing a bit.  I get it.  Okay.  Yeah.  So it's not.  No, he's in advance enough to do a prank on a podcast.  I, I'm his normal.  This is a coming across this normal.  For real.  I'm not, I'm being furious.  Keep trying.  I'm not, this is not a list.  You're, I appreciate you leaning into this bit.  How he thinks that you can stop.  No, you don't have to keep talking about this for years.  How we held your horse to, how'd your horse do?  He doesn't, he runs it.  It looks like we're gonna run him to 24th,  the 24th of July.  Dude, this isn't funny.  I'm getting pissed.  It is funny, dude.  It is, I got it.  Why is the other, the main one says that I'm,  that I'm, that it's working.  I, I, what were you, what was stocks were you gonna tell us about?  Okay.  Tell us about the stocks.  I know we gotta do this.  I gotta get back on the main one.  This is insane.  Oh geez.  No, dude, you gotta stay where this,  dude, we're flying this plane into a building right now.  If you jump off.  I'd rather have lists being how he then know how he.  This is terrible.  This is absolutely terrible.  It's fucking terrible.  How he, how he said he made his first ice coffee today, by the way.  Yeah.  This is my, this is my ice coffee, right?  Is that part of your transition?  Yeah.  So, so would you just put coffee with ice in it?  Yeah.  Isn't that what you're supposed to do?  Yeah, exactly.  Yeah, exactly.  I think it's, I think it's like you cooked up something.  Like you did some kind of cooking.  I kind of like it.  It's pretty good.  I respect that so much.  How I respect that so freaking much, dude.  I really pissed.  I have no idea why the laptop is there.  We're enjoying it.  Let's get into what we're talking about.  All right.  Well, no, we, uh,  but Alibaba, we bought some Alibaba calls today.  And that's important because we've been waiting  for a long time in a drop below 107.  We all jumped on and I fucking love the way Sam  just hits her in the last because for some reason.  I won't laugh anymore.  I sound like half of, I won't even say it.  Yeah, there we go.  We're on, we're on YouTube.  Yeah.  So, um, you sound like half a Cooper flag.  Yeah.  Yeah.  Half a Cooper.  That's what I sound like half a Cooper.  So, so you got an Alibaba.  Let's get on track here, people.  Yeah.  We can, we can, you know,  we should turn it, you know, the, the English invented a way  to get around this called Cockney rhyming slang.  We should all just educate ourselves to that.  And we can use it on YouTube to avoid censorship.  That's, that's the key.  Cockney rhyming slang.  Let's do that.  It's, which where you find words that kind of rhyme with the word  you want to say and you say that and everybody knows it's like  a secret language.  We should all be.  We'll just, we'll just say, yeah, I saw like I got back from  New York City in New York City and there was 550,000 Cooper  flags in the parade.  That's right.  Exactly.  Yeah.  No, I'm all about that.  There's a lot of Duke fans, a lot of Duke fans in the  parade.  It's fun to do fancy.  Kind of Duke fans.  A lot of Duke fans, dude.  I like, Apple's, Apple's and pairs are stairs.  I'm just looking down, cognitive, and butchers is look.  Dog is bone.  Anybody, let's tell anybody who's listening to the three years ago.  We had friend of mine asked me to say these MC rhymes.  So I said to him what I'm about to say.  All right, you done?  Yes.  Three years ago.  We had the question, 100 different people.  What's this talk to buy?  What's the next Amazon?  What do we say?  We said Uber and everybody bought Uber, Johnny bought  Uber, Sam bought Uber.  Uber hit an all time high today.  The market is way down right now.  Uber is up.  Uber is cranking all time high today.  And right now you got the Dow down 500.  NASDAQ's down 211.  As the piece down 60 points, Uber is trading at, let's see  right now.  And I'm going to say 97 96 and a quarter.  All time high.  You can't beat that.  How are you crushing it?  You're crushing it.  You're absolutely crushing it.  We had a guy out here that bought these Uber calls at 83.  He bought the, and I think he's up like 230%.  He's like, he's like, he's like,  profit.  I'm like, yeah, I probably would.  Oh.  Oh.  These guys, these guys on the Patreon love to just ride it.  Just take, I'm a hold and buy guy,  which always blows up in my face.  That's my perfect ADD, not buying a hold, hold it.  And then buy it.  Hold it, and then buy it.  Okay.  You know what I'm saying, dude.  You know what I'm saying.  Yeah.  I know what you're saying.  I know what you're saying.  I know what you're saying.  Okay, Johnny, judging motherfucker.  We bought ask you to.  You're saying that's honest.  We're doing this whole charade to try to avoid  losing the YouTube channel.  Yeah.  Well, that's what you get when you start talking smack.  It's fine.  We can just all dump on how we all day,  but it turns to Sam.  Oh boy.  Yeah, exactly.  Now you know the rules.  Hey, so we got a big week coming up next week.  It's just coming up.  I like this comment.  It just came over.  Sam, you see this?  XG is the Mexican wolf of Wall Street.  I like that.  Yeah, he is.  He's the phone say he's the next warm buffet.  I heard that too.  I heard what he's talking about him, dude.  His new shows the number one show on planet earth.  It's unbelievable.  How good he's doing?  She get how he and XG on the podcast together.  Oh, that'd be great.  XG talks stocks are now, you know, just getting  to the technical analysis, that kind of thing.  Yo, why you be buying Apple?  Yo, why you be buying Apple from a tree?  She's he's not he's not like that.  How many of you do?  I don't know why I went into a half.  Yeah, that was very racist.  That was the thing that I was like, which is in  which is in which is totally okay, I'm going on.  How my girls.  Encourage on the show.  I was going on.  Oh, my girl.  Yeah, they talk.  Yo, Uncle, how are you?  Why are you be doing that?  Why are all your nieces and nephews Puerto Ricans?  Sounds.  They're not, but they're all from Brooklyn.  And pretty much you can't tell the difference.  Like I don't.  Joe, I have that joke where I thought my girlfriend was Puerto  Ricans.  She's actually Palestinian.  And that's a true story.  That's not a joke.  I really did think she was Puerto Rican for like 20 years.  I thought she was Puerto Rican.  That's totally true.  That's totally true.  Yeah, I agree.  If you know how I believe that.  Oh, shock.  I believe that.  She's Puerto Rican, but she's just obsessed with the  Palestinian issue.  It's crazy.  Three months after we were going out, I was like, we  go, what do you have any relatives still left out on the island?  She was like, what?  What are you talking about?  I'm like, Puerto Rico, why don't we ever let go there?  And then she told her brother that and he almost beat the  shit out of me.  He was pissed.  It's so crazy how people lose it on that.  I guess if someone called me a turque, I'd be like, no, I'm  Armenian, but I wouldn't fight anybody.  Yeah.  Yeah, that is weird, right?  Pop wax, love, racist, how we?  Well, she was Puerto Rican.  She would have hit me.  So that's how I should have known she wasn't Puerto Rican.  Because I did live with a Puerto Rican girl one time for a  year.  And that's where I learned to cover up and duck.  Oh, yeah.  Every single girlfriend I've ever had is  Swagami.  Everyone.  That's why I don't date MMA fighters at Thai boxes.  And he checked that does combat sports.  I can't date you because you will inevitably swing on me.  Yeah, I've never, the girl hot is a therapist.  So when things go bad, she'll just start asking me  questions that make me feel 10 times worse about myself.  And yeah, yeah, she's like her goal is to get me to off  myself.  She's come pretty close, but she's good at it.  She's really good at it.  She's all up yourself.  The show can't go on.  Yeah, I know.  That's why that's why I don't, you know, plus, you know,  we're banking too many fatties.  So why do I do it?  By the horse.  I got a horse running in two weeks.  I got a horse running in two weeks.  Okay, tell me about it.  The horse, who's it falls who's been working out like a just  unbelievable.  We we passed a big, big, uh, block cave when we got Hall of  Fame writer, Johnny of the last quest to commit to him.  He wrote it again.  Can you say that again?  Johnny of the last quest.  We got him to what fuck are you laughing?  Fire dude.  There's fire.  Somehow there's got to be an AI thing where Johnny, you can  edit this and get rid of my list.  No, it's staying.  So anyways, we need those gay dollars.  We got Hall of Fame writer to write him.  He likes him.  He's got to write him again next week.  If everything goes well, he's going to run on the 24th and the 6th  for a lot of race, which will be televised on national TV, you  will see me 100% on Fox one or Fox two sports.  It's going to get wild.  It's going to get real wild.  I mean, my trainer texted me last night and she said, this is  really starting to hit me and starting to get real.  So not going to put my boys just got to stay healthy,  federal, a bunch of carrots, sweet potatoes yesterday.  I love this.  Where is this fight happening?  I mean, where is this race?  This it's a fight horses fight by race.  I would love to watch that.  That's a little inside the track lingo, Johnny.  Someday you'll realize that.  You I love that you're telling me about horseling.  Oh, that's good.  Yeah.  He's he's racing it to most popular race track in the world  during August, July and August, Saratoga with the highest  stakes of any track in the world.  He'll be running his first race against a bunch of two year  the best in the world. It's gonna be very hard. We're gonna be in tough, but I love this horse man  I think he can do this. I think you think it goes the distance or do you think he like takes him down like what six rounds  I'm happy we're happy that it's six for long versus five and a half because he's bred  He's bred for distance. He's definitely bred for distance. So the extra half for long should help  I don't know. I just loved this horse man. He bit me three times yesterday. I'm so rich  I like this horse. I like the list you're gay  When I walk away from him he just latches on pulls me back  Loving I love him. I may sleep in the stall the night before  I'll see those videos in my fall night. I've seen those videos. Yeah, oh boy  I  Was he did that I wouldn't stop her, but I would just go, you know, that was wrong finished. Yeah  Yeah, so we got uber cranking. We got we got earnings next week. We got tariffs back in action  Trump's tear from the shit. I love how he's like we have a great deal with Vietnam like who cares  Like nobody gives the shit buddy  Thank you, but yet we don't have one with Japan South Korea China countries. We do a little bit of business with  so  That's where it is right now. He just put 30 40% on  What South Africa which I don't really care  Yeah, he called it the beast he's targeting what he calls the bricks agenda is what he anyway. Oh snap  guys from Doug Wilson  Excuse me is the Mexican wolf of Walts, but you really know you already said that but we have to feature it once they give us those  Dollars and what how he's how he's list for a good start getting mega  Gay dollars and there's a lot of gay dollars. Oh, it's smart play. It's the smart play. Yeah  I mean, well, I can get weird and come back out of the closet to show up explode  Well, I'm gonna tell you this if this horse wins this race  And he wins another race after that and we end up shipping him to San Diego for the winter  I'll be I'll be staying in San Diego or Irvine for the winter  Come on out now now is osmo talking about bedding  Investing or horses. I'm checking out the tattoos right now hold on. Yeah, you could be right depends if you're willing to take that chance  I'd like to be careful unstable doesn't mean bad of course if you like to take risks trust your instinct  Mr. Hands action or is she talking about?  Investing I can't tell either way. I'm in you  Everything I do since I've been born has been some sort of risk involved whether it's chicks  Whether it's girls you shouldn't hook up with but you did you made a bad decision whether it's investing  Whether it's I love her should I get involved with this horse? It's all risk life's a risk life's life is gambling baby  Speaking of gambling guys speaking of gambling what about the new big beautiful bill in this new gambling?  How about this ship Sam so I want to tell you what this what this what this ship listen listen  Credit to Evan hand by the way. He was the first person I saw to make a video about this and it's spoiled  I mean it's insane so if if if I bet $100,000  Okay, and I win a hundred thousand and I lose a hundred thousand  They don't have study each other. I still have to pay 10% I still have to pay 10,000 in taxes  Impossible how is that guy that this is a whole thing whenever oh  Your truck guy. Look at me. Yeah, he lied to us  Lying about everything he lied about everything the money is spending the wars he's starting the taxes he's doing and then he'll throw up  Mid it maybe I'll give it to the fact no you won't it's gonna. Oh, I ain't sack a shit  Listen this gambling bill is so beyond bizarre  It's it's what it's worse than it's a communist philosophy. That's what it is  Like the it almost sounds like a mistake  I mean yeah, yeah, gani. That's probably the best thing I've heard so far come out of anybody's mouth  You just said yes, it sounds like hey, did you make a mistake?  What it was it sound like?  Like somebody screwed up it's like not it just doesn't seem possible. It's like this  like it's like you go to McDonald's and  You buy 10 dot you buy a $10 value meal and you give him $20 and they don't give you they give you nothing back  that's a tax vote now that's what it is that's exactly what it is and  It's you know, it's insane whoever came up with this should just be dragged to the seller and given a beat  I'm sorry. They should because it's the it's the it's the worst thing. I've seen probably ever ever  It's just you're still it's the government really stealing like not even hiding. Yeah  It's really bad and it gave ice  $150 million which is bore  150 billion dollars which is more than some governments defense  budget  Yeah, I was I saw this chart with all these other countries that don't spend that not even close to that major countries  It don't spend that much on defense  And he's giving the ice  Yeah, and you know and you got people who lived here for 25 years  They've never committed a crime getting deported all of a sudden. It's really it's some bizarre bizarre shit going on  Well, it's and then it's the the I don't know  Go that's kind of a field for our field for us isn't it that but it's the way some people are  Gleefully celebrating it, you know like even if it is the right thing you could argue that is it  Is it is it right to be celebrating it, you know like like oh, yeah, that's what that's what we want to see  No, but I mean at the part. Yeah, you know back to the gambling thing  There's professional poker players that they make their livelihood out of this. Oh, it would screw it would it  I mean it's not it's not hyperbole to say this would wreck gambling as a  as a  What is gonna do is those offshore sites? They're back and play again. Yeah back and play again  I mean get me get me gambling off of Turks and Caicos and whatever island has shady ass gambling  And by the way if you go to Turks and Caicos and you say you know Johnny Woodard and Sam  Turply you're gonna be treated like a celebrity. Absolutely. We have like the top podcast in Turks and Caicos  Amazing. Okay. Sim is huge  That's amazing and that's like my favorite murder of Turks and Caicos  That is awesome  This is from the independent the Trump administration signature spending package contains a little known provision  That could radically upend the gambling industry previously gamblers could deduct all their losses from their declared income  Makes total sense while still having to pay taxes on their winnings as a result  Bedders were only tax if they walked away from the table with a net profit  Obviously, that's what you do  But starting next year under the new bill which the president signed into law Friday  Betters can only deduct 90% of the losses from their declared income  This sets up the potential for people to pay income taxes even if they ultimately came out of their bets with a loss  How is that possible? This is an accountant in the Vatican Russell Fox and these are his comments  He told this to the Washington Post did anybody think this through they thought we'll bury this somewhere in the bill  No one will see it and now we've got an extra billion dollars of income to offset a billion dollars of tax cuts  On believe about it's an it's yes now this  This is just a nightmare and it's just one of the dumbest  It's it's it's kind of like  Sleeping at night and there's a fly in the room and you just can't get that fly. It's just  It's terrible. They've got a they've got a role in spec though because I mean he  Trump if if he has an association with any city other than New York  It's Vegas and Vegas will be losing their shit about this or Atlantic City. Yeah, I mean  Maybe not as a probable  I mean he bankrupted all his companies down there  So no, it's really messed up and hopefully they get this they're gonna have a lot of pressure man a lot of pressure to take care of this quickly  I mean there's a lot of things in this bill they got to take care of but it's just the bill overall  if you are  basically a conservative  Like our boy down in Kentucky  Not Ram Paul, but the other guy that  Turner account confirmed  Burner account confirmed no, she's real  Burner account confirmed we are friends a woman named  Delta, Ozema. No, I don't think so he's real bro. She's battling the forces evil on Twitter every day  Okay, I follow her  I bet you do but did you do the math water? It's amazing how all these  fucking conservatives  literally  Pass this bill through because there's no term limits and I got to keep their jobs. I mean talk about make America first holy shit  I'm with you. I'm with you dude  I mean it's it's these term limits are so 12 states are trying to put term limits on  Gotta have incentives, which is if everyone doesn't follow that is gonna hurt them in the long run  But it's one hundred percent necessary has to be you got to because  Nobody in their right mind would have passed this bill  I mean all it does is it assures this that we're gonna print more money. Yep  They work that the dollar is gonna consume it and this is what this dumb at these this guy's really slow  He's economically. He's not smart. He keeps saying  Hey, we got a lower rate. She got me while the dollars already at 97. It's fall you can't  If you lower rates that dollar is going below 90 and we got real problems  So he's telling pal the lower rate. No, there's not a nobody with half a brain right now  It's like you can't lower rates. It's the worst first half return for the dollar in 52 years according to us  Yes, the dollar time will 10.7% against its global peers through June making it the worst first half since 1973  Yeah, it's  What trade 97 right now we were one ten at one point  Yeah, yeah, that's exactly right. Real quick update Chad is absolutely getting Merck in the super chat section  Hey Sam, huh?  How much of a nuisance is Chad Zuma? He's not I love Chad Zuma  Why does everyone hate Chad Zuma? Crog crimes dogs? I don't think everybody hates  We only one of the nicest people I'm met when I came out. He treated me totally chill like from day one  Yeah, I heard so say to everything that's fine. He burnt the village shot the family, but that happens and now  I think a mushroom. Oh, we got kicked off our ATC. Oh, I didn't yeah, of course  We used to be important people there now. We're no longer there. Yeah, boy. He did do that didn't he?  Yeah, we did shoot the family. Yeah. Yeah, you're totally right  So kind of  Continuing on what you said about make America first again. I mean  Yeah, whatever  Elon Musk is he's announced he's creating a  own political party. He's had enough of maggot the whole agenda there. Whatever it is.  And his Tesla dipped seven percent after he announced this political party. What's going  on with Tesla? Do you like it here? Or is it just too volatile with him?  Well, we've been on the Patriot all morning talking about this. And, you know, here's the deal.  Besides, he's got the perfect storm going right now for why I think this stock  could go around to 280 275, which will buy calls. Well, buy it when it goes down there.  We're being pasture right now. It's right around 292. But it dropped below 300. I said  last week, don't buy this thing until it drops below 300. Guys were ready to buy it last week at 320.  I was like, no, look, no more $7,500 tax credit. It's gone. Okay. Eli got Trump elected. Trump turned  around, took away that tax credit. On top of that tax, correct tax credit. There's no more. Remember  the zero emission vehicle credit that they had? That's gone too. Bye bye. It's history. That was  the one that had to do with greenhouse gases. So you take those two credits. They're a gun.  You got you got Musk and Trump fighting it out. And all of a sudden now, Musk says, I'm going back  in a politics. That's not good for the stock, man. I thought this stock. Shareholders don't want  you to get the money either. So listen, if you're paying attention, you know what? De-dollarsation,  it's real. Okay. Fiat, Fiat is fake. And you don't want to be left holding the bag when the dollar  collapsed. Golden silver have been money through all of recorded history and our excellent ways  to protect yourself from inflation. Okay. It's just that simple guys. You want to protect yourself  against us. You want to play the game, play it right. All right. Play it right. And that's why we  love our boys at Wise Wolf. Golden silver. That's why we trust our friends at Wise Wolf. Golden  silver for all things precious. Mel, veteran owned and A plus rated by the better business bureau,  no transactions too big or too small. You can even roll your 401k or IRA into physical,  gold and silver. If you think you can't afford price miles, if you think you can't afford  price miles, well, think again with Wise Wolf monthly membership, you can get golden silver delivered  directly to your door for as little as $50 a month. Wise Wolf, Golden silver also deals in and  accept Bitcoin. Just go to Sam Turbly.com promo code 10 FOIL at checkout to receive free,  a free constitutional silver. Okay. And remember in the world of bulls and bears, be the wolf. And  we thank them for sponsoring this show. Thank you, Wise Wolf. We love you. And I'll piggy back that and  say if you're buying hard gold or silver, buy to Wise Wolf because man, he's a good dude. And right  now you got gold at 307. Do I think it's going higher? Yes, I do. I think you could see gold at  323, 30 silver also going up. Nice. And I've told all our guys, they said, should I sell gold?  I've got, I'm up 100% and I said, no, put stop losses in. But I do think you could see these  metals go higher. And he's got to be doing great right now, hopefully because if he sold some gold  silver, people got to love him. Yeah. How you too, you were mentioning the EV credit. And that is,  that's the thing, Trump blames for Elon kind of going off the res with him. You know, anytime  their dispute gets brought up, he says that Elon's pissed because he's killing the EV tax credits.  So I, and I, I, it's probably where it started, you know, he's, I, you have to, you have to believe  that Elon Musk is a genuine person to believe that he's just in it to care about the spending and  the fate of the, he did. He did. Now, I don't like Elon. You know, I thought he went too hard to paint  on people that have worked in the government for 20 years, a lot of them being vets. And he is,  but now I will say this, talk about getting stabbed in the back, man. Elon spent hundreds of  millions of dollars getting trouble. Yes. Yes. Yes. And what is, and they interview Trump. What does he  say? I don't know about you. I don't want an electric vehicle. There's shit cars. He said, Trump said,  they blow up. They blow up. What he said. Yeah. And I mean, I'm just like, you, this is a movie.  Watching Donnie Trump get interviewed as a movie about just a dirt bag. It's the stuff that comes  out of his mouth. It just blows my mind. I mean, and that's got to set Elon off because, you know,  he's got a serious case with the Tisms. He's got no filter. So Elon's just saying what he feels,  and it's a little crazy. And I mean, don't be surprised if he starts to view some Epstein stuff again,  because that's back in play. Everybody's everybody's like, okay, you guys told us there was  information on this whole Epstein thing. And now Cashew Patel and the boys like, we don't know  anything about it, man. There's no. Yeah, I don't know if you've heard, but our government has told  us that there's actually nothing to that. There were no news. I mean, an absolute demoralization  campaign. They wanted to moralize all of us. Epstein was a decent fellow man. He didn't, you know,  he just had a heart attack and pretty. He was a good guy. He wasn't bad. There was no files.  It's just the whole thing is just insane at this point. It's like, I mean, that chick,  Pam Bondi, she cracks me up. She's just, and I can't blame her because she's told what to say.  she's told me that he can't blame her because she was working on the Epstein case when she was in  Florida. I think she was an AG. I don't know exact position.  Yeah, she was. She was right there. And that's why she got  promoted because she cleared that up too.  You know what I would love to know about her right now? I would  love to get her in her. Does the does the curtain match the  drapes? I would love to find that out, which I don't think it  does. But I would also, you know, I would love to go into a  room and just talk to her and say, Hey, what stocks are you buying  now? You can tell me. I'm not going to tell what stocks are  you buying. What sectors do you like, babe? I would love to  ask her because I think she probably has some pretty good  info on that.  Oh, yeah. I mean, it's it's it's it's absolutely ridiculous.  That means just lame Maxwell is in jail for for nothing.  No, just no.  And if I was her lawyer, be like, then why is my client in jail?  Totally.  Damn, that's a good question, man. Like why is she in there?  Because nothing happened, correct? Yeah, exactly.  So so when when Epstein go and goes and get arrested in  Florida the first time and they go to the prosecutor, this is a  above your level. What were they talking about? What are they  talking about? Yeah.  It's it's damn, it's beyond interesting. It's just whacked at  this. Maybe they meant it was below your level. It's a waste of  time. There's nothing to see here. You're just wasting your time  officers.  Yeah, but it was above his level. I'm joking. I mean, obviously  that's it's it's it's clearly intelligence. It's obviously  a huge mansion. Like people abuse PAM mindy and you  mentioned the stress level that that lady has, which she goes  home at light. Like I hope I say the right thing. I have to  say the right thing at all. I think she's like, yeah, dude, I  just got lied. It's great. It's a great gig. Well, I just got  a little.  You know, and then you got going to how much of this is theater?  Like you remember Johnny, I don't know if you saw this, but how  well, there was a there was a secret video tape of her.  Talking about how there's 10,000, 10,000, yeah, it was it was  James, you're key, right? Right. But what if that's not even  real? And that's done on purpose to demoralize us?  Yeah, I at this point, I'm getting on that I'm telling you with  this whole shit. I'm all over the I'm in the I'm with the  conspiracy. Is this going? Cause something is so beyond whacked.  What's going on? There's no rational thinking you can't even  critically think about what the hell's going on? Because that's  his making sense. Yep. And that's done on purpose. And and  right when you say that, we have 911 people watching totally  makes sense. Yeah, it makes sense. So that's great. Yeah. Yeah,  it's just bizarre what's going on. And I have no answers anymore.  I think we are this is just whacked. And my job is to just not  is to just I needed to know all of the static and just focus on  making the boys money. And that's all that matters at this  point. So you know, we got retail buying, which is guys like  you and me, it's weakening from April. Not as much retail  buying right now. So we this is why we may be seeing a sell off  today. We may be selling seeing a sell off possibly in the month  of July. This is why we're owning SQQQ. Because I think there's  profit to me made on the market going down. This is why we're  holding 20% cash in the 2025 portfolio. So, um,  allow those stocks to jump like novidia Tesla spy,  Palantir, look for Palantir to drop another 15 20 points. Um,  why they just got big contract? Why would they drop? Because  that thing pumped up too quickly. And I think if tech sells off,  which it looks like it could, they'll drop now if it does drop 10 15,  do we sell out and buy it? Probably. Uh, because we're just all  about banking fatties on the show. That's what it's all about.  Yep. So that's it. You know what? And I'll tell you, I'll  tell you another shady sign. You got me, you got me thinking  whack right now, Sam. I'm ready to jump on the fucking 10  foil. Let's go bro. I got one for you. This, this woke me up  today. I'm watching C NBC in Vanguard, which has the best  index funds in the world. Um, Vanguard's been around forever.  Great index funds, stocks, equities, stocks, equities. What  do they do today? They come out and announce that they now  have a managed, not an index, a managed bond fund, which is  fixed income. So in other words, and they asked the dude,  you're from England, they said, why are you coming up with a  managed? This doesn't sound like Vanguard. What that tells me is  that they got some big money clients that want managed fixed  income to put a shitload of money in because they see this  market dropping over the next year. That's what that tells me.  I mean, I just connected some dots today. And I'm like, why is  Vanguard coming up with a bond fund? This is a managed bond fund.  This is not like Vanguard. Why are they getting into this business?  And it's because they must know they have a shitload of money  that wants to be put into fixed income. So in that market  drops, those people still make money. The rich get richer,  baby. So let me ask you something how you've, you've talked  about owning Uber forever. Should we get out of Uber? If the, if  everything's going to crash and burn at some point, but the  problem now is Uber is so close to a hundred and we have a  mental aspect of everybody and their mother wanted in its so  institutionally owned. I do think we break through a hundred. Now  if we break through a hundred, what I put a stop loss in it, 95,  probably, probably. But I do think we break through a hundred  year. But I, with that being said, we may see a little sell off  right now. We may see a sell off. Now that doesn't mean everything's  going to sell off. Um, you know, I think China's probably a  decent place.  to invest right now. I mean, those stocks have gotten beat up. They seem to be handling this  tariff situation pretty well. Shit, did you see them core Elon back, Johnny? China's  the guy back. He left. We love you. We love you. You don't have to deal with your asshole.  President, come on over here. We'll take care of you. He's building all kinds of shit over there.  What's the mechanism? How do you get into China? What do you like? I like what we hold. We  haven't sold it yet. I like K-Web. That's the ETF, which has a lot of... I like tech. I like  Chinese technology. That's where I'm like. That's why we're holding it. That's why we bought  some Alibaba today. I went to drop below 107. I like tech in China. It's not going anywhere.  Would you hold the stock? Alibaba, would you hold the stock? Yes, I would. I think it's probably  150 to $100 stock over the next year, year and a half. It's another kind of boober style,  but for the rest of the world. It's like the Amazon of the Asia.  How do you see crypto and Bitcoin going up in this crazy time with all these dollars?  I don't. I see it probably coming back down a little bit. If you ever want to gauge crypto,  just watch American technology. On days when we have big sell-offs like today,  I'm sure I haven't even looked crypto's probably down. That's why you need somebody to hold  your hand, guide you through it. 100% Johnny. That's why you got to check out our good friends  at copy my crypto. Guys, it's a fishy off the watch crypto fly up in price for over a decade.  And you've still done nothing about it. Come back. Oh, no. It makes sense. Crypto is complicated.  Really, boy. And well, here's the good news. You don't need to know a thing about crypto to make money.  Like so many have the copy my crypto.com membership site shows you the exact crypto that  YouTuber, James Man, personally owns, which means you just copy him. It's like having a big  brother who knows what he's doing. You don't need to know a thing about crypto or how to invest  you simply copy along. So let me tell you about James. He runs a crypto with James YouTube channel,  which has over 54,000 subscribers. In the summer of 2020, he told his viewers about 26 crypto.  Had you put 100 bucks in each one. It went on to be worth $123,000 off the 26th.  Script those his top pick of the year. The one he singled out called Phantom went up 692 times.  when he said it. Wow. That one, call alone retired a number of people, including guys and girls  with face tattoos in their 20s and 30s. Remember, this is public knowledge. You don't,  you can go to YouTube and verify for yourself. So if you like to join the 2800 members who copy  James and puzzle you're doing right now and head over to copy my crypto.com slash Sam or cash  that's copy my crypto dot com slash Sam. S a M you not only, you'll not only find proof of everything  I've said, but my viewers are viewers get full access for just a buck. Yes, you've missed out  Bitcoin, but there's over 2 million other bitcoins. You really think you miss out on all of them.  Come on guys guys and gals don't waste any more time. Go to the site and read it. Once again,  it's copy my crypto dot com slash Sam or copy my crypto dot com slash cash that he's it's any  money worries for so many. It just may do the same for you. And again, we thank them for sponsoring  this show. Yeah, we're killing it. We're on fire. Yes. Yes. Yes. So, uh, how he I don't, I did you  did you say if you like Tesla, I know you said the guys are talking about it over there. What  where you looking for it to kind of drop to maybe get in on it. It is right now trading at  294 76. It's come back a little bit. I think we can get it under 290, probably 285 or so,  275 to 285. So we're going to be patient. It's down 7.6.5% today. I think you could drop more. Definitely  make a big move there. Is it just the Elon fact? They're kind of scary from from doing.  I, you know, we'll buy some calls on it. And if I can get a bounce and make a nice 20,  30%, I'll get out of it. Um, because long term, I'm a little afraid of it right now. I mean, you got  Eli, you know, with the Tisms, talking full line, going back into politics. He's starting his own  political party now. Um, and I love that Trump who for years said we need a third political party  for years that we don't. Yeah. Did you hear in the other day? So that's stupid. It's not a good  idea. It's never worked out. Why would you? And these idiots just want to run back and forth between  these two parties. You had Kim Iverson, the beautiful Kim Iverson going, I'm just going to vote  all Democrat now. Well, why did you vote? Republican before that is because the Democrats suck.  So you're just running back and forth between these two two parties that spit roasting us.  Yep.  It's ridiculous. It is. It is. It is. Do you think it's, do you think he, if anybody can do it,  it's Elon Musk that can get it off the ground? I think it would be hard. It's going to be hard.  I mean, he's a sharp dude. Look, I don't, you know, it's all it is. He's got the money. I don't  care. I mean, it's just the money. He's got the money to wait it out to get names on ballots to  get the party. Well, here's what he, here's what he can do when he will do. He's going to get some  Republicans just acts. He's going to, he's going to look at different states. I'll tell them,  dude. He's going to, he's going to kill kind of the trade and Minnesota and be like, you're gone.  He'll go to Illinois. You're gone.  you know, that's how he got Trump elected. So, well, we read all the things, even even the  retarded ones, iron mask, metal, bank, bill, dank, I'm on top of the trash heap in Philly,  vote, blue. Okay. Okay. Everyone's doing drugs in Philly. No, but you know Billy is a fallen state.  Yeah, but Sam, you know what he's talking about. No, I'll take it back. I will take the,  I'll take the R word back and say, I'm in our word. If you can tell me where I was wrong,  which I'll talk. What he's talking about is right now, Phil Doffia is the largest  waste management strike in the country. They've been on strike for like seven days and garbage is  piling up everywhere in the city of Philadelphia because all the garbage men are on strike. And  let me tell you, they better figure that shit out quickly because if this ever happened in New York,  oh my God, I can't even imagine. But no, there's the real problem. Phil Doffia right now,  they need to pay these guys, man. Um, so that's what he's talking about. There's garbage men aren't  working in Philadelphia. And if you look at the streets, it's just garbage is piling up quick.  Well, I was sorry with a drug act. Are you talking about, um, copy my, just go to copymycrypto.com  slash Sam and get in on it to win it. Um, real quick, Johnny, the name of the, the episode is  our nine to five jobs still enough in 2025. You said, you saw an article on that. What are your thoughts?  Yeah, hold on. Let's bring it up. Uh, but yeah, there's this, the story I found was about how there  so many people in the end, you know, the gig economy wasn't even a phrase before what like  five, 10 years ago, something it kind of became a bigger thing during the pandemic. And now you're  seeing, you know, it seemed that we had helped maybe at the time that that would be a temporary thing,  you know, once the pandemic was over, people could go back to full time, go back into their offices.  But it seems that, uh, because, uh, full time jobs, you know, traditional jobs aren't enough to  support a family now, because of inflation, uh, people are working, many more people than before  are working multiple jobs where I can't, can somebody text me in the thread that we all have together?  So I can find this thing out there. It is okay. Uh, that DD D, da, da, da, da, here it is.  This from Fox business is the headline is Americans trapped inside hustle economy as nine to five  jobs no longer pay the bill. This is from a lending tree survey. Uh, the typical nine to five job  isn't cutting it for many Americans as a cost of living continues to rise. Even with those  full time, even those with full time careers in fields such as real estate and tech,  they're turning to side hustles to cover the bills and make ends meet. We're seeing, and this is  a quote from Kira Kaban, who is a flexible work expert. Talk about making your own career.  Can you yell out yoga?  Yeah.  What's a flexible work expert in the head of communications for Insta work? What are that is?  She says we're seeing a surge in people turning to side hustles. I think she sounds like one.  It's a way to build financial stability in these uncertain economic times.  For many, flexible work is helping them cover the rising cost of daily essentials and giving them  the financial breathing room to enjoy things like a summer vacation, etc.  Two years ago, about 20% of new signups to their service, which connects businesses with temporary  workers, were between the ages of 18 and 24. That's jumped to 40% recently in recent weeks.  So it's twice as many young people are seeking temporary work as just a couple of years ago.  A March lending tree survey showed that about 40% of Americans have a side hustle  as the cost of living increases. Most of them, about 61% only have one and they say their life  would be unaffordable without it. 61% say they couldn't afford their lifestyle without a second job.  So this is coming from Ford last week CEO Jim Farland, Ford's come back a little bit.  They had a meeting with all his senior managers. The senior managers said, we got a problem.  We got all these young kids coming into the factory and their eyes are red and they're exhausted.  Because it is outrageous. This is during union contract negotiations,  finally learned from veteran employees, the young workers were struggling with low wages,  often working multiple jobs and getting inadequate sleep. Some workers were even holding jobs in  Amazon working eight hours there before clocking into a seven hour shift at Ford, leaving them  with only three or four hours to sleep. So the CEO Ford and response came back and he made  temporary workers full-time employees, made them all eligible for higher wages, profit sharing  checks, better health care coverage. So Ford's doing it, Ford's doing the work. They came in and  they upgraded all these, you know, temp workers and young kids working that were just coming in  because yeah, if you're making 17 hours of 17 bucks an hour, you got to work another job.  You can't live off of that. So Ford's the first to do a hopefully some of these other companies  file suit. They really need to. Yeah. It's funny though. How I wonder how that  because we know investors hear that and they're like, oh, that sounds expensive.  It's what I've always said. The more they spend on their employees, the more money and economy,  the more money will come back. The more it's, you know, Sam just said it and that's why it drives me  nuts. Some of these companies, Oracle, I won't really say it, but some of these companies just  have been stiff and employees for so long. And then you look at the CEOs and you know, every  yeah, they're there. Yep. Their numbers go up. IBM just fired 9,000 people and they're going to  replace them with these HP one visas people. Who's that IBM crazy? First of all, IBM's been using  Hb1 for hb1 for the last 20 years though I know but it still spucks  Yeah, but you got to look into that that's a those are usually specialty coding areas  You got to find coders. Yeah, they claim that they can't find them in America  You didn't you say they were laying off people with already with jobs Sam. Is that yeah?  Yeah, and they're gonna give them to  They're gonna give them to foreigners who will make less money and what will happen is because they're making less money  They can't survive so they all will group up and then you're gonna create little india's all over the place  instead of being a  Instead of being like assimilating into the country. They're just gonna create little pockets of where they left I  Wonder I I'd have to guess I'd like to get some specific sign in because I am man  Those if you're working at IBM and you're working in software tech those guys make a lot of damn money  Yeah, and that's why they're gonna replace them with foreigners who don't  Yeah, but the foreigners make a shitload of money to Sam. I mean we used to place  No, if you're gonna pay it American tech guy 150,000, you know, and then you're just gonna replace them with the Indian who makes 90,000  I'm not yeah, that's a possibility that could be possible. I don't know if that's the case  But they're doing that in every every area, and I mean  The India instead of staying in our economy  Oh, yeah, I mean that's that's not good either. I mean, but ai is a big part of this shit, too  I mean this you look at you look at the movie industry right now in these companies everything every company out there besides  Netflix is in is in a little hot water right now even Apple Apple's not crushing it well no, no, no  I'm talking about the movie industry. I mean that's well  Apple just had there. I mean they're only real movie hit this f1 movie  Generated more than two hundred and ninety three million dollars at the global box office. That's the most of anything they've released  I mean those apples not Apple Amazon  They're not crushing it in the in the film industry now they hadn't been until this film  But this this film is great by the way if you if you have the chance to go see it in the theater go see it because it's it's like  It's kind of like you combine days of thunder with top gun Maverick. It's all right Creed a little bit of creed in there  It's it's a good film. It's a good show  Why old these old white guys are just bailing out Hollywood?  again and again  The only thing that people want to see it seems as these old school movie stars  uh  and and and  So woke you can't that's it. That's it. Yeah, and I mean it takes a guy like Tom Cruise or Brad Pitt to just come  On set and say hey, we're just trying to entertain people here. Dude. We're not trying to  You know get a political message across  Yeah, I mean, yeah, let's let's make it somebody needs to come out with a new rocky  Um if our horse wins the wins and kicks that still make a movie on us babies  You'll be played by a trans that list  That's awesome. I like do it. You know what that'll be great. I'll go along with it  Yeah, it'll be yeah, you're it. What will your core drama will be like you were struggling with your transition and people are making fun of you on your podcast  So you turn to the horse to kind of you as you're like anchor in life  Yeah, you just go talk to him about your troubles. That's what they would do  I'll go up to the bar and wear one of those chick Kentucky Derby hats  Yeah, you can only dress out. You wanted to dress around the horse  You know, you'd be a horse amazing a world black woman with a with a  A world black woman with a giant black hammer. That's who you would be. That's who they play it. I would love that  I would love that just to friggin this is how we the hammer. I like it. Yeah, you might  The hammer and I was in the hammer Chad Zuma just sent me something  I was sniping your show. That's why people are sending you super chats  I made four dollars today just watching it. I don't know what the sniping me. I assume it means he's watching it on his stream  Oh, hey  Chad Zumaq stop selling our viewers  Guys we need the numbers even though we're doing the show is going up. We've had we we had one of our best weeks ever on YouTube  Last two ever really good. Yeah people get it  Jack Dorsey has launched a WhatsApp messaging rival, but it's built entirely on Bluetooth. It's interesting  It's a peer-to-peer messaging app that works only on Bluetooth the chats are encrypted a femoral meaning they disappear  And they're stored only on the device with no account numbers or servers involved  Now the thing that I wonder is like that would be limited by range right like Bluetooth is limited range so I it's called  Bit chat a new decentralized peer-to-peer messaging app as I said works entirely over Bluetooth mesh networks and mesh networks with no  Internet central servers phone numbers or emails required and you know who's gonna blow that up hookers  Oh, yeah, yeah  Does anyone at all believe that the CIA can't see any of this stuff? Of course not I  Mean that's that's that's the thing about anything that says a protection data like that's Facebook and  Who else says that now?  Safari your data safe. Yeah, yeah, but there's back doors on everything  Yeah, the only way to do it is to stay off the f-ing internet. Yep. That's it. That's it. All right. How we? What is your pick of the week?  We bought it today by a BA BA  We baked on this in the past. I think we're gonna bank out at this time  Cheating saying  Let's say I'm which of the good  What kind of sandwich?  What kind of sandwich is it a big banana turkey turkey nice. That's good. I like a turkey sandwich  Can't be  I got you if you really all learn where to make your money and how to do it you got to go to our good friend  How do you shoot you I gotta leave I guys I gotta leave and come out because I can't hear you. It's probably my thing  The show's probably gonna get better  The dinner gamblers it's hoarse racing. It's baseball. We got cows football month and half  It's gonna be so crazy. I got my boyfriend clients  one of the best thoroughbred handicappers in the world  On all the time he's done a Churchill's downs right now doing his thing  Yeah, if you're into betting and you know with all the help from the new big beautiful bill  betting's gonna just be beautiful. Oh, yeah, and then  If you want to see me live because I've been on fire lately go to simkamly.com grab your dates now  Hey, we got San Diego coming up Boston broadbrook  Kansas City Tulsa Oklahoma Oklahoma City  M and skank fast so go check those out while you can and  Um, what do I have to say to you how we oh? Oh, how we dance done all next season  No, that's yeah, of course. Ah howie  What are your thoughts on that the Dodgers are insinuating that the Houston Astros are stealing signs again  Because they got their ass beat by like 20 runs you know  Or or her Shizer is like  They're hitting everyone these breaking balls. It's like they know they're coming  You said it's like the China of baseball they can cheat  Yeah stealing signs ain't cheating though if you're if you're letting your signs get stolen  That's part of the good point Johnny good point. Yeah, but if you're telling the batter  What's coming that's yeah, they've done that forever dude guys on bass doing little weird  If you don't get caught the drumming thing is different because you're bringing in like like a piece of equipment  That to enable it, but if you're just like doing a little bit with the little guy said he's when they try to tear his shirt off  He's like no, I'm shy  My girlfriend doesn't like when I  Who is that yeah?  Do you think got to be getting a hall of fame?  Probably  Good player or very bonds and before  Clemons a two legginson. Yeah, you just mentioned to juice head Sam  Yeah, but they are busted in the world series cheating dude. They have just mentioned to the biggest juice heads of all the  It's team things. I mean wasn't just the end of the world none of those scumbags should get it guys  We love you tell your friends about it and  Let's uh, let's go to the patreon where the bangers bang join the patreon. That's where all the good stuff is  Yes, yes, we just sent Dustin Yarbrough there  He talks all about it. It's uh, he was looking for some tips. I go go check out how we do we on the cash days  Patreon  Yes, it's $20 yes  That seems like a lot until you realize the potential to make money  It's just an education man  Like three years ago and guess well inflation's gone up like seven percent his the patreon can't know it's the same 20 bucks  $20 most of these things are like this are  $200 yeah  I think most of the things like this are two million dollars mostly is what I've seen guys  You said I can't afford the bang you can afford the bang dude  You can afford to bang  $20 a month you make more money back bang  Okay hot chicks all right  All right guys, we'll see you at the patreon  On big fan of hot chicks. I have to say dude who is it they they ruled the rules"