" A reported shooting at the DHL cargo hub near CBG.  The death toll in Texas flash flooding rises above 100, but doesn't still miss it.  And Joe Burrow gets his close up on Netflix, the new season of Quarterback is out.  5 on 5.  In 5, it is Tuesday, July 8, 2025.  Kelly Ripon, maybe Mitchell Stephen Albright in here with you.  On the podcast at WLWT, and they're very busy morning, but the weather's going to cooperate  for us.  Yes, turning down the dial a little bit.  It's more comfortable temperatures.  Yeah, I think everybody can appreciate that.  The rain came through yesterday, which I was really kind of waiting on because I kept saying  to my kids, we can't go to the pool because it's going to rain, but it's not raining.  But there's dark clouds, it's breeze, it's going to happen.  And then it did.  So that knocked the edge off the high heat and the humidity.  So it's honestly pretty quiet today.  More comfortable as well, especially for early July.  Plan on temperatures in the mid 80s.  A stray shower is possible, but most people do stay dry.  And it's a 3 to 1 Tuesday down at GABP.  They're also fundraising for the Red's community fund.  So if you have any idea what the Red's community fund is, even if you don't look it up,  they do great things in the community to make sure that our children are finding ways and  outlets and things to do.  And they make sure that people are fed.  They do a lot of good stuff.  So they'll be fundraising this afternoon in this evening as well.  So let's talk the future forecast because those storms, storms, storms.  I have a side note that I'll tell you guys later.  Storms and showers do pick up again tomorrow.  So Wednesday and then we kind of just get in a pattern where there are rain threats almost  daily.  So just be aware of that.  Kelly, thank you for that fantastic weather forecast.  Hopefully it continues fantastically, which we know how Midwest weather does.  And it will not.  But that's just what we're going to deal with.  Let's get into our headlines five on five in five.  First up, we're going to the airport.  Yeah, police work through the night to investigate reports of a shooting at a cargo hub.  We first told you about this in our 11 o'clock newscast.  It's happened.  It happened at the DHL facility south of the airport.  No details from police.  And airport spokesperson said first responders were called to a quote reported incident,  but didn't say what?  A CBG spokesperson said airport operations were not impacted and have deferred further  questions to DHL.  They just told us that there was an incident where one person was injured.  They cannot tell us how bad that person was injured or if they were shot.  Last night at DHL employee at the facility told us that they heard what sounded like fireworks  and saw a car on fire in the parking lot.  That incident may be related to a shooting.  We are not sure police were on the scene there for hours of overnight.  And right now we're working to get more details from police on exactly what happened with  that police report.  Very light on details there of looking forward to seeing what actually happened overnight.  Let's go down to Texas' story.  We'll continue to lead the way on and that toll keeps on rising.  It's all anyone can talk about just because how awful it is.  There are some incredible stories of survival that are starting to come out.  But the death toll now at 104 people from the catastrophic floods, the vast majority of  those deaths in Kirk County, which is not far from San Antonio.  Now, vigils are taking place for the victims already.  In Texas, Governor Greg Abbott is preparing to give an update today on the search and rescue  efforts as they enter a fourth day.  A lot of people still holding out hope for any kind of survivors.  Two dozen people are still missing and authorities are facing growing questions about whether  the communities were warned early enough and if enough preparations were made.  Now in Kirk County, there are no siren systems despite years of debate over the cost of  installing them.  The Union representing the National Weather Services on the night of the deadly storms.  They were adequately staffed.  They issued a critical flood warning 12 hours before the storm even began.  However, the Union says federal budget cuts have them concerned about staffing for future  storms.  Democratic leader Chuck Schumer has called for an investigation into the ramifications of a  staff shortage.  The White House, though defending those budget cuts saying this was a once-in-a-century  flash flood.  Unfortunately, in the wake of this once-in-a-generation natural disaster, we have seen  many falsehoods pushed by Democrats such as Senator Chuck Schumer and some members of the  media.  Blaming President Trump for these floods is a depraved lie and it serves no purpose during  this time of national mourning.  Here are the facts.  In the lead-up to this tragic natural disaster, the National Weather Service did its job.  Despite unprecedented rainfall, the National Weather Service executed timely in precise  forecasts and warnings.  Texas authorities were just staying focused on what they can right now on the search  and the rescue mission.  They do plan to investigate what went wrong, including a review of weather warnings, how  they were sent out and how they were received.  All right, next story.  Something that's kind of gotten lost a little bit in the headlines, but a story that was  very important, especially when the Trump administration took office.  Right, so the Justice Department says there is no evidence.  The Q-SEX trafficer, Jeffrey Epstein, kept a client list or was murdered.  This comes after U.S. Attorney General Pam Bondi said in February the list was sitting  on her desk ready for review.  The DOJ's admission goes against previous promises from President Trump who spoke about  releasing more government files on Epstein.  The government says Epstein died by suicide in 2019 while awaiting trial on federal sex  trafficking charges.  The administration, now standing by those findings.  Back here, locally, you may remember that viral video outside of the Montgomery in  Boat House, but the trial was continuing here.  So collectively, in our morning meeting, everyone, wait, wait, what?  Kind of thinking of this at all been over.  I heard somebody else say that that yesterday after it did resurrect.  We are talking about a trial for one of the people charged in the fight outside of the Montgomery  in Boat House.  One man has taken a plea deal.  That's Kyle Raleigh.  Another is now facing trial for a menacing charge.  Video of that fight went viral online last year.  Doug and Lois Morrow were injured.  Kyle Raleigh was charged with assaulting the couple,  and he took the plea deal and was sentenced  to three years probation.  Now the son of the couple, Troy Morrow,  is going to trial.  During the brawl, Kyle's father, Steve,  said that he felt threatened by Troy's actions.  So jury selection wrapped yesterday, opening statements,  said to begin this morning.  In our final story of the day,  we all ended up talking about football and how football season.  You know we're going to be playing pro football games  by the end of this month.  The Hall of Fame game is the last weekend in July.  So we are in football season.  Just so everybody knows that.  So be ever leave football season.  No.  OK.  We're staying at it all the time.  But let's talk about the Bengals and the one and only QB1.  It's been anticipated all year long.  We were surprised when it was announced  that he was going to be on it.  But the new season of quarterback is out.  And Bengals quarterback Joe Burrow is front and center,  making his debut.  In December, we are member when his home was broken into.  That is in this series.  Remember he was away on Monday night football.  And some guys part of a Colombian gang  or something like that hitting a bunch of athletes  homes and Joe Burrow was in that.  But it's episode six where Burrow addresses  the media frenzy surrounding the invasion of his privacy  and how he dealt with that.  So I'm already about 15 minutes into episode one.  It's all Joe Burrow centric.  It's I'm about to hit play on Game 1 against the Patriots,  which did not go the bank.  I would say, unfortunately.  But I'm intrigued to see how Joe Burrow navigates this year  coming off of injury, slow start once again.  Home gets broken into it.  And he ends up being come back player of the year.  So I'm fascinated.  You know, I don't think that this is any type of spoiler.  But when I looked up some of the headlines  on this documentary, all of them had to be believed.  Because there were a lot of things that came out of Joe  Burrow's mouth, especially during gameplay, where you're like,  oh, yeah.  It's when you get on the football field languages you use.  I'll never forget.  I was, I don't remember where I was talking to an ex-identify  football player.  And he always talked about how you step inside those white lines  and you just change the person you are outside of those lines.  It's not the person you are.  When you are inside those lines and it's sort of like news.  All such a one.  Those lights come on.  And you walk in and see where it can't be said.  Then when the lights come off.  I'm glad that we don't have just pulling back  here in a little bit.  Mike's, oh, thank God.  What was it called?  Was it breaking the news?  There was reality show.  Of that small TV show.  Alabama, Greenville, Alabama, Greenville.  There's a bunch of small market news and they put cameras.  I think it only had one.  It did.  But I do know my news director at my first market was contacted by  the other together to see if they wanted to come.  And to this day, I say it would have been fantastic to  television.  My first newsroom.  Oh, 100%.  No one's making any money.  You're like scrapping by, you know, people are dating.  You're all, it's a mess.  The wrong.  Yeah.  It's a mess.  That's fine.  Because eating for same jobs.  Yeah.  And nothing going on in the rest of the town usually.  There'd be some slow days.  There'd be some slow days out there.  But those are the times we always remember.  And I appreciate every moment in those smaller markets.  So kids out there going to get into this business, go to small  markets.  You'll never forget it.  You need your best friends there.  Wow.  We want to do a lot of tangents there at the end of this podcast.  I'm Joe Burrow to small town news stations.  That's how we do it.  So enjoy quarterback.  Let us know your thoughts.  We'll see you back here on Wednesday."