" Thank you very much Scott and welcome to the Exchange.  I'm Kelly Evan.  Stocks are moving toward session highs as tech leads once again.  The NASDAQ set more than 1% right now.  The Nvidia is up 3% regain its crown as the largest market cap.  S&P's up 39 points, 447 on the 10-year.  Dollar is strong today.  The dollar stores that is above the green back is two.  Dollar general is on taste for its best day ever.  With a 15% pop nearly on after-it-top Q1 estimates and raises full-year sales outlook,  Dollar Tree up about 5% in sympathy as well.  And meta-signing a 20-year agreement to buy a nuclear power from constellation energy.  Consolation initially, sword on the news, but is now basically clad to 1% day.  We'll have more on that, what might be going on ahead.  Let's start with some breaking headlines, though, from Fed Governor Leeds of Cook.  In her speech on monetary policy, the council of form relations in New York and I'll do my best  Steve Leedsman here.  I bring you some of what we've heard so far.  Cook saying she sees evidence that trade policy is starting to affect the economy by increasing  the likelihood of both higher inflation and labor market cooling.  She also says the response from financial markets, businesses and consumers to trade policy  changes suggests risks to both sides of the Fed's dual mandate and she expects a slowdown  and the pace of economic expansion from last year's pace.  I mean, maybe a one basis point back up in the 10-year on those remarks here to react.  Talk more about what's going on in the economy.  Tom Simons is chief U.S. economist of Jeffries.  Great to have you here.  Welcome.  Thank you, Kelly.  We've sat through a number of big events the past couple months.  Yeah.  Finally, here we have a chance to kind of digest everything that's going on.  And the jolt state of this morning.  I mean, the hiring was it what?  It's highest pace in a year?  Yeah, and job openings increased as well.  But trying to parse together the details of that and you look at sector specific things like  with healthcare or food accommodation services and whatnot, it seems like you know,  get a drop in job openings, but then that sector had an increase in hiring,  so it's like they filled the jobs, right?  Quits fell a little bit, but you know, fell in areas where, you know,  the economy is running very hot, right?  Like a trade and retail trade, wholesale trade, manufacturing all the logistics around  So it's not a problematics in for you.  No one's quitting because they need to work.  Right.  So I mean, I think that it was pretty steady state, which is very similar to what we've seen in a lot of  What month is it now?  June.  So this was the April date.  Yeah.  Here's what's so interesting about the April date.  It's been okay, you know, for a month they had one of the biggest headline shocks we've had  in years in terms of the liberation date tariffs, the market absolutely tanked.  That alone sometimes has an economic effect and nothing.  You know, I think it's just a good reminder that a lot of the data that we see we always refer to it  as lagged because, you know, we got April data in June, but it's also lagged because a lot of the things that  that make up that data would have been based on decisions that happened months ago.  Absolutely.  So especially with hiring and anybody who's ever tried to fill a position knows that it takes a very long time,  the approval for it may have happened months and months ago.  By the time that person actually starts the job and will be counted on payrolls,  it could be many months down whenever.  Follow them more high frequency like the LinkedIn or indeed.  I mean, sometimes those indicate you see any.  So do you think the Joel's number is kind of real or do you think that there is a slow and unhappening?  Because just this morning, Torsen's lock was out there with a district list talking about,  could we be down to 60,000 for the next jobs report?  Right.  And I actually expect that the number that we got on Friday is going to be pretty soft as well.  We're only at 95K, which I think might be the lowest number in the survey.  But, you know, I think that's more an issue of weather.  You know, it was very, very wet in May.  It rained a lot, especially around the East Coast and throughout the southern United States.  And May being kind of like, you know, prime spring season is when there's a lot of activity,  whether that's construction or leisure and hospitality.  Maybe they don't, there's a little bit more slack, maybe, right?  So of expecting that it's going to soften things here.  But, you know, whether, you know, Joel Sir, the other high frequency data are telling the right story.  I don't know that it's necessarily one that can be identified versus the other.  I do think that it is very reasonable to expect that demand for labor is slowing,  as economic activity has come off.  It was really a torrid run for quite a long time.  It's reasonable to expect that.  But, you know, it just things feel like they're holding up okay.  Yeah.  And light of these massive moves, you know, that we've had.  So some of the consumer data points, even we're talking about, you know,  you can read the dollar stores to it.  Well, they're strong because consumers weak.  Right.  Then, again, they also have a lot of discretionary involved.  So you can't be that strong if things are really slowing down.  So I just try to figure out what's going on.  The GDP data is going to be really high in part because the import rebound.  Personal income was high, but that was in part because of the social security thing.  So it's like, but you strip all of that out and it still feels like the core data is pretty good.  Yeah. And I mean, look at the equity market too, right?  I mean, I think that something that's illustrative is that.  At least as far as the detail that I am aware of is that retail didn't really sell during the big sell-off, right?  Like, this was a lot of institutional investors' repositioning.  But they weren't saying, like, oh, no, we need to now get liquidity by selling stocks.  Instead, it was more by the dip as far as I know.  So to me, I think that's also illustrative, the fact that people who have assets who have higher incomes  are doing much better than those at the lower end of the spectrum.  There's going to be winners and losers within the consumer spectrum in terms of spectrum  in terms of, like, people substituting different higher lower cost goods.  That's going to continue as we see price increases and price changes from tariffs.  But I don't think that there's any real evidence that we have a big loss of demand.  And I don't think that we've seen enough cracking in the labor market to think that that's going to happen really any time.  Have we seen enough for Fed rate cuts? Where's the market on that?  And what does it mean for bond yields if that ends up not coming to pass?  So I don't think we've seen it yet, but if we get my number on Friday, and then if we see subsequent weakness  follow through in the summer, I think that maybe by September we could be ready for a few rate cuts.  But as Lisa Cook mentioned, there's this inflation impulse from tariffs that's difficult to sort of balance against what's going on in the labor market.  So you don't want to stoke all the sudden low cost borrowing and up preserving higher and higher spending.  For sure, but if we are low on Friday because of seasonal reasons, it's going to mean we're going to have to wait many more months to see if we're going to have low numbers because of cyclical reasons as well.  So yeah, that's that's an issue. And you know, the bar for the BLS to tell you that the weather impacted data is extremely high, right?  They would have to be some sort of cataclysmic disaster and perils it have to be very negative or something.  So they're not going to have in the press release like weather impacted this, but I do think that's going to be most people's takeaway if it ends up being weak.  And yeah, it just adds to the kind of merciness of the data and difficulty in that decision making.  All right, Tom, it's great to have you. Thanks so much.  Appreciate it today. Tom Simons with Jeffries.  Our next guest also has some unique insight into the markets, the consumer mergers and IPOs.  Joining us now from stifles and you will cross sector insight conference is stifle financial chairman and CEO Ron Krishewski.  Ron, it's good to see you again. How are things? Welcome.  Hey, Kelly, everything. Great. How are you? Good. Good.  I mean, we've gone through a couple of these sort of interviews this year where at first we were in the midst of the January run up anticipating a deal boom and all of this.  You know, your shares were flying everyone's were last year. Then we had the big correction and the tear of scare. Where are we now?  You know, Kelly, it's like RIP and Boincle. You and I could go back and if we just closed dry to January and we looked today we think like nothing happened, right?  The markets exactly where was this the beginning of the year.  And I haven't really changed at the beginning of the year.  I was cautious. I said, look, the market's trading at 23 times forward earnings in place in a sticky.  You got to be careful. And then, you know, on liberation day, I was on your show.  If you remember and I was pounding the table, then you need to buy socks at 4800.  I'm right, but we're right back to where we started and I don't think the risks have really changed.  They're what they were in January.  In other words, so it's so fun. I listen to you. I listen to Jamie Diamond. It's like it's in your guy's blood to just come out.  You're supposed to be the one saying companies, you IPOs and deals and get into equities.  And instead, I feel like you guys are always like careful out there. Everybody like bond markets going to crack.  You know, the crazy things are going to happen.  I'm not saying that. I look at I remember, Kelly, I was saying by equity when everyone was panicking on terror.  That's not the new normal. I was on your show and said, have me back, but you did have me back. Thank you.  But look, I think, I think at the, you have to look at where we are. This market was being driven on two things tax reform and deregatory.  Neither one we've seen yet. And the one that has to take in the spotlight that people underweighted in terms of risk were terrible.  So look, I think that we're going to see clarity and terror of the tax bill probably by Labor Day.  The regulation is coming.  But from my perspective, I'm just being realistic here.  The route to 7,000 on the S&P 500 is probably going to go through 5500.  I think you're going to get a little bit of a pull back there again.  And I'm being cautious as usually are.  And when I'm right, I like to remind myself and remind you when I'm wrong, I just don't show up on your show.  No, we all know that it's not just you.  Oh, that's seeing us coming on our earnings. Oh, that one's not okay. Sometimes they surprise us.  But no. So I think the reason I don't know if you just heard part of the last discussion is to try to figure out,  are we heading into a period of economic slowdown or is the economy actually resilient and fine.  And I'm just curious if you could tell us maybe because of your strong network of all the businesses,  you know, your dealing with the businesses, especially mid-sized small.  This is the front lines of what's happening or not happening with tariffs.  And what are you seeing?  Well, you know, I'm putting on certainty.  Cali, that's the thing that is causing the most.  The reason we're not seeing the rebound of capital markets is this is uncertainty.  Here costs a good toll.  That means tariffs.  If you don't exactly know what your supply chain is going to cost.  It's hard to price your product.  And it's uncertainty on how the tax will finally settle out.  But look, I'm seeing generally optimism.  The retail investor's photo speech went through this with a really no problem.  They didn't panic at all in terms of that.  But what do I see?  I see a flowing economy, not a recession.  And I think you're going to see a pullback on the consumer of spending,  which is going to impact the market a little bit.  So we think that you're going to see a slowdown before you see the market roaring to 7,000.  And I'm not, look, I run a wealth management firm.  I'm paid to be optimistic.  And I am optimistic.  But I'm also realistic.  Where would you say if this was like a mini beige book?  What are the strongest and weakest parts of the economy,  whether it's by industry and geography?  Look, I think the overall economy is fine.  It's just equity valuations of five.  So if you start today and try to do normal earnings growth with a reasonable PE and you look forward  from today, you might get a five or six percent return total return in the equity market.  And heck, you can almost get that risk in treasury.  And that's where we draw a little bit of consumers.  No equity risk premium in the market today.  The economy is fine.  We have to get through this tumultuous time of tariff.  I'm not sure we're done yet.  You know, the president's been people pointed out that taco trade.  You know, throw away chickens out.  You know, if anything that owned bold in the president,  but he won't chicken out next time.  And so I think tariff's are not over yet in terms of the risks of that.  And we got to get through this period.  But we get tariff behind us.  We get the taco done.  And then we get a deregulatory done.  And this market will will be just fine.  Yeah, you guys, like, if you coin the term, you have to know the impact it's going to have.  It shouldn't be a short seller who coins the term.  So by the time it makes it to the president, he reacts it away, which they don't appreciate.  I just wanted to mention the deals that we are seeing the IPOs that we are seeing.  A lot of them are mid market.  And that's where you guys are.  And that's really been the area of shit.  It's not the mega mega stuff.  But that's also where I hope to see.  The de-regulatory come from.  I mean, we're had our at our conference, our prospector conference.  And what we see is a real need for capital and companies that need access to capital markets.  And it's encouraging to see middle market companies,  start to go public now.  But yeah, nearly what we should see.  We need to make it easier for company's access to public markets.  And by the way, Kelly, make it easier for the average investor to share in the wealth creation.  And kind of states that's who IPOs.  And we need to see that.  And that's what they're talking about here.  That in AI.  I mean, you know, AI is, you can't go to a meeting when I talk about AI here.  Believe, I could go on and on about how I've used it just in the past 24 hours.  So I understand, Ron, it always good to see you really appreciate the time today.  Kelly, good to see you.  Have me back again.  All right.  Any time.  All right.  She falls Ron Krishewski.  Coming up, the only mag seven name in the red over the past year is Alphabet.  Amid regulatory threats to search and its ad business.  But there's another part of the company.  Our analyst says it's getting zero value despite being one of the most exciting.  I have more on that ahead.  But first meta, signing a 20 year agreement to buy nuclear power from  Consolation Energy.  We'll have those details and more on the stock reaction when we come back.  This is the exchange on CNBC.  Welcome back, Shares of Consolation.  Energy, not the beverage giant.  Our pairing their gains after initially soaring on the news.  They've signed a 20 year agreement with meta to provide them nuclear power.  Let's bring a tip of Steven's with the details and pivot.  Why did the market go from jazz to what's the opposite?  Classical?  Well, first, Kelly, let's focus on the deal.  Because this is meta's first nuclear deal.  The company will buy all of the power generated at  Constellations Clinton, Clean Energy Center in Illinois,  which has one nuclear reactor beginning in 2027.  The companies did not say how much meta is investing,  but they did say without the backing,  the plant would have been in danger of closing in two years.  Now, this nuclear plant is not going to power a meta data center directly.  Instead, it will continue to power the regional grid while helping  matter reach its goal of 100% clean electricity.  This is just the latest instance of hyperscalers,  teaming up with nuclear.  As energy needs balloon, thanks to AI,  Alphabet and Amazon are backing small modular reactors.  On Microsoft signed an agreement last year to restart  three mile island.  Now, in terms of the share reaction,  Constellation pulling back here after earlier rallying 15%,  still, cigarette capitals,  Arthur Hyde said this is clearly positive for the nuclear  thematic, supporting the view that nuclear assets are strategic  and scarce.  The stock Kelly had a big run last year,  so perhaps a little bit of a sell the news and also  got some angst around the lack of disclosure around the deal terms.  Oh, interesting, but still a remarkable step here.  20 years of nuclear power, I know the CEO,  I'm apparently recently said, you know,  the nuclear is here.  It's really having its moment.  Pippa, thanks very much, Pippa Stevens.  And while shares of meta are still at 15% in year to date,  making it one of the strongest in the mag seven,  Alphabet has gone the other way.  It's down about 11%,  but our next guess says that's about to change.  UCF Scully is head of internet research at true securities.  UCF, I guess, you know, these days companies have to be busy  signing 20 year nuclear power deals.  I don't think anyone had that on their Bingo cards five years ago.  No, no.  I'm just kind of to add to Pippa.  I've been talking about access to nuclear power.  Just access to power in general.  It's becoming really competitive advantage.  And so for meta to be able to lock in 20 years of nuclear power  from this from constellation,  I think it's really, really important.  We see it as certainly competitive advantage.  And something that from P&L standpoint has already been accounted for.  He's already been accounted for with the way  Capax and Opax has been growing now.  This is not going to hit until 2027.  So, you know, impact right now.  But I think the strategic importance of it  cannot be underestimated.  Yeah, and I, you know, I think it's also smart,  frankly, from a PR point of view.  You know, they're in my local paper.  They had an article the other day about protecting consumers as data.  And this is a new jersey.  I don't even know if we have data centers.  You know, but they're saying as data center usage grows,  they're trying to make sure that that doesn't drive up bills for a customer.  So, I would think with big tech, you know,  and all the anti-trust scrutiny,  the last thing they need is people blaming them for higher power costs.  I think that's fair.  I think that's fair.  I think you're jersey in particular,  your state has, is seeing just from based on what I've been here,  and as well, pretty dramatic increase in,  in your electric bill.  So, anyway.  No, thank you.  You're here to talk about Google as well, or alphabet.  Indeed.  And maybe, you know, as we all pivot towards Robo Taxis,  we have to worry less and less about our energy cost over time.  But I know you're saying that that is like the way Mo business,  and we had a flurry of headlines about Tesla  that were better than expected earlier today.  You think Waymo is increasingly showing itself  to be an incredibly valuable part of alphabet, right?  100%.  I think today at $16570, I think Waymo's being carried  effectively at no value.  Even though the last round,  I think it was series C that was done  in late last year was done at about 45 billion.  And that was before the company has announced  that they were doing a quarter of a million rights.  We think that's exponentially going to grow  over the next 12 to 18 months as they roll out new markets,  as they partner with Uber, as they partner with Toyota, etc.  So, we think Waymo within the next 3 to 5 years  should be in hundreds of markets generating over $10 billion  in revenues.  And, you know, enjoying valuation,  more than $100 billion, which again,  is like over $10 per share,  not reflected in the in Google stock today.  You think it won $169, which is where about  where we are, the various pieces on their own  would add up to a business worth about $200 to $210 share.  So, that's a pretty big discount.  Exactly, exactly.  I mean, the caveat is obviously what happens to search, right?  Because today, search by our estimate,  account for about $125 and about $169.  And, you know, the bears will tell you that,  you know, with the onslaught of ChadGBT,  complexity, et cetera, you know,  Google is bound to lose share,  and that's going to eat into the value of search.  Our content is just like what we've seen in 2012  with the advent of mobile.  It had an expanding effect on the tamarth  the total dressable market of search.  And I think AI or LLM driven search  is definitely also going to be expanding the overall  tamarth search way beyond what's been baked in today.  So, even if Google goes from 92% market shares  to 85 or 80% market share, which is conceivable,  I think that your overall pie is going to grow  and the pricing of these search results is definitely going to go up  from value to the advertisers just going to go up.  Yeah, that may may well be true as we saw potentially in earnings.  And again, good timing with the way both business  regardless.  You sit thanks for your time today.  Appreciate it.  Thanks, really.  You sit gully with the trueest.  Meantime as the Senate digs in now  to the GOP's massive reconciliation bill,  one lesser known provision is starting  to spark some outrage from states  who could find they have their hands tied  on AI regulation over the next decade.  Dear Javos, I have more on that angle  in today's tech check.  Hi, dear Javos.  So, Kelly, on paper, this is a push  for national consistency, but in practice  this actually blocks near-term regulation  by shutting down the only regulators  who've actually been acting.  That states like California, New York.  And that is the real strategy here.  Shift the power to Washington  where federal rules are stalled  where agencies lack clear mandates  and big tech has more influence.  So, the result is actually a regulatory void  or it would be and into that void  a new narrative is taking hold  one that is being pushed by Trump's AI  SAR David Sachs and other Silicon Valley figures  that AI safety advocates are just wrong  but they're part of a globalist campaign  to slow American innovation.  At the center of that argument is China.  That every hesitation here is a gain for Beijing,  post-deep seek and as Jensen Wong warns  that we could fall behind.  This is a new angle for the accelerationists.  For investors at narrative shift matters,  a decade long freeze on state oversight  that could mean fewer near-term hurdles for AI.  But it's also an admission  that China's catching up.  And it's not just playing out in Washington  but potentially at megacaps to  Meta's latest AI Reord Kelly puts a focus  squarely on product over research  at prioritizes speed and deployment over  safety work over caution.  It could also send a signal to Apple,  which has taken a more cautious privacy-focused approach  and thus fallen behind.  It's basically a message saying  accelerator get left out, especially  as WWDC approaches.  But in other words,  the crafters of the bill would argue  they don't want states to stop  tech companies.  Kind of like what we've seen with California  and this fight over a car emissions,  that kind of thing.  Yeah.  I mean, Gavin Newsam has said  that he would love for federal,  national regulation,  but he just doesn't think it's possible  because it's at the end of the list  and there's not a lot of driver incentive to do it.  So he's doing the next best thing,  which is figuring it out for California.  And that's why I say sort of on paper  it looks good,  but in practice,  never going to happen at the federal level.  So this is really just an excuse  but from many people who are incentivized  and because of China catching up to  to accelerate,  make sure that AI is moving ahead as quickly as possible  for better or for worse.  But of course, there's the other side,  right?  People like Dario, M.O. Day,  at Anthropic and a lot of the research labs  argue that you got to be careful.  You got to have regulation,  a little more caution in place.  No, I understand.  Dear Joe,  appreciate it,  and we'll see what happens with that bill  as it does move through the Senate this week.  Dear Joe Bosa.  Coming up,  the housing stocks are rebounding  from yesterday's big drop  after that weak construction data.  But homeowners overall  are sitting on a record amount of home equity.  And we'll tell you what they're doing with it next.  Welcome back.  Second day in a row,  we were in the red  pre-market and green  by the afternoon.  So far with big tech leading  today up 1% mentioned in  video.  Dom Chiu has a look at that  and some of the other big  viewers.  All right, so Kelly,  we're going to start off with  something other than big tech.  How about some market  bling?  That's coming from signage  jewelers right now,  which is sold by around 10%.  The surge comes after  the world's biggest diamond  retailer and the parent company  of jewelry store brands like  the market.  It's a very important  profits and revenues that both  top estimates.  It also raised its  full year guidance indicating  perhaps that consumer  demand remains relatively strong,  so sign it up 10%.  Sticking with the consumer  shares a  victorious secret.  Having been moving  between gains and losses,  now just out about two  thirds of 1%.  This is all after the  retailer of women's  intimate wear, casual wear,  delayed the release of its  full quarterly earnings report  because of the effects of  a recent cyber attack that  the industry did not  affect the financial  results of the reporting  quarter,  but it has not yet announced  a new release date.  It did pre-announce  profits and revenues that both  came in above consensus.  That's a myth.  So on balancer,  Victoria's Secret  down fractionally.  Well,  cap things off with that big  tech trade right now,  the battle for the most valuable  company in the markets.  Three members of that  $3 trillion club are  jogging for the  market cap heap here.  That's Microsoft  and video in Apple.  As things stand right now,  we do see  the  $3 trillion.  Just a hair of  Microsoft right now.  Apple should right now  just about $3.03 trillion  overall.  The last time in video by the way,  close with the title of the  most valuable company in the  world is back on January  24th.  So far this year,  Nvidia has been up 6%  Microsoft up 10% and year to  date Apple.  Cali down 19% all  something's back over.  Starting to feel like  it.  There you go.  Back to where we started  in many ways,  dumb banks.  To contest a brewer now for  the CNBC news update.  Contessa Kelly, a federal judge  has dismissed the state of  California's lawsuit  challenging President Trump's  tariffs, citing jurisdiction  as threes in it,  partially siding with the Trump  administration.  The judge said the case belongs  with the specialized US trade court in  New York,  not the northern district of California.  By dismissing the case outright,  however, it leaves a path open for  the state to appeal to the  Marc da Blue prince and  Mr.  Brian Syrkith,  Americans are scaling back  some travel plans.  Reuters reports people are  downsizing vacations or  waiting for kids to look only when there's  a deal and airlines are facing  a 10% drop in summer settings despite  lower fairs.  Hotel pipelines split or  down from last year,  The iconic good-year blimp turns on 100 years old.  It's been gracing American skies for a century.  First taking flight, June 3rd, 1925.  And since then, there have been 31 good-year blimp.  The Akron-based tire company will celebrate  the milestone this year.  Backward all started, flying three blimp's  over Northeastern Ohio throughout this week.  Ohio, of course, produces the inventors of aviation.  Because they have the right brothers, too.  They've got it all.  It did not realize that happy birthday to the blimp.  Contest the things.  Meantime homeowners are sitting on a record  amount of home equity, and now they're beginning to tap it.  And Diana Holick has more in the store.  I'm curious, Diana, because we found the process  to be expensive, difficult, and many have pulled out  of the business sold together.  Well, let's change in Kelly.  Look, the steep run-up in home prices over the last five years  means roughly 48 million homeowners  are sitting on a record amount of collective cash.  17.6 trillion dollars to be exact, that, according to new data  from ice mortgage technology.  That is the full amount of home equity.  Now, they can tap about 11 and a half trillion  of that while still leaving enough to make their lenders happy.  The average individual homeowner can pull out  about $212,000, not too shabby.  In recent years, homeowners have been reluctant to take equity out.  They still, of course, remember the great housing crash,  well over a decade ago, but that appears to be changing.  Number one, because in the first quarter of this year,  all home equity withdrawals, including home equity lines  of credit and cash out revised total $45 billion.  That is the highest Q1 volume in three years.  Now, if we're just looking at second lean home equity lines  of credit, your helox, those withdrawals made up $25 billion.  That is the largest volume in 17 years.  Demand has increased for several reasons.  First, that interest on interest rates on helox  have fallen to the lowest level in three years,  and they could dip even lower by next year.  The monthly payment needed to take out $50,000 on a heloc  has fallen by more than 100 bucks just since early last year.  So, the numbers of people taking them out are increasing.  Still, though, historically low,  borrowers tapped less than a half a percent  of their available equity early this year.  That is still well below long-term averages.  But that's the answer to your question, Kelly.  It's because it's cheaper to do it.  Well, but it's still borrowing at eight percent or so  if that chart, if I read that chart correctly.  So heading towards seven, heading towards that.  Still, yeah.  Still high, but it's better and look,  you have a lot more people who are now staying  in their homes longer, historically longer.  And that means renovations.  And that is the number one reason  most people take money out of the home  is to put that money back into the home, indeed.  All right, Diana, thanks.  Appreciate it very much.  Our Diana, Oleg.  meantime, Clarna is trying to diversify  beyond just by now pay later by launching a debit card  in the U.S., founder and CEO Sebastian Simiakovsky  has been on this show a number of times.  Talking about his goal of becoming a bigger fintech player  in the U.S., here's what he told us three weeks ago.  We want Americans to start to associate us  with not only by now, but the PayPal wallet type  of experience that we have and also the Neo Bank  offering that we offer our card has been launched in the U.S.  And we're making upgrades to that.  So we have tons of other features.  We are basically a Neo Bank app to a large degree,  but people associate us still strongly with buy out there.  And a few days after that interview, Clarna,  reported its net losses doubled year on year  in Q1 to $99 million.  I mean, time's still no update on its highly anticipated U.S. IPO,  which would put it firmly in competition  with publicly traded names like a firm and blocks after pay.  For more on the story, go to CNBC.com.  Coming up, Ford's employee pricing promotion  continuing to boost sales with purchases  climbing more than 10% year on year for the third month in a row.  And that's despite a huge drop in EV sales.  We've got those details with the shares of 2% right after this.  Welcome back.  The Dow is now on pace for a fourth straight day of gains.  It's up 250 points right now.  Back to back for the S&P and Nasdech,  and our next guest says, Markets overall  are getting a little expensive.  again second time you've heard that this hour, but he says there are four areas where you can  still find bargains. Matt Misket is co-cheap investment strategist at John Hancock.  I'll bring it up again Matt, but I love Jason's why he's a piece of the good journal over  the weekend saying a lot of investors have foggy. They're fear of getting in.  I totally understand that. They feel like it's always all-time highs because it basically always  is. Yeah, we've got earnings throw the least so. And earnings throw is going to be the  most important driver returns. As some people have heard, it is getting back up to that high  multiple we reach back in November. It's only five percent iron out. In terms of the multiple  expansion, you're likely to get, but the earnings growth intact, healthcare, industrial,  communication services is looking like double digit growth over the course of 2025. We're  leaning into U.S. high quality companies with earnings growth. Right now there's been the  sell-of-american trade over in the courts of May. We would lean into that by America here.  And actually make cap and small cap stocks. So the only thing cheap on the planet anymore in terms of  equities, that's where we're looking to allocate capital is more in the mid-cap space and those sectors  in particular. Okay, fair enough, but is it that the market is strong where the earnings are strong?  And is that not so much the case with small and mid? Yes, so you've got to use what we're looking  for as a peg ratio. So it's like golf, the lower the better, but it's the earnings growth that  you're getting relative to the multiplayer peg. So PE divided by the G, where the growth rate.  And so that's a way to be disciplined and not to overpay for the growth. I do hear you. There are some  pockets that are expensive. But some of the expensive pockets actually don't have earnings growth.  So you just got to be thoughtful there and then it may cap your right. The earnings growth is an  as robust, but you are getting a much cheaper multiple. And so if you can get any turnaround  story there, we continue to look at industrials. I know we've talked about it on your show multiple times  industrials. One of the best performing sectors that's here. And so one of these build it and they  will come type years. This is the, you know, field of dreams. Time quote and news like today, where you've  got utility companies, infrastructure companies, building out all these type of data centers. That's  earnings growth too. So do you see pockets are earnings growth even on reasonable  valuations? That's where we're gravitating towards. Not to put you on the spot. But where do you see  companies that have kind of high valuations or have run up, but don't have the earnings, you think to  back it up? So real estate is one consumer discretionary consumer staples. A lot of it is consumer related  right place. But if you're thinking about chat backs and industrials, those have better earnings  for those utilities. Actually, they have good earnings growth this quarter or some of the best  14% earnings growth healthcare has gotten crushed. Still has great earnings growth. So we're just trying  to find those pockets opportunity. There's a lot of political back and forth, great headlines,  but he's opening up these pockets opportunity where there's some value in earnings growth. And that's  where we're seeing some good spots. Stick with the lower peg. That's what I'm taking away from this.  Matt, thanks very much. Appreciate it today. Matt Miskin with John Hancock. We've got a new  slurred on the GOP's spending bill. Amy Javers at the White House, even what's happening.  Well, we just got a tweet from Elon Musk, which kind of rattles the cages here in Washington and  Republicans who support this big, beautiful bill. Take a look at the tweet, which I'm told we do have  ready here from Elon Musk who says, I'm sorry, but I just can't stand it anymore. This massive  outrageous pork-filled congressional spending bill is a disgusting abomination. Shame on those who voted  for it. You know you did wrong. You know it. Elon goes on with additional criticisms of the bill.  And this is a leader who was in the White House as of last week, being celebrated by President Trump as  one of his great allies. Now, really dumping in public on the President's big initiative here in  terms of what he wants to pass on Capitol Hill. We also see Elon Musk saying it will massively increase  the already gigantic budget deficit to $2.5 trillion and burden American citizens with crushing  unsustainable debt. So that's a broad side from Elon Musk against Donald Trump's signature  legislation up on Capitol Hill. Caroline Levitt, the White House Press Secretary, is briefing reporters  right now. She was asked moments after that tweet posted for her reaction. She kind of laughed it off  and said, well, look, the President already knew that Elon opposed this bill, but the President  supports it. They call it one big, beautiful bill here at the White House and they are pushing forward  with it. The big question here is, what will Elon Musk's opposition to this bill do to the chances of  passing it up on Capitol Hill? Given Musk's near unlimited political funding capability for senators in the  future, all of whom will start to be looking toward their own re-elections in two or more years.  All of whom will be looking at the 28 election. Some of whom will be running in 28 for the Republican  nomination and may want Elon Musk as their primary financial banker. All of those questions now swirling  in the moments after Elon Musk fired off that broadside on social media. No, it's a great point,  amen. And of course, this comes after a morning in which Rand Paul was on CMBC talking about his  opposition to raising the debt ceiling. The President then, again, angrily tweeting at him,  sort of saying he's letting the people of Kentucky down and standing in the way. But I'm curious about  this kind of fraction between Musk and the President where we've seen, you know, not only did Trump  go ahead and kind of make this big splashy announcement with open AI in the Middle East against Elon Musk's  hopes. Musk also, of course, fired with best in a shouting match in the West Wing. And then after  Musk left the White House on Friday, the President withdrew his nomination of Jared Isaacman.  I think it is for NASA who, of course, has been a close friend of Musk for a very long time. So it  feels as if he's kind of going for the Achilles heel musk is with the President by sort of going after  the one thing that would blow up his entire agenda this year. I think that's exactly right, Kelly.  You're right to point to the Jared Isaacman withdrawal, right? He was the nominee for NASA. He's a close  friend of Elon Musk. He's been on Elon Musk's SpaceX trips outside the Earth's atmosphere.  I mean, he is orbited on SpaceX aircraft. He was set to head NASA. He was dumped uncertainoniously.  And the White House said the reason he was dumped was because of a review of his prior associations.  And they want to make sure that everybody who's in the administration is fully on board with the  MAGA agenda. But they don't say exactly what associations they're talking about with Isaacman.  And whether or not they have any particular beef with him. And why any of that didn't come up early on in the  vetting point. This was well down the track here in terms of Isaacman. So that all of those associations  could have been known earlier. And the question is, is this a bigger rupture here between Elon Musk and Donald Trump?  And it seems like it is at this point. Yeah, growing one at least, we can say,  Amen. Thanks very much. Appreciate it. Market for what it's worth. Shugging it off taking it and  strides shares are still broadly up this hour. Coming up shares afford our higher with the auto  makers reporting strong sales in May. But what's it the last hurrah? Let's talk about that next.  Welcome back for once again, putting up some strong sales numbers in May. But that was driven and  part by promotions anticipating tariffs that were taking effect. Let's bring in fill above from  more details here, Phil. And Kelly, these are solid numbers from Ford. And we're seeing this from all  the automakers. Just got the numbers in from Toyota a few minutes ago. And what you're seeing,  when we take a look at the Ford numbers here, the market is shifting. It's moving away from electric vehicles,  much more towards ice and internal at hybrid and internal combustion engine vehicles. They see  forwards overall sales up 16.3%. Driving some of this for Ford is strong demand for its pickup trucks.  And this is what we're seeing with a number of the automakers. Retrenchment into those vehicles  that they are most well known for. And if you're looking at Ford, you're looking not only at the F-150,  but you're also looking at the Maverick, specifically the Maverick hybrid hybrid trucks have become a big  seller for Ford. And for other automakers, it's year to date sales, as you take a look at shares of Ford  up 3.2%. And this is what we're expecting for the month of May, if you will. That as also when you look  at Honda and Hyundai, they had nice sales gains. And for the industry overall, the pace of sales  Kelly is expected to come in about 15.9 to 16 or 16.1 million vehicles. Not as strong as April,  but still solid in there. But keep in mind, we are seeing the inventory of pre-terrorist models.  It's dwindling quickly. And by the end of June, you will likely see mainly those vehicles that are  impacted by tariffs. And that's expected to change pricing. So many ups and downs from the pandemic  now to this fill. Appreciate it. We'll see how it all shakes out. Again, Ford shares up about 2%.  Coming up, people are reportedly downsizing their vacations, or waiting on deals to book.  The airlines facing a 10% drop in summer bookings. It actually could all those  vote well for the cruise companies. We'll talk about why right after this.  January and February, we came out like gangbusters. And then we saw some real measurable  softening in March, as I think the consumer adjusted to help slew it the macro factors were. April,  we started to see some recovery. That was Marriott CEO Tony Capuano on Money Movers yesterday.  He also said consumers are being more mindful about spending right now, which my next guest says  could be a boon for the cruise lines to grab more market share. Let's bring in Laura Champines and  your consumer analysts at Loop Capital. And Laura, you just up to your price targets on a couple of  these names. Your take is becoming more consensus. I mean, more and more people talk about it. Like,  yeah, it's kind of a value driven vacation item. So I'm just wondering how much more upside there  might be in the stocks from here. So we raised estimates for the current quarter and took our price  targets up for Royal Caribbean and for Carnival Royal Caribbean. We have a $290 price target. So  still pretty significant upside there. What we spoke to Carnival last night and Carnival has with  all of its banners about 50% of all cruise cabins in the industry. So they're the biggest player by far.  And they said they still see a 25 to 40% discount on cruise vacations compared to comparable land-based  vacations. So as people get more sensitive to that value proposition, we think the cruise industry  has a lot of room to grow its share. So what do you think is priced into the cruise lines right now?  You know, I mean, in order for that to go well for the people who are late, you know, to the call,  can they feel comfortable sitting in these for a while? We think so. We think for Carnival in  particular might make sense to wait. Carnival has a big private destination that comes online in July  and it will take a while for word of mouth there to to grow. So you might have more upside in Q4 for Carnival.  But we like Royal Caribbean because we see double digit growth there this year. We like Norwegian because  the stock is just very cheap even though they're gross likely going to be less than RCL. We like Viking,  that higher in customer with with leadership and river cruising. All in all, I think this is  a space to own and I think it is a space that you can own today. Yeah, Royal Caribbean is up 15%  year to date where Carnival is down about 6%. So it's not as if all the cruise lines have been going  gangbusters or anything like that. It's interesting because you see that you see Royal Caribbean leapfrog in  Carnival and a just city but died next year. So what accounts for that growing difference?  So Royal, it's hard to tell what's marketing and what's real. So Royal has that perception of having  the best ships in the business. It does certainly have a lot of new big ships with a lot of features.  They have herfic day at Cocoa which is basically a water park for kids that looks very exciting. They've  got a hot air balloon that leaves from there. So whether it's just marketing or it is truly the product.  We think all the cruise lines have great products. Royal is having an easier time filling those ships  and is a little more disciplined about pricing. We think they're closing their closing discounting  is still down year over year. So prices for the cruise lines, even though they're a great deal,  they're holding in nicely even though we are in sort of a choppy travel market. Yeah, I remember when  Seema went on some of those new ships or tons of water slides and everything behind her. I looked  fun and you think Texas is a market to watch increasingly with Galveston? Texas is underserved.  Relative to the big ports in Miami, Florida has really been the base for most of these cruise companies.  But they're still just as much population that could easily get to Texas as opposed to Florida.  We think that area is going to grow and we think Royal Caribbean is doing the right things to put  its assets there to take advantage of that growth. To 90 is the new price target from 266 where it's  trading today and previous 250 Laura has always thanks appreciate a large share of time with Luke.  And thanks for watching the exchange, I'll go join Dom Chew for Power Lunch right after this quick break.  More on what Muscus saying about the one big budget bill stay with us."