" Welcome, welcome, welcome.  The best thing you can do for yourself  is start your week off correctly  with a routine that works for you.  Whatever you did this weekend,  Monday is the perfect time to reset  get your motivation back and get focused  because the journey to your goals  are many, many steps, many, many steps, okay?  So we're gonna get started.  Today we are talking about  where QuickFacts book club, reading time.  Let's go.  We're gonna be talking about Animias,  which is a huge subject.  It's actually in quick facts for nursing schools.  So if you have quick facts for nursing school,  come on, take notes,  but we will be studying it out of, of course,  QuickFacts for NCLEX because that is what we are  primarily doing on Mondays.  QuickFacts for NCLEX.  I've been loving reading this book with you all.  I got so many positive responses  about how reading the book together is really helpful.  And for those of you who are just joining  my Inclx Review program,  I'm hoping that every week we can establish  how you're able to study and still live your life,  live your life.  Now speaking of my products,  did you know about my newest product that I released  during the month of June?  Maybe you heard it, maybe you didn't hear about it.  I mentioned it a few times,  but it's absolutely, it's absolutely this money back guarantee.  Yeah, anyone who purchases the Inclx V2,  now you have access to get that investment returned.  Return.  So if you wanna check it out,  go to my website, remart nurse.com,  and that is where you can get your V2 program.  Now speaking of remart nurse university,  we did not finish the final game night.  And so we will be finishing it this Wednesday,  9 p.m. Eastern Standard Time,  that willing we will be playing Kahoot,  and everything will be as we intend it to be.  So come back, Wednesday night 9 p.m.,  when some cash prizes for your knowledge,  and make sure that you are staying consistent  because we do study sessions every Monday, 12 p.m.,  Wednesday 9 p.m., all East Coast baby,  all East Coast of the United States.  Get out, you're a quick fax,  we are diving into it, quick fax for Inclx,  every nurse needs quick fax for Inclx.  So let me grab my Minchram, getting it,  make sure I got what I need to get.  Okay, and I am turning it  to page, put on the page that we are rocking with today.  If you have quick fax for nursing school,  it's great you will find these anemias on page number nine.  If you are rocking with me, quick fax for Inclx,  we are on page number seven, page number seven,  shout out to the nurses who are working,  dropped off the kids, maybe you're staying up late  to make this study session.  I see you and I appreciate the work that you're doing.  Okay, we wanna be nurses who are on time,  on time today.  So diving right into Inclx,  diving right into Inclx,  I put anemia's on my radar  because not only do you have to be able to care  for these patients safely,  but every Inclx,  essentially presents differently.  If we look at the anemia's here,  A plastic iron deficiency,  vitamin B12 and sickle cell anemia,  even though they're very common,  they all have different presentations,  different causes and different treatments.  So when you are reading about this in a med search book,  it's so easy to go around in circles.  How many people are literally looking at these names  and you are familiar with them,  but you may not be able to teach somebody else about them.  Like, you know, and that's the level that we wanna break.  That's the barrier that we wanna break,  because Inclx is not a memorization test, it's not.  It is a literal clinical judgment  how a nurse is supposed to behave  in certain emergent or acute situations.  So looking at anemia,  like I said, out of these four,  because we can be kind of vaguely familiar with anemia.  I wanna ask you, my first question to you is this.  Put it in the comments.  Which of these anemias is most deadly?  Which is the worst?  If you had to pick one of these  you're like, okay, the worst one, which is it?  Is it a plastic?  Is it vitamin B12?  Is it sickle cell, which one?  Right?  Because sometimes if we understand the hierarchy of things,  we'll pay attention to it more.  So the most dangerous one,  the most dangerous one I see all the guesses,  the most dangerous one is the first one  that I have here, a plastic.  And I want us to really understand  the signs and symptoms and the treatment  and why this one is the worst.  So just just look at, what did I wanna start?  Let's look at just the name a plastic.  So when we have anemia that's a plastic,  usually the term a means without something's off, right?  Something is not right.  So.  So here, a plastic means without formation.  Something is not forming, right?  And this is anemia.  Now, the thing about this anemia is normally when we are talking about anemia, we're  talking about red blood cells, hemoglobin.  Like those are the two major components, right?  Anemia.  Well, here you have a decreased in red blood cells.  This is anemia.  So we expect that low red blood cells.  But the thing about a plastic anemia, and this is what makes it so dangerous, is that you  have a low functioning in the bone marrow of all the blood cells.  It's not just anemia.  So if I asked you what are the three types of blood cells, we know one of them will be red  blood cells.  So your patient has low red blood cells.  What are the other two?  Patient will also have low white blood cells.  Okay, this is a plastic anemia.  Low red blood cells, low white blood cells, and then low platelets, which is really bad.  So how I have here decreased the rithrocytes, bleeding mucus membranes, thrombocytopenia.  It is literally because the bone marrow is just low functioning.  It's not really producing anything it's supposed to be producing.  So yes, your patient's going to have problems with their immune system, with bleeding  because they have low platelets, and with anemia.  And so when you think about this one, when you think about this one, if you look at the  treatment, you'll see that this is the patient that if they don't get treated, they're  going to have issues with blood.  Okay, they're going to need bone marrow.  They're going to need their bone marrow taken over.  That whole bone marrow transplant, this patient needs to have it because it is not functioning  at the capacity and needs to be functioning at.  Okay, so this right here, a plastic anemia, this would be the worst that you could have  in the patient.  And in collects likes to see if you understand the correspondence between the white blood  cells and the bone marrow functioning and the platelet functioning too with this anemia.  Don't just focus on the red blood cells here because there's so much more to this patient,  so much more to this patient.  All right, let's go to, we need to go down.  Let's go down to iron deficiency anemia.  Iron deficiency anemia, most people are, they're familiar with the term.  They know what this term means.  So let's break that surface level barrier.  And let me ask you this, when we talk about iron deficiency anemia, is it affecting the  red blood cells or the hemoglobin more?  Is the iron deficiency affecting the red blood cells or hemoglobin, which one?  Oh man, that's good.  And you know what, I'm gonna just draw a picture because maybe you don't really understand  how red blood cells and hemoglobin interact.  So I actually, I drew this picture earlier in my, in my book.  Now you know I'm not the best drawer, so we're not even gonna go there.  But I wanna just kinda make sure that we understand the relationship between red blood  cells and hemoglobin.  Okay.  So this is a truck, okay?  Everybody see, this is a truck.  And this truck is a red blood cell.  Now this truck is a red blood cell.  Now what's the relationship between red blood cells and hemoglobin?  So red blood cells are carrying the hemoglobin inside of it, okay?  So this truck is carrying hemoglobin.  And that's the relationship between the two.  So your red blood cells are all around your body floating all around everywhere, everywhere,  carrying hemoglobin that is releasing oxygen to the different parts of your body, right?  So I asked the question, an iron deficiency anemia, what is the iron directly affecting?  Is it affecting the truck or what the truck is carrying?  Is iron deficiency anemia affecting the red blood cells or the hemoglobin?  Which one?  Which one?  The only way we're going to learn this information is if we break past just familiarity,  like surface familiarity.  Okay.  So iron deficiency anemia, it is directly affecting the hemoglobin, okay?  So if you don't have enough hemoglobin, it is because you don't have enough iron.  is the main building block of hemoglobin without iron.  No hemoglobin can be made.  Okay.  Now without iron, can your body still make red blood cells?  Absolutely.  Red blood cells can still be made.  Now are they, they're going to be small.  They're going to be a little different, but the body will still produce them.  It will be very difficult to make hemoglobin without iron.  So the issue is if you have iron.  and deficiency anemia, you don't have the hemoglobin  to carry the oxygen around.  So the truck is functioned, the truck is still going,  but it doesn't have what it needs.  So it's carrying around empty, it's empty truck.  It's empty truck.  I hope that makes sense.  It's empty truck.  So that means that your body's not getting oxygen,  how do these patients present?  They are very tired.  These patients are tired.  I have here, they are pale.  They have tissue oxygenation issues.  It just, you know, it just what happens.  Especially in pregnancy.  In pregnant woman gets iron deficiency anemia.  In pregnancy, you like to sleep anyways,  but you know, one of the reasons could be  because your iron is low.  So that's how that's the interaction.  Now the treatment for iron deficiency anemia  is simple, it's simple, but it's not always easy  to explain, okay?  Or easy to carry out.  Cause what's the treatment?  All right, the treatment is iron supplementation.  Right?  And it's just so simple, you gotta take iron.  But if you don't take the iron correctly, it won't work.  That's the thing about it.  So sometimes doctors will just hand out pills  and say, oh, to a patient, your iron is low.  Take iron supplements.  Patients like, okay, I can buy those over the counter.  So they take the iron supplements and it doesn't work.  Why won't it work?  What are all the parameters for taking iron supplements?  How do you have to take them?  And this is literally, this is the things that we learn  when we first learn this information.  Okay, in pharmacology, in nursing school,  when we give a patient iron, what do we tell them?  Typically, never take it with what?  Never take it with dairy, because calcium blocks iron  absorption.  Don't take it with dairy, take it with what?  Take it with vitamin C.  You can take it with orange juice, right?  Something that will help promote the absorption  of the iron.  Also, I have here, people say, take it on the empty stomach,  to help with absorption.  Dietary changes, making sure you're getting food  with iron in it, high iron rich food.  So iron deficiency anemia, done, let's move on.  Let's go to vitamin B12 or pernicious anemia.  This one always got me in school  because number one, they had two names.  And nobody really explained to me why this one had two names.  Why can't we just call it B12?  Why can't we call it pernicious anemia?  I think the reason why we don't call it pernicious anemia  anymore is because it's no longer pernicious.  It's no longer that.  It used to be, it's not.  So if you look at the term pernicious, it means deadly.  It means the people who got this certain deficiency  before the treatment was established, they died.  They died.  And so that's what made it so deadly.  Now, the question is, this vitamin B12,  what is the real issue?  Because when people died from this anemia,  they didn't die from anemia.  Usually when we're talking about these different types  of anemia and we're talking about deadly situations,  it's never being anemia that people are dying from.  It's some sort of complication.  So here with vitamin B12 or pernicious anemia,  the people were actually dying from one of the signs here  which is peresthesia, right?  The people were actually dying from irreversible brain  and neurological deficits, okay?  They were dying because when you don't have enough B12,  your spinal cord, your nervous system,  it begins to just degenerate slowly.  And so people were having dementia like symptoms,  they were confused, you know,  this is back in the day before the treatment.  And the doctors were really wondering like,  what happened?  What's going on?  So that's why this is pernicious anemia,  but let's look at the other signs  because this is very important for you to know.  Payler.  What's gonna cause payler?  Well, the payler's gonna come from anemia.  We can see the other forms of anemia have payler.  But this beefy red tongue,  this is the one right here.  This is the one that is the best assessment  and the easiest, you wanna get a question  like this for NCLEX.  The tongue actually works like your skin.  Did you know that?  So just as your skin sheds and gets new cells,  your skin sheds and gets new cells, right?  Everybody knows that, right?  Your tongue does the same thing.  The top layer of your tongue sheds every seven days.  Like every seven days, every 10 days.  Within like a week or two,  that layer of skin sheds off in a new layer forms.  So when you don't have a healthy body,  You don't have a healthy, you know, the inner workings of your body or off.  Where's one of the first places you can see it?  You can see it on the tongue.  The tongue is a great dashboard for your body.  And when we do it, it says to me, tell me, it was take open your mouth.  Ah, let me see your tongue.  If the tongue is covered in white stuff, then we know, oh, you have some sort of yeast  overgrowth, right?  And something's not right with your immune system.  Something's going on with your body right now, right?  Beefy red tongue.  You have some sort of malnutrition because if the top layer of your tongue is shedding off,  but new surface cells are not able to be formed, it's some sort of malnutrition going  on, some sort of deficiency.  Yeah, yeah, yeah, yeah.  So your tongue is very reflective of your inner workings.  When a patient is dehydrated and you look at their tongue and it's dry, it's cracked.  It's like, oh, something's not right.  Right?  So that is why a beefy red tongue indicates that there's some sort of malnutrition here.  Okay.  So what is the treatment?  So the treatment is sino-co-ballamen.  Now this is an injection that is done for this patient.  Okay.  So NCLEX always wants to know, do you know the treatment?  Is this synthetic form of vitamin B12?  And then also, if the patient's getting an injection, how long do they need to get the injection  for?  For their entire life, their entire life because their body is not making enough of this  vitamin B12 and actually, one of the reasons why, let me see here.  Oh, yeah.  So I just say the injections work well because they don't have to be absorbed through the  stomach.  Right?  If it's pills, then the stomach has to absorb it.  So with the injection, it goes directly into the bloodstream.  Are you guys learning?  You guys learning?  Okay.  So those are the three.  Now the last one is sickle cell anemia.  Now sickle cell anemia is very important.  It has an entire section in the back of QuickFacts.  So should we go there now or should we just wait until we get there?  Sickle cell anemia is the genetic disorder.  All of these other ones are more so acquired through baby viruses, autoimmune disorders.  But sickle cell anemia is one that is genetically inherited.  So a patient would get this from their parents trying to think, I do, I won't go to sickle  cell anemia.  Let's see where I have 20 women.  I won't go to sickle cell anemia.  One of the things though that I want to take you way, way back to, and this is just foundational,  when we're talking about anemia and the body realizes that there is not enough oxygen,  which organ is responsible for fixing that.  And all of the cells are screaming out for oxygen and saying, we're not getting enough  oxygen, you need to fix this.  Which organ are they yelling at?  Which organ are they speaking to?  I wondered if you all knew this.  It is the, yes, the kidneys.  It is the kidneys job to regulate.  It is the kidneys job to regulate the oxygenation by producing what, what's the hormone  that the kidneys produce.  And we, we hear about it in nursing school all the time, but we may not know where it comes  from.  The hormone is a rithropoetin, a rithropoetin.  This is a hormone that comes from the kidneys that tells the bone marrow, we need more  red blood cells.  So how important are the kidneys?  The kidneys are not just for filtering waste.  They are to correct things in your body.  They're to filter waste, what else?  They correct blood pressure issues.  And they release hormones to help correct your red blood cell levels.  Now the kidneys can do their job and release that a rithropoetin, but if there's a problem  in the bone marrow, then it won't help, right?  But if the body can be responsive to the hormone, then it will try to boost up the production  of red blood cells.  So with that being said, let's go to sickle cell anemia.  I don't have much here.  I think sickle cell anemia is very, very well studied for most of my nursing students.  And the notes here are pretty comprehensive.  I just wanted to point out for sickle cell anemia, we're talking about the shape, the  sickle indicates that the shape of the red blood cell is a crescent shape, like a crescent  moon.  Instead of the sun, it should be a disc, but it's not.  It's the sickle.  So what happens is when the patient requires more oxygen, those abnormal sickle cells begin  to collapse and clump together.  It should be.  to get hard, they begin to stick together. And this is what causes the crisis. And most individuals  who have sickle cell anemia, they have a shorter lifespan because this clumping together of the cells,  of the red blood cells, as it is circulating your body because remember, the red blood cells go  everywhere. There is not a place in the body where you don't need oxygen to be delivered.  So those red cells go in the lungs, in the heart, in the spleen everywhere. And they do damage to those  and so it's just a really painful cycle of the body in a low oxygen state, the pain of the sickle clump  cells traveling through the body that issues with hydration and stress. And so most people in the  United States, even with great treatment with sickle cell, these usually live to their 40s,  usually live to their 40s. And without treatment, it's an even shorter lifespan. So this is a condition  where the patient, because of their sickle cell disease, can have silent organ damage, the organs can  be really crying out and the patient doesn't know it at the time. So patients usually have issues  with jaundice, gallstones, I have here spleenomegally, the spleen gets damaged. And when the spleen  gets damaged, that really affects the patient's immune system. It puts them at risk for infections,  particularly the worst kind, which is sepsis for these patients. So I have here the final point,  sickle cell anemia may become a chronic multi-system disease with death from organ failure.  So those are the major points. You can read more about sickle cell anemia here. And then of course,  reviewing number seven as far as to actually turn back to page number seven, let me just  go over the stage major points. So if I asked you, of course, if I asked you which anemia had a  genetic origin, I want you to say what sickle cell anemia, if I asked you which anemia requires  bleeding precautions, which anemia requires a patient to have bleeding precautions.  Okay. A plastic anemia. Yep, because of the little platelets. Remember that, remember that,  little platelets. Which anemia affects the brain can cause forgetfulness, confusion in your patient.  You should be saying the pernicious anema or vitamin B12. Okay. All right. So this is how you are to  be studying this book. And really, we read it together and then I want you to go back and make sure  that you are catching the main points in the book. Because quick facts gives you a structure,  quick factive you a structure to dive deeper into. Now it's time for our actual Monday motivation  across the nation. Thank you everyone for coming to class. This is the point for this week.  We're grounding ourselves and I'm asking you which door will you open this week? Oh,  so good. This is a good question. I'm starting it with everything that you have going on.  Which door will you open this week? Because many times we have choices in our lives of  opportunities that we see in front of us. And so some of the opportunities are good. You know,  the door of faith, the door of patience, the door of rest, the door of learning, the door of courage.  Like for me, definitely I want to have, I want to work patients. I'll always have to work my  patients because it's an area that I struggle with. But also when we talk about doors opening,  there are some doors that may present themselves to you that you don't need to go through.  In other words, there are some opportunities that will be available for you to jump on.  There'll be some bandwagon that you'll be able to jump on. There'll be, you know, some events that  you could possibly go to or a job that you could possibly take or somebody else might present their  own issue that you could attach yourself to. And I want you to consider if you should be doing  those things or not. Our scripture for this week is Proverbs 16.9 in their hearts,  human plan, their course. But the Lord establishes their steps. And what I like about this is that  we do have our own mind about what we  want to get done this week and what things are important. But I'm so grateful that God can give  me the discernment. If I'm listening to him to say, uh-uh, don't go there. How many people need that?  How many people are okay with wisdom being presented to you? A divine wisdom. You know, in my  position, in my position, because I am- I- I hold a high position, right? The CEO of Remar,  CEO of Safer's now. Other- other things that I am involved in. I get opportunities presented to me.  I get messages from people that want to partner with Remar. Messages from people that want me to  sell Remar, right? People want to- people see things working and they want to either take ownership of it  or be a part of it in a big way. And there are times when I have to really ask God, God, why is this  thinking front of me? Why is this opportunity in front of me? Is this what you want? Is this your will for me?  You know, am I the only person like that where you have people that come into your life and they  present themselves as doing good or having good will and you have to stop and say, you know,  Lord, I'm not sure. Is every opportunity your assignment? No, I don't think it is, right? And sometimes  we over commit ourselves because we want to do good or we could see ourselves being able to do  well for somebody else or being able to support somebody else. But not every door that is in front of  of you, you need to go through because on the other side of that door is a room that you might  not need to be in or there are people in that room that don't mean you any good or or on the  other side, you might not have the character just yet to be in that room. God still has to work  some things out in you in order for you to go into that situation. And you need to be able to say, Lord,  I need to trust you with my daily bread. I cannot make a decision without you because you,  if you move too fast, you can find yourself trying to catch up to something that you had no  business going into. You had no business going into it. So if you get yourself in those situations,  I want to pray for you that you can slow down this week and be able to use discernment before  committing yourself to anything else. Do not over commit. Do not over commit. Okay. And just ask  God this week, Lord, help me discern which door is for me. Some of you are looking for jobs. You  want to go back to school, relationships. I believe that God speaks as loudly as you allow him to.  He speaks as loudly as you allow him to. Maybe you can't hear him. Maybe you might need to fast.  Maybe you might need to turn down your plate, turn off that, you know, those programming,  those channels get quiet with God because this is the truth. We don't want to force  open the wrong doors out of impatience because impatience often leads us away from God's perfect timing.  And a door that seems open isn't always the right one. Not every opportunity that you can go  after is part of God's plan for you. Okay. And the doors that God opens, no man can close.  I like this song. When Jesus says, yes, nobody can say no, you hear that one before. I love that.  When Jesus says yes to something, no man can say no to it. And we have to be confident in the timing,  the timing of it all. All right. So that is our Monday motivation. That thought should be able to  keep us grounded. We are still having the ability to come together and study together during this time.  And we're doing something that I think is super beneficial, which is reading the quick facts  books together and being consistent in our studying. Also, please don't fail to reach out to me.  Email me support at remarvue.com. I'll put it on the thing here because  Team remar is answering messages in real time. We are by any means necessary trying to make sure  that you have what you need. So if you have issues with your  issues with your subscription, you want to upgrade, you want to cancel, you want to downgrade,  you need to take a break, you need days, add it, all those things. We get them all, we get them all.  So support at remarvue.com. And I am really excited about the work that our partners are doing  in Kenya. I am working with schools now. I'm so so excited to be working with the administrators and  the nurses.  educators over there getting the students ready to take in collect. So if you are in any part of Africa and you need to join the V2, please this number going down here, the WhatsApp number is the contact for you to be able to get started.  Thank you guys so much for an amazing lesson. Thank you so much again brought to you by Rheemarr V2 the best in collects review that I ever created myself ever created out of all the years I've been doing this.  Rheemarr V2 is the absolute best and as always you can you will and you must pass in collects. You can do it in four weeks follow the study calendar, follow that study calendar, get it done, get it done. I'll be here every Monday and Wednesday. See you guys later. Bye bye."