" This is the Angels Coastcast.  You're instant game reaction for the Los Angeles Angels.  Part of the locked on podcast network.  Your team, every day.  All right.  All right.  All right.  Hello, Halo Nation.  Hello, Halo.  Welcome back to the latest edition of the locked on Angels  Coastcast.  Come in at your live as always after every single Angels game  right here on the locked on Angels YouTube channel.  And after fact, both on the channel and wherever the heck you get  the locked on Angels audio podcast feed.  If you don't know I am, what's going on?  Everybody.  My name is Gavin Carlson.  Former credential journalist in the LA areas.  Everyone says you're in the comments making fun of me.  spent four years covering UCLA sports with the daily brewing and now in  year two with the locked on podcast network where it's your team.  Every day our team is the Angels.  And the Angels have one two in a row to start this series at Fenway Park  unbelievable, unbelievable.  Feels good.  And let's be honest.  This was not the prettiest of games.  This was a nail biting game.  This was a game where the Angels got a little bit of help from the red  socks.  But it was a game that ended with the boo birds out at Fenway Park.  The Red Sox fans very very frustrated as they lose back to back games to the  Angels two games or the Angels jump out to lead two games or the Angels almost  blow it but two games or the Angels light that baby up.  So before we tell you what went on in this one.  I know you guys have been missing the turning point.  You've been missing the ads as everyone's saying in here.  But yeah, shout out to everybody in here.  I know was not able to do the show yesterday.  I'm always going to be fully transparent with you guys, right?  And so yesterday, you know, the last week or so is back in the Bay Area.  I got last week off from work.  So I wanted some time to visit my family and was actually at Oracle Park  watching the Giants for those who remember.  That was my childhood team.  It's my second team in addition to of course the Angels.  So was there watching the Giants lose a ball game of the Padres, hated  watching them lose to the Padres of all teams.  But yes, done with that back here and shout out to everybody in here who  was wondering where was at and is excited for this one.  Like Dave says, also before we jump into this one, I absolutely,  absolutely have to give props to Vinny.  And I'm going to say Vinny, what are the lottery numbers going to be  grow because this guy is unbelievable.  I think he's like three for four in terms of predicting when Mike  Trot is going to hit a home run yesterday or two days ago,  he predicted that Trot was going to hit a home run over the green monster yesterday  and he was absolutely right.  So shout out to Vinny, shout out to everybody in here.  But with all that being said, let's not waste any time.  Let's get into it with time to reveal where the game was once or lost.  It's the turning point.  It's America's favorite segment, the turning point, but it's a combo.  It's a combo today.  We're combining the turning point with.  This is the lock done player of the game.  Yes, it's both.  It's both.  It's both.  And they both go to read freaking debt members of all people.  You know, I've been critical of read debt members.  Not necessarily him as a player.  I've been critical of people that are that were clamoring for  debt members to be in the rotation two months ago without him actually  proving anything.  Now we know the rotation is a different story.  We know everything that happened over the weekend in terms of, you know,  out of Jerry and Ron Washington's comments and, you know,  needing help in the rotation and everything.  But just zooming in on this game specifically.  How huge.  How huge.  In the top of the 10th, the Angels have a huge opportunity that is missed.  Bass is juiced with nobody out.  And somehow all we get is one run on a Taylor Ward double play and a  Jorge Solaire pop up, right?  We'll get to them in a second because not all positivity in this game for sure.  But what a turning point.  You go from the huge missed opportunity, right?  Huge opportunity missed by not converting more than one run there in the top  of the 10th inning.  But what a huge job debt members does coming in.  And I wasn't alone.  I know a lot of people were like, wow, did not expect to see  debt members come in to have the opportunity to get his first MLB  save, right?  And then what a spot to do it.  Not a traditional save.  A run run second base.  You just had an opportunity to go up six, three, five, three,  blown.  And you're only up four to three.  There's a run run second.  Surely, surely they're going to tie this game, right?  And if they only tie it and we get to the 11th, I kind of saw this as a  long play by Ron Washington.  Okay.  You hope he gets through the 10th,  and then, you know, hope he gets through the 10th,  only giving up that one run,  and then you get to the 11th,  and you can still pitch that number.  That's what I thought when he came in.  Okay, he's not gonna get out with no runs, surely,  but he'll be a long arm that can go into the 11th,  if we need him, right?  But how about Dettmer's man,  shutting up everybody?  And in a couple of these at about,  he did get an assist.  Some horrible hitting from the Red Sox,  in a game where the Red Sox did a lot wrong.  Let's not act like it was only the Angels in this one.  The Red Sox gave the Angels some runs in this game,  the Angels, or the Red Sox ran into outs in this game.  The Red Sox had more hits than the Angels  and lose the ball game,  but the combination of poor hitting,  and absolutely red, red Demers deserves credit  to get in to, or to get out of this one,  and get that first career save.  Navarrez, the lead off hitter,  with the runner on second,  and he strikes out in a fastball at his face.  A fastball at his face.  And so Red Demers, he took the Kenley Jansen approach  of only throwing, cutters, of only throwing fastballs here.  He throws the curveball, it misses,  and he says, all right, you know what?  Navarrez, you're getting three fastballs.  Swing and a miss, foul tip,  and then swing and a miss on a fastball at his face,  at his face, right?  Then Trevor story comes up,  and this one, a good variety.  You go curveball on the corner, nasty pitch,  73 miles an hour.  You're never going to be able to time that up  if you're Trevor story.  Then you sneak in, back to back fastballs.  It's one, two, you go curveball high.  And Trevor story swings at it, like above the zone,  but then a nasty, nasty, one, two, back foot,  or front foot slider, yeah, back foot slider,  down and in, nowhere near the zone.  Swing and a miss, just like that, there's two outs,  and you're thinking absolutely now there's a chance  to get out of this inning with the save, with no runs,  and then just a high curveball again.  He likes to start it off with that curveball,  gets the hitter on their toes,  then there's a fastball up and in, at the hands,  popped up by Rafella, and the inning and ball game  are over, the boob birds come out at Fenway Park,  and Reed Detmers picks up his first ever MLB save.  The starter turned long reliever.  Now, this is what you got to do, right?  As someone who has said he did not earn a rotation spot  at the beginning of the season,  who's been critical of him,  this is what you have to do.  It's not proven in certain moments,  oh, I want to be a starter,  so I'll do better in long relief appearances.  No, when your number is called,  when your name is called, get it done,  no matter the situation,  and you're gonna improve the likelihood  of being chosen to be a starter once again.  So, shot at him comes in one, two, three,  bottom of the 10th with a runner on second.  You know how hard that is.  That's why it was the turning point,  that's why he is the player of the game.  And before we take the break, I have to say,  it capped off a great game for the Angels bullpen, right?  Kind of ironic and fitting that once again,  there's a you say kakuchi start that's good, not great.  Probably could have been worthy of a win in certain situations,  but with the Angels, you're not getting a win,  unfortunately, only going five innings  and giving up three runs,  but did not deserve the loss either.  He gets no decision.  And the bullpen was phenomenal.  We use five relievers in this game,  Brockburg, scoreless sixth,  Brockden, scoreless seventh,  nearest scoreless eighth,  Kelly Jansen, eventful, but scoreless ninth,  and then Reid Detmers comes in and gets the job done, right?  So the bullpen, you gotta give him credit so much talk  and rightfully so about the rotation,  about the bullpen, the lack of talent  and the lack of proper management by Ron.  But tonight, you gotta give both credit.  You gotta give Kelly, as Dusty says, it's so true.  Jansen is always a showman,  and not just in terms of getting out of the jam,  not just in terms of having guys on base  is always making it interesting  like you're referring to Dusty,  but also whether he's stepping off the mound,  like he did three times in this inning, in this game,  whether it's that amazing, savie, hatcheries,  directing guys, whether it's him always intentionally  blocking and telling the guy on second,  go to third, get out of my way, right?  He always finds a way, you're right, Dusty,  to make it interesting,  but he got out of it, and then Detmers got the job done.  So the bullpen, they deserve an A plus in this one,  they were fantastic.  We're gonna take our break,  and when we come back, we're gonna tell you  how the Angels scored those four runs,  including a few of them, because of mistakes,  by the Red Sox, we'll also talk about the lineup  and why, despite the four runs,  which isn't even that many to begin with,  wasn't really a great game for the Angels lineup,  some questions need to be asked,  but we're gonna take our break, we'll do that all.  When we come right back here,  on the lockdown Angels postcast, we'll be right back.  Now, on this,  Tuesday night, today's show is brought to you by supply house.  Get the supplies you need from the site made for the skilled trades.  Supply house, whether you're in plumbing, HVAC or electrical work,  supply houses, the reliable way to order products online.  Their easy-to-use website is packed with helpful resources  and the latest product info to help you get the job done right.  Plus, with a complete inventory of over 200,000 parts from 400 plus top brands,  you'll find exactly what you need delivered fast from coast to coast.  Need help with an order?  Supply house offers expert support and industry-leading service  to always talk to a real person.  And for trade pros looking for an extra edge, their free trade master program offers  exclusive perks, look at dedicated phone line free shipping and discounts on every order.  Thousands of skilled professionals are already taking advantage now it's your turn.  Join the trade master program today at supplyhouse.com  slash TM and start ordering plumbing, HVAC and electrical supplies with just a few clicks.  Plus, use promo code SH5 for 5% off your first order.  That's supplyhouse.com.  And today's show is also brought to you by Monarch Money.  Ever check your bank account and wonder where did all my money go  between dining out online shopping and entertainment.  It's easy to lose track, but that's where Monarch Money comes in.  Your personal CFO giving you full visibility and control over your finances.  Monarch Money isn't just a budgeting app.  It's a complete financial command center.  You can track all your accounts, investments and spending in one place.  So you stop just managing your money and start building wealth.  I recently started using Monarch and I realized just how much money I was spending  on food takeout.  I did everything.  I split up the credit cards.  You certain ones for certain types of purchases.  That wasn't enough clarity.  I needed Monarch Money to show me where the money,  why the heck is my credit card bill so high at the end of every month.  Well, now I know.  And because of it now, I budget smarter and save more.  And instead of juggling multiple apps, I only use Monarch to check my finances,  track my spending and even plan my long term goal.  So take control of your finances with Monarch Money.  Use code lock on MLB at MonarchMoney.com for 50% off your first year.  That's MonarchMoney.com code lock on MLB for half off your first year.  Back here live on a victory edition of the locked on angels postcast.  Angels for Red Sox three in extras.  And it feels so good to talk about win on a postcast or victory edition because I made the joke  on Twitter.  I made the joke multiple times with you guys.  The angels love to have unbelievable performances when I can't do a show last night.  Of course, the unbelievable record setting first inning when I couldn't do the show.  If you, if you don't remember, probably the most exciting win we've had all year,  the Joe Adele walk off against the Giants when I didn't do a show.  Fortunately, I was there for all three against the Dodgers, all four against the A's.  But still, it feels nice to have a W while I'm doing the show on what was a pretty exciting game,  a nail-biting game, a four, three win in extras.  The angels got some help from the Red Sox today.  And that's what we're going to talk about right now.  Three, three, three errors from the Red Sox.  And this was a game where both teams looked like teams that were under 500, right?  The Red Sox, now five games under 500, the Angels, four games under 500,  and looked like a game of two teams that aren't the best, right?  Because the Angels walk seven.  Angels walk seven Red Sox hitters, but the Red Sox respond by having three errors  and running into an hour, right?  And so the Angels score all three of the runs before extras in the third inning.  And what an eventful third inning it was.  it started with a gift, Joe Hidal getting hit by a pitch, then stealing second base.  And then it continued with another gift.  The Red Sox doing the unthinkable mistake of walking Chris Taylor,  the guy who doesn't even own a bat. He doesn't hold a bat when he goes up to hit.  And yet you walked him.  And I'm being sarcastic because he did have a foul ball on a three-two pitch.  He did have a foul ball on a one-two pitch.  So it was a great at bat by him.  But still, I can't believe you walk Chris Taylor.  So now it's first and second with nobody out.  And then of course our guy, our guy, Jack Nitto.  If there was a guy that's going to come through, it's going to be him.  And he takes a cold strike on a sweeper below the knees.  And then, oh, one gets another sweeper outside corner off a bayo.  And he pokes a ground ball up the middle.  He hit it very hard.  That's not an easy pitch to hit hard up the middle outside like that.  But he did. Joe Adele scores.  And then there's the throwing air by Rafaela that allows Chris  Taylor to get into third and net out to get into second easily.  So that's the first error that assisted in the inning.  Then you get the biggest swing of the game arguably  too on nobody out.  You're thinking, OK, it's a guy you want in terms of productive out.  And Nolan Sean will, at the very least,  he's going to get you a sackfire.  to even a walk, right? But no, how about one two pitch change up down in a way and he gets  quite lucky. It's a week rounder. There's nobody there. And it gets into the outfield  despite it being hit just 59.7 miles per hour. But a two RBI swing for Sean. Well, we know  all the conversations about the lack of exit below for him. But the moral of the story  is exit below. The guy is getting it done. He's getting on base with walks. He's getting,  we contact clutch base hits like this. And that made it three nothing. Unfortunately, we're  not able to capitalize anymore after that. Three straight flyouts from trout ward and so layer.  But still, you get three runs in the second. You got an error from the Red Sox assisting you  in that one. The Red Sox also ran into and out. And that was a huge play there, right? The Red  Sox had the opportunity to score on a ball hit pretty darn deep into the outfield, right?  But a beautiful relay. This was in the bottom of the second inning, a beautiful relay from  Joe Adele to net O to Darno is able to throw out Toro at the plate. I don't think it was a good  decision to decide to send him, but we'll take it. That was another mistake by the Red Sox. And then  another notable one in the top of the 10th inning. You have the sack button from Nolan  which was good enough to get net O to third. But with the error by Zach Kelly, no place, right?  Sean was able to get to first. You have runners in the corners. That's what sets up the trout walk.  The base is loaded. And then unfortunately, it was a double play from Taylor Ward, but still we  will take it. We will absolutely take it. So thank you, Red Sox for giving us a gift in this one  a couple times after we gave you a gift in terms of turning that six nothing lead into a nail  binder. But with all that being said, the angels are too low at Fenway. And we will absolutely  take it now. They're too low. And two polar opposite games. The offense goes crazy with the three  home runs, the six runs in the first inning yesterday today. Just eight hits and three of them  coming from Travis Darno of all people. Shout out to him. We don't have critical. We have been  of him at times. But quite honestly, he's had a couple clutch performances. And so Darno goes three  for four outside of him. Just five hits from the rest of the lineup. Two came from Netta, who  was probably the player of the game in terms of hitting two for five with the RBI. He scored two  of the runs as well. He's backed up to 272 good to see that. Sean will, like we said, the two RBI  swing there. And he did have a walk, of course. And trout does go one for four with a walk. So just  like that, Mike Trout's OPS is 800 guys. It's 800 despite the two 46 average. He's having an  OK season just like that. But unfortunately, what we need to talk about is the four five, right?  Ron Washington makes the decision to move up trout to the three, the three hole. And good thing he did  because four and five boy, are they struggling? Ward goes over five with two K, two Ks. So there goes  over five with the strikeout. They're both now hitting just 213. Now Ward did have that crazy  home run stretch, of course. So his OPS is still 744. But so there's got a 663 OPS. You can't  hit him fifth anymore. And you can't tell me yet you're not watching this game and watching  Chris Taylor continue to still not get any hits. He's hitting 163, right? You're watching  Renhipo. I hate to say up a Renhipo over four and he gets caught stealing again, right?  He's hitting 211. So layer 213, Ward hitting 213. Those are guys that you got three guys who are  two guys who only play the outfield in ward and so layer. And they don't play it well, right? You  got a guy in Renhipo is a utility guy and Taylor who's a utility guy and all four of them are struggling.  And you can't look at that and think, man, oh man, you're telling me Matthew Lugo couldn't be there  after the hot start he had. I don't care if he let a ball fall in front of him in the outfield  in the minors on a play. I'll be honest. I don't know about you guys, but if you saw that play,  I didn't think he even really made that bad of a play. I don't think he was going to make the play.  You got it, right? I don't think he was going to make the play. We know current pairs fell off the cliff,  but even he added some excitement at least. And of course, he's young prospects for the future.  You're telling me that neither of those guys could be in the lineup for either of the four,  any of the four guys we just mentioned, right? So I don't know. That's something that we talked  about so much on the show, but sitting here watching this game specifically and watching the  combination of ward, so layer, Renhipo and Taylor go to combine. What is that? And combined  0 for 17 tonight, 0 for 17 with three, four, five strikeouts. You're telling me you couldn't have  at least one guy be replaced by Lugo. Come on. I wish, right? But we'll take it nonetheless. We  will take the...  win, uh, despite a bad performance by most of the lineup and we'll look forward to tomorrow.  An opportunity to sweep an opportunity to sweep the dang angels.  How good would that feel now early, early, early, first pitch 10 35, first pitch means  the game's going to end around 1 p.m. which means I will be doing the show from the LA  Clippers office.  So, uh, how ironic.  I'm so happy.  I was able to do the show back up my place.  Um, I didn't think I was going to do it.  If you don't, you probably, there's no way you would know actually, but I just flew from  the bay to LA today at 5 p.m.  The game started at 4 10 today.  And if it wasn't for the game going into extras, I probably would have had to do the show  from LA X, but instead, uh, the second can we got out of the bottom of the ninth, I said, okay,  I can call the Uber.  I made it home.  We did the show.  So, um, now we'll go back to doing it from a different venue with the mic quality, a little  bit lower unfortunately, but we will be live tomorrow.  After what is hopefully, another angel's win and a sweep of the red socks.  That would be fantastic.  Like you guys are saying, it will be Lucas de Lito as the starting pitcher for the red  socks tomorrow.  Going against our guy, Jose Soriano, uh, I think we have the advantage in that matchup.  I'll always think we have the advantage when it comes to Soriano because you know how  much I love our boy, Soriano.  So let's hope you can get it done.  Um, I think so.  If you asked me to call it right now, uh, there says something about the red socks right  now.  They're struggling.  The vibes are not good at Fenway.  There's people booing.  There's errors being made.  A lot of mistakes.  I'm calling the sweep.  And unfortunately, I want to have a broom with me, uh, in the office, but I'm calling the  sweep.  Um, we see here that Vinny is calling the home run over the monster for child tomorrow.  I'm not going to live any.  It seems a little forced today.  I feel like you got pre or pressured into calling it, but, uh, certainly we'll take it right  now.  Hopefully you're right.  Uh, we need the lineup to warm up a little bit outside of the, the guys who have been  rocking it right.  We know Neto's trying to one trout at this point.  They're getting it done.  Joe Adele.  He's actually been pretty warm, obviously lately, but Ward, Solaire, Taylor, run hefo.  If, if any of you four are in the lineup, I need to see a couple of base hits from you.  Um, J, J, J, C H is calling a Lugo start and a Lugo home run against him.  His former club in the Red Sox, that would be quite interesting.  And Jeff, Jeff's birthday is tomorrow.  He says, I'd like to see a sweep tomorrow for his birthday.  Well, happy early birthday, Jeff.  Thank you for the call, J, C H. Thank you for the call Vinny.  Let's have the positivity continue tomorrow and hopefully, let's get a sweep at Fenway Park.  What a statement.  That would be.  We like big venues.  We like making statements.  We sweep the Dodgers.  Uh, at Dodger Stadium, we're trying to sweep the Red Sox at Fenway.  That would be pretty, pretty impressive.  But with all that being said, we're going to wrap this one up.  So glad to be back doing the show in my regular spot.  We won't do it tomorrow, but we'll be back to doing the regular spot when the Angels  have normal games again.  We're back in LA.  And we'll keep it going.  But we're going to wrap this one up, shout out to everybody in here.  Angels four, Red Sox three in extras, read that, the hero with his first career save  in the bottom of the 10th.  Take care, everybody.  Let's sweep them tomorrow.  And as always, go, Angels.  Go to be back.  Take care, everybody."