" Pro football focus ranked all the offensive lines in the national football league and the Chicago Bears  Surprisingly ranked in the top five in all offensive lines and football were talking a little bit about that plus  Which coach is other than Ben Johnson is gonna make a surprising impact on the Chicago Bears?  Bears wire talked about that and we're gonna continue looking at the list now of players  I each position on the defense side of the ball down to the players to watch in training  Can't we're getting to all that and more right after this?  What's going on Bears fans welcome to another episode of Chicago Bears Central  You're number one spot for everything Chicago Bears related on the host their haze more importantly  You guys can follow channel at  Shide Bears Central on every social media platform. We happen to be on with that said  It's gonna get into this content for today also  So pro football focus is going been going by position group by position group  We've been looking at their rankings for the Chicago Bears the defensive line ranked in a pretty surprising spot  So our receivers ranked in the top half of the league as well  But now we're at to the offensive lines and this is where it's a big point for the Chicago Bears right and again  All this preseason talk is just preseason talk it all matters when they're showing it on the football field  But at all 32 offensive lines in the in the national football league  The Chicago Bears not only ranked in the top five. They're number four overall  Pro football folks going on the same this things are set to look a lot different in Chicago  Now only is the offensive line remolded  But it's also perhaps the most improved unit in the NFL  Braxton Jones and Darnell Wright who both finished among the 20 the 22 highest-graded offensive tackles in  2024 we're already a promising young duo now the unit has three new interior starters who represent immediate upgrades  Trade acquisition Joe tuning has been the best-class past blocking guard in the NFL in recent years a free and free  It's a new dominant ranked amongst the top five at this position in pf overall grade in each of the past two seasons  The right guard Jonah Jackson if you can stay healthy and get back to his old form  This can be one of the top offensive lines in the NFL  That is great praise for the Chicago Bears. You know, you know one of the goals of every off season  It's to be able to turn your weakness into at bare minimum  Not not something that's not hurting you anymore  But if you can turn it into a strength and much less one of the biggest strengths on your team  That kind of shows you've had a pretty good offensive line now  I'm sorry off season now the Chicago Bears are gonna have to prove it  You know one thing that I keep saying with this team all the preseason stuff and all that type of stuff is good  It's good for conversation  But everything has to come down to what we see on the football field and with the Chicago Bears  Unfortunately there've been times where we've won the off season and we didn't win no games because of it right  So of course that that stigma is there  But you cannot doubt the work that the Chicago Bears have done on the offensive side of the ball  One of the reasons for example that I'm not asked down on the running backroom  It's because of the improvements that the Bears have made on the offensive line for the team this season  And so it's good to see that you know as much  I always say this which is much dumb articles and doubt and clickbait shit that's written about the Bears  It's always going something positive was written about them  But again, it take you with the grain of salt because everything has to be proven  Everything has to be shown if it's not proven on the football field. It don't means anything  But you know one of the things there's still questions around the offense  I have no doubts that the Bears could have one of the best offensive lines in football  But it's gonna have to come down with health health is still a big thing there in depth  Who how do the debt pieces step up on the scene because you can have really good starters?  But but especially for offensive lineman they're not playing every single snap  Your starters aren't playing every single step. You need to rotate guys out of there  I think the Bears have have a solid path to some to some decent depth, right?  I think with as much as purple ball focus called out and talked about Braxton Jones  You know, we don't know if he's gonna start between him and Aussie Trepello  But even with that if Aussie Trepello does not end up the starter  You now have a guy that you drafted  You know high in the second round that that can play either the left or right tackle  So that's good depth there, right?  Karen, I'm a god J the bears are hoping that he's gonna take a step even the fact that he's played some reps with the starting  starters as well and it has  Has from what we've heard look pretty good when he played with the starters  The fact that he can play guard or tackle. I think really works to that  You got a guy like Ryan Bates is still here Bill Murray that's still there at the depth  Luke Newman another draft selection of this year that I think the Bears are still looking or and then one person  That's not talked about a lot either still Bennett it now keep in mind  This is a guy that the bears thought so highly of that even despite having a season ending injury early into training camp  They kept him around  They wanted to take a look at him to see him and he's only 23 years old  He's a guy that hasn't been talked about a lot and I don't expect it  But he's another guy that could add some depth to that offensive line for the Chicago Bears  So the depth is one of the biggest questions  I feel very confident in the starters that we have there  The question then becomes about the depth and even at center. Doug Kramer  Luke Newman right these those are the two guys that are going to probably be competing for the backup center  Minutes on that offensive line and that's where I do have some questions  But to look at what the top five offensive lines  Per folk pro football focus were Philadelphia Eagles came in at number one no surprise there  They should the Denver Broncos came in there at number two the Buffalo Bills at number three  The Chicago Bears of course we just talked about there at number four the Indianapolis Colts at number five  The Buccaneers the Minnesota Vikings the Atlanta Falcons the New York Jets and the Los Angeles Chargers  Round out the top 10 there you will know the bottom five teams as far as offensive lines  Per PFF Houston Texans Cincinnati Bengals Seattle Seahawks  New England Patriots and the New York Giants. Those were the bottom offensive lines in the game of football Cleveland Browns  Or one spot above that that one too. So you know it  Like I said, I feel I feel very confident  What the starters are gonna bring  The biggest question is, is the, is the depth and how much that depth is going to be able to be relied on?  Now that's up to Dan Ruchar. We brought him in again, a world where down offensive line coach.  And so, you know, you got to trust that he's going to have the guys ready that he's going to have  the guys geared up and ready to go. And if he does, the bears are going to be perfectly fine.  Right? If the, if the depth guys show up and they're able to play their role well, this can be the  best bears offensive line that we've seen in quite a while. Maybe in Steveos lifetime, because Steveos  is young. I shot out to Steveos. I know he's going to watch and shoot me texts after he hears that shot.  Um, so, you know, and we'll see. And, but, you know, not to be pessimistic, but just to be real,  you got to show it. It all doesn't mean anything unless you show it on the football field and health is a  big concern there as well. Because when you talk about death, you also got to talk about health.  Tony is a, I mean, uh, uh, Jonah Jackson is a guy that has not, was not healthy last season.  You know, now he was relatively healthy other than that. He must have a lot of games last season.  You know, I, I can't remember who called in a couple of weeks ago on a voicemail. And they were like,  well, you know, 10, 10 Jenkins, and Jonah Jackson basically the same amount of games over the  last few years. We're Jonah is because of how much he missed last year. But, you know,  and that's a question there. You don't want to deal with the health things. And so,  if this offensive line could stay relatively healthy and the depth can step up when needed,  I think that we, we could be on to something to wear the offensive line is no longer going to be  a weakness and could even be one of the bears biggest strengths heading into the year.  That's what you got to look at guys like coast and leveling. During, during the smith and  their ability to block as well, um, Broshan, Johnson, Kalman, non guy when he's in there as far as  past blocking and hope, K, the Williams got a little bit more as well. These are all things that are  going to be important to keep in the quarterback first 68 sacks last year. 68, you got to be better  than the 68 sacks as a team. And that while those are all weren't on the offensive line,  you're like having a much improved offensive line, hopefully goes away and helping build the confidence  overall. So let me know what you guys think down below as far as PFF grading, the Chicago Bears,  not only one of the best offensive lines, but top five in the NFL at number four, do you agree with  this? Do you disagree with it? Like me, do you share a little bit of, okay, that's cool. That sounds  good. But let's see it. Let me know what you guys think on that down below with that said, yesterday,  we talked about an article from bears wire and which they ranked or not ranked, but they gave a  player at each position group on offense as the player to watch at that position in training.  Now I had different thoughts on them on some of them. So we're going to go over there,  list five any different players at that position group. I'll mention it, but today we're going to  look at the defensive side of the ball and to start off with on the defensive end, they brought up  my test sweat. Um, you know, say this, my test has a case to be considered the best all around  player on the bears. They are hoping that a few players on offense challenge them for that rank in  the coming year, but it's where they are right now. So what is also alone on the defensive line of  terms of the elite pass rusher? And that's the part where I'm going to stop at, right?  Montes sweat did not have the statistical season. Now that people wanted to see from a guy that  you paid that much money and that you traded for and all that. Now you can factor in how much of  the fact that the bears didn't blitz. So we weren't creative. We actually got quite a lot of  pressure for teams that did not blitz as much. You know, seldomly is the bears did last year.  You had, you had, um, injuries all up and down the defensive line. Then we also found out that  Montes sweat was not healthy from almost the entirety of last year. So now with Dennis Allen,  who's going to have a much more creative set of play calls, uh, Montes what coming in into this,  having a clean bill of health, which it looks like is really good and overall better performance  in depth overall on that. There's no question that you should expect more from Montes sweat.  And I actually agree with this rank. A Montes has to be a leader. He has to be a guy that  comes in here and sets a tone, but also you have to, you, you have to come in here and perform.  You just have to come in here and perform. He's one of those veterans that you have to look at.  And you got to say, you have to go out there and do your job. And you can't just do it and  keep by you got to actually come in here and dominate at what you need to do if the bears are going  to be good. If the bears are going to have a good defensive line, something that comes in with  Montes. What, of course, Dale has to do with this thing. And I almost picked him here as the player  to watch because of Dale O'Dinging Bo does enough. If he has one of those repeative five,  sack eight, sack seasons that he's had in prior seasons. And that keeps defenses. Honestly,  not be able to double team Montes sweat. That goes a long way. If you're fine, Dexter, who we're going  to talk about here in a second. If he, if he has a more consistent year, it goes a long way in  hot open Montes sweat. But I think play calling alone, being more aggressive on the blitz, being more  creative, which you're play calling in that that's going to already help Montes sweat have a better  performance. But I'm not mad at Montes being the player at the defensive in position that needs to  look out that needs, you need to watch out for in training camp. Next up defensive tackle and they  picked Jervon Dexter here. And I'm going to go ahead. Barry, the lead, no notes here. Jervon,  Dexter who had a fire start to the season last year. And like I said, there's different between  reasons and excuses, the defense suck at times last year, 27th ranked defense in the league.  The injuries all in down that offensive, that defensive line last year that played a part into it,  lack of production out on the edges that played a part into it. And it has to be synergy, right?  The inside has to provide pressure to help the outside and vice versa. And Jervon Dexter, who  his first year as a full time starter coming into the season last year is now coming into the  second year as a full time starter. We got to see more consistency from Jervon, Dexter in year three.  Jervon has to be consistent from start to finish. And it doesn't have to be a huge sack number.  For defensive tackles, it's not always about having some six, seven sack total that indicates how  much you can bring, but you have to be better at consistent pressure. You have to be better in the  run game. Absolutely. Jervon has to be better in that run game. And we hope that that's going to  be the case here as well. And we'll see what happens. We shall see what happens when it comes down to  that. But Jervon Dexter being the player to watch out for at that defensive tackle position.  I think that that's more than fair. And uh, Jervon has to step up and do even better and more  consistent based off what he showed last year. All right. Next up at the linebacker position,  surprisingly enough, they labeled root root in the hip a light here. Now it, you could have gone  remain admins, especially with how he's paid, how disappointing his, again, in relative.  He's had solid seasons, but not to what he gets paid here.  He just has it.  And in coverage, he has not been what we brought him in here to be in coverage.  Reuben Hippolyte, though, has a young rookie who's coming in here and trying to earn a starting  position.  I look at this two ways for Reuben Hippolyte.  Not only is, yeah, he's a player to watch out for the speed that he has, how it can be used  in blitz packages.  But also, this could be in our addition for Reuben Hippolyte to actually be the middle linebacker.  And it's remain admins who is on the clock this season.  If terrain does not bring it this season, do not reciprocity.  He's not back in a bears uniform next year with the way that the bears can save.  And so now him and power echoes, these are two guys that really have an opportunity to  show and use this for what they can bring.  But Reuben Hippolyte has that third linebacker.  What he put what the potential that he has to bring there in coverage and with that speed  coming there to try to get to quarterbacks and to the backfield, that really is something  that can really open up this.  And you know, TJ Edwards is the one guy that he's going to be consistent.  You bet is if he's healthy, he's going to be consistent.  So you need somebody else that can step up.  If Reuben ends up showing himself to be a dog for this defense, man, that really does change  some things for this bear steam.  So Reuben Hippolyte, not mad at it all.  You know, him and Noel Sewell competing for that starting a third linebacker spot, even  though you're going to see some, some, some D backs lined up that and things like that.  But you know, I think that's a fair thing, but I'm still looking at Tremaine Evans as well.  Tremaine, Tremaine got to bring it this year.  If Tremaine Evans is not plaken more consistently this year, we know that he's not going  to be back, but we need Tremaine to step the hell up and be better this year.  And if the final position corner back, no, I'm sorry, not the final.  We got one more after this corner back position.  They label Jalen Johnson.  Now, I think the thing that's interesting about this is that you can name any of the corners.  You can make a case for Cola Gordon as a highest paid nickel in the league.  You can make a pace for Tyrech Stevenson and how he needs to step up after disappointing  second half of the season in the hair in the dumbass mistakes that he made.  How you can make a case for Zay Frazier and how with his size and speed and how Dennis  Allen is going to like to use him, you can use that.  But Jalen Johnson, and the reason why I do agree with Jalen Johnson here is because  Jalen himself has talked about for a few years now wanting to be able to do more, more  things in man coverage.  Dennis Allen has already said he's moving Jalen Johnson all over that field.  And what that's going to do is that's going to put quarterback in a position where they have  to think more.  In prior years with the way that Jalen Johnson was used, he basically was used to shut down  one side of the field.  We saw teams that not pass really to the side that Jalen Johnson was on and even when  they did he held them to a really low QB rating.  But when the way that moving them around changes things is that if you're lining up as a  quarterback and you know the bears, just leave Jalen Johnson on one side of the field, you  look at that.  You're like, all right, we're not going to go to that side of the field.  If you know that Jalen is going to roam and he's going to move around and they're going  to get more creative and we're starting them off on one side and maybe having them go  to a different side to guard or whatever else and actually following players around.  Now you have to look at that and you have to process and say, damn.  All right, Jalen's on this guy.  This is my read on this one.  All right, let's go over like you have it makes you think more.  And Jalen has to perform in that.  And Jalen's been calling for this.  So now, what's the thing I always say?  I like to be able to hold players to what they say about themselves.  Jalen laid out his goals for this year.  And I said before, even if he reaches a third of those goals, that's a pro ball or all  pro season.  So this is a big year for Jalen.  And I think that is is not only in the production on the field, but because he is a leader,  he is a veteran on this team.  He may be the best overall defensive player that we have on the team.  He's a leader.  So we talk about guys like, it's a Frazier that's coming in.  Right.  We talk about guys like, like, you know, just overall in leadership on that defense.  That's what you need from Jalen Johnson this season.  And so I think Jalen and having him picked here as a player to watch at the corner back  position.  It's fair.  But if you wanted to go collar, not, not mad at that because of the way that Dennis Allen  is going to use.  Kiler very creatively.  If you wanted to go, Tyre Mc Stevenson because of the way that his season finished and wanted  to say, let's look to see how he grows from those mistakes last season.  That's all fair there too.  So I think that, but Jalen Johnson being here, the pick, that's really good.  All right.  Let's get into the last of producing and that's safety.  And bears wire here, picked.  Jekwon, brisker.  And I fully agree with this one.  Jekwon, brisker is a player that we know what he can bring.  He was on pace first, third straight year of over a hundred tackles and has a safety.  That's really good numbers.  And we know what Jekwon brings as far as he's, he's trying to step up as a leader himself.  So only 26 years old.  And this is a guy that when he's healthy, he eliminates so many questions for you.  The problem is his health.  And so I think that like even just picking him for just that, can he stay healthy this  season and with the contract situation going on with him not having an extension has his  stands right now.  It makes it even bigger reasons to pick him.  Jekwon has to have a big season this year.  And when you look from week five on to the end of the season, we just didn't have him.  And so now if Jekwon can step up and stay healthy and do what we've seen him do when he  is healthy, it provides so much dominant play at that position.  It helps the safety.  He's helps the defensive backs him and Kevin Bayard really look like a safety deal that  was going to work.  And I think it also eliminates another future thing for you.  So Jekwon, brisker being the player here to watch at the safety position, that just  makes sense.  There's just no really no other way to talk about that.  It makes so much sense for what this team is going to do and what this team needs.  So Jekwon brisker being that player to watch in training camp, as safety, can he stay healthy?  How does he perform?  How does he respond?  He already talked about having to retrain his body, but he's not going to change his playstyle,  which I think is really good.  So we'll see what happens with that one.  But all right.  Now last time before we go, bears wire had all their writers named the new coach that's  going to have the biggest impact in 2025, not named Ben Johnson.  I think this is just interesting thing to see how people are looking at it.  Alisa, Alissa, I believe it's how you pronounce your name.  She picked Dennis Allen as a defense coordinator.  I think I said it many times.  Dennis Allen is as creative as the defense of mine as Ben Johnson as an offensive mine.  I think what he's going to use for Kyle Gordon, Jalen Johnson, Montez,  what, just the guys that we have overall the defense of line schemes,  it's going to be really important to see what Dennis Allen brings for this defense.  And so I'm not mad at that pig.  Brendan over there bears wire pick Antoine Rendoel, the wire receivers coach,  and assistant head coach.  I think when you look at our receiving core with DJ Moore,  Roma, Dunes, they loot the burden.  All of a sudden, these are chaos, right?  When you look at that, even what's going on with Tyler Scott, whatever happens there,  that's a nice pig.  I think when you look at what he's done here, how he worked himself as well as a wire receiver  and working with the Monseent Brown, Montrose Saint Brown.  So I think that's important too.  Sorendo will now get to come here and work with the young crop of players and a veteran.  Now let's see what he can get out of those guys.  Mike Pendleton picked Al Harris, the defensive backs coach.  I think that's an extension of how we know that Dennis Allen wants to use the defensive  backs on this team.  So I think that's a fair one as well.  But I think overall like this is just like it highlights the fact that the bit,  it's not just Ben Johnson.  The staff that Ben Johnson went out there and picked nobody picked Eric Bannamy,  surprisingly enough, especially with the running back room being looked as a weaker room.  I was surprised that nobody picked Eric Bannamy, but Eric Bannamy, you've been getting  doubt his whole entire coaching career, it's not going to stop now.  So, but I think when you when you look at this, the coaching staff, the Ben Johnson  built and that he went out there and intentionally got it shows a lot of like just how he covered  his own ass and how he covered himself with having people that can stick to the standard  that he's trying to set as a head coach here with the Chicago Bears.  But let me know down below, what is the coach other than Ben Johnson, you are most excited to see  the work that they do with their position group.  Let me know that down below.  That's my time for today.  Make sure you guys are following us at Shibera Central.  If you send us any feedback questions, comments, concerns, Chicago Bears Central at gmo.com.  Lastly, if you don't leave a text message and our voicemail for the mail bag, the number to do.  So, 773-272429336.  We are the number one spot for everything Chicago Bears related.  But that's thanks to you, lovely and beautiful people.  And like I like to end every episode on Shai Town Up.  We'll bear down.  Love you guys.  Peace y'all.  This has been a presentation of the Break Great for you to end the end of the end."