" I, again, everybody on damn board, and thanks for downloading the Bengal's Boot podcast.  Ah, welcome to the family edition.  As we meet the two newest members of the Bengal's Scouting Department, Josh Hinch and Tyler  Ramsey.  Then, it's the latest edition of five questions with one of this year's draft picks  followed by five observations after watching practice.  The Bengal's Boot podcast is brought to you by Paycore, proud to be the Bengal's official  HR software provider.  By Alt-of-Fiber, future-proof fiber internet, designed to elevate your home, business, and community  to a new level.  And by Kettering Health, the best care for the best fans Kettering Health is the official  health care provider of the Bengals.  Now, here's a quick reminder that you can have the latest edition of this podcast delivered  right to your phone, tablet, or computer by subscribing.  Wherever you get your podcasts, it's the greatest thing since.  Johnny's Lunch.  I was back in my hometown of Lakewood, New York recently to celebrate my stepfather's  90th birthday.  It was awesome to see him, my mom, my four siblings, and to eat at Johnny's Lunch.  Johnny's is like the skyline chilly of my hometown, a local delicacy that you miss  if you move away.  There are a wide variety of things on the menu, but you really go there for one reason.  The Texas Hotts.  They're hot dogs or hamburgers, if you prefer, covered with Johnny's famous sauce.  You can add mustard and onions as well.  The sauce is more like a gravy.  They list the ingredients as ground beef, tomatoes, onions, and spices, but the spices  are a secret recipe that gives the sauce its kick.  I wolfed down three of the hot dogs and bought a container of the sauce to go, and yes,  if you're interested, they do ship the sauce.  If you want to try it, go to Johnny's Lunch.com and send me a picture on Twitter, Instagram,  or Facebook, if you do.  Now, let's get to my first guest.  The Bengals recently lost one of their scouts, as Christian Sarkisian left to become the  football GM at Northwestern, his alma mater.  But the Bengals weren't short staffed for long, as they announced the addition of two scouts  on Monday, Josh Hinch, who spent the last four years with a Patriots after previously  working for Tampa Bay, and Tyler Ramsey, whose NFL experience includes 12 years in Seattle  and three in Carolina.  We get to know them on this edition of the pod beginning alphabetically with Josh Hinch.  Josh, let's start with your path to the NFL.  You are running back at Nazarene University and then South Carolina, was the goal then  to have a career in football in some way, shape or form?  Absolutely.  I just, my whole life, I grew up playing the sport, loving the sport, and after I found  out that my dreams of being an NFL player were going to come to an end, had to find another  avenue to at least stay in the game.  So initially it was coaching, that's really all I knew.  But the longer I was in the business, the more options and opportunities came about as far  scouting in front office opportunities.  How did you transition from coaching to a front office type career?  Right.  So coaching, that's how I had to start right after my college career, that experience was  great.  But once I wanted to elevate myself and push myself and just try to move up in the ranks  so to say from the visions to this competition, more opportunities came about.  So when I was at the South Carolina, when I went back to intern, I had opportunity to meet  some coaches, particularly at Northwestern, developed some relationships and ended up finding  a recruiting avenue at Northwestern, so that's how I kind of transitioned.  Your resume is interesting.  It includes stints in the XFL and the AAF as a director of player personnel.  Your young now, how old were you then and what was that experience like?  So around 29 or 30 years old, that was obviously a blessing in the skies.  I didn't know what I was getting myself into necessarily because if it didn't exist.  So way back when the USFL a long time ago before I was born, but when the XFL and AAF  were just a blessing for me, I'm from the upper foot.  professional development and just everything that I've learned,  the people that I've worked with, just my expanding my knowledge  on just the full aspect of running and constructing a team.  I mean, those opportunities and those experiences were great.  Most recently, you've been with the New England Patriots  where your job title was a Southeast area scout.  What leagues and teams did you cover?  Yes, so mostly from, say, the state of South Carolina down  through Florida, and then you push west through Mississippi.  So you got Alabama, Georgia, Mississippi, South Carolina, Florida.  Look, some parts of Tennessee.  So just mainly the Southeast area.  It sounds like there must have been a lot of current  bangles that you scouted extensively.  What guys were you really high on that you're going to be  around now?  No, Dan, you know, four out of the six, you know,  that I spent a lot of time on evaluated,  getting to know the person and the player.  I'm excited for all four.  I mean, I really am.  From this year's draft?  Yeah, absolutely.  There's particularly, you know, the Metra's night,  Dylan Fairchild, Bear Carter and Jenna Rivers,  all four of those guys I was high on throughout my process  with the Patriots, not only as a player,  but as a person, one thing that stuck out to me  about these four guys were just the character on these guys  with the type of guys that they are.  They're going to be ready to rock and roll pretty early.  And these guys love football.  Speaking of Demetrius night, specifically,  as soon as you meet the guy, you think, all right,  he's going to be a captain someday.  What about the on the field player?  What jumped out to you there?  For me, it was just the physicality,  the unique size, played strength.  He played around 240, you know,  had two, two, 30s, and he can run.  He can run, he can close, he's explosive.  He's a grown man, you know, already, you know,  so he's going to come in and ready, ready to roll.  And also the instincts and just the overall football intellect.  You can see on the field, he knows what he sees,  he triggers and he goes.  You mentioned Dylan Fairchild as well,  the third round offensive lineman out of Georgia.  What caught your eye when you watched him?  Yeah, so Dylan, he really caught my last spring.  As far as doing the spring scouting process,  just the size, the athleticism, the play strength,  just all those components put together.  He's just, he's going to make a really good guard  for a long time in the league.  Like all these guys on like all the drive picks.  And just like us, you and I,  we have stuff to develop and clean up and, you know, critique,  but the natural traits and, you know,  the stuff that you have to project.  I think there's a high ceiling for Dylan.  We are visiting with Bengal Scout, Josh Hinch,  who are some of your biggest mentors in football?  Yeah, I mean, I would just have to say,  so long, my journey and my path.  One guy that sticks out is Clayton Kidger Holmes.  He's the chief of staff at Army right now,  but he gave me the opportunity for my first job  about a college taking a chance on me.  It was in the Bronx, New York.  It was a division three school,  and kind of like a regimented military base school.  And he threw me in the fire right away, you know,  and let me do everything, you know,  from handling the position to running intramural,  intramurals for the college to doing the laundry,  to game planning, to everything.  So I was exposed to a lot.  And I have nothing but gratitude for Clayton  for getting me started so early.  And then after that, it just goes on to Coach Spurrier,  even as a player at South Carolina  to being able to work with him,  and to hand as his DPP for the AAF,  a really good mentor just showing me the way  of just having fun with it and enjoying the process.  I also getting the work done at the same time.  Tim Ruskul, who's a former NFL GM,  he was with me in the AAF.  And he kind of, he springboarded me,  and he was there for me, but he allowed me to just,  you know, get the full experience  and take matters into my own hands.  And he really trusted me in my evaluation process.  And he really helped me out a lot.  And Mark Trestman, he taught me a lot.  He showed me a lot of tension detail.  And this is all from the, you know, the AAF and the XFL.  Now, you know, this is before I got to the Patriots.  It was just, Mark.  trustman, that's the way he went about his everyday just process, you know, a very detailed  guy, man. So those guys managed to go to me. What attracted you to the possibility of working  with the Bengals? I would just say one, the opportunity, the continuity that the Bengals have  in the front office, the type of people that they have in the front office, the way they're  they respect who you are and the value that they saw in me that I could bring to the table and  vice versa. It's just an exciting situation and opportunity for both parties for me and the  Cincinnati Bengals. Did you have any pre-existing friendships or relationships on the staff?  So I knew Trey Brown through the springly, so the AAF and XFL gained a lot of respect for Trey,  throughout those opportunities and we just kept in touch since then. And since we've both been  in the league, we gather a true friendship or relationship. It's no secret that the Bengals have a  smaller staff than other NFL teams. Because of that, every voice is important and heard.  Did that stand out to you about the opportunity of working for Cincinnati?  It did. It did. It's just the, like I said, the opportunity. And so my voice could be heard and I can  really prove my value and show my work and also just help the team as a whole. That was really an  intriguing part of the process. Joshua, an evaluating a player. What are some of the most important  traits that you look for? Every player is his own guy. You know, but I love, you know,  instincts, you know, instincts number one. Because instincts happen to every position. You know,  no matter how big you are, how small you are, how well do you see the game? It's something that I  really look forward to evaluating and looking at and just the overall movement skills. I love  speed, sort of place speed and just, just the fluidity and just, just overall, you know,  movement skills of a guy, you know, at any position. That's the duty of the sport in this game.  So many different positions that you can evaluate in so many different ways that guys move around  and have to move around to get the point A to point B. And then just obvious, you know,  per position. What do they, per their position? What do they do? Well, that's what I look at,  look for. How about character? How does a scout try to get to the bottom of somebody's character?  You know, you're dealing with, you know, human error, right? So it's a lot of ways,  you just got to dig deep and really trust the process and trust your resources  and, you know, gather a bunch of information, whether it be one year or two years or  even longer. And you, you just got to trust your process and come to your own opinion  with all the information collected. And then also, you know, we do a good job to lead yourself  as far as checking every box throughout the pre-jive process to make sure you get what you need.  So from, from, you know, visiting schools and talking to your resources, but then after the season,  you get to actually sit down with these guys on whether, whether it be the all-star process or the  combine process or the pro-day process. So all that information, you should be able to, you know,  make an accurate decision at the end of the day. Are any of those events, especially valuable  to you, whether it is the combine, an all-star game, a pro-day, whatever? Yeah. I think area  event throughout the process, especially in its own way. I mean, you can, you can get valuable  information. But if I had to pick one to answer your question, the pro days, you know, the pro days,  because you get to, you get to really interact with the player and the coach. You get to see,  obviously, you know, they're in shorts and they're running around. But it's just the process,  you can be able to sit down with these players in the meetings with the coaches and really,  you can hash out, you know, what you, what you think may be concerns or if they don't have  any concerns at all, just really getting to know the guy again. And then also the third B-visits  are fun too as well. Bringing these guys in and being able to get to know the full aspect of the  guy, you know, the carry there, the mental and everything that you, if you do have concerns at the  end of the day, those 30-visits, so to fit answers, answer those questions.  You're chatting with Dinkle Scout Josh Hinch.  How has NIL and the transfer portal impacted the job of a scout?  So with NIL, with these guys getting more money, I think it, for me, I think it's just you can  kind of see a little bit more of the character, how they handle their money, you know, what they do  with it, how they react to it. And then the transfer portal, I would say, you know, it happens  so much, I think nowadays the transfer portal is kind of risen above, you know, just the average  high schools, high school scouting, you know, in value in the recruiting, because it's,  because the portal for me, these guys can can absolutely come in one year, get a lot of money,  come into a new environment, not know anything in them and also with the schools,  you know, the schools may not know these guys until towards the end of the year, because they're  just transferring in, right? So that's the impact that our jobs from a standpoint of we like to get  character early, you know, in the process, let the film play itself out from a evaluation standpoint,  but we wanted to try to get the know these guys, family situation, just who they are early on,  and I think all the transfer, all the transfer situation, you have to rely on where they've been  in the past. And if you have, if you don't have that same school or cover the same area,  then you know, the information that you've got and you're kind of relying on someone else's,  that that makes sense. The life of a scout is not the easiest. There's lots of travel. They're  obviously long hours. What do you love about the job? I think at the end of the day is just football.  I mean, you love football. You love everything about it from being as a player,  to being as a coach, now being as a scout. You understand that all those things tie together,  and for me, scouting really fit my personality more at the end of the day of that makes sense from  being able to experience being as a player in the coach. I just love the aspect of constructing  a roster and evaluating players and seeing things come to fruition and just working with  like-minded people and to seeing goals be achieved and come to life. So that's what I love about  scouting. How are your teams in the XFL and the AAF? So in AAF, we went to 71 before the  kind of unfolded. So we were on the roll there. It was good. It was a good team. The XFL,  we weren't as good record-wise, but I think overall, I think we had a good team as well. We had a good  offense and defense. There's more or less coming together. It's going to take us a little bit  more time to come together as I feel like we were down the stretch and then COVID struck.  Everybody that does this is trying to win a ring. What do you think of the Bengals roster as you  join the organization? I think it's a win now roster. I think there's-there ready to go. Obviously,  it's a high-octane offense as far as skill players. The quarterback, obviously, the offensive line,  I think will be very improved this year, defensively too, with everything that's going on,  with the, you know, from the draft pitch to the veterans, to the coaches. It's barely for me,  right? So I really can speak too much on it, but I do feel like everything is going to be  improved and ready to compete at a high level. You're in your mid-30s. What's your ultimate goal  professionally? To win a Super Bowl, I haven't won a Super Bowl yet. So that's more to go  and to win a Super Bowl by any means. I don't really care about what title I have. I just want to do  that. But also, we'd like to, you know, be a contributor and show my value on a Super Bowl,  on a Super Bowl roster in the Super Bowl team, which I think this, you know, not going to work  well, God willing. I think this is the opportunity, you know? So we're always going to work my butt off and  do my best and do my part and see where it goes. We're excited to have you with the organization.  I look forward to meeting you in person and I appreciate your time today. Thank you, Josh. Thank you, Dan.  Appreciate it.  Up next, Tyler Ramsey, who will look to add a Bengal Super Bowl ring to the one he earned while  scouting for Seattle. Tyler, did you grow up dreaming of a career in football?  I dreamt. I had a lot of dreams, but when I  Realize I wasn't going to be in the NBA, you know, I started evaluating other athletes around me and  Realize that I had a pretty good eye for it. So kind of fell into it got got pretty lucky to  Graduating in the recession in 2008. I thought that was  You know gonna go into banking or be a financial analyst or something like that and then the fact that nobody was hiring anybody  The time kind of did me did me well because I was able to pivot and you know chase a dream and I've always been a competitor  Always been an athlete. So, you know, we're gonna professional sports was was a goal for sure  Well, it's talk a little bit about your athletic days because you're from the state of Washington  You went to a high school that's got a storied football history and traditions  A tradition rather 11 state titles in a 13 year period and you are part of three of those state championships  How did that impact your love of this sport?  It was a well oiled machine out of those the two years we did not win  After I had already graduated was against Kellen Moore who's who's now an NFL head coach and Jake Locker  It was a force first round pick. So  We had some pretty steep competition  But it really set the foundation, you know for work ethic and discipline and you know toughness like  There would be 110 guys in that program  There would be in the weight room the Monday morning after the state championship and it was just like all the work  You put it in the offseason all the work you put in is gonna you know pay off a year from now and and that just steam rolled for  You know well over a decade of just kind of a blue collar work ethic and the toughness about us  We ran the wing tee so you know just run the heck out of the ball and and play good defense  It was a when he recipe in the state of Washington when I was there  You went to the University of Washington, but did not play football correct?  Correct  Like I said, I was a wing tee quarterback. So  My highlight tape was very very small  Graduating high school. So has some opportunities to what to you know go to division three schools and  You know potentially compete for first spot there  But you know kind of did some self scouting there as a you know teenager and figure that my future wasn't on the on the field  So might as well get my life started and go through the business school at the University of Washington  We are visiting with Bengal Scout Tyler Ramsey. Let's talk about your professional career  You spend a dozen years with the Seahawks  You were on the staff when they won the Super Bowl in the 2013 season  Of 43 to eight win in the Super Bowl over the Denver Broncos  Can you describe the emotion of when the the confetti is falling in a game like that?  Yeah, it was totally surreal  I mean I think it was a safety on the first play of the game that went over pain many heads  So at half time I think it was 22 to zero  Percy Arvin returned to kick at the beginning of the second half and it's 29 to zero on it  It's just such a weird  You know excitement sitting there for almost two more quarters  Being like I think we're just almost Super Bowl  But you know you still got to finish the game and then the team did a great job, you know  Finishing it out. So it was awesome  It was it was a very elongated emotion because you were sitting there just on the edge of your seat  Like when can we get down to the field and get with the tee?  How does winning one ring affect your desire to win another?  Oh, I mean that's that's why we're all doing this is is to you know  Hoist a host trophy at the end  If you're a if you're a competitor, obviously  There's a lot of stuff around the game, but it made me hungrier  I was trying to you know, we were fortunate enough to get back that next year  And didn't turn out so well, but it really motivated me. I actually  signed up for grad school immediately after that second Super Bowl just being like how can I challenge myself?  How can I do something better?  And got my master's in business administration while I was scouting for the Seahawks  So it really you know kind of stoked a fire like you know being the best in the world takes takes a lot  So we we need to continue to kind of you know grow and push the limits and personally that's going back to school  felt like the right choice of the time  Tyler who are your biggest football mentors?  Yeah, I'd probably go a little bit back to high school  As well as with the Seahawks and high school my head coach, butch got her off who was there for all those championship runs  Really, you know instilled kind of the work ethic and blue collar, you know style  He was a really demanding coach, but he was always your friend  He he made you want to play for him and just he's kind of genuine style  Just be an authentic butch  My defensive coordinator there was James Hasty the former DB  For the Chiefs Jets  Ironically, he was the original bump and run you know prototype corner for Pete Carroll when he was with the Jets  And then I was fortunate enough to work with Pete in 2010 my second year in the league and then you know 11 years after that  But Pete Pete is always going to be a huge influence. He's he's got a rare quality about him in terms of you know  Just the charisma the  energy, the passion, the competitiveness. He makes football fun again and you could talk  to any other players that have ever played for him of how much, you know, they re fell in  love with the game under his leadership. How does somebody learn how to become a scout?  Are you taught? Is it trial and error? How did you develop the skills for this profession?  Yeah, you know, it can be a little bit top, but there's definitely some instinct involved.  A lot of scouting is obviously gathering information and, you know, just being detail-oriented  and having, you know, the personality to walk into a, you know, Division I coach his office  and ask for information when he doesn't have a reason to or trust you or know you at all.  So you've got to have a little savvy there. And then the instincts when it comes to just  evaluating the way a guy moves, what a team is going to be asking him to do and does he have  the physical capability in his body to do that. That's just something that I've kind of always  possessed. I've always, you know, looked around on any athletic field that I'm at. And like,  that guy moves different than everybody else or, you know, watching the NBA growing up every  Sunday on NBC was just being like, having an appreciation for, for God-given talent that I never had  is something that I've always possessed. But you can definitely work on all that, the ins and outs  of details. But at the end of the day, if you're working hard and watching film and writing  the wrong grades and putting the wrong projections on players, you're not going to be in the business  that long. What traits do you prioritize as a scout? I think there's, you know, a minimum threshold  of athleticism and speed and all that stuff. And if you don't meet those, you're, you're just going  to really struggle. No matter how smart and tough and competitive you are. But once you get over  that minimum threshold, depending on the position, you know, it's really the competitiveness and  the passion and the toughness, you know, there's always going to be hard days. There's going to  be bad plays. There's going to be, you know, things that don't go your way. And to have the  competitive confidence in yourself to continue to just come back and explain mentality. I think  that really carries a lot of players in the league because it's not smooth sailing. They've always  been the best player to get to the league and everybody's the best player from everywhere.  So just having somewhat of an irrational confidence that, that you can succeed despite, you know,  everything that's going on around you, you like to see that. We're chatting with Bengal Scout  Tyler Ramsey. What attracted you to working for Cincinnati? Yeah, obviously, I had some connections  in the front office with Steve and then Trey and guys that I've developed relationships over the  years crossing, you know, a lot of paths gotten out west back back in their early days in the  league and mine as well. And we developed a good relationship. So, and it've always had its  center aspect for, for, you know, getting out on the road and seeing Bengal's coaches out there and  doing workouts and really doing the work and collaborating with the staff. And then as well as the  setup, you know, everybody talks about, you know, a small front office. But I think it's great. I  think you have in your hands and in pro and college scouting and really being a part of the  decision making process and being a part of the team puts a lot on your plate and it forces you to,  you know, to grow, to learn, to, you know, get outside your comfort zone a little bit. And then  obviously, you know, Coach Taylor, I've heard nothing but awesome things about. And then,  having, you know, Joe Burrow, James T Higgins and an offense that's high flying is exciting.  With the smaller staff, every voice matters and every voice is heard. Is that something that's  appealing to you about coming to Cincinnati? Yeah, of course. You, you, I mean, you do the work. If you  do the work and you, you know, put spending the amount of hours that we do, you know,  away from our families on the road digging guys up at small schools, doing all that stuff.  Feeling like that matters when you say something is, is really important. I've gone years.  I've been around a lot of good people, but I've gone years where we haven't acquired a single  player that I evaluated in my area or after the draft and you just kind of, you know, like, I just  spent nine months doing this and we didn't have a single guy that I scouted, which, you know, happens.  So, um, just being able to, to put the work in have your voice heard, whether it's, you know,  they, they truly believe and then want to go with your opinion or not. That, that happens. But,  you know, it gives you, you know, ownership and agency over your own, your own job and then really  makes you hold yourself to a higher standard. After your time in Seattle, you spent a few years in  Carolina and then last year working with the senior ball staff in those roles are their current  Bengals that you scouted extensively that you are high on and kind of looking forward to now  being part of the same team. Yeah. I mean, Demetrius and I would be one of them. Um, the second round  pick I followed him pretty closely this past year, um, living in Charlotte. I went to a couple of  South Carolina games and learned quite a bit about him and his whole story from Georgia Tech,  uh, um, UNC Charlotte South Carolina is a pretty cool one. Really.  mature kid. I think he's got a ton of upside too. So I'm excited to see him really stepping in  compete. You know, the schmars steward is likewise like he was a guy that you couldn't help but  notice on tape. How big, how athletic, how disruptive, how hard he plays. Like he is a competitor.  So I'm excited to see him. He actually get on the field and all that. But those two guys  this year definitely jumped off the tape. How is NIL in the transfer portal impacted  the life of a scout? It definitely adds another layer that you're going to have to, you know,  follow up on relationships from a guy that could potentially be at three schools like Demetrius was.  So you got a really dig, you've got to really find a way to sift through a lot of different  information, you know, a school where a guy has some success for a couple years, then jumps in the  portal and ends up somewhere else for a higher dollar amount. Naturally, the school he left might  be a little bit bitter. So the information you're getting out of that school might not be as,  you know, as loving loving a kid up is his current school that he's playing at. So, you know,  just having the maturity and, you know, nuanced and so sift your way through all the information  that's coming your way definitely takes some skill. But it also, you know, guys are getting paid  already. So you don't have to worry about what, how they're going to react to money in the NFL.  So it's somewhat makes it a little bit easier that they show who they are sooner to us versus,  you know, you draft a guy and you have no idea how he's going to react to moving and money and  all that stuff and fame and then they've been exposed to it for the most part. So it's somewhat,  you know, makes it a little bit easier to see who the real guys are. You know, the running back that  that gets a big an aisle check and he shares it with all of his offensive lines stuff,  stuff like that where you can just see the true nature of guys that stuff that translates to the  NFL pretty easily. A life of a scout isn't necessarily an easy one. You travel a lot. You work very  long hours. As you noted, you have three young kids. What is it about the job that you love?  It's really the people. It's footballs, you know, obviously, in my opinion, the best game in the  world just because of the ability to bring so many people from so many different walks of life  together for a common cause. It's easy to relate with, you know, it's something that the game day  still gets me fired up, the athlete of me never went away. So, you know, being able to impact a team  in a roster in a culture for guys that I genuinely believe in. And I feel like playing the game  the right way and carry themselves the right way. It's just fun trying to build a team like that.  So, yeah, it's, it's just, you know, always going back to the little kid that fell in love with  their like, tapping to that passion. Even though it's a tedious job, you got to remember it's  you're pretty lucky to and plus to be in the situation. You've got a Super Bowl ring. You know  what a championship team looks like. How close are the Bengals to being a team that can contend for  a Lombardi? I think really close. I'm actually watching our guys right now. So, I'm trying to get  a caught up to speed before mini camp next week. Cause you obviously know the main players,  but some of the guys that on the depth chart that I'm not too familiar with just want to get a  feel. But I think when you have, you know, number nine behind center and offensive weapons that  he has, it gives you a chance in any game. So, I think if a couple areas, you know, can improve  like it's, it's not too far away. It's, it's really cool. The NFL is really cool in the sense that  every, every year is a different year. It's, it's not what happened last year. So now what's  going to happen next year. It's like if you capture this, you know, six month run and you start  jello, I'm like the, the Bengals did back in 21. It can be a special year. So, um, I don't think it's  too far away at all. Obviously you want to continue to add and grow and and get better on bull  sides of the ball. But, um, yeah, it's, it's gonna be fun to, to watch firsthand. Well, we are  happy to have you in the Bengals family. I appreciate your time today and look forward to meeting  you in person. Thanks so much, Tyler. All right, Dan. Take care. Thank you. Josh and Tyler aren't  the only additions to the player personnel department is the Bengals also hired  trail of bounty to join Sam Francis in their football analytics department,  Trey earned a master's degree in sports analytics at Miami University. Before getting to my next  guest, here's a quick reminder that the Bengals booth podcast is brought to you by pay core proud to  be the Bengals official HR software provider by alta fiber, future proof fiber internet,  designed to elevate your home, business and community to a new level. And by Kettering Health,  the best care for the best fans. Kettering Health is the official health care provider of the  Bengals. Now, time to move on to another edition.  five questions with a Bengal's rookie.  Time for five questions with Bengal's rookie offensive lineman, Jalen Rivers. Question number  one, you shared with us on draft night that your mom, your dad and your stepfather, ball  spend more than 30 years in the Navy. So naturally, we assume that you had a discipline  childhood. Tell me something that you weren't allowed to do that your buddies were.  tough because it was so many things. But one thing I will say is I couldn't go out at all  during the week. And no matter if I finish my homework or anything like that, during the week,  in the matter with age, I was in high school, middle school, during the week, no, no, school night,  no, you got to wake up, you got to, you got to, I went to practice, came back, finished my  homework, do whatever. And there was a curfew I had sometimes because I'm not a morning person,  all the time, session when I was in high school. So it was like, oh, you're going to put your phone  downstairs after 10 o'clock or something or not 30. So yeah. So there are probably times you  didn't like that. But it clearly is paid off. Will you do that with your children someday?  It's a yes. But if they got to show me that their trustworthiness is discipline and they're  disciplined enough to put their phone out at certain time, but you know teenagers. They're  proud of me. So probably yeah. So I probably do the same. All right. Question number two for  Jalen Rivers. We all know that a perfect GPA is 4.0. From what I've read, your GPA in high school  was 4.3. Did you ever have a B? Yes, I did. Yeah. Um, but it was in high B's, you know, anything,  anything on B or less, I was mad at myself. So I strive for all A's on or all A on a rope,  but yeah, I do good B's. Well, not many, obviously. The 4.3 GPA did school come relatively easily  to you or was that GPA, the product of a lot of grinding and hard work. A product of a lot of  grind and hard work. I mean, I credit to my parents is me staying on top of my school work. Um, so  it was tough because some things I weren't good at. Um, like math or problems, stuff like that.  When I was young, I over thought the question a lot like, it might be this might be, but you know,  overcome that over years and you start getting better at it and it's like, you know, it's kind of  getting easy because I put someone's work in the being a great student. So question three for  Jalen Rivers. You're a big man, six, six, about 320 pounds. Where does your size come from?  My family both sides. Um, my mom's side. Well, both sides of my parents, my grand dads were  above six foot, like six, two, six, three. Uh, yeah, both sides are both sides of my family.  Is your mom six feet tall? She's six foot. My dad's six, two, six, three. Yeah. It was meant to be  question number four in addition to having a great high school football career, you are a state  champion in the shot put. That's one of those events that obviously doesn't attract a bunch  of fans, but did you enjoy competing in track and field? I loved it. I enjoyed it every  because I started my seven degree year when I started middle school up until obviously not  up in my senior because I didn't leave it early to come and go to Miami. But yeah, I enjoyed it.  Every single year I look forward to the spring to be honest, it's a thorough shot put.  All right, fifth and final question for rookie Jalen Rivers, tell us something about you.  Not many people know that I'm a great cook. One of my biggest hobbies right now that I've just  gotten to like the past three years was cooking. So I can cook some chicken Parmesan with some  rigatoni pasta, jerk chicken, stuff salmon, stuff chicken, homemade mac and cheese,  all this stuff. Yeah. I'm looking for an invite to your house. Are you good at following a recipe  or do you have a natural ability to think, okay, these spices will work well with this dish  etcetera? No, first I do follow recipe and then also my dad. He's a chef. He's a he caters. So I get  some ideas from him and he teaches me stuff. So but when I figure out a recipe, I start putting  my own spend on it when I started learning some of the new things. It is offensive lineman  for three GPA, state champion in the shot, put and chef. Jalen Rivers, we've learned a lot.  It's nice meeting you. Great to have you here in Cincinnati. Thank you, appreciate you.  Now let's go from five questions to five observations after watching the Bengals practice  and talking to players and coaches on Tuesday. Topic number one is Cam Taylor Brett. After  disappointing third NFL season that saw him get benched at times. Cam is embracing a fresh start  defensive coordinator, Al Golden, Taylor Brett, intercepted Joe Burl on Tuesday when he  lined up as a slot corner and picked off a pass intended for Mike Gaseki on a quick out route.  Here's corner back coach, Chuck Burke's followed by Taylor Brett.  What are you emphasizing with him as you try to get him back to the level of play he's capable of?  Just discipline and consistency. We always talk about TNC doing the things that take no  talent and you know that's my main focus within this spring taking care of those things  you know stance alignment assignment and having your eyes in the right place and when mistakes  are made, no excuses, no explanations, those are the next one. Anything stand out on that play  that kind of fits what you were talking about. What stands out is he was in his correct leverage  and you know that that's where it starts and he was in position the ball showed up and once  Cam gets himself in position, he has better ball skills than you know a lot of guys I've  coached him up for here so I'm not surprised he made that play so he just has to be consistent  in putting himself in position to make that play. Is there anything about that play that illustrates  what you're working on to try to have the type of year that you know you're capable of having?  Honestly, just put me in different positions on the field to guard different people I believe on  that when I was just on the tight end at the moment I just held my levers then regardless of what  he did at the top of the router just you know use my guy giving ability to go get the ball there.  So you're moving around a lot outside slot wherever? I'm out of it, I'll be all over.  With Mike Hilton gone is that what the secondary is going to have to do by a bunch of people  moving around to try to make up for his loss. Yeah I guess it's a win at the end of the day  honestly still, man. Just in the sense that I believe everybody can guard anybody within our back  head. Doesn't matter you know body type or anything. You can all be interchangeable so  yeah it'll be here and there you just never know.  That's your confidence level at this stage of the OTS. I feel great yeah I'm lit right now man  I know everybody is coming in in the right way man and I'm not even thinking about you know last  year you know it's a new mindset for me. For my teammates and it just didn't come to work  every day by the way on the very next snap after Cam's interception Joe Burrow floated a long  pass for Jamar Chase who beat DJ Turner and caught it in stride for a 70 yard touchdown.  Topic number two is Dax Hill. I watched Dax working out on a rehab field and it was great to see  him running and cutting under the watchful eye of the Bengals outstanding rehab coordinator  Nick Cos Gray. Dax is coming back from a torn ACL that he suffered in early October and he's  hoping to be fully cleared in time for training camp. Once he's back it will be interesting to see  where he lines up. Hill was the Bengals best outside corner in the first five weeks of the season  last year but with Mike Hilton gone there's an opening at slot corner where Dax often lined up  in college at Michigan. Once again here's cornerbacks coach Chuck Burks. Well with Dax I'm  going to put him in position to cover and blitz wherever that's at. So corner whatever you know  he's a guy that has a elite skill set to cover and that has an elite skill set to blitz and I plan  to utilize that and however that really manifests. What is the mix of guys that will compete  to replace Mike Hilton in the slot? All of you know today we've had or this past week we've had  came at Nickel we've had Josh Newton at Nickel we've had JD at Nickel you know Dax had placed  some Nickel so to me it's really more about matchups not necessarily positions we have multiple  boss who may line up inside but it's about the matchup of that week and how we plan to approach  defending that team that week. JD by the way is Jalen Davis who has been a valuable reserve  in his five seasons in Cincinnati. Topic three is wide receiver three. The Bengals have the best one  two punch at that position in the league in Jamar Chase and T Higgins and while there's growing  optimism that Jermaine Burton can be a more dependable pro in his second season we should not  forget that the Bengals already have a number three receiver on the rise in Andre Yosi Vash. The third  year wide out out of Princeton had 36 catches for 479 yards and six touchdowns last year then spent  another portion of his off season working with renowned receivers coach Drew Lieberman. I discussed  Yosi Vash with T Higgins. See if this time last year I remember a lot of guys were talking about  Yosi Vash and how much improvement he had made.  you see another step in Andre this year?  Oh, man, hell yeah, you know, Yoshi, I don't.  He teaching me things and it's night and day  from last year to this year.  And y'all gonna see, y'all gonna see this year.  Yoshi's gonna really gonna come on this year.  He's teaching you things.  Oh, yeah.  I could always learn from the other receivers, you know what I mean?  I learned from Chase, I learned from Charlie,  I learned from Jermaine, I learned from everybody,  you know, just do anything to put, you know, put in my bag.  So, so if he's taken those kinds of strides,  knowing that the Bengals have the best one, two punch  in the league with you and Lamar,  I mean, is this three-headed monster?  Definitely could be, you know,  that's what we're looking forward to doing.  Obviously, Yoshi, he's a bigger,  he got stronger, he didn't got faster.  He's twitchier, and he's just,  he know everything right now, man.  This has been great to see.  Andre has 10 touchdown catches in his first two seasons,  and for what it's worth, that's more than Zay Flowers  or Pukanukua, who are also taken in the 2023 draft.  Topic number four, you get what you emphasize.  Al Golden uses an acronym to sum up his defensive philosophy.  It's best, B-E-S-T.  The B is for ball disruption, E is for effort,  S is for situational masters,  and T is for tackling.  That first letter B for ball disruption  really stands out at practice,  because the defense begins the day  by going through four stations  where they work at punching, stripping,  and ripping the ball away.  Here's Logan Wilson on how Golden has everybody  focusing on forcing turnovers.  Just always find ways to affect the ball.  I mean, even in our daily unit defensive meeting tests,  he'll bring certain situations  based on how the ball carrier is holding the ball,  how we're going to attack it,  or where our profile is,  or we're behind it,  or we're in front of him around the side of him,  all those different things  so that becomes second nature.  We're not thinking about it in the game,  and when you're always harping on it,  and you're always working it,  just like I said, it just becomes second nature,  and then that translates to turnovers in the games.  Those four little stations,  there's something a little bit different  about each thing, right?  Yes.  Yeah, it's about how you're attacking the ball,  are you ripping it,  or are you rodeo uppercutting it,  or we're mirroring the hand of the quarterback  trying to make plays on the ball.  Not necessarily you just turnovers,  but even batting a ball now,  because it could be like a third down play,  and you've got the ball down in complete pass,  and we're off the field.  So those are also good ways to get,  quote, I'm gonna quote turnovers, you know what I mean?  So is it the classic case of you get what you emphasize?  Yeah, you get what you put in,  and that's technically before practice,  so guys are choosing to come out  and get those reps,  and he's not asking to get to 15 reps of each one.  Like you're just getting one rep of each,  and so when you're just constantly adding layers  to your game, like I said,  it becomes second nature on game days.  And even in practice, when we hit training camp,  so that we're,  because when we're always punching at the ball,  it's not only gonna help us defensively,  it's gonna help our offense too.  Al Golden's Notre Dame defense had 33 takeaways last year,  that was two more than any other team in the country.  My fifth and final observation involves tight end,  Mike Gasicki.  There's always a period early in practice  where the quarterbacks go through a series of drills  where they work on moving around in the pocket  before making off-platform throws.  And more often than not,  the person on the receiving end of those throws is Gasicki.  It made me wonder why he's the guy that gets to do that.  It's because I don't run down on kickoff for one,  so they're doing special teams drills.  And rather than just getting over there  and stretching or getting ready for practice  or things like that,  I just follow the quarterbacks and just get over there.  I like to get over there and they're talking  about some of the plays that are on a practice,  some of the looks that they're expecting,  just things like that.  And then just warming up and just getting a couple extra catches  before practice.  So it's just something I've always done  and it's something I enjoy doing.  I know you catch a ton of balls off,  you're good, jugs, everyone, everything.  But is it different just to get in extra catches  from a ball throw?  Yeah, just because the jugs machine is such a specific point  and you know where it's gonna be every time.  And our quarterbacks are extremely accurate,  but it's just always different catching it  from a human and a jugs machine.  So I like doing that for practice,  feel like it gets me ready mentally and physically  and then you go out there and make a play, so.  It certainly worked last year when Mike had 65 catches  and earned a three year contract extension.  That's going to do it for this episode  of the Bengals Booth podcast brought to you by Paycore.  Proud to be the Bengals official HR software provider.  By alta fiber, future proof fiber internet designed to elevate your home, business and community  to a new level, and by Kettering Health, the best care for the best fans Kettering Health  is the official health care provider of the Bengals.  If you haven't done so already, please subscribe to this podcast and if you have a minute  give it a rating or share a comment that helps more Bengals fans find us.  I'm Dan Hord, and thanks for listening to The Bengals Booth Podcast."