" On project to Stroud in Aryo, Crea Rinsiam, El Lid Ritaliano, Nel Wels management.  The city's junior to millivinty, three-quisier unichelas en blaire ordinari de yazzunista de  Mediobanca.  Pera Pravarilo Ferta publica de scambus u banka generaale, pertechi palas en blaire.  Who is your assistant to the Rito de de lega?  We present a message across the tuition and solidity that's una conferimento de de lega de voto.  Siprega de perenderevisione de relativo prospeto de solidity that's una.  The Dodgers and Mets are getting set for game two of this four-game series and we're joined  right now by a man that was a major league umpire for 30 years and now he's that Mike  Pereira for major league baseball on Friday night broadcast and that's the one and  only great Irishman, Brian Gorman, Brian, thanks a lot for the time.  Oh, thanks.  Appreciate you.  This is a lot clearer than zoom.  A little bit.  Yeah.  You need the technology, right?  Hey, when you look at the game now and how it's changed and just how umpires are  being graded, do you feel for your fellow brethren on just how much they have to juggle  these days?  Yeah, we talk about it a lot since since the pitch clock came into existence, everything  is getting condensed.  They call the same amount of pitches, they call the same amount of plays, everything is just  done in a shorter amount of time.  So the biggest difference from like when I work and from the times that you do now is that  they don't have a break.  You used to like between pitches, you used to be able to take a breath and take a break and  kind of reset.  Now they can't do that.  They're watching pitcher disengagement and the clock's taken down and so they're always  working so it's intense two and a half hours as opposed to a little bit more relaxed  three hours.  Hey, how much more is on the home plate on fire with everything that you just said?  Yeah, he's got a busy plate, I mean, he does all pitcher disengagement, he does all  batter time outs, he has to keep track of the batter time outs a couple of times we've  had a situation where a batter took a time out and then he wants another one.  And so you have to remember, no, you already took one.  So sometimes, you know, there's 50 someone, 60 batters a game, it gets a little confusing  things, you know, they already have a time out as you do one.  And so he's busy, it's a condensed period of time and he's got a lot to do and then he's  got to call balls and strikes and get everyone right.  Right.  And they usually do despite what hitters think and pitchers think.  Hopefully, yes, the scores are pretty much the same.  Everybody's scoring like in the mid mid, you know, high 90s with with adjustments that  they do for the evaluations.  The box that everybody sees on the on the screen, it's not accurate as what they get  evaluated.  So a lot of people go by that box, but that box is just a static box from the center field  camera.  It doesn't take into account a batter's height.  So so the low part of the strike zone and the high part of the strike zone, which is a lot  where the controversy comes in is is not accurate.  So so they're getting hit and hit pretty good on social media.  I understand.  Yes, exactly.  I'm glad you brought that up because I had heard that the broadcast that we see in that  box that we see, that's not the actual strike zone and on game day.  How accurate is that compared to what we see on TV?  It's it's not.  They do their own adjustments for what major league baseball gets evaluated.  Their vampires on their own adjustments and then they have post game adjustments where  they take into account the catcher where like you might get adjusted if the pitch gets  by the catcher goes back to the screen, but it might nick the box.  They'll get adjusted for that pitch.  So it's it's a lot different than what people see on the screen.  I almost kind of wish that it wasn't on there because it's just frustrating.  Former Major League umpire Brian Gorman is our guest.  He is now part of Major League Baseball umpire operations and also a TV star.  He's the guy that they go to on Apple TV in the zoom room when there is some questions  about the rules like last Friday night where Michael Conforto tagged up with the juggle  in the outfield at city field since the Mets are in town Brian.  What do you remember about that play and did you know that it should have been allowed  right away?  Why did it take so long?  Well, the two unusual plays in one game, it's usually three or four games go by and they  don't even have to come to me.  They had two plays in one game.  The first one was the juggle out in the outfield where the ball touches the center fielder.  It gets deflected.  And in fact, I think the right field around the catch in a ball.  This is the time that ball just dropped so this play never happens.  But if anybody's tagging, he can go on first touch and the theory behind that is like  a good outfield that can juggle the ball all the way into the infield and prevent the  guy from advancing.  So as soon as the ball is touched, the runners can take off.  Apparently some guys know it because the guys took off on first touch.  In fact, there was a play at second where he could have probably tegal tani and he didn't.  So, you know, he just advanced on the tag.  So he was safe at second and then they went to review.  So when they go to the review, they call it a matrix shot.  They have one camera face on the outfielder.  They have another camera face on the guy tagging up and they sync it with the timestamp.  So they make sure the guy actually did tag up in time.  Then there was another tag up at first.  So they do both tags at the same time and I think that's what took some time.  So they're, you know, there's 14 feeds home in a way and they have to go  through every feed in case there's a feed that shows something different.  So that's what takes time in New York.  Brian Gorman is our guest.  All right.  That other play on Friday night where obstruction was called twice.  One time we all noticed it because Tazka Hernandez made a great throw to throw  out the runner at home.  Starly Marte, the other time, the Dodgers, Tazka Hernandez scored safely.  Can you take us through that obstruction play because what is the distance?  The third baseman is a little bit too close for comfort.  Sure. There's two types of obstruction.  One is a play being made on the obstructed runner and one is a play not being made  on it and it's got two different benefits.  The play that's not being made on it.  The umpire lets the play go through and waits to see what happens.  That if the obstructed runner gets thrown out on a close play, which actually happened,  then he enforces the obstruction.  If he scores easily or if he gets out thrown out by 40 feet, they don't enforce the  obstruction.  So a lot of people don't know the obstructions he'd been called until the play happens  after which they got obstructed.  The play, the third that you're talking about, he actually  strolled in front of the batter tagging up and prevented him from getting a clear view  of the guy catching it.  That's called obstruction.  You don't have to touch him and it doesn't have to be intentional.  I don't know if he did an intentional max as he did.  So yeah, I believe him.  If he gets in front of him by the obstruction, the vision of the field of tagging up,  that's called obstruct and if he gets thrown out on a close play, which happened,  it's reversed to a safe.  On the other, on the other case, he did walk in front of him, but the umpire thought  that he didn't obstruct this view.  So you can get close and not obstruct them or you can get far away and obstruct them.  So it's a judgment call by the umpire.  Is that something that whoever's on prying third base may have that rule at the forefront  of their mind that night and maybe focusing on it because I've heard a lot of third  basemen obstruct, but it's never called.  Right.  The funny thing about it is that the umpires also watching from the tag up.  He's lining it up and he has the same vision as the guy tagging.  So so if he's getting in the way of him, he's probably getting away of the umpires  well.  So it almost brings it to your attention because you're trying to line up the  tag up at the catch as well.  So max kind of gotten away of both of them.  And that's when trip Gibson was at their base umpire.  He called it right away.  We all know trip Gibson's name in Los Angeles now, Brian Gorman.  He's a hell of an umpire.  Hey, before I let you go, so many years on prying major league baseball, when you  come back to Dodger Stadium and you're here on quite an often basis, what do you  remember the most?  Were there any like interactions with Tommy LaSorda or anybody else on the  Dodgers that stick out to you?  Sure.  He was one of my first injections.  Yeah.  He's not surprised.  Yeah, I think it was by first year.  I don't even know if I had a job yet.  I was going up and down from Triple A and I called a couple of pigeons.  He didn't like.  He started yelling from the dugout.  He got ejected.  And then the paper the next day, he said, I liked his dad.  I'm not so sure about the side.  But I worked my last game here in Dodger Stadium.  It was fun.  It was my, my family was all here and walked off the field.  The first person in shock band was mooky bets.  And Dave Roberts came out and he shook my hand.  They had it on the scoreboard before the game that I was retiring.  It was kind of surprising.  But I've got a lot of good feelings here in Dodgers, Dodger Stadium.  Square is always say they missed the camaraderie with their teammates  and just being around the guys.  What do umpire has missed the most?  Same thing.  Same thing.  We, uh, you know, we traveled as a group of four from from April to October.  And, uh, there's a lot of card games, you know, we travel together.  We go out together.  So, you know, you form a little bond and like a family bond.  Sometimes if a guy gets hurt, they'll bring another guy in.  But everything we do is juicy together.  You know, if somebody has an off day and they go home and stuff.  But you, you get to know the guys and their families.  And after you retire, you kind of missed that part.  It's, it is the camaraderie.  That same thing I've mentioned with the players.  Thanks for sharing with all of us, Brian Gorman.  We don't get to tap into the knowledge of a, an umpire that has the  experience that you have and continue to do a great job.  And you are baseball's Mike Pereira.  It just means I'm old.  They think, yeah, there he is.  One of the best umpires in his day.  Brian Gorman now helping Major League Baseball keep everybody in line.  in the world."