Speaker A: Hello there and welcome. This is calming anxiety, your moment for daily guided meditation. An affirmation to reunite mind, body and soul. If you're new, please subscribe now and make mindfulness part of your daily routine. Now find your quiet place today, somewhere comfy where you can sit or lie down, close your eyes and with your beautiful imagination expand your awareness and feel your breathing intimately. To be mindful of the rhythm are the rise and fall of every breath and the sound of my voice, to the exclusion of all other thoughts. But should you find yourself distracted, which is natural, by daydreams, random thoughts of tasks yet to be completed, acknowledge these moments and when you're ready, bring all of your attention back once more to the rhythm of your breathing, the movement of your chest, to be mindful of every sensation as you inhale, as your rib cage expands, as it rises, the feeling of your skin brushing against the surface of your clothing. Or simply the sensation of air passing through your nose. Experience it, explore it. But with every out pressure, open your mind to the natural feeling of release, of blissful relaxation as the muscles unwind, the fibers loosen and lengthen, and you discard the tension and stress of the day, as if taking the deepest of sighs that drifts and touches the core of your soul. Relax now. Deeper and deeper and deeper still, letting your thoughts touch every feeling and sensation. Unwind and drift, truly allowing yourself to find a blissful moment of calm within your thoughts, within your day. Deeper and deeper and deeper you drift. A moment of time to unshackle yourself from the darkness that holds you back, the regrets that we all have. Relax now and unwind just you, this singular moment in your lifeline, finding balance and harmony within the monologue of your thoughts, Filling your lungs on the in breath with hope, with ambition, with self worth and love. And then with every out breath, you let go of all the regrets, every moment of anger, of panic or fear. Deeper and deeper you relax and unwind. A moment to love all that you are. So that within your mind's eye now, as you find your moment, you visualize these wonderful words. You see them, you feel them. You speak them softly yet silently in your mind with every out breath. So relax, unwind, imagine and repeat. I nurture balance in all I think, feel and do. I nurture balance in all I think, feel and do. I nurture balance in all I think, feel and do. I nurture balance in all I think, feel and do. And deeper and deeper you continue in imagining yourself as you drift into your magical place of change, A sanctuary within the boundaries of your consciousness where your dreams can come alive. Your ambitions are nurtured. Relax, Unwind now, truly find your moment of calm. And then once more imagine and repeat. I nurture balance in all I think, feel and do. I nurture balance in all I think, feel and do. I nurture balance in all I think, feel and do. I nurture balance in all I think, feel and do. Further and further you find harmony, self worth. Relax. As if a warm weight of relaxation covered your entire body. Relax and unwind safely, deeply. And then once more imagine and repeat. I nurture balance in all I think, feel and do. I nurture balance in all I think, feel and do. I nurture balance in all I think, feel and do. I nurture balance in all I think, feel and do. And simply drift, appreciating how far you've come, the knowledge, the experiences gained, and now able to move forward without regret, empowered by all that you are. Because simply put, you are worthy. Now just feel your breathing once more before you start the day with positivity, with an open mind. Relax now. Take a deep, deep intake a breath. And now start to reorientate your mind, your thoughts and focus to the challenge, joy and beauty of the world outside. Take another deep breath, this time filling your lungs completely to the very top. And now stretch out those muscles in your arms and legs. And now open your eyes and smile. And thank you for joining me on this joyous moment of mindfulness. Have a lovely day. Please do subscribe and if you take regular solace from these shows, you're welcome to join the supporters group. It's only $5 a month and all this content is then advert free and you know you're keeping this show on the road. Take care my friend. Smile often positive thoughts and above all to everyone, begin.

