" And I'll never forget this and I still talk about it to this day,  but I'll never forget in the history of doing all of these late night shows,  Kilborn, Carson, all of these shows,  the only person that ever yelled at me for an audience being bad was Craig Ferguson.  He literally pulled me down from the bleachers when I was doing warm up after  the first act, pulled me around the corner and was berating me on how bad the audience was.  And of course, has nothing to do with the monologue being shitty,  has nothing to do with the guests being awful.  Of course, it's the audience, right?  Of course, even at other shows, there's going to be days where the audience isn't great.  They just don't, you know, it's same with comedy.  They just don't come together as a group collectively.  But I will never forget when he did that, I just, I, to this day,  have just bad feelings about him.  This is Coops Comedy Corner.  Fucking up, he's his funniest.  Coops Comedy Corner.  Welcome to Coops Comedy Corner.  Let's see if he's there.  Welcome back.  I tell you people don't forget the website Coops comedycorner.com  is for all things Steve Cooper merchandise.  We got T-shirts for this show.  We got T-shirts for my business podcast at Coop Tank.  And of course T-shirts for Cooper Talk.  Plus we got Mugs.  We got Doggie sweaters.  We got a whole bunch of great stuff.  So go to Coops comedycorner.com.  And you know, I mentioned my show Cooper Talk.  And it was 12 years ago in February that my guests did my show Cooper Talk.  And I think I worked a bit at a call,  which I was very funny starting to tell them about that.  But he met my now wife, and he was so kind that he was doing warm-up for the show called  Sullivan Son, which was a really good show.  And he got us to go see it.  He gave me a T-shirt.  He gave my now wife a script.  And he's just a good guy that we all like the buses chops at his carry gun.  And how are you doing, Gary?  I know.  Are you good to see you?  Good.  Good.  I was thinking about that.  I still have that Sullivan and Son shirt.  I have it in my closet.  And it's 12 years old because it was a very,  it was a very good quality shirt.  But you were doing not that one of your first warm-up gigs, right?  No, that was my very first sitcom that I did warm-up on.  I had done a bunch of other shows, talk shows, game shows, variety shows, that kind of thing.  But Sullivan and Son was my very first sitcom to do warm-up on.  And the truth is, when you're a warm-up person in LA,  the sitcoms are hard to get because there's only four or five people that do those shows.  They're very select on who they use because sitcoms are a lot different than say a talk show  or something else.  A sitcom could take five, six hours to film.  So they're very intricate in a sense of you having to kill a lot of time while they're redoing a  scene while they're rewriting the show.  So you're in and out all the time rather than when I would work on Conan.  That was 15 minutes at the top of the show.  Show would start, you'd be done.  So there's just different ways that shows work.  A sitcom is probably one of the hardest shows to do warm-up on.  Now, the money's probably the best.  But it's the only reason I got that cake on Sullivan and Son.  My friend Steve Byrne was starring an executive producing it.  And he said, I want Gary to do the warm-up for it.  Or else trying to get a warm-up gig on a sitcom would be very difficult without experience.  That so if Steve hadn't recommended me, I don't know if I would have gotten higher for it.  Well, I remember you had told me also.  I still remember our first interview.  You really went out of your way to do stuff like you bought gift cards.  You really made it like your domain.  I mean, what made you be so creative in that way?  Because a lot of guys would just showed up and bullshit it their way through.  It's interesting that you remember that, Steve, because I knew that that was going to be a long  tape day.  I knew that the show being new didn't have a lot of money if any for swag.  And I knew we were also going to have a paid audience.  And for your, for people watching listening who don't know what that is,  so many shows back in the day filmed here in LA.  And it's different now.  Things are slowly going away with the state of Los Angeles.  But you know, back years ago, there used to be a ton of stuff taping in LA sitcom,  game shows, talk shows, late night shows.  It was an incredible time.  But the problem is with a new show like Sullivan and Son or any type of new talk show where  audiences don't know what that show is.  They have to bring in paid audience members.  So they're bringing in church groups, baseball teams from a local college, they're bringing in  whoever they can to fill those seats for the six hours you're going to be there.  So I knew in order for that audience to be better, right?  Those groups are paid to be there, obviously.  But they're raising money for their church or for their school.  So the individual people aren't seeing the reflection of it at all.  But I knew that I needed to go out and buy stuff to goose the audience, whether it was  star but gift cards, whether it was having one big prize at the end of the show for my best audience  member.  Maybe that was a hundred dollar gift card at Target.  Whatever that was, I just knew it was an investment because if you wave that around at the beginning  of the show saying, my favorite loudest most enthusiastic audience member will walk away with this,  it really adds value to where their energy level is.  And it worked.  And as the show went on, we did end up getting a budget for gifts.  But in the beginning, a lot of their shows, they just don't have it.  So  Not that some some warm-up guys wouldn't use it and just say hey  I'm just gonna entertain them on my own. No gifts. I just knew we needed that. I and I knew Steve hired me  It was a reflection on Steve if the audience wasn't good or I wasn't good  So I just knew what I had to do to make sure that audience was good and Steve  Here's the other problem with a sitcom you take one show a week, right?  Sullivan and son only did 10 episodes a season  So it's not like Conan or a daytime show where if the audience isn't great, you're back tomorrow, right?  They'll forget about the show the previous day with a sitcom if you're doing 10 episodes  You have all week to stew about how bad that audience was the night before all weeks  Now they have all week to think about. Hey, was the warm-up guy bad was the crowd that like it's never the script  That's bad. It's never the acting that's bad. It's never the producing. That's bad. It's the audience  These are all these shows think they have the million dollar script the funniest thing ever you and I both know that's not true  So it's easy for them to shift focus and be like hey  It's on you. That's why like comics. Well, I know that work on cruise ships  They're the most expendable people on that ship, right?  If people complain, it's easy to get rid of a comic people can complain about the food the Broadway show the cabins  There's nothing they're gonna do about that the comic is the most expendable person of a production  Who cares get rid of them? Well, let's try somebody else. Let's see if they can  Throw some fuel onto this fire even though they may get the same results  But I just knew especially with Steve hiring me. I knew it had to go well  Same with Ken Jung Ken Jung has brought me on to many shows and I knew going in  There's no way that I can let Ken down  He brought me in for mass singer and that's a long tape day five six hours as the repositioning resetting  rehearsals all the stuff so I knew with Ken that I had to go in and  Just kick ass and make Ken proud so the producers aren't looking at him like who is this clown that you brought in?  I mean you just you know and Steve for the record don't get me wrong sometimes these gift cards do nothing  Absolutely nothing you could be waving them around  These people could care less. I mean they just don't you know  They're looking to get out of there as quickly as possible  because they want to go  light up their  Their you know users there  You get so many different people. I remember interviewing somebody at  Sullivan and son and I said what do you do for a living in the guy city? Just got out of prison and I believed him  I mean you could tell that he was you're not getting these audiences at these new shows dressed up in suits and  Excite like they're there for five hours because their church group is forcing them to be there  Their baseball team is forcing them to be there. They need new uniforms. They need new this  They need new that they don't they don't care. I remember one show Steve  Never forget this. It was the reboot of mad about you. Okay? They were bringing that back for ten episodes  Paul Reiser Helen Hunt I did the very first episode and  The producers told me it's gonna be  Rabbit fans from the original. I was like great  Steve the audience is loading in it's all kids backwards baseball hats  College kids. I was like these people don't they know clue what mad about you was  I said are you guys here for mad about you? They're like we have no idea what you're talking about none  They just didn't know so I think these shows want  To give the idea that there's so many rabbit fans waiting outside and they're not they just weren't there for the show  Now now you've been doing you've been doing one of them that you got your start and stand up now  Yeah, when did you get into stand up? You I know you and me's on are good friends. Mason. Yes  Yes, now you're from are you from Detroit originally from Detroit but started stand up in San Francisco  That was when I started back in her when did I start 1998?  So started stand up in San Francisco  There were two big clubs in San Francisco the punchline and cops. They're now one they they now are under the same umbrella of  Live Nation, but it was weird when you started in San Francisco  You either got love at the punchline or cops that wonder the other they always  There was two different managers two different owners. I managed to get love at the punchline. They worked me a ton  No love at cops nothing  So I would host there all the time. I very first paid week at the punchline. I will never forget this  Co-headlined Tom Rhodes and Mitch Headburg. I mean, it was absolutely unbelievable to look back and that was my first paid week  The crazy thing was they were flip flopping who would go first right?  So one night Tom would go first followed by Mitch next night Mitch followed by Tom  I'll never forget this Steve the Friday night first show  All of the people from the punchline booking office were in the audience to see the show because they wanted to see Tom and Mitch  And I remember we were about to start and they said neither of the guys are here keep going until we let you  Well, I didn't have any more than 15 minutes. So I knew at 15 minutes  If they weren't there, I was gonna be doing a dance contest where the birthdays  Shout out to the troops. I knew I just didn't have it there was and so now the pressure is on even more because all of these people who booked me from the punchline were there in the audience  I'm doing my thing doing my thing. I am at the end  Steve. I'm like this is this is over  And as fate would have it. I look up the red light pops on  I see Tom in the back through the curtain and he was there and it just was very magical how it ended  He showed up and it was it turned out to be a good night  But it could have been  Listen, you see this doing warm up. You see it. Hey keep going stretch stretch stretch  The host isn't ready. I guess it won't come out one of the guests is late. You see it  All the time I see it right now.  It's a difficult chore because as a comic,  you know that you can front load your set.  If I know what I'm going to do 30 minutes,  I can front load it 30 minutes.  But if I do all my good stuff,  and then now they're telling you,  stretch it out, what we're all in danger.  Now it's just bad.  So is that I met you at Sullivan and saw this at where it was?  No, I met you.  You did Cooper talk because I think I may have met you  with flappers.  I don't know why.  I know you've been Facebook and Scolaro and Roy Wood  had done Cooper talk with Sullivan and Son,  because they were both on it.  And some of your name came up,  and you came to Burbank to the studio  and my wife, Joanne, will have a marriage now  was visiting from New Jersey.  She was there and then she came out next time.  I talked to you because she wanted to see a show.  And I know Jimmy Pardo had gotten us to see  who you took over later for Conan  had gotten us to go see Conan.  And so you invited us to the show and we went.  And which I really liked that show.  It was a really good show.  And I end up interviewing Dan Lario,  who's a great guy.  And yeah, you invited us.  I still join, got the script.  Because yet you wanted to give her a T-shirt,  but they don't have any of the largest.  So I got the T-shirt.  And I always wanted to show that for each other.  And it's, do you remember what episode it was?  I do not remember what episode it was.  But it was, yeah, yeah.  I don't know because I watched the show all the time.  That's the thing.  But if you watch it, you know,  it all runs together.  But it was like, it was Joanne's first time at a taping.  And I live in LA, you know, if you're an industry,  you don't go to taping.  Never.  When someone visits, if they're taking,  but that's the thing.  So let me get back to you.  You're in San Fran.  Now what makes you go to LA?  Because what's your goal is just to be a stand up  with this one, an act that you want to write?  What did you want to do?  By the way, I just want to rewind for two seconds.  I remember when I first started Sullivan and sun,  I was such a huge, huge, wonder years fan.  Maybe one of my top three favorite shows of all time.  I loved it.  So then I get to work, Dan Laurie is the dad.  And I'll never forget Steven years,  as when we filmed the show,  every summer, Dan would have a little party  in a barbecue at his house.  And I remember going there, it was all the cast.  It was Dan.  I remember swimming in his pool.  And I remember Dan saying something like,  there were a lot of episodes of the wonder years  that he wasn't even on, or he had one line.  And I said, what was the line that you had  in the shows that you did?  And the line was, like he just made that grunt  from whatever the scene was.  And I just, I'll never forget it was like that  little moment of like, oh my gosh, this is insane.  This is my very cool Hollywood moment  being at his house swimming in his pool,  because I was such a fan, right?  So, but getting back to stand up, yet no,  I don't think the, I don't know what the thought was  when I first started.  I really didn't know what I wanted to do.  I just do that I love performing.  I knew that after a few years in San Francisco,  I kind of done what I wanted to do  when it was a little bit bored.  And I knew that if I was gonna make a move, let's do it.  So I ended up, I think I was doing stand up for about four years.  And there were so many comics in San Francisco who said,  do not move to LA unless you're featuring  at the clubs up here, punchline cops.  And I was like, well, who's making that rule?  I was like, that doesn't, I mean,  who's, because I quickly found out when you moved to LA,  the punchline and cops are so indifferent  and nobody cares about them.  They just care about what you're doing.  So it was just, the truth was it was a silly thing.  I think a lot of those guys who were saying that  were just afraid to move truthfully,  because they didn't wanna move.  So I remember moving and I got very fortunate  with a series of events that happened.  When I was living in San Francisco,  I worked with Brett Butler a lot.  Remember her, Grace Underfire, worked with her quite a bit.  When I moved to LA, she was gonna be at the Ontario improv,  which is East of LA, it's 60 minutes East.  I get a call from Matt Coleman, who was booking the improv  at the time.  He says, hey, this is Matt Coleman.  I worked for the improv.  Brett Butler's manager reached out to me, said that  she wants you to open for her in Ontario.  So I'm calling to set this up.  Great, went out there, did the show, boom.  A couple of weeks later, I reached out to Matt.  I would love to showcase for you at the Hollywood improv  to become a regular at the Hollywood improv.  So he sets me up, it's a daytime showcase,  main room, all comics in the room.  Sure, you know what that's like.  It was brutal.  I mean, you're just playing to the other comics.  I remember saying during the performance of like three  minutes I said, hey Matt, you could tell me right now  that I'm a paid regular here.  This is obvious that I'm crushing this.  Sorry you guys, I'm the only one that's gonna be,  I literally was calling out how pathetic this was.  And I remember at the end of the show,  I was in the dining room and he came over and he said,  hey, I'm gonna start working you.  And I remember like three days from that day,  he calls me and he says, hey, we're gonna put you on,  you're gonna host Thursdays, which is Drew Carey and Friends.  Do you remember those shows?  Yeah, yeah.  Drew Carey and Friends was the biggest night of the week  at the Hollywood improv.  Always sold out, it was Drew Carey doing improv  with Ryan Styles and Jonathan Mangum  and all of these other people were waiting,  Brady would show up.  It was sold out every single Thursday night.  And I remember he started working me on those Thursdays  and it was terrifying, it was exciting,  it was all that stuff, but it was a way for me  to get into the rotation, keep getting better.  And it's so funny, years later, Matt now owns the Tempe  improv, you don't stand up live in Phoenix.  I literally two months ago, he flew me down to Phoenix  to do the auction and comedy for his kids' elementary school.  So here it is, like years later, I still hold  on with ton of gratitude and he has  had me come out and do this benefit auctionering role.  And he said, we need somebody who can make fun of us  and who can be high energy.  And I went in there just dumping on them,  dumping on Matt.  And it really was a lot of fun kind of coming full circle  and how much he's done for me.  Well, as you know, you're at the moment I work with you.  And this is a certain time about flappers, but scratch me up.  But you're at you make fun of the other app.  Actually, you make fun of the rest.  And you make fun of the class and you make fun of yourself.  And we were doing flappers, the Yu-Hoo room,  which people, flappers, is a club in Burbank.  And we were on the show and you were closing.  And I was like, you who show, it was like seven people.  And I remember I think you said, oh, look,  it really looks like a pedophile.  Where did you see it?  You hit me, shit.  I thought I was spotted.  But I forget who the act was though,  but you busted this one-act balls.  Can't remember his name.  But that night on Facebook, he posted his old pistol.  He's like, what can't believe the headliner  is making fun of me?  What kind of act is it?  And I'm like, dude, I wanted to say that is his act.  Because that's how you coin that act.  So where did that come from?  Because it takes a lot of balls.  Because if you go up on stage and you start  fucking with everybody and you make a fun of the other acts,  and you make a fun of the crowd, and you make fun of the owners,  some in the crowd, some people get nervous about that.  So when did you always hear about that?  Or when did that happen?  No, I don't think so.  I think what's funny, so I do comedy and magic club a lot.  In comedy and magic, on the weekends,  they'll do 10 comics, they'll do a 10 comic show.  So it's just a popery of people.  So I will always, because it's a magic club too.  So they'll bring on like a Ron Pearson, who's a juggler.  I'll always say, if you guys don't start laughing,  I'm going to bring the juggler back out here again.  Depending on who I follow, the audience immediately loves it.  There's a comic, I'm sure you know Bruce fine,  you know who Bruce is.  Bruce is a comic, he's probably four foot 10.  And I'll always say, if I follow him, if you don't start laughing,  I'm going to bring the little guy back out here again.  They immediately know who it is.  I think what happens is if I am on a show, right,  at the improv, they'll always have what's called a cold open.  So before I go on and start hosting it,  it's always a newer comic that is relatively new to perfect.  I'm performing or new to the improv.  They'll go up to five minutes, bring me on the show starts.  If I don't know that person, Steve,  I will not make fun of them.  If I don't know them, I will.  But if I do know them, I'll always go up and say,  how about a hand for Richard?  A lot of people don't know this.  This is very first time performing here.  We also saw that set.  It'll be his last.  And it gets a big, but I have to know that person.  So when I do it, I always at least now make it a point  to know that person.  Now the person that you're mentioning,  I don't remember who that was.  But I also think somebody who doesn't have thick skin  can't take it.  And I think it's clearly a joke.  It's clearly a goof, right?  I'm making fun of myself if you kind of extract the act  and see what it is.  It's clearly all about me dumping on myself.  It's never about that person.  But listen, I remember there was a time I was working in.  I think Milwaukee and I said to the guy, oh, I said,  if you guys don't start laughing,  I remember bringing the hose back up here again.  And it gets a big laugh.  And I remember at the end of the show,  he's like, what are you doing, dude?  And I just, I then realized I have to be more cognizant  of who I'm doing it to because they don't know me.  It's almost like when I dump on people online,  whether it's a gene pump or these other guys, I know them.  So if I dump on somebody that I don't know,  I remember there's a club in Arizona called Stir Crazy.  And I was making fun of the club, right?  And the owner's wife ran the social media team.  She's like, what's up with this guy?  He's being obnoxious.  And I then realized like, she's not in on it.  So she doesn't, so I, you gotta kind of scale it back  a little bit, which I now try to do.  You can make fun of people as long as you know them  and they're in on it, right?  But I couldn't do it unless, at least that's my philosophy now  is to just kind of play nice.  We look at this, it tells you and Brian McDaniel and Papa.  And, and I think Marshall,  what are you looking, okay, is it Marshall Epstein?  Wait.  Yeah.  What does he do?  Like, is he?  Well, I know it's like he's not.  No, the truth is, I don't know what he does.  I'm not sure I'm confused.  Listen, I like it when it's like guys like gee,  I love making fun of people when it's guys like gene or look,  because they can go toe to toe, they're really funny.  But more, I don't know what some of these guys post.  But one for you, which is crazy,  I remember back in the day going back and forth with Josh NASA  or another comic.  We always make fun of each other.  My mom literally reached out to me.  She said, I gotta be honest with you, Josh.  This guy on Facebook's making fun of you.  It's bothering me.  I'm gonna reach out to him on Facebook.  I said, mom, are you seeing what I'm writing to him?  It was just, and I remember even with the Sullivan and some guys,  we went out, we were on the road together.  And Steve Burn was making fun of me at lunch.  And my mom pulled me aside and she said,  I'm gonna have to talk to Steve.  I think it's just rude, what he's doing.  My mom never saw it.  The Sullivan and his untapings how I would make fun of Steve's  acting.  I would make fun of the show.  I would make fun of the entire situation.  You know, I would say Steve is just a dramatic actor.  This is a soap opera being filmed.  It's not a comedy.  Who knows when this is gonna air?  Like nobody saw that.  My mom never saw that part, but she saw Steve poking fun  at me and thought, as a mom, I'm gonna step in.  Now, you host a lot, but it's funny.  And once again, well, weird memory I have, when you,  two things I remember from the first time you were on my show.  One, you told me to sorry about how you sold copiers,  but you never went to work and you just collected the money.  Yep, I have that and I think when you did my show you were a little bit nervous because you were going back to  headline  Was it Mark Ridley's comedy how great memory? Yeah, yeah, yeah  Something that you you weren't really you were working, but you weren't really you were little nervous. Do you go back to your hometown?  Your headline yes, no  Yep now I mean for now for you  Because you go in the road with a lot of people your host because you do a great job hosting  Do you get headline in gigs or you'd sit there and do you like doing the hosting game because you always work?  So it's like why are you gonna burn yourself out like when you go to Phoenix where you go to those clubs  Do you go in as a headliner or do you go in with like a friend yours?  So I know it do it. It's funny you said it because the club in Phoenix that I just headlined the guy knows that I don't love  Headlining, but we'll do it and I love stretching that muscle  He will also  Accominate me and ask me how much time do I want to do so instead of a headliner doing an hour 50 minutes  I'll say huh, can I do like 30 right and then you build the show around that maybe a couple of guess sets  The feature does longer because I could do it. I just hosting is my wheelhouse. It's what I'm good at  I know what I'm good at and and to me I work a lot because I'm a good host right  When I did Ridley's this is a funny story. I grew up in Michigan, but I never did comedy there  It's I started in San Francisco when I live there for a little bit, but  Mark Ridley has this great club and the interesting thing about Mark Ridley's it works of a right  variety people like he'll headline me right and then the next weekend  He'll have like Kathleen Mattigan or an a list or somebody right so he levels it out  We probably pays them a lot of money and then doesn't have to pay me a lot of money  It's the shift right so I was gonna be back home for Christmas this was years ago  He gave me a headlining date December  2627 to 28 five shows and I remember Steve. I went out of my way  To do media radio TV just to get the numbers up. I obviously had a lot of friends out there  But I really wanted even though I had a flat rate. I wasn't making any extra  I worked my butt off to bring people into that club  When I did the one in Phoenix  You'd have to do anything. Here's the check. We don't care. We'll promote it ourselves  But I really wanted it to be busy so I remember going up there having fun  I remember on the roof. I forget this is right after Christmas  So there were these Christmas trees on stage and I would dump on the trees. I would make fun of the trees  They were from Home Depot nothing says happy holidays and these dead trees from Home Depot like really making fun of them  The next day I got there the trees were gone and I heard from the manager that she was pissed that I was dumping on the trees  Well, the trees being gone means I don't have an extra three minutes of material. I'm not joking  There's a true story. I see the trees gone. I'm thinking I got to kill three more minutes because that's how I was killing three minutes  I  Literally had one of the drawer guys go out there pull the trees from the garbage or whatever they were and put them back on stage  Okay, so this manager wasn't thrilled with me  Shows went great. I thought everything was fun. I literally I'll never forget to this day  I go to collect my check at the end of the week and I say to the woman  Hey, great week and she said now not really and I said wait, what excuse me? She said we got a lot of complaints  I said okay, which is odd Steve because I was out there every night at the end of the show saying goodbye and  I said well, it's a comedy club  I assume that you would get complaints all the time right and she said not here. We don't and  It was just it was a complete FU to me at the end of a week that I worked hard  for and  She didn't want to give me the satisfaction of leaving in a good space and  You know as tip we both know this how many comics squad on the road?  They leave Sunday night. Hey numbers were great happy to have you. Can't wait to have you again then on Monday  That comedy club owner will call your agent or manager and say I was difficult  Numbers were down. He was a pain in the ass. I had a lot of checkwalk  So I think this woman really just wanted to stick it to me and let her know that she was in  In charge. I mean and as is typical. We both know this  She's no longer there. She's been gone forever. She's probably running a trader Joe's. I mean  It's just it's so like you're shocked that these people  I meet people all the time that run these companies these clubs and I'll say where'd you come from?  What's your background? I was an assistant manager at a team mobile store. You're like well  You're a perfect fit for running this comedy club. You like yeah, I the first time I worked at the San Jose improv  Lou or no not Louis CK. It was oh  Lewis Black was headlining and I remember calling the manager whoever it was  I said hey Lewis Black is coming this weekend and like Lewis Black is he a host or featuring like it was just  They were so out of touch they just didn't know so I  Just think to that point like if I am headlining I'll kind of divert which so crazy look back when I had lined  15 years ago and I probably just didn't have the time to do it right  And I remember calling Mark Ridley before I got there and I said hey  as a comic I love to have guest sets on the show  Which was a way of saying hey fill the time with other morons, right and  Mark said we don't do guest sets. I was like shit now. I got to cover the other six minutes  Because you know  Some comics that would do exactly  45 minutes and walk off stage  You know what I mean like that's all they would do not a minute more not a minute less  But I just you know when you're when there's a little flexibility and there's always great  You can kind of play around with it  So okay, so you're in LA one of the back when you're not like you have this great night at the improv and you're doing the Drew  Carrey night so now at what point  do you start getting into warm up? Because you know, it's something, I mean, people I know who  do warm up like Joey Cole was on a few weeks ago. Joey does a lot of software. He does  uh, Rachel, Rachel, you know, you know, you guys know what you're doing.  I'm frightened.  I'm frightened.  You saw him.  Yeah, so you guys, but like somebody tells me a lot of time, since I've known you, you've been  doing warm up, but when I met you, that was your first sitcom. How did you get into the warm  up gig? Because like you said, there's, there's not, it's not like anyone can do it and it's,  it's got to be, how did you break into it? Because you've been doing it forever?  Well, it's really crazy because I moved down to LA in 2002. Okay. So at the end of 2003, I was working  as a paid regular at the improv and I was doing warm up for the late late show with Craig Kilborn.  So within a year, I had this.  How did you get that job? But Gary, Gary, how did you get that job with Carl Greg Kilborn?  Okay. So when I first moved to LA, I had a day job where it was me and my boss working in a  small office. We were salespeople. He was out of the office all day every day. It's so funny  thinking about it because his name is TJ. I'm still close with TJ. He actually came to one of my  shows over the weekend or still close. He's still an amazing person. We worked for a company.  He was my boss. I was his sales rep underneath him. So because he was gone all the time out of  the office and it was just a two man show, I could leave the office too and nobody would know.  Nobody would have any clue that I was gone. I mean, it was very rare, right? So I would start  attending TV tapings. I just wanted to kind of see what the lay of the land was. So I'd go to  Craig Kilborn. I would go to other shows just to kind of see what they were doing. I saw that there  was this warm-up position. And I befriended the guy that was doing Craig Kilborn. He was a  guy named Roger Lundlade who to this very day, one of my closest friends. He was doing  Craig Kilborn. But because Roger also did sitcoms during the week, he would leave and book out  two or three days a week to go do sitcoms. They were way more money, right? Let's say a late  night show pays 500 a show. He was probably making five grand doing a sitcom, okay? So of course,  he's gonna leave. So they had a backup guy to Roger. And when I started coming to hang out,  they were no longer happy with the backup guy. The way that the wheel rolled, it was just pure luck  that I started hanging out, right? So I kind of got a sense of that. Roger and I became close over a  couple of months. He said, hey, they're looking for a backup to me to fill in on days that I can't  be here. He's like, okay, great. I audition during a real show, me, and I think one other guy or two  other guys. That was it. It was three of us total. We do a real show. Roger was one of the decision  makers who said, I think this person would be a good fit to back me up. Roger and one of the producers.  I get the gig and it's immediately my gig within two months of hanging out there. It was  and to have a show like that in town, it was also interesting too, Steve, because I remember at the  time, Roger might have been getting like 700, 800 a show for that show and they were paying me scale,  like 300 or whatever it was because they knew that they could. I wanted the gig, all that other stuff.  So I did that and ended up filling in for him anytime, which was usually two, three days a week.  Right? It was great. Then he would do the sitcoms I would come in. Then Ferguson takes over. I do it  for Ferguson. Then Carson Daly brings his show from New York to LA. I knew I was kind of done being  an underling substitute for somebody and I really wanted my own full-time gig. So I get an audition  for Carson Daly, me and a couple of other people. Brody Stevens was one of the guys and ended up  booking it, which for me, it was a game changer because I was no longer somebody else's shadow.  I mean, the truth was Craig Kilborn, Craig Ferguson. Those guys didn't respect me all that much because  they loved Roger and if Roger couldn't be there, they felt like, oh, we have the babysitter in tonight  and they didn't enjoy it. So when I got my own gig, it was great.  Now, I know what is, when you say you audition, what is the audition like for a warm-up guy? Because  you're sitting there. It's not like when you're doing stand-up and you're doing your seven minutes,  said, what do you just, as you said, you do the show, but you, you watch. I mean, what was your  audition's like for like Carson Daly? Was it in front of the show, was the show already castor?  Or I mean, what happened? So when I did Kilborn, that was a real show, an absolute real show on a  Tuesday regular show. Carson Daly, this is a, I'm very proud of how I got that show. Carson Daly  was in New York and I remember leaving a voicemail for somebody. I didn't know who it was. I found out  a name. It was Nicole Yarn, who was a producer. I said, hey, this is Gary Cannon. I worked at the late  late show, which was good. It had a job. It always looked good. I know you're bringing the show  to LA. We'd love to be part of it. She calls me randomly, hey, we're bringing the show,  or doing like three or four test shows that will never air. We want you to do warm up on one of  the shows. So I go in there. I just hype them up. Maybe I brought my own gift cards to that extent.  But I will never forget, Steve, this was again, a proud moment for me. We taped it NBC in Burbank.  As I was leaving, the audience that was there for the first show was hanging out and going  right back in to do a second show, second test show, which now Brody was going to, I don't know if  it was Brody or the other guy. The other warm up was going to go do. So as I'm leaving, all the  audiences still sitting out there on the benches. And they said, hey, man, we'll see you back inside  a few minutes. And I was like, ah, I'm leaving. I'm just, I only did the one show. They're like,  ah, bummer, we liked you.  I said, do me a favor, guys.  The producers thought you guys were way too loud.  Please do me a favor for the second show,  just pull it back a little bit.  And I don't know what happened.  I just remember sabotaging Brody or the other guy  that was in there.  And I remember getting a call like a couple days later  and said, hey, you're the guy.  I was very proud of that moment that,  like I just figured out an all-tee way of like,  hey, let me, and the one thing that I loved about doing  last call of Carson Daly is that it was my show.  I never booked out.  He respected me.  It wasn't like I was subbing in for somebody,  but it was my show.  And that was a game changer for me  because that show allowed me to get my own apartment.  It just, it kind of pulled me into a better direction  since it was my own gig.  And I didn't have to wait for another warmup  to say, these are the days I can't do.  So it was a game changer for me.  And he was the nicest boss.  And it was a great group of people.  They let me do stand up on the show.  I will never forget that being,  and every time I still drive by NBC,  which is now the I Heart Radio Studios,  I still think about my amazing memories of being there.  Now then where do you go after Carson?  Cause Carson's show goes,  how long are you in the Carson the whole time?  Four years, maybe four, three years.  Yeah.  And then I think I started doing more like variety shows,  like I think I started doing America's Got Talent.  I started doing Dancing with the Stars.  Like other types of shows like that Chelsea lately.  I did a little bit of that.  Before I then start kicking in and doing more sitcom stuff  with Steve.  And I think it was, yeah, it was 2015.  Cause Carson Daily, I don't know if you got this,  ended in 2009.  And then I didn't start Conan,  which was kind of my next late night gig until 2015.  So there was that period of like not doing any late night stuff.  But I had done variety,  all that other kind of like mishmash of other shows.  Now Conan, part of how you get that, right?  Is that what happened?  Yeah, well, there's an interesting story about it.  There's an interesting kind of dynamic to the story.  Jimmy had called me because he had to take some time off  to film something that he was doing.  He was filming some on camera stuff for a show  having nothing to do with Conan.  So he said, well, you come in and fill in for me  for like four days.  Well, that show, Conan had known me  because I did other TBS shows under the Conan Unrow.  I did the Pete Home Show.  I did D on Cole.  He had a show right there on the lot.  So they knew me from that.  But I never met Conan.  So went over there, watched Jimmy.  Jimmy and I, and Jimmy will tell you,  were two different styles of warm-up.  Jimmy is somebody who stands on the floor,  does audience work from the floor,  brings out the band, the show starts.  So the first day that I jumped in,  I'm up in the audience, I had them give me t-shirts.  They'd never done that before.  They had them, but they never given them away.  I'm doing a dance contest.  And I guess Conan was backstage at the time saying,  this is insane, what's going on out there.  Like, cause I guess the energy level was just different.  And not to say good or bad different,  but I just brought in a different shift to it  that hadn't been happening.  You gotta remember too, this was in 2015,  the show had been at TBS for a little while.  It was just a different, it wasn't Conan on the tonight show.  It was Conan now three or four years into TBS, right?  So I get a call the next day from a producer  and they said Conan and the show were really happy.  I know you have three more days left.  They said, are you available to rest of this year  by any chance?  I understand what that means.  Are you guys developing another show?  And I was like, yeah, of course.  So I didn't really understand what they were talking about.  But then I did the show a few days later  and then they called me and offered me the job full time,  which was an unbelievable gift  because I'd been such a fan of him for so long.  So here's the difference.  Go ahead.  No, I was gonna say what's funny when you did Conan  was my friend Carrie Stubin was going to LA with his family  and he said, you know, then he suggestions.  And I said, yeah, I can get you on and you got them.  I think you got them on the list.  Like went to see the show.  You didn't know it was my friend,  but you brought them up on stage  and he won the dance contest.  And I love it.  Love it.  Yes.  It was just like, it was just, it was my,  but here's what I will say, right?  I got the gig.  It happened the way it happened.  But I will say this and I've said this many times publicly.  I don't think that Conan was a fan of my warmup.  I think Conan knew that it was a necessary evil  for me to be there.  And I think the reason I lasted as long as I did  was because their executive producer Jeff Ross  really knew that I was needed there.  But I think Conan, I always look at it this way.  The difference between Conan and say Jennifer Hudson,  the show that I currently do.  Jennifer respects what I do.  Jennifer always gives me a shout out at the end of the show.  I have a different relationship with Jennifer than I did  with Conan.  I just don't, I think Conan liked the kind of  puristic style that Jimmy brought to the show, right?  Conan did want some dancing clown out there throwing out T-shirts,  doing a dance contest to baby got back.  I just, I believe that there were two different styles, but I believe in the moment, it was a necessary evil for what the show needed at the time.  And I just fit that mold of what they needed, which was really gung-hoing the audience and hyping them up and bringing them from zero to 60 very quickly, right?  There's, Liz, I will say this, there's certain shows that I couldn't do right now because I'm just not the fit for.  There's other shows that I'm a better fit for than it just, it depends on what that is.  So I think in the moment, I think Jimmy is what Conan wanted and then I still don't know what would have happened if he didn't take the day.  So I don't know, but it is, it is why I'm very careful even after having done this for years to ever take a day off and just don't do it.  Now, what did you do during the pandemic? Because right there, you know, it's not like you're losing the comedy money, you're losing the crowd.  I mean, so that must be a big, was it a big shock to you and, and how did you think, would you be like, hold on, it's just got to end or me. What were you going through mentally during that time?  Well, the crazy, the great thing was pandemics was 2020. Conan paid us for that entire year.  We got paid, they paid out our contracts through the end of 2020.  He still did the show from Largo without an audience, things were kind of changing.  But things were slow, not only slow, depressing, we started, which I was super happy with.  We would do outdoor shows on the patio of the Hollywood improv that I would produce and host.  And it was just a way to get out and clear your head and just do something that felt creative.  It was just horrible sitting at home.  So that was a tough one. I ended up rescuing a lot of dogs during that time, because I had the time I was home.  I think at one point during the pandemic, I probably had 15 dogs at my house because I love the shit out of them and ended up getting them all adopted.  But I just, that was my thing. I was going to do something proactive.  So then I think what happens is maybe the first show back out of the shoot was the mass singer.  That's probably maybe 2021 late 2021 or early 2022.  So then I started to get the ball rolling with that.  And then I remember getting a call three years ago to do Jennifer Hudson, which was a game changer.  And I was shocked because I didn't think a daytime show was the fit for me because I was more late night, more comedy driven.  And it's certainly a different vibe than when I do Conan.  So I could be a little dirty at a late night show and this that and the other.  But I love it. And it's I think it's because of her.  I think it's just that group of people that are so nice and so caring and so giving that it's just it's the perfect fit.  I love it.  Now, what's her crowd like? What's the daytime crowd like?  And I said, you know, even the late night show, the crowds, as you said, you know, people will be sitting there.  And you said they pay or they're just be handing out like, come to see the stuff that's showing people share us walking through.  So what's what's her crowd like? What can you expect? Is it like, you know, used to see the daytime shows were all housewise.  That was what they did. You know, see the audience. It was all.  So what is her crowd like is your kids there? Is there.  I know.  What's it like it's older. It's definitely older.  A lot of people coming from out of town, which again, I always take for granted because I'm so close to Warner Brothers where we film that if I have guests that come to the show, they will text me and they'll say we're in line right now.  And they'll say, are you here? Can you come out and say hi and I'll be like on the peloton like riding my bike before I do the show. And it's like it's such a gift knowing people are waiting out there.  And I'm not even anywhere close to being there. I can literally get there 45 minutes before the show starts. It's just all like just know.  The difference between the two audiences is this.  Conan, if that audience wasn't laughing when he came out, there was a problem. Right.  Jimmy at the end of every warm up, would have to go backstage and tell Conan if they were good or bad. So Conan knew what to expect, which to me isn't great because what if Jimmy's out there killing it.  He comes backstage, tells Conan they're great. Conan isn't having a good time. Right. Or the reverse right. He goes back.  And they're not great. Now Conan's in his head. So the key with a late night crowd is you have to make sure they're laughing engaged having a good time.  Daytime is all about happiness. Right. It's all about feeling good. Thank you guys. This sat in the other thing.  So if she comes out and they're not laughing. Well, I mean, that's not what the show is, right. That's just not.  And I'll never forget this. And I still talk about it to this day. But I'll never forget in the history of doing all of these late night shows.  Killborn Carson, all of these shows.  The only person that ever yelled at me for an audience being bad was Craig Ferguson.  He literally pulled me down from the bleachers when I was doing warm up after the first act, pulled me around the corner and was berating me about how bad the audience was.  And of course, has nothing to do with the monologue being shitty. Has nothing to do with the guests being awful. Of course, it's the audience. Right. Of course.  Even even at other shows, there's going to be days where the audience isn't great. They just don't, you know, it's same with comedy. They just don't come together as a group collectively.  But I will never forget when he did that. I just I, I, to this day have just bad feelings about him.  I just I'm not Dr. Phil, another guy that I quit two weeks in because he was not a good person. Just not.  And.  I was as much as that actually speaking of which crazy to set now that I'm jogging my memory  2020 no shows still getting paid for Conan I get a call to come in and do warm up for Dr. Phil in  September they're gonna do it without an audience, but the audience is gonna be virtual on TVs, right?  So you're gonna warm up TV monitors, right?  Okay, so Steve I have to go on stage with a mask, right?  And I'm trying to communicate and engage an audience on monitors.  I'm in a mask. There's nobody around me the whole thing silly, right?  Of course, five minutes later, Dr. Phil comes out. No mask. It's the whole thing is silly, right?  So I'm never forget I was excited because I was like, I need this gig.  There's nothing else taping, right?  They said, okay, the money's gonna be this. It was really low.  You'll do five minutes and you'll introduce him and then he'll come out.  The show starts you can leave, right? Film two shows a day.  So after the first one I'd go to the commissary walker on the lock come back to the second leaf.  Well, five minutes turned into 10 minutes turned into 20 minutes turned into 25 minutes of doing warm up, right?  At this low rate that they said was for five minutes.  Here was the worst part. I was wearing an earpiece and I would hear the director say in my ear,  we need more jokes please more jokes.  And it's always that thing to me where I always find it interesting where it's almost like a corporate gig, right?  We want you to be squeaky clean. We want you to wear a suit. We want you to do this.  But we're gonna pay you $50. Okay, you can't have both.  You're gonna pay me a thousand and I'll be clean or you keep the money at 50 and leave me the fuck alone, right?  That's that's the rule. So you can pay me a minimal amount, right?  But the minute you start critiquing my act and the minute we start doing more than five minutes, which was agreed upon early on,  all bets are off or done. We're done. This is ridiculous.  So I remember calling the show and I just said, hey guys, this is what we agreed on. This is a bogus deal.  What do you want to do? I said I need more money and  Steve, this was at a time. There's no work. So it's like you either take the money and shut up or complain about it.  They ended up letting me go. We walked away. I remember I went to sag after.  And I called them and I said, this is a union show, right? And they're like, yeah,  I said, they're certainly not paying me union rates.  They went back. We went back and traced all my time and the show had to cut me a check for like  four grand after I was said and done. And I could not have been happier to stick it to them.  And nobody on that show liked them.  Yeah, I can imagine. Now Jennifer Hudson, she has so many great stars. Do you get stars,  struck at all? I mean, because you know, I mean, I know you're a performer and you work a lot with  Ken Young and Craig Robinson and who are big, sick, who are big stars. But you guys, you know, Jennifer,  can I always see them dancing? You know, do you get like, do you get starstruck at all when you're there  and you go, holy shit, there's such and such. No, not anymore. I mean, not, not really,  because we, it's been going on for so long. I'm trying to think if over the course of  I listen, I mean, I remember like a cone in like Martin Short was on or some of these other guys that  I'm big fans of like that was really cool comedy wise. But I don't, not, not so much now.  It's, it's very, because people ask me all the time, do meet people. Do you get to, I do not fly  with that section. I do my job. If I have guests, I'll ask if they can get a picture before  after, which is always cool. There's never any issue with it. But I don't take people backstage.  I used to do that before. It always ended up biting me in the ass because guests don't know how  to behave. I had a buddy of mine came to Conan. We were walking backstage. Snoop Dogg was walking  from backstage to his dressing room. My buddy quickly grabbed him, can we do a picture. Snoop  says yes. I got in trouble the next day. Again, you, you just have to be, and I understood. I mean,  he's there thinking he's in a safe space. He did the picture, but you can't do that. It's just,  it's not acceptable. So I just think you have to be very cautious of what you're doing. And I come  in, do the gig, get out. I just, you know, I always would have people like Conan or some of these  other shows. How can I get on the VIP list? I cut that all off because these gigs are too good.  And these shows aren't here to entertain or for you to get selfies for your Instagram. It's just  not. I just, you know, it depends who it is. But I try to be very cautious about it. A crazy story  two years ago, which would have marked 20 years of meeting my buddy Roger and working on Craig  Kilborn. Roger and I had lunch with Craig Kilborn at the Grove in LA, which was an amazing full  circle moment. Roger met his wife from that show. She was in the audience one day. I met Roger as a  result of that show. One of my best friends, Craig Kilborn, my very first warm-up gig. It was to me  pretty cool. It was a very cool moment in my warm-up personal professional world.  Now, will you keep doing warm-up? Is there, is there, do you see an end to it? Or do you, I mean,  you know, because you do stand up or is it just something that you, it's in you and you love it.  And of course it pays well. So you're not closer during one of them. But you think there's  any time where you will get tired of it or just say, I need to take a break. No, because I do love it.  And the alternative is listen, I see my friends, warm-up is the baseline. Warm-up pays for the  apartment, pays for the car, pays for all that stuff. Stand up is great, but stand up pays for  the direct TV bill, stand up pay all that other stuff.  It's a great in town gig.  I live 10 minutes from Warner Brothers.  I get to work at one.  I'm home by six.  We take two shows a day, three days a week.  It's unbelievable.  I just see so many friends now that work on cruise ships.  They're gone.  As I get older, I love being home.  I absolutely love it.  So I have this great mix.  I have this great warm up job.  I do a ton of stand up.  I can do spots anytime.  I'm in town.  I usually get a lot of work at the improv lab factory.  I can go to a corporate gig here and there.  I started doing benefit auctioneering, which I love.  So it's kind of a mix of everything.  You always want more, of course.  But I just, I'm very happy and content with where things are.  I enjoy it.  One final question.  I always do it either way.  Just FYI.  When you look at LA right now, the landscape,  there's not much taping in front of an audience right now.  Back in the day when I started,  there were eight sitcoms filming in a week.  There were eight different talk shows filming in a week.  Everything was out here.  There's very few things that film in LA right now.  There used to be a full audience company called Audiences Unlimited  that would play sitcoms and all this stuff.  All gone.  It's just nothing there anymore.  So the fact that I have a full time regular stable gig in town,  it's unbelievable.  That show feeds my medical benefits, my retirement.  It's unreal.  And because we're heading into season four,  everybody knows their job.  Everybody knows what they're doing.  Everybody's got their thing going on.  So there's never any issue with like,  hey, the crowd's bad.  It's like, it's a family.  It's maybe one of the top jobs I've ever had in warm up.  And it's because of our.  Okay. So final question.  You hit on it a little earlier.  But looking back at your career and your life.  And I know you can bring up the dogs because I know you do a lot  with the dogs.  What are you proud of?  When you look back, what are you proud of since you've like moved LA  and since you've gotten into entertainment?  Uh, couple things.  I am proud that people respect what I do.  That people look at me as a good host.  That people look at me as the guy they can come to for advice.  Like I'm pretty affable.  Like I love people at the improv call me the mayor because I'm always sitting  at the bar, making sure everybody's taken care of who needs what?  What can I get for people?  Even if that means, you know, losing money at the end of the night.  Cause I'm buying drinks.  I really want to make other people happy.  That's kind of my thing.  Even, you know, looking back when it involves.  Not the best decision for other people in my life.  But I really, that's, that's my thing.  I love making others happy.  And I do really, really want to look back at the end of my life and say, I really made  a difference to some degree helping dogs because I, I, I'm going to meet a dog in a couple  of days that's been at the shelter for a year and a half.  Now I have no idea what I'm doing with that dog.  I don't know if that dog can come back here with the dog that I have.  But I just am trying to figure out why that dog is been there for a year and a half.  I mean, I work with somebody at KTLA who gets dogs that have been in the shelter for a long  time placed on TV.  These are dogs that are close to me or that I advocate for.  I have a dog right now that was in the shelter for six months and was close to being put  down within minutes before we pull them.  Those are the things when I look at him sleeping, which he's doing right now on the bed.  I am melted by cause I love looking at that saying that was kind of what I did.  So there's a lot of things.  I love being known as a good warm up, a good host, but going to your point, Stephen, like,  do I want to headline not really?  I know my lane.  I know that I'm a really good host that can kind of bring good energy to a show and, you  know, make friends and just be kind of that guy.  Um, yeah, there's some people who come to me, hey, I want to do warm up.  Well, okay, I'm happy to sit down with you, but they, they don't want to put in the  work.  They don't want to, they just don't want to do it.  And this isn't a business where you submit a resume or what it's, it's all networking.  It's all, there's probably under 10 guys that do warm up in LA.  There's some many.  I'm sure you know them Ron Pearson, Alan Murray, Roger Lundblay, Mark Sweet.  There's just a handful of guys that do it.  And now because the landscape is changing, that number is even smaller.  So, you know, you just try to be a good, I, it sounds so cliche, but I just want to be  a good person.  And, and maybe sounds easier said than done, but I do, I do love having that thing wrapped  around me.  Well, this is awesome.  I'm glad you got to do this Gary.  How can people, how can people find out where you're performing?  They use it to Garycannon.com.  This was long overdue just so you know, long overdue.  Um, Garycanon.com has all the links to socials and all that stuff.  And, uh, yeah, um, when are you guys back in town?  I know you guys have your own new life back East, but now we're next, our next vacation.  We're going to Cleveland to check out the rock and roll all the fame, the football, all  the fame.  I was in LA for a long time.  I'm dumb with LA.  I don't know.  I get it.  You know, listen, I get it.  I get it.  And, you know, there was a moment, listen during the pandemic in 2020, 2021, where I was  going to move back to Michigan.  I was going to help care for my mom who is dealing with dementia.  And I was just going to call it and see what I could do from Michigan.  My buddy Roger, who's another warm up guy, the guy that I met a killborn, said, I have  a little guest house downstairs below me, come live there.  I did.  And it was a game changer.  I literally lived with him.  The rent was dirt cheap.  Later that year, I got to call the new Jennifer Hudson.  My life changed.  My life literally changed with it.  those few months. So I'm very grateful. And it is funny because so many people forget those  who helped them. Steve Byrne was a guy, gave me my first sitcom right out of the shoot.  I owe that guy indefinitely. Ken Jung always has my back. Roger took care of me when I needed  it. So, you know, there's certain people that it's easy to forget about for whatever reason  because like it's in the way and all this stuff. But I just always remember those who take care of  me and just try to pay it forward. It's just it's simple. It's just a simple math.  Well, there you go. Well, people say, yeah, go check out Darry. And for your not like, go find them.  Go see the Jennifer Hudson sub. We start back in September. There you go people. And also go to  CoopsComedy Corner.com and get that merchandise go to YouTube to find out CoopComedy Corner  Watch past episodes. Jimmy Coran, the producer. I want to thank him of comedy train wreck. He does a great job  perhaps a lot of fill up the comments out. He's been making me shorts. My one short got 7.5,000  views. But I was interviewing Steve Young. We do a little short and also go to Coopertop.net.  I've over a thousand and forty episodes. I recently interviewed Stan Lynch, the drummer from Tom  Petty. And also don't forget my business show on YouTube. The Coop Tank every week. I moderate  three different local business people. We talk about all that good stuff. So I want to thank  again. Jimmy Coran and comedy train wreck Gary Cannon. I'm Steve Cooper. Thank you for watching.  And I'll see you guys next week. CoopsComedy Corner."