" Yeah, so first what's really cool is you can purchase that NFT using USDC and then, you know,  very soon you'll be able to also use our DMC, DeLorean token as well. And when you receive that  NFT, then you have your place in line as you get closer to the vehicle being ready at some point  will allow you to upgrade.  This episode is brought to you by Trezir. Trezir makes beautifully crafted hardware wallets  that make it easy for you to safely store your cryptocurrencies. I'm a big believer in self-custody,  I've been using hardware wallets for years. And Trezir was the pioneer of hardware wallets  and they started this journey in 2013, their hardware wallets are open source, and they support  a variety of tokens from Bitcoin to the top all coins and even new coins such as BlackRock's  middle. And I'm personally a user of the Trezir Save 5, it's a beautiful device and easy to use.  And Trezir offers a hand-holding service where they can help you onboard and set up your device  so you can speak directly to a Trezir representative who can hold your hand through the process.  And if you use the code thinking crypto all one word, you can get 5% off your purchase of a Trezir  device. So to learn more about Trezir and all their great devices and services,  visit the link in the description.  Hey folks, welcome into the thinking crypto podcast. I'm your host Tony Edward and joining me  today's Evan Coon, who's the president of DeLorean Labs. Evan, great to have you.  Yeah, thank you for having me. Excited to be here. Yeah, Evan, I am so excited. I'm a static  because I'm a huge DeLorean fan. I've been a fan of the car forever since watching back to the  future, growing up as a kid. I'm like, man, I wish I could get this.  And I'm sure there's a lot of people who can be watching and listening who will feel the same way.  So I'm really excited to dive into what DeLorean Labs is doing and how you're embracing Web3.  But let's get get off of your background. Tell us a bit about yourself where you're from and  your professional background. Yeah, for sure. So I'm originally from Toronto, Canada.  And been in the crypto space probably for eight years now or so. I co-founded Canada's first  regulated crypto brokerage called Coinbase grew that over the last five, six, seven years to over  a billion dollars transacted volume, 250,000 Canadian users and had an exit there to wonder  five company backed by Kevin O'Leary that actually just sold Robinhood a few weeks ago.  So kind of went through the full journey there. And then when I left the day to day started doing  some consulting, DeLorean ended up becoming a client, started working them on this whole  Web3 journey. Love the team, love the vision, love the opportunity to take this iconic brand  and bring it into Web3. So just jumped in and here we are today.  That's amazing. And you're certainly an OG in the crypto space. I mean, eight years you  founded Coinbase. Just incredible. What was your first encounter with Bitcoin or crypto? What was your  aha moment? So for me, it was probably, there's this guy on Dre's Antonopoulos probably  heard of him when he went on Joe Rogan. But at first time he was talking about it and it really just  resonated with me. And yeah, it's like, this is amazing. And then wanted, the next thing was,  okay, how do I get some Bitcoin? How do I? And then I think at the time there was, you had to  really meet someone in person that was mining it and it's very difficult. And I was like, oh,  this is too tough. Like, I don't know what to do here. So downloaded first wallet and then was  just looking online for ways to, you know, complete different tasks and can get little bits of  Bitcoin here or there. And then so had that for a bit. And then shortly after I think Apple  removed crypto wallets from the App Store. And you know, at that point, it kind of took a bit of a  step back thing and we'll, okay, it's not going to be in the App Store. Fappled doesn't  back this or support it. You know, a good chunk of the world's population isn't going to be able  to have access to it. And so kind of took a back seat for a bit. And that was really a few years  later. You know, with a bunch of friends, when I think it was that ICO wave, they really kicked off  in 2016. It started hearing about it from, you know, a bunch of people in my network. And that's  what, there was still that challenge of that on and off ramp being difficult still at the time.  In Canada, Coinbase was around, but you could only purchase by a credit card. There'd be a huge like  six, seven percent fee on that. So, you know, that was really the genesis and the idea for starting  Coinbase was, you know, how do we make it easier for Canadians to get in and out of the space?  Yeah, that's really great. And, you know, now in today's world, we're seeing the log  launch of ETFs as being one of the on ramps. And the Canada has been ahead of the United States.  They were first to launch a Bitcoin ETF ahead of the United States, ETH and an XRP and others.  So in many ways, you guys are ahead in the United States. We're on base.  Yeah, I think well, the Canadian ETF, I believe that came as a result of a lawsuit,  suing the regulators in order to get that across the line. And, you know, even with the stuff we  were doing with Coinbase, it was really putting pressure on the regulators. And at first, when we  reached out to them, it was crickets, didn't really hear much from them. And then Quadriga  happened, you know, one of the big exchange failures in Canada. And then shortly, like, a few weeks  later, they're calling us up.  being like, okay, you know, we want to check this out and understand this space.  And shortly after they came to the office and probably brought 10 people  from their team and just wanted to know everything we were doing and wanted to learn.  And so that that was a two, three year process working with them on with that framework  with look like in Canada.  I know here in the United States, we're at the cusp of getting that done with market structure  and stable coin legislation.  Even though we have, you know, the Bitcoin and Ethereum ETF,  there's still a ton of other all coins that don't have ETF.  So hopefully this year we can catch up to you guys.  Yep.  It's just a matter of time.  I'm sure it's coming very soon.  For sure.  Okay.  Let's talk DeLorean Labs.  Tell us about DeLorean Labs and how it's connected to the DeLorean Motor Company.  Yep.  So DeLorean Labs, it's part of the DeLorean ecosystem with the motor company there.  So access to this amazing IP.  And as you know, DeLorean Motor Company is coming out with the new electric vehicle,  the DeLorean Alpha 5.  So, you know, just look that new vehicle.  How do we make this the vehicle of the future and, you know, look at revolutionizing the auto  industry, everything from the sales, the way the vehicle is sold to how people interact  with the vehicle.  And, you know, that all starts with the marketplace that we launched at marketplace.  DeLorean.com, where every vehicle deposit comes with an NFT.  And if you decide you want a better place in line to get your vehicle faster,  you can buy that NFT or you can sell your NFT and get out of your deposit at any point in time.  So, this is just a really a new way to sell vehicles that, you know, makes it more efficient,  easier transparency when it comes to pricing.  And, you know, we're very excited to be the first to do this in the industry.  Yeah, that's amazing.  I was looking through the website and of course, you know, the headline on the homepage,  the DeLorean Web3 ecosystem.  I just love that.  And I love that, you know, you guys are being innovative and adopting this technology because  we see the puck is heading in this direction.  I think everybody's going to be on board it at some point.  So, what was the genesis or the, how did it come about to say, hey, let's embrace this technology?  Is it, you know, kind of the ethos of DeLorean being forward thinking and innovative and things  like that?  Yeah, so I think it is that forward thinking.  Um, you know, I guess mindset of the company and, you know, just also being in a position that  they're almost having a rebirth in a way of, you know, the last vehicle came in the 80s.  Yeah, this is 40 years later that they're coming out with a new vehicle.  So, they really get to approach this from the ground up and, you know, way the foundation in a way  that, you know, legacy companies are already rooted in the old system.  So, you know, this is an opportunity to do something new.  Absolutely.  So, what was through a bit of the process?  I think you touched a bit on it, but just for simplicity, say, let's say I want to get  the new DeLorean, right?  The EV and I go and I buy that NFT.  What happens next?  I hook up my wallet.  I get the respective NFT.  Does that NFT automatically update over time and things like that?  Yeah, so first, what's really cool is you can purchase that NFT using USDC.  And then, you know, very soon you'll be able to also use our DMC DeLorean token as well.  And when you receive that NFT, then you have your place in line as you get closer to the vehicle  being ready at some point.  We'll allow you to upgrade the NFT and choose the different package and interior colors,  exterior colors, all the options.  And, you know, at a further point than the rest of the deposit will be due.  And then, when you receive your vehicle, that NFT will essentially become like the car  fax or the certificate of authenticity.  And we're looking at having all the driving data uploaded to that.  So, you have the kilometers driven.  You know, anything you can think of service records and we'll be able to incentivize,  you know, good, good care of the vehicle, safe driving through our DMC token as well.  That's really amazing.  Because I remember years ago, I think it was at the property conference.  They're in the real estate space and the web through real estate space.  And I was on stage and I was talking about dynamic NFTs and that it's not just monkey jpegs,  right?  They can be these transformative, you know, item that could be applied to many industries,  even to house and its mortgage and its deed and capture the life and longevity and the changes.  And, you know, if you bring it back to the audio, maintaining your car and it captures all that  that stuff and you said driving habits.  And I'm just like, I'm waiting for people to realize how powerful these NFT technology can be.  That is not just a jpe.  Yeah, and just to interrupt you there, that's one of the reasons we chose to build on Sui  is, you know, their cutting edge technology really leading the way when it comes to these  dynamic NFTs.  And we tested the waters already when we first entered the space.  Like, I look at web three is about community.  And, you know, we got all these DeLorean car clubs and community scattered around the world and we  wanted to...  bring everyone together. So we started off with our time capsule drop. We had 8800 of those released for free.  And really a chance for people to jump into the community and get comfortable with web3.  And utilizing that dynamic NFT technology, as you said, they came as these sealed time capsules.  And then over time, they opened up revealing various prizes, one of which was a new DeLorean EV.  And so, you know, over $3,400,000 worth of prizes in these time capsules.  That's amazing. Will the car itself integrate blockchain? Will there, and I know it may be a bit early  to discuss this. And I don't know if you can release details, but it may be an  eventually in further iterations, blockchain will be integrated. Where you can do different things,  micro payments for tolls and things like that. Yep. We're looking to have each car vehicle come  with a crypto wallet already pre-installed. And, you know, I think as you alluded to, you know, with tolls,  like I think that's just the tip of the iceberg. What's going to be possible. Imagine just pull your  car up to a parking spot. It automatically pays for parking. Or you go to a drive-through.  You can already interface with, you know, wherever you're shopping. And, you know, it kind of also  goes into a future where, you know, each car eventually is. It's going to be its own AI,  autonomous robot in a way that's going to have a wallet. So it can cover all its maintenance.  And so yeah, it's kind of the first building block of where it's inevitably going.  That's amazing. I'm fan-boing a bit because I love it. I was showing my wife yesterday because I  told her I was going to be interviewing you. And I'm like, you know what? I think I want to get this car.  And if it has crypto integrated into it, you know, I'm going to be there. So  Yeah, that's going to be so exciting. I can't wait to drive one myself.  Yeah. Now you'll, you mentioned the DMC token, right? And this, of course, this is all built on  the sweet block chain. Tell us a bit about the token. When is that going live?  Yep. So the token is going live on June 24th. So very, very soon. And maybe when this comes out,  it's already happened and it's already live. And we've got 12 plus exchanges launching with us  on day one. This is really a first for such a big brand to come out with a token and, you know,  really be diving into this industry. And, you know, we have many cool things planned. You know,  this is definitely a utility token. So there's going to be staking involved as well.  We've got some really cool things planned with when it comes to staking. So if you've purchased  the new DeLorean EV build slot, you'll actually be able to use the stake the build slot as well  and use it as a bit of a multiplier on the token. And then, you know, we looked at a lot of the other  auto companies out there. You've got Porsche design and what we've seen with Ferrari,  where huge chunk of the revenue actually comes from merchandise. So we're looking to roll out a ton  of limited edition DeLorean inspired merchandise where you'll only be able to use the token  to participate in the sales and in the ecosystem. So, you know, that'll be an add-on to our marketplace  platform. We're going to have a lot of cool products dropping and really getting to use that classic  DeLorean design language that we all love and then bring it to some of our favorite products.  Wow, that's really great. And it's great to hear that you can stake this token and use it  exclusively within the community and ecosystem. You know, Evan, this feels like,  and I'm not understanding this because you're on the podcast and I love DeLorean, but  it just seems this is the future of brand branding and even keeping customers around  longer customer retention. Just engaging people better, right? A more intimate relationship,  so to speak. Yeah. Oh, yeah. This is kind of the, you know, all the ideas that have been  rolling around in my brain for the last, you know, five, six years. Ever since NFTs started,  you know, coming into the mainstream. And I think in the first wave, you know, some greed took over there  and the market went out of control and really all the utility has been lost. And, you know,  there were back then there were some great projects that I did interact with. You know, where you  do get the NFT and then maybe you get a limited edition art print, you know, by the artist that created  that NFT that goes along with it. So really that NFT has become the certificate of authenticity  for that art print that you can hang on your wall. And, you know, I think there is, you know, if you're  able to use that NFT technology with real world assets and not even hard assets too, you can use it  with experiences. And, you know, we've already kind of seen that with a few NFTs where they're building  club houses and works at restaurant memberships. So the technology is being developed. And I think  it's a shame that, you know, the rise and fall that we had of these NFT values somewhat tainted  all these first movers in the space. But...  So the technology, I still really believe in it.  I think it's here to stay.  And I think it's gonna take a brand like Dorian  to really pave the way and do it in a way  that really puts the technology first.  Like as I said, when we dropped our time capsule  to 800 and 8,800, we put those out there for free  and let the market decide the price.  And yeah, I think that's the kind of mindset  that you need with something like this  to really be about community first,  build value for the community,  make people want to be part of it  and let it grow from there.  I love it.  And you mentioned like the speculative rise  of many of these things that you have the ICO,  the NFTs and so forth.  And many of it feels, look,  it's like human nature playing out.  You can't really stop it,  but it's like if I can use an analogy,  like the dot com boom, the 90s, it was kind of like that.  A lot of things rising up on this speculative bubble,  but when the market corrected and nature healed,  so to speak, you had the real winners.  Those who had real utility start to grow your ghouls,  your Amazon's, your eBay's and much more,  while certain companies that didn't necessarily  have utility, but they were pitching their idea  and raising tons of capital, but no way for people  to use it and no revenue generation.  And it was the same with Bitcoin.  Like when's the last time you heard someone say,  Bitcoin's dead?  And that used to be every time, every party I went to  and spoke about it.  Someone would tell me that.  And I just don't hear it anymore.  So that's gonna happen with all these other aspects  of the industry too.  Oh, for sure.  Now with the NFTs, right,  given that it's dynamic  and it's attached to the cars,  attached to your activity and so forth,  I'm assuming Delorean, if you're holding events  or you're doing any type of new promotions,  people who are holding those respective NFTs  will be able to get exclusivity, access to things  that maybe people who are not holding it will, right?  Yeah, we've got lots of cool things planned.  In Dubai, a couple of months ago,  during token 2049,  the sponsors of a karate combat,  a very cool fighting league.  And we put a call out to our time capsule holders.  If you wanna come sit in the Delorean VIP section,  let us know.  And we've got a Discord channel  with all our time capsule holders.  So we're able to bring a bunch of them out to that event,  ones that were in the region or able to fly there.  And so how to chance to meet a lot of them in person.  And that was a really cool experience too.  Here in some people that they downloaded  their first script of wallet because of Delorean  and we're able to get that NFT.  So question on the crypto wallet set up.  So obviously this is all based on the sweet blockchain.  So which crypto wallets do you support  to allow people to hold a token  and as well as hold the NFTs as well?  So yeah, right now it's as you said,  just on the sweet blockchain.  But there are a number of great wallets out there.  For our AirDrop, we've been partnering with Phantom  and OKX wallet.  And of course all the OG's in the SUI community,  there's the Slush wallet as well  that used to be SUI wallet and stashed merge together  to become slush.  But yeah, we've got a really exciting AirDrop campaign.  Seeing the way AirDrop's were done in the past,  people wouldn't receive tokens from a project  they'd never heard of.  They might not do the research.  It ends up as dust in their wallet  and just kind of burns the supply.  So we've done it a little bit differently.  We've AirDrop vouchers to people with the token amount  and then they can join the Delorean race.  And we've set it up as eight laps  because in the Delorean ecosystem,  everything is in eight because 88  is when time travel is possible.  In the back of the future, it's the speed the car has to go.  So yeah, we've got eight laps, join the race.  There's different tasks for each lap.  And at any point in time, you can exit the race  with your tokens, but the longer you stay in the race,  it's an opportunity to earn more tokens  and engage with our partners.  I love it.  Now, are there plans and I don't know if this makes sense,  but to expand other blockchains,  given that we're headed to a role that's multi-chain,  there's gonna be interoperability.  And it may be too early for you to do this,  but I'm just curious if you're gonna plan  to expand it in the future.  Yeah, I would say it's definitely too early  for that conversation.  And we're just so happy being with Suey  and working with the team there.  The team is just so professional,  the way they handle everything.  It's just amazing to see in the community  that's being built around this chain.  I almost wanna say it's almost cult-like.  And the enthusiasm and going to the events  and seeing everyone supporting everyone else's projects,  it's just really great to see.  Yeah, well, you can add me as a cult member  because I'm gonna be participating.  I love it, man.  And I love that this brand is getting new life.  I'm really looking forward to the car launch  and like I said, I already asked the boss, my wife, you know?  But it's just so fascinating to see how this is all unfolding,  not just with the relaunch, but with web through being integrated.  Now obviously, you're doing a lot.  You got the coin launch coming up, the MC token.  Are there other things on your roadmap?  What can we expect maybe later in the year?  Yeah, so as I alluded to with the token utility,  all those partnerships and the products and goods  that we're looking to design and bring to market,  it's really just so much more than the car.  We've got a good chunk of the team focused on delivering  one of the best cars.  And we want something.  The car is going to be very limited edition.  And we want to create some more mass market products.  And yeah, things that everyone has a chance  to engage in the brand and the ecosystem.  Given that this technology and its EV  and its forward-looking and its futuristic,  is there AI integrated into this car in any way?  So it's a little bit too early to commit  to how that's going to look at inevitably that I see  that being the thing.  But is it going to happen in the first version?  Or is it going to happen in the second version?  We'll wait to see.  And we're still in the process of figuring out  who our AI partner would be for that as well.  Yeah, it would be pretty neat to have all that in.  But I know we're still early.  Even these AI developers are still going through the iteration  of getting the bugs out, making sure things are  copacetic and all that.  But I would also see something in the future  of everyone's going to have their own AI,  that they probably want to move from device to device.  Like, because it'll already be trained,  it'll be like their virtual assistant.  So I think if we could do something  where everyone could just port the AI that they already  trust and use and work with,  that's something I'd like to see as well.  Oh, that's brilliant.  Yeah.  I didn't even think about that.  That absolutely makes sense.  And we were talking about interoperability.  If you can move that AI to different devices  of your car or whatever it may be, that would be perfect.  Yeah, exactly.  Wow.  That's very interesting.  Man, I'm so excited.  I'm thinking of, what can I ask you next?  But it's just amazing.  And the car launch, if I'm not mistaken,  I read is scheduled for 2027.  Is that right?  Yeah.  It'll be around there.  OK.  So lots of time to save up, take some crypto profits  and get ready to.  Yeah.  And then I don't know if this gets too much  in the weeds of the infrastructure of the car  aside of things.  But obviously being an EV, it would have compatibility  with most of the charging ports across the United States.  Yep.  We are in conversations with some of the leading charging  systems out there to really piggyback  on existing infrastructure.  Because we're not looking to build that infrastructure out.  Oh, for sure.  Yeah.  That definitely makes sense.  And my hope in general for EVs is that the governments also,  they start helping with these infrastructures as well.  Like you have gas stations in different place,  but you have more designated areas for charging.  That would be really great to boost the adoption of EVs.  Oh, yeah.  Definitely.  Yeah.  We're seeing lots of incentives already in mandates.  Some countries want to be fully electric by X-State  in the future or putting these aggressive mandates out.  Evan, I have a feeling that what you guys are doing  is going to be an amazing case study.  And we could see other car companies do the same copy  of the model that you're putting out there.  Yeah.  I would say other car companies, but also just other brands  in general that want to adopt web3 and create a community  in web3 as well.  Let's pivot to the crypto market.  So I definitely want to get your thoughts on how things  have changed, especially as an OG,  like yourself getting into the crypto industry, launching  a company.  What are your thoughts on how things have grown?  How things have grown?  Would traffic coming in, launching ETFs,  tokenizing the stablecoin market, growing significantly?  What are your thoughts on the growth we've seen?  Yeah.  I think it's amazing to see.  And in many ways, it's coming slower than expected.  But in some ways, when it comes to what we've seen  with the Bitcoin ETF, some BlackRock, faster too.  So we really see Bitcoin leading the way  and then stablecoins as well.  I think people look at just how profitable tether has been.  So now you get the whole wave of everyone  trying to launch a stablecoin and get into that.  And then governments trying to figure out,  how do we regulate it?  But yeah, I think stablecoins definitely  could be competing with Visa and MasterCard.  And when it comes to payments in the future.  But I think things are on track.  And we're also getting to a point where I think  we're going to start to see the Bitcoin drawdown  not be as pronounced when it comes to bear markets.  And I think we're getting a lot more long-term holders  than previously as well.  Yeah, that's a great point.  I've been thinking a lot about that.  And I'm getting a lot of questions from my viewers  and listeners.  Will the next bear market be as deep as the ones we've seen before?  70% 80% down.  turn, right? But to your point with the ETF buying strategic reserves being set up here in the  United States, I think just yesterday or the other day, Texas passed the air strategic Bitcoin  reserve bill. So you're just seeing ETFs globally and all these governments and nations and so  forth looking to buy Bitcoin. So to your point, would more liquidity and more holders not so much  of a downside, right? Yeah. And then even with what we're doing at DeLorean really has nothing to do  with what the price of Bitcoin is doing or the rest of the industry. Our revenues really come from the  IP and come from vehicle sales and merchandise and what the broader crypto market is doing  really shouldn't have any effect or much of an effect on it. So yeah, so curious to see how that  plays out over the cycles. Yeah, that does something I'm really thinking about and how to play  in myself because I'm invested of course. And you know, it's kind of easy when you know, okay,  80% draw down by the dips hold for the next run up Bitcoin having hits start of the next bull  market, right? But it may not be as easy anymore, but we'll see certainly there's going to be a  pullback because all market pulls pullback at some point, right? And some even the stock market.  So we'll see how that plays out. So we've seen a boom in tokenization. You got all of Wall Street,  Black Rock and all these folks are looking to put traffic assets on the blockchain stocks,  equities and much more. What are your thoughts on how that market is growing? So I really think  that this whole stock market is meant for the blockchain. You know, it just makes sense to be there.  You know, still probably have to have some limitations on it. You know, it may not be trading stocks  24 hours a day and on weekends. But, you know, it will make settlements easier, faster,  and there'll be more transparency as well. I think we all remember the GameStop  situation on Robinhood and, you know, everything that was going on there. So I think just by  putting that on chain will give a level of transparency that investors would like to see.  You know, I've been talking a lot about this on the podcast that putting these assets on the  blockchain makes them more accessible globally because there are certain stocks that people in  certain countries can't access. I think I was reading like in India, you can't access Tesla or  whatever, right? Or whichever country. And then on the brand side with what you guys are doing,  if I'm in New Zealand and I'm looking at DeLorean, I'm like, man, I love the DeLorean. But there's  no way for me to participate. Even if you were a public company, right, I mean, I'll be able to access  that stock because it's on the New York Stock Exchange. But when a token, if you got internet  connection, you got to wall it almost anybody can access it. Yeah. And that's what's so amazing  about DeFi. And one of the things I love about SUI and the whole ecosystem is their DeFi  ecosystem is so easy to use because you have almost instant transactions, very, very low fees.  And it can also handle a ton of transactions. So I don't think we've even seen the network  tested at its limitations yet. And it really, when you're interacting with DeFi, it feels like  you're on a centralized exchange. It's that smooth. It's so fascinating. And so  maybe too early for the answer to this question. But with the token, you know, you mentioned  you can do staking. But eventually, there may be DeFi protocols or DeFi products offered around the  DMC token, right? Well, we will be integrating with the various platforms in there, whether it's,  you know, at some point with like SUI land and, you know, all the DeFi stuff. Oh, got it. Okay.  That's really great. Because going back to, you know, my example of someone in New Zealand who  really loves the lorian and they can't participate in certain ways when now they can.  I'm a fan of the company, I'm a fan of the brand. I can hold the token, I can stake and do DeFi.  And it's like takes, it takes my brand affinity, if you want to call that to the next level,  where I feel almost like I'm a more of a stakeholder. Yeah. There's really no minimums either.  Like it's not like you have to be trading a large amount or holding a large amount. You know, it's  really democratized where, you know, works for anyone around the world that whatever level they want  to participate. It's amazing. And then you never know what, you know, by holding DMC, you know,  are there other communities that are going to air drop? And I think going back to the time capsule,  you know, some of the cool stories are heard of, you know, people picked them up for free.  And then all of a sudden we're air dropped walrus token, which is another big token in the  SUI ecosystem. And some people received life changing amounts, which is really cool to hear  or a couple months worth of salary for them, which is pretty cool. That's amazing. I love that.  And speaking of that, I saw the different ads, Patrick Stewart, Christopher Lloyd, of course.  You know, I would, I don't know if you could answer this question, but I would love to  get an idea of how Christopher, you know, thought of this or how you felt about it with the relaunch  because for him, you know, in the history and there's so much around back there to future and much more.  Oh yeah, he was so excited to be on set. And yeah, just when he got into character and  just gave those facial experience.  expressions, there's timeless facial expressions.  It's just so nostalgic.  And yeah, it's just so amazing to see and be part of something.  It was just so special.  Oh, wow.  That's amazing, man.  I love it.  Like I said, I'm fan-boing a bit here, but I love it.  And I love what you guys are doing.  And I, you know, in addition, I think what I mentioned earlier,  what you guys are doing is kind of the blueprint.  And I hope other brands recognize what's happening here.  And they also adopt this sooner than later.  Because I think a lot of people would love to connect with their respective brands,  companies and things that they are fans of in a much intimate way.  Oh, yeah, exactly.  And, you know, just people in the collector community in general too.  You know, this is just perfect for collectibles.  So you can kind of have that digital twin of your real-life collection.  Hmm.  Random question.  I don't know if it makes sense, but obviously you're launching an EV version,  kind of a new design.  Is there plants ever, ever do anything around the old design as like a rare set of cars  that you may put out?  Yeah, so that's one of the things I've been pushing for since day one of being  involved is, yeah, I'm just such a fan of the classic design language.  And I know a lot of other people are too.  So that's really what I want to see is a kind of a new EV that brings in that boxy stainless  steel.  So yeah, I'm going to keep pushing and you never know.  Oh, man.  I would love that.  Okay.  I've been I got some rapid questions here for you.  First, if you could create your own metaverse, what would the theme be?  Think more just like a second life.  Yeah, like so many more realistic and, you know, that was like this world just in the  in the metaverse.  Yeah, I don't know why that may be think of Sims.  I don't know if you remember that.  Oh, yeah.  So I grew up playing SimCity was one of my favorite games and then also played Sims  for a bit.  Yeah, so yeah, I've always been drawn to things I guess would just be a bit more realistic  in life like in that sense.  For sure.  Rapid fire questions, favorite food.  Right now it's got to say pizza.  I went through a hamburger like I go through phases with it with all that stuff.  Yeah, I think it's probably I got to meet Dave Portnoy a few weeks ago at consensus.  And yeah, just always now when I'm traveling around, it's always trying to find a pizza  place to check out.  But yeah, I'm into ton of food.  I always have that kind of flavor at the moment went through big burger phase, sushi phase,  everything, ramen phase.  I'm like that as well.  I go through those phases and I'll look for the best of the best.  And then I got bored of it and I already listened to something else.  Favorite musician or brand?  So right now I've been into electronic music a lot.  So it comes to progressive house, a lot of air pits, bedmows, to me even more lower tempo  stuff, a black coffee, going into his stuff.  And then on the band side, grew up listening to a lot of the classics, Beatles, Rolling Stones,  Led Zeppelin went deep into Dave Matthews, man.  I think they're one of the best live bands you could see out there.  Incredible drummer.  Big music fan as well.  Nice.  Favorite movie?  Favorite movie.  You have to say back to the future.  Yeah, I have to.  Yeah, I love that.  I still remember watching it as a kid vividly.  And just, you know, it just touches, you know, all elements of life.  I think time travel is just such an innate part of human nature.  But you just always, you know, kind of want to go back in time to relive an event or redo  something or you just want to go see the future and see how this all ends.  You know, so I think just even beyond the story of that movie, it's just everyone can  take that concept and apply it to their own life.  And I think that's really why it hits so deep.  Yeah, I mean, it's one of those movies that had a great impact on me as a kid just thinking  bigger and a universe and time travel and all that kind of opened up my mind to those  concepts.  And so it's like this deep-seated thing, right?  Where I just love it.  And if it's on TV, I'll just watch it even though it's to be the million time I've watched  in.  And which is your favorite of the theory?  Man I got to say one just because I've seen that so many times.  And then in the 90s, as a kid, we went to Florida and went to Universal Studios.  I remember riding the back of the future ride and it's just, man, just good times.  Yeah.  Favorite book.  So I really like kitchen confidential by Anthony Bourdain and I'm looping it back into  the food stuff there.  Yeah, I just think he was brilliant in the way he puts words together and just who he  was as a person.  I think it's a really special book that really created almost the modern day celebrity  chef and the kind of the precursor of the whole food culture that exists now.  Mm.  Have to check that out.  I'm a fan, my wife and I are both fan of Anthony Bordings.  We used to watch a different shows with him and obviously, you know, rest in peace.  But yeah, it was that book that started at all for him.  Like he was working at Weavads a chef at the time.  Well, he was writing that book.  When you're not working at DeLorean, what are you doing for fun?  Right.  I really got into long distance running over the last few years.  I've done two half marathons right now.  So it's 21 kilometers.  Started training for a full marathon, but then realized that's a full-time job.  So, you know, with everything going on at DeLorean, I had to pull back my training.  So now it's just, you know, running to relax and blow off some steam.  Nice.  Evan, absolute pleasure chatting with you.  The door is open anytime you want to come back and talk about the car.  Thank you.  The things that are happening because I'm a big fan.  But thank you so much, man.  I'm looking forward to the future updates around DeLorean labs and all the cool things  you guys are doing.  Great.  Thank you.  Let's definitely do this again sometime."