" Good evening. Welcome to the old-time radio Superman show. Last episode last Sunday,  the series, the M over the Incas came to our conclusion. And now we turn to the next  real packs of sub-series, Denelle's Protection Record. Now I gotta tell you one of the challenges  about this series and I've not even started to listen to it yet, but there's already a challenge  and that is how do you spell Denelle. The fact of the matter is that basically all of the episodes  list we have for Superman and most of the other radio shows for this era by the way are based  entirely on, you know, amateurs, recollections, names of the series. So in some cases,  a series name won't make sense or they'll differ from person to person as to what it is.  This led to a very interesting situation where there's actually a disc that's saying that they have  six episodes of a kind of B radio detective drama starring Jack Webb called Johnny Madero.  The problem is there were actually only two episodes of Johnny Madero. This six episode disc has the  two episodes three times each under slightly different names. And the problem with this Denelle thing,  I found one place that spells Denelle D-I-N-E-L-L-I. I found another place that spelled Denelle D-O-N-E-L-L-I.  And I cannot find any way to correct it. And certainly I found actually a legitimate uses of both  names. So if you happen to be an expert in know what the absolute 100% correct way to spell  Denelle is, email me, Adam at Adamsweb.us. Or if you would like to complain about  discussing spelling changes at the start of a Superman episode, you can email Adam at Adamsweb.us.  Please also cast your vote for us on podcastallion at podcastallion.com. Put old time Superman  in the search bar. We're going to come up as one of the first results. Your votes appreciated  as it helps increase the reach of the show and the number of people who get to download and enjoy  this classical time radio. Of course, whenever we do this, I do this also for our magazine laser and  sword. We've got our April Fool's Post-op. Though I don't it seriously fooled anybody, but  maybe you'll get a little laugh out of it. Visit lasersword.atomsweb.us. Because the reason we  co-sponsor Superman here is we absolutely love serial fix and that's why we're bringing it into the  21st century with fun characters and fun adventures that people are going to be able to really  enjoy those who miss the style of these old programs. We'll enjoy the serial aspects and we offer  in laser and sword magazine. So please check it out lasersword.atomsweb.us. Issue two is coming  very soon in the next few days and will be available for an extremely low price. So please go and  check that out lasersword.atomsweb.us. Alright, well with that we're running a little long  I'm getting started maybe I'll run a little short at the end. Here we go. Denelli's protection racket  part one. Presenting the transcription feature Superman.  All the disgusting. It's a bird. It's a plane. It's Superman.  Now Superman might even enter from another world with powers and facilities never before realized  by mortal men. Able to leak tall buildings at a single bound, race is feeding bullet to a target,  frost steel with his fair hands. Superman,  the owner of the weak and the oppressed courageous fighter for truth and justice who  mingles with ordinary men and mild mannered Clark Kent reporter for the daily planet,  a great metropolitan newspaper. As our story opens today Clark Kent is about to leave the daily  planet building. When he is held by young Jimmy Olson, a redheaded psychopath copy boy who works  for the editorial department of the paper. Listen.  Can I see a minute? What's up Jimmy?  The moral arm fire? No, it's nothing to do with the paper Mr. Kent. Well it's sort of personal.  If you're in a hurry and you're having that time. Oh no all the time in the world, Jimmy.  I'm going to miss a white stop as he's gone for the day.  Hey, now we can talk about having to shout over the rank of those typewriters and new stickers.  Oh, that's on your mind, Jimmy. I'm worried. I am worried, Mr. Kent. It's about my month.  She's sick, Jimmy. She's all right. At least she's all right now.  Oh, what do you mean? I guess I better start a bit of stuff with the mean so you don't know what it's all about.  All right. You see my father owned a candy store on school street.  Well, he died three years ago. My mother went to work in his store and kept it running pretty good.  Oh, why herself? Yes, but she doesn't go clean. Not mom. She won't have even told me about  just an Ellie if I hadn't caught a crime. Chip and Ellie, the racket here.  What's he got to do with your mother in the candy store? I'll tell you, Mr. Kent.  About a month ago, a man came into the store and told my mother  that unless she paid $20 a week protection money to chip the nelly,  the store might be wrecked.  What?  And has she paid him?  Yes, sir.  $100, so fine.  It was coming tonight for another 20.  Jimmy, are you sure the nelly is behind this?  Absolutely.  I wasn't the only story taking money from him.  All the stores on spruce feet pay.  The guy who comes around is just the nelly's flight.  Say you'll be there tonight?  Yes.  That's why I wanted to talk to you.  Mom can't pay anything.  And why should you?  This is a free country, Mr. Kent.  And no crooks got it right in on our take it easy, Jimmy.  Real fix, Mr. Denelli.  I'll get out of the store with you and meet a collector.  See, Mr. Kent, would you sure?  But remember, Jimmy, how'd I word about this to anyone?  Perhaps the nelly must be handled privately.  I'll get you a hat and go.  I'll talk on the way.  Pete, thank you, Mr. Kent.  I'll see you at the elevator.  10 minutes later, Jimmy and Kent approach the candy store on spruce feet.  This is the store, Mr. Kent.  Mom's behind the counter.  Where do you mean?  They say all the stores on this street pay protection money to Denelli?  That's right.  She'll, it's the butcher didn't pay last week, huh?  So we got a brick thrown through his window.  See, it might have crossed his feet.  Yes, it's not much window left.  I wanted the police to bother.  They couldn't do anything.  They said, no evidence.  My mother can tell you more about that.  Come on, Mr. Coon.  All right?  Oh, what make you so late, Jimmy?  I want to hung around the office for a while.  Mom, this is Mr. Kent.  He's the best reporter on the daily plan.  I have a great Jimmy who's given to exaggeration, Mr. Coon.  Well, he told me about you, Mr. Kent.  He's still wonderful.  Nice to know that somebody does.  Mom, I told Mr. Kent about Chipped and Melley and the racket  is pulling.  Jim, and you shouldn't have promised you  wouldn't mention it to us, though.  No, I don't.  All right, Mrs. Olson.  I want to help you.  Oh, you can help me.  Nobody can.  The only one thing left for me to do, give up the store.  Oh, I won't let you do that, Mom.  I'll go to Chipped and Nelly myself.  I'll tell you.  Just a minute, Jimmy.  You won't have to give up the store, Mrs. Olson.  I've been up against men like Denelli before,  and I think I know how to handle them.  I understand his collector is coming tonight.  Oh, what time does he usually arrive?  Sure, yeah.  He should be here any minute now.  Oh.  But, Mr. Kent, now please don't start any trouble.  They said that.  I know what they said, Mrs. Olson.  But don't you worry.  Jimmy and I will hide behind the car.  When the collector comes in, refuse to pay her.  Oh, no.  No, I can't do that.  They'll do something.  Jimmy, if I don't pay her.  They won't do a thing.  I promise you.  Just you refuse to give him the $20.  I'll take her to the rest.  All right, Jimmy, duck down.  What are you going to do, Mr. Kent?  Tell Mr. Denelli's collector where he gets off.  But what's supposed new portals are good?  Well, guns don't frighten me.  I mean, well, he won't pull it, actually.  Here he comes now, Mr. Kent.  Is Denelli, Mrs. Olson.  Don't be afraid.  OK, lady.  I'll take the protection payment, 20 bucks.  Hello.  I'm not going to give it to you anymore.  Oh, no.  Take a look across the street, lady.  See what happened to Schulz's window,  because he didn't have protection.  You want that to happen to your window?  Well, I can't see you anymore.  I haven't done money.  Don't give me that stuff.  Only up on making fast.  This is my last step, will I?  I don't try to waste.  I need better find some time because I want to talk to you.  Where'd you come from?  Behind the car?  I heard everything you said.  And so did Mrs. Olson's son.  Unless you and your crooked boss, Denelli,  want to spend some time behind bars for extortion and blackmail,  you'll return every penny you took from this woman  and never bother her again.  Oh, yeah.  Who are you?  My name is Kent.  Mark Kent.  I'm a reporter with the Daily Flash.  The story, poor.  It's too.  Shut up, you.  So you're a reporter.  You're right, pieces, with the paper, his.  Well, right.  That's what we call.  Oh, well.  Good.  Walk over to the 20, lady.  Yes.  Here, kid.  Shullo, wise guys.  Mr. Kent.  Mr. Kent.  Are you all right?  I'm all right, Jimmy.  Just a little surprise.  See, I thought he knocked you off.  No, I'm not quite.  Oh, you're seeing, Mr. Kent.  I told you not to try to do anything.  It's impossible.  They're just not human.  I haven't given up Mrs. Olson.  One punch doesn't frighten me off.  I'll get every cent of your money back  and teach Denelli a lesson he won't forget.  All you're doing is risking your life.  Don't you worry about that.  I'll see you tomorrow, Jimmy.  The right is, Olson.  Yes.  Too bad I had to take that punch in the jaw.  I was itching to tear that wrap up  on right in the store, but it wasn't  the time or the place for Superman to do his stuff.  I'll just take a run over to Denelli's place  and have a little talk with him.  Here it is, you have 600 smackers,  like taking candy from baby sex.  Even just to put your plate up without a squat.  No trouble at all.  Oh, yeah, little, but I clipped the guy  in that position.  What did I?  Some mug that was hiding behind a counter  and also a candy store said he was a newspaper reporter  but then they backed in for a corner.  Yeah.  My paper's bite.  I didn't forget.  Wait a minute.  Oh, yeah, that's daily.  Planet.  Are you cutting the clip there?  They got one of the newspapers on my knife.  Well, what do you want me to do?  Stand there and take the stuff.  He was shooting this burnt up upon blackmail, Nick.  All right, all right, forget it.  Tell us on any of me if I can figure it.  OK.  Lane for eight.  6.  Hello.  Hello.  Hey.  Hello.  Hey.  Yeah.  What's up, boys?  Come on, newspaper.  The Daily Planet may publish a story about how the stores on screw street are paying me protection  money.  Yeah.  I want all those papers bought up the minute they hit the stands.  Every one of them.  They got it?  All good, poor.  Thank you.  Jim.  Jim.  Jim, Jim.  Jim, he's here.  Oh, sir.  That reporter, Kim.  Tony, you haven't been in these white-nosel proof rules.  Let me finish him, Jim.  Let me get him out of the way.  I'll be a fool.  I'll be getting his on the jam.  I'll talk about him.  They did better be careful.  Don't worry.  I'm always careful.  I can't stay here.  Hey, what is this, a gag?  Nobody here.  Oh, yes, there is the delay.  I just thought I'd wait for you in the closet.  Hey, somebody trying to keep it in a fight so the reporter would wait.  I'll get on a circus outfit.  Clark Kent couldn't wait, so he asked me to keep the appointment.  He'll get you to these blue tights and red caves if you keep on robbing poor shopkeepers  to an LA.  Why, you...  Get off.  Get off before I get out the moment you hand over the $120 you took from his results.  And as soon as I teach you how to behave like a decent human being.  Get out of the flood.  That gun won't do you a bit of good to know.  Fortunately, I see this room of soundproof.  It's back on to go ahead.  Nothing happened right, you are.  And now it's my turn.  There goes your gun.  Hey, what are you doing here?  Oh, let me call.  Can you land every morning?  Let's say how you bounce off the wall.  Oh, oh, oh, oh, that's bad.  Oh, tell him.  He's not quite in LA.  Another bow.  Got a...  Oh, stop.  How about you or anything?  All right.  Let me have $100.  Oh, sure.  Oh, here it is.  But...  Oh, wow.  This was only a sample, didn't I?  The next time you try your extortion racket, you won't walk for a month.  Understand?  Yeah.  You understand?  I thought I'll leave.  Through the window.  Oh, remember, didn't I?  Remember?  Mike.  Mike.  Mike!  I'm coming.  Hey what happened?  You're all missed.  No, I never mind what happened.  Listen to me.  You, you call that old woman.  Hey, she's cleared.  We take care of her, didn't you?  Yeah, sure.  What time she closed her star off.  Gennick's left.  Who's with her?  Just turn her kid.  Okay.  Don't take the big car, you're down there.  And she comes out of the store.  Teach her all lesson.  But how'd you...  It's about time you knew how.  Show her, and her kid, it don't pay the school.  Come on, get caught.  As Superman started something that even he will be unable to stop,  something that may result in injury to Mrs. Olsen or Jimmy?  Even now, Jip Denelli's two henchmen are speeding to Bruce Street in a high-part car.  Will they plan to wait in the darkness?  Ready to strike.  And where is Superman?  Don't miss the next real packed episode.  Tune in and follow the exciting story of Superman.  Up in the sky!  No!  It's a bird!  It's a plane!  It's Superman!  Superman is a copyrighted feature appearing in action comics magazine.  Alright, welcome back!  Wow!  Superman bounces the guy off the wall.  Let's see how you bounce.  Let's go ahead and do that again.  Hilarious!  Of course, creating some jeopardy.  You know, this is kind of...  I'm just kind of like a Denelli.  You just got bounced off a wall twice.  You just saw the guy fly away.  And you're just going to continue to mess with him.  Okay!  I think there may be some peril in here for Mrs. Olsen,  but I think Denelli is going to really come out on the short end of this.  Of course, you noticed we met a character that I had not seen before in this whole series.  And that was Mr. Jimmy Olsen.  And in this case, he's really a young man.  A lot of the... sounds more like a young teenager or boy.  And I think some labor laws have changed in newspaper practices.  So we have seen Jimmy Olsen progressively get older.  Well, not progressively, because even in the 1950s TV series,  Jack Larson was not a real kid.  I think in his 20s already by the time that Superman started.  But this Jimmy Olsen, very young, this is our first time seeing him.  He's of course going to be in the series throughout.  This is just an absolutely...  Of course, Superman's tactics here are not exactly what we would expect.  Of Superman, Tiptic, typically.  Because it was very much very rough and tumble.  And again, this is Superman the way originally written for the radio,  which is a lot more rougher than I think Superman when we met him in the 1950s TV series.  So I don't think Superman in this series is as rough as he can get in the...  cartoons, but I'm wondering which modern day  incarnation of Superman would  meet the villain and start bouncing them off of walls. I'm not certainly I can think of one.  Andrew says it's fun though. Yeah, it's fun to see the different ways. This was yeah, Andrew says it's more Batman. Oh, yeah, Batman would do this in a heartbreak  heartbeat  But as I say follow the story we'll be back on  on we'll be back on Sunday 7 30 p.m. Eastern. Please join us live or 3 30 p.m.  Let's get at least her and excuse me. Join us for part two of Denelli's protection racket and we'll see if Superman bounces him off the wall again.  And please check out the magazine, laser sword, laser sword, laser sword,  laser sword, dot Adams web dot U.S.  Do think everybody's so much for listening for now though. This is Adam Graham signing off."