" Welcome to the Armani Talks podcast. I'm your host, Armani Talks in this podcast.  I'm helping you develop your five soft skills, public speaking, storytelling, social dynamics,  emotional intelligence and creativity. Five soft skills for you to change your life forever,  skyrockerture confidence along the way. In today's episode, we're entering the land of  social skills. And I'm going to be talking about why you should never make disagreeing your  personality. I know some people that love to disagree. And they disagree so much that they consider  it a personality trait. Actually, met someone like this recently where it was my first time  meeting him, by the way. And we're over here trying to talk. And the conversation initially  is going smoothly or I would expect because we have so much in common. There was a period that  we were both from Virginia. We were living there. And we were pretty close to each other. I believe  I was in McLean, Virginia. And he was only 20 to 25 minutes away from me. So I thought we were going  to have a lot to talk about. But then we started to actually talk and he kept on disagreeing. I said,  dude, it could get colder sometimes. And he said, not really said, what do you mean? I've been there.  I mean, it's 19 degrees on certain days. I mean, it's probably not always like that. But you  know what I mean? But he's over here disagreeing with me. I said, dude, the food there is amazing.  There are places within the DC area where the food is nice. But once again, he says, not really.  And he has this smug face every single time he's disagreeing. And I'm thinking, dude,  could disagreeing so much. And it's fine every now and then because it presents some form of tension  within the conversation. And it allows both of us to feel more engaged. I get that part.  But when he's doing it too much, I'm just getting annoyed with the conversation. And I'm starting  to get distracted by other parts of the event. I'm thinking, how can I leave this interaction?  And that's when I start to see that this guy's entire personality, it's about disagreeing.  He loves to disagree. Not only with me, his wife was at the event too. And she said,  hey, aren't this samosas really good? And he responds back. No, not really, not quite.  I'm thinking, man, bro, you got some issues. So if you're someone who's disagreeing too much to a  point where this is now your personality trait, you really need to watch out because you may be  thinking you're acting all cool. But other people who are interacting with you, they are finding  very, very annoying. Quit doing that. There is a time and place to disagree. Sure, you don't  want to be a yes, man. But when you overdo it, people will stop returning your calls and people will  stop talking to you right after they met you. If you enjoyed today's talk and you want to get more  insights like this into communication skills and social skills, be sure to check out my book,  The Charisma King. Within this book, you will learn much more about being agreeable and disagreeable  in the right context, listening better, speaking better, and much more tips on how to improve  your charisma. Check out the charisma king within the link in the description box or go on  our body talks.com, click shop and grab your copy today. Thank you very much for joining me and I'll get  you next time."