Speaker A: Dear friends, fans and fellow travelers in this podcast journey. As indicated in an earlier podcast installment, my aim of this podcast is to stimulate listeners and public at large to ask questions and to seek logical answers and to not get fooled, cheated and looted by the 24 hour bombardment of lies, stunts and dramas that powerful vested interests and mafias indulge in for past 2000 years and more, and to make the public realize the dark truth that all that glitters is not good and to help the public at large to separate the grains from the chaff and to make the world a more enlightened and educated and empowered place. It has been deeply distressing and painful to see how international mafias and dacoits and power brokers and millions and millions of bribed, sold out and immoral cheerleaders and so called intellectuals including millions of cheerleaders from India Shouting from rooftop 24 hours a day and using all forms of loudspeakers that non violence is an amazing divine trait just to fool all millions of slaves or third world or fourth world and fifth world countries by the colonial nations and to make sure that they show the right cheek when slapped on the left and to prevent the dacoits and looters and colonizers and their cheerleaders from getting attacked or hurt or killed by the millions of slaves and people of colonies while these Jacobs and colonizers were indulging in violence and using all sorts of murderous weapons and doing genocide of slaves and people of colonies. Further, these sold out cheerleaders and loudspeakers and mafias did not utter even a word of protest when nations were using raw violence and eliminating opponents in World Wars I and 2 and when superpower USA and allies dropped nuclear bombs on Japanese cities and fried to death millions and millions of Japanese since they were not part of their clan or elitist group. It's worth debating what would have been the picture of the world if Japan instead of USA and allies had the nuclear technology and weapons and dropped nukes in Europe and USA and killed millions and millions by those utterly violent acts and controlled the world affairs as USA and allies were using since dropping of nukes on Japan in 1945 etc. Etc. Of course millions and millions of sold out bribed and immoral cheerleaders will have their own explanation why unbelievable violence was used in World War II to eliminate millions and millions of opponents while using a force orkal tongue. They were busy eulogizing the greatness of non violence and the greatness of the propaganda makers or propagandists or evangelists of non violence ethos, etc. I hope to unearth millions and millions of such dirty truths and lies and vicious propagandas of vested interests and power brokers in hundreds and hundreds of podcast installments in future, though I am not worried whether exposing dirty truths and lies will only add to the number of enemies I might attract for blurting out unpleasant truths to some people or vested interest by my plain speak in podcasts. Big thanks to all my followers and fans and fellow travelers for the wonderful support and love showered on me for more than two years. Yes Madam, I said in colloquial Parisian French language I am really curious to know of your Indian connection. You know Nanda German started the reply in French language. When I was a school kid we were taught that France had three small colonies named Pondicherry, Mahi and another one third one, though I forget the name of the third one in third one. Incidentally, I got married to a Frenchman working as a soldier in French army and on duty in Mahi for a few months and that was when I heard the name of Kerala having land connection with Mahi. In fact I had the honeymoon after marriage in Mahi and when Christian mentioned in passing that her research trainee was from Kerala, I pleaded with her to arrange a conversation with you to relieve the past, especially since she told me that you are conversant and fluent in French language and also to have answers for some questions that have been plaguing me, especially in this old age when I am alone and mind becomes a devil's workshop. I shall come to those troubling questions later. In fact, the French lady continued, I have pleasant memories of my short stay in Mahi for a few weeks I felt that Mahi was really a small piece of land, not even half the size of Paris municipality and we went by ship to the Honey for the honeymoon and not by air since whole of India was under British control and we had to get British entry visa to land in Indian soil that was some 500 km away from Mahi. Further, for the French people to seek British visa to enter India was considered a climb down of their ego, while for traveling by ship there existed no such mental or psychological hurdle. The main motive behind my request to my cousin Christian was to arrange a chat with you strictly personal and perhaps you as an Indian intellectual can help me surely? Oh sure, I said, I shall try to answer your question queries if they are within my intellectual and analytical ambit. I replied in French as desired by her. These days when I am alone and when going to bed, German continued and caught hold of my hand and said, the thought of death scares me and prevents me from falling asleep. Even I have heard that Indian saints have a formula that to circumvent this scary thought process. Please help me Nanda in solving that disturbing thought process. I had not anticipated such a query and had to strain my nerves to find an answer to After a few moments of silence I said, yes, thought of death scares everyone though. All humans have to go through that disturbing thought though, especially when age catches on. It is ironic that even those who are brainwashed by some religious preachers that they will get heaven after death with wonderful enticing ranelai or amazing gifts etc. Never accept truth of death with glee and in fact plead fervently with their doctors to give them some more days or months or minutes to breathe and to live in this world. It's another matter, I continued, that no one can explain with logic how humans buried under earth after death can get access to their promised heaven and have access to the wonderful promises and gifts etc. And that question might never be answered until someone who has died and got buried under the earth and comes back to life later and detail the journey after death to heaven, etc. Etc. In fact, 99% of devout Hindus, I continued, believe that human body is made of five basic elements and that the soul within the body is part of the universal, all powerful cosmic force or brahman that has no birth or death. So for a devout Hindu, a dead body is just like a cage of the bird from which the bird or soul has flown away. The cremation of the dead body after death is to merge the five basic elements of the physical body with the earth from which the body took shape and God the soul or Brahman at the time of union of all ovum of the woman and the sperm of the man or husband. 99% of devout Hindus, I continued, believe that the worst soul that has flown away at the time of death gets reincarnated in another human form or animal form in the next birth, depending on the good deeds done during the period of life that just ceased to exist at the time of death. Maybe for followers of other faiths this explanation might appear more as fiction, though My advice is I continue to get some lessons of yoga or meditation to help you to calm the nerves and maybe your cousin Christiane can help you in finding a good mentor or yoga or meditation teacher to circumvent this mental and existential crisis. Surely. Merci Boku Nanda May I discuss with Christian about your wise counseling words and try to fix the problem too, though many might think that old age has made me lose the marbles and made me crazy, though she giggled, wishing Germain all the best and wishing her peace of mind in this old age and thanking Madam Gandhi, Mr. Gandhi and the Belgian couple from the bottom of my heart for the unforgettable party. Within minutes I was on my way by bus to Sita campus, ruminating the bliss of having an amazing, unforgettable day of my life in Paris in company of some wonderful French and Belgian friends.

