" On project to Stroud in Aario, Crea Rinsiam, El Lid Ritaliano, Nell Wells' management.  The city's junior to do me living teaching in Quicirunicella,  same play out in Aario de Yatsunice, the de Mediobanca.  Pera Pravaril of Ferta, publica, this campus of Banca, generally.  Perta, Chippala, same play out.  Who is the assistant to the Rito de Delaga.  The present in Massageo, Quiciruna, Solici, that's your now confirming  to the Delaga de Voto.  Siprega de Prena de Vizione de Rilativo,  Prospecto de Solici, that's your now.  Touta de Cominta, it's your now same play out  in Aario de Sponey, Blesu, vu, vu, Punto,  Médio Vanca, Punto, Con.  Do you know about Punto?  What a qu involvement, what a qu  There are 7-1 pop-a-go.  Good.  And it was time for the get-stop pop-up.  Pop-up, the pass.  I'm like 30 seconds to go.  There's 7-1 pop-up off negative.  Okay.  Pop-up.  There you have it.  There you have it.  Yeah, it's not.  It's not a good idea.  Pop-up is passed over to the...  I got...  I don't know what it was, but it's from...  At least three thousand feet above us.  The entire pass by the other top of us.  7-1-1.  There you have it.  Do what it's called.  I'm going to be a close-up.  Mm-hmm.  They're off there.  They're on the airplane.  I just asked for a third spot.  I swear to God.  Four calls in on an identity object, everybody.  Four calls.  Four calls.  Four calls.  Four calls.  And an identity by flying object.  Four maps.  They're too close.  All right, we'll check it out.  Welcome to UFO Chronicles.  A place where people share their experiences  of the strange and unexplained.  If you've had an encounter,  I would like to be on the show.  You could email me at UFO Chronicles at gmail.com.  Hello, and welcome to the show, everyone.  I hope you're all doing good.  Tonight's guest is Neb Borkovich,  and he is going to be sharing his extraordinary encounters  with UFOs while sailing across the Pacific Ocean  in a 29-foot sailboat with his sailing companion,  Don, in a year 2000.  But before we hear from Neb,  I want to give a shout out to Wayne Martin  and his future son-in-law, James,  down on the Dorset coast.  Thank you for listening, guys,  and taking a time out to email me.  I like getting emails from you guys,  and it makes it all worth it.  But remember, without you wonderful listeners,  this show wouldn't be possible.  And a lot of people think it's a whole team  that works on this show, but it is just me.  And I also want to give a big thank you to Deep Bagwell 30,  Money Guy 925 from the USA,  and Gypsy Dream from Ireland,  for leaving fantastic five-star reviews on Apple Podcasts.  It is something that really helps to show to gain more listeners,  and more listeners means more guests.  If you enjoyed this show,  and you would like to help support the podcast on Patreon,  you can do this for as little as $1 a month.  Head on over to www.patreon.com forward slash UFO Chronicles podcast.  You can also find a link in the description of this episode below.  Any help is very much appreciated.  Now on with the show.  I'm really happy to welcome the near book pitch to the show.  Good evening Nick.  Thank you very much for inviting me to your show.  It is great to have you with us today.  Nick, would you like to start with a little bit about yourself and then what you experienced, please, sir?  I was born in former Yugoslavia of Belgrade, Serbia.  And as a child, I've immigrated to the United States, 1973.  Prior to this, I lived in Croatia, old city called Zadar, Zadar.  And since 1965 to 1973, there I felt a lot of the ocean.  And boating, particularly, my father had a little more boat.  And we took it out, uh, watering to beautifully.  We had a pilot in the region.  Uh, there's some strange names here.  Most people outside of Omega Slough, you probably wouldn't even know about them.  Is doggy or talking so on.  So, uh, my father immigrated to the United States in 1972.  And then I followed.  We rested my family and moved to Detroit two years, Buffalo, New York,  where I finished my schooling in graphic arts.  And then I moved to Phoenix, Arizona in 1981.  So after all my schooling, all the youthful events in my life,  I always had this desire for the ocean to explore, you know, to become a sailor.  I read lots of adventure books from people who have been all over the world,  to Antarctica, to Tunisia.  So it's something that was almost like a sirens call.  You have to do it.  So for a while, I went to California, a little Los Angeles back in Fort.  And since Phoenix is very close to San Diego and Pacific Coast,  I also went to San Diego.  And I just couldn't get enough of the boating scene there,  looking at the boats and being jealous at people sailing.  And finally, I said, save it through money.  And I bought a little sloop.  Canadian male, uh, made a sloop called Royal,  which I named after my father.  And after some, uh, about a year or so of a practice,  uh, strange idea came to my mind to take it out into the distant ocean,  maybe towards Hawaii.  Now, I was advised by the older sailors that I met and talked to and not to do it.  It is too much of a adventure to too much for, for a first time or go to Mexico, go someplace else.  Uh, so I didn't know what to decide.  But, uh, I thought about it.  And I said, you know what?  I'm going to do the Hawaii thing.  Luckily, I had a person with me.  So we went out.  Three days out in for Pacific.  And I got totally scared.  And it turned back.  Uh, within a week or so, the guy left.  And I could not find anybody else to accompany me.  So as the same time, the hurricane season was advancing.  And my, my supplies were dwindling aboard a boat.  So I decided let's go follow the bitter pillow.  Let's do it.  So I took off.  It was back in 1991 alone.  On a long voyage, the last 52 days, there was a Hawaiian island.  It only a small plastic section.  Uh, at this time, the GPS just came, came out,  but it was too expensive for me and too complicated.  So I just painted a little section to read the direction finer.  And I missed the island that I wanted to go to.  I wanted to go to Maui.  Uh, but I arrived to, uh,  Big Island, the southernmost island of the group after 52 days.  And I promptly crashed into the rocks.  I was rescued by U.S. Marines and aboard of a sea night helicopter.  And the rest is history.  Of course.  This kind of misfortune didn't teach me.  So back in, uh, 1998,  I bought my, my last boat, the third boat named Mira,  which I named after my mother,  just a year or so prior to this purchase.  I met this real fine guy.  Navajo Indian fellow.  His name is Donald Begay from Lukasuke, Arizona.  Four corners area near Utah, uh,  New Mexico, Arizona, and Colorado for corners.  So he accompanied me.  We trained for about a year,  went down to 47 day long cruise to Baja California.  town of Aturis Meccals, Cabo San Lucas, and then we ended up in a capital Baja, which is called La Paz.  Very beautiful desert area in the ocean, kind of like being a Utah. In Utah, on a Mediterranean,  red, colorful, fantastic place. So, since the winter was already upon us, in Christmas season,  I wanted to go home and he left in about 10 days. I secured a boat and I took a direct flight to  Phoenix from La Paz, and it goes across to across the seal of Cortez to a place called Guimas,  and for Guimas to connect to Phoenix. So, we did a couple of months. We returned back to the boat,  and after some repairs, some preparations and purchasing to supplies and food and  boat was in good shape. So, we decided to go to Hawaii again. So, we left La Paz on April 8,  with the idea of anchoring in the harbor of Cabo San Lucas before going out into the Pacific.  This is a very much longer voyage, even from San Diego, a little over 3,000 nautical miles away.  So, you have to think twice before you do it, but I already thought about it. I said, what the  decision was made. So, how does this year-first venture start? On the night of night, April 9,  we were slowly sailing. There wasn't too much wind and slowly sailing just south to the island.  It's La Sera, a little uninhabited island, only a few fishermen live there,  let's say maybe 60, 70 miles south to La Paz, still on our way to Cabo San Lucas.  About two in the morning, I was outside steering the boat, kind of dosing off,  and that was asleep below. And I started, I looked upward, and inside of this little cloud,  I noticed these blinks. It kept going off and on, stop, then again. But in several seconds,  I started up again. And it was something that never left the cloud. I kept thinking, as maybe this  is an airplane going to a Muslim clan from La Paz Airport, never registered the cloud.  There was no other lighting or rain or wind or nothing special. So, I had more or less  this regarded it. The very next morning, well, after breakfast, I forgot the time. I have  everything written down in my notes. Again, I was staring down, it was below, it was just washing  dishes. I looked up and I see the sphere standing over us, high up, metallic sphere.  Before I could even wrap my eyes, it wasn't there anymore. I called down to come out and he didn't  see anything. He just looked at me strangely and he suggested to start the engine, which we did.  But in a day or so, we were in the vicinity of Kavas and Lukas, and we were hit by a very bad  gale for the 50 or not winds, very high seas. It was a pretty scary night, especially after being  anchored for so long. It takes a week or so to get to your sea senses, again, to get to sea legs.  But we continued on. We didn't stop at Kavas and Lukas, which was an initial intent,  but continued on. I didn't want to waste my supplies and just hang out with the anchor.  The first night out, late in the morning, again, he was sleeping and I noticed his screen  neon light falling from high in the sky and slowing down, and then he started hopping around,  like a little frog, a little zip, zip, zip, zip, and then behind some cloud that he was gone.  I was kind of weird. I never seen anything like that. It's the second or third time that we  seen something like this already. Another sighting was also near in the same area as out the  Sarawo on a same afternoon from the first sighting of the Chrome sphere. There was something  allocated that came from the mountains, red, orange, color, and it showed itself up on a shoreline  and went back into the mountains in a very strange, jerky, zippy motion. There's nothing there,  absolute desert, nothing going on there in that area. This is the third time I've seen this green  neon light, but this time I was very puzzled. What's going on here? Again, the following night,  this time we've both seen this and this is the occasion which really absolutely blew my mind and  totally put any cut.  notions over there not being your foes and they don't exist. This is fantasy was a completely swept away.  Again, the same Neanderthal green light showed up falling and it started circling high above us.  It would stop and blink, blink, blink, blink disappear, blink on the other part of a sky.  And there was just, it made a much, much larger blink. It made a 360 degree  loop disappeared into the outer space, leaving a long yellow trail behind it.  I think I heard a pop. We both must have looked at each other and said, this is not a man-made,  this is not a satellite, there's nothing here. This is, I say, no. We actually haven't even seen  a single airplane going there. It's a lot of nothing. This was absolutely mind-blowing experience.  So, we continued on. The next night, again, the blinker returns only the time this was red.  This time it was red color. It would be red with some orange in the middle and started  descending in a falling leaf motion. Stood to our port side, maybe half a mile away,  very bright red color. And this time we were kind of scared. You know, this is a third or  four time. We're seeing this. And this is not, this is not something normal. What does this mean?  Why is this happening to us? I was petrified and next thing I thought of, after looking at it  through binoculars, I want to try to call this thing. So, I got on my little VHF radio, which we had a  board, only about the 30 mile dismissal radius. And I got on the radio and called it.  Hello, hello, hello. This is sailing west of Mira. Who are you? Please identify yourself.  What would you like to know? Of course, I didn't receive any reply. It things started climbing up,  and it was, it disappeared behind clouds. So, after this time, I decided this has to be recorded.  I must put this down on a paper. The GPS positions, the time where it happened, the drawings,  tried to describe as much as I, as best as I could, and possibly tried to record it by, by video.  The only piece of photographic equipment we had a board was an old RCA camcorder, the type that you  actually put the tape inside and slap it, and hopefully catch something. It was a very  unwieldy type of camera, especially at night, because he had this,  a light internal light blinded me. My right eye and my left eye, I have to close it. So, many  times I would lose the object in, in later on recordings. Plus, the boat was moving in big waves  back and forth, and the awning and pitching. So, it was very hard to capture and take up substance,  but actually I did a few times. So, we had a couple of more sightings like that. Most of the blinking  lights in the distance until we reached the big island 35 days later, which happened or made the  12th. We pulled into the harbor of Hilo on the southernmost island, the big island again,  the same island I had that misfortune some years ago, and dropped the hook.  Took a couple of days to get our land lags back and eat something good and shower up and  look like humans again. And my next idea regarding this, the UFO sightings, I had to inform somebody,  see if there's anybody on the island who would ever listen, any reporter, any kind of UFO  organization will fire anybody else. I went into the phone booth, looked at the yellow pages and  there was, there's nothing I can find there. There were a couple of palm raiders and  some gypsy people, nothing specific. So, the next idea was trying to go to the police station and see  what maybe then if somebody or maybe they want to take the report down or inform some other  organization, whatever, whoever. I walked to the police station and they came out and said,  what could, what could we help you in? Said, well, I want to report to UFO, some UFO sightings  we had during our voyage and they looked at me funny and they almost laughed, they smirked and  said, well, we really can't help you. We never take this kind of report. We never heard anything  like that. Maybe you should try the coast guard. So, yeah, that's a good idea. So, the same day I walked  to the coast guard station and the clerk and duty inform me.  that the person I needed to talk to was Captain Kevin Lopes, but unfortunately the ship he was on the  Coast Guard cutter named Kiska was in Harbor, it would be back within five to six days, so I have to wait.  So I agreed, no problem, we'll be here for at least a couple of weeks in Hillo Radio Bay.  So we hung around, enjoy the sights, enjoy the sights, and I took a bus around the island,  and done a sit on the boat, enjoying himself, finally away from me for a while, and Kiska eventually returned.  The next day I went to talk to the clerks again, see a captain is a boy, you can go, you can proceed,  come and see him, so they were kind of waiting for me already, and I went to talk to the man and another officer  whose name I can't remember right now, I didn't jot it down, and I showed him the videos,  whatever little I had, I showed him these notes that I kept, a number of pages, good 15 pages that I recorded from  the inbound wage, so he looked at me very interested, there was no smirking, no laughing, it was a very serious  matter to him, what he did, he made a report about my sightings took my boats information, very official,  and send it to the Kiska group in Honolulu, faxed it, so he could do it, refer me to FAA, you know, maybe  then or something, I didn't proceed with that investigation, but anyway I thanked him and I left,  and within a few days we left Hillo on a month, a month and a half long stay in the islands themselves,  it was very beautiful, I got there for like I said over a month and a half maybe, we went to  to Island of Maui, anchor there for a couple of weeks, place called La Hina, then we went to our  Molokai to the Oahu, Island of Oahu, stay there for a week, but the situation, anchoring situation,  and it was very very welcoming, so we're deported authorities, there's a new camera you can only  stay for a month and you can't anchor here, you can't anchor there, too much red tape, so at that time I  decided you know what, instead of going to New Zealand police, which I envisioned, or staying  with the islands to find work, I decided to go back to San Francisco, so it was a big  sigh of relief, at least the decision was made, so in this case we went back to Maui,  stayed there for another couple of weeks, stopped by the island of La Nye,  then we went back to Rondo, Oahu, this time with the name of stop, we just sailed by it to the  Island of Kauai, tropical paradise, absolutely beautiful place, rainbows, waterfalls,  birds of paradise, lots of friendly people, artists, people camping on beaches, Bohemians,  other sailors, say it was a wonderful two weeks that we stay there, and then in June,  it was time to go, so I don't recall the date right now, but this time we left, we left  towards San Francisco, this was to be a 42 day long trip, and it is a much more demanding trip  than coming to Hawaii from Mexico or California, because there you just go along with the trade  events, it takes about eight days or so to reach the trade events, you can tell by the way  the boat's turning and the way the clouds look very puffy, like a huge atomic bomb explosions and  on horizon, but to return to San Francisco or to Washington State or further north to Vancouver,  this requires approximately 11-hitter mile climb directly north to reach the Japanese current  Garcia, a North Pacific current which takes you towards California, and also by doing this,  you avoid the area of comms, known as North Pacific Patch, lots of garbage right now  floats through there, all kinds of floats and horrible, but it's a huge area which moves,  you know, in a summertime, it moves north, and there's no wind, it's just, you know, if you get stuck  there you could be there for a couple extra weeks without a good engine, so at a certain point,  you need to have your engine all the time just to transverse this six to five, six, seven,  aggregate miles of comms, but anyway, to continue on, the first night out, we left early in the morning,  the first night out, the UFO is back, it was almost as if they were waiting for us, we see in these  two little lights that were come from different directions, the yellow lights,  Sometimes they would stop by each other and start circling each other and do wide again and go back before they came from  Sometimes there was a single object  And but it's time. I was just exhausted brave. You know what what what's going on? It seemed like we actually been followed  This is actually yeah, this is how I quote the title my book later followed because we actually were followed  Why would be be followed? Well, if you're following an airplane you can stay with it for a while or a car  If you're following a slow moving boat and you want to  Keep an eye on it. It will take time  So you show yourself periodically. It's exactly  What has happened is for some kind of experiments or some kind of adaptation experiment. I think  We'll be back with neb after the commercials to take us there  We have a song by one of our listeners Yancey Yates and it's called purple red  Like that the day we met  Come hold over parapet  My soul surpassed your castle door  Slitter crows your kiddling glow  A drunken shaman points the way  To a crystal palace classy  Choking on court side  Y'all long night man  Dead man's trust  Oh  What he had was a little bit forget  Squeezes my elbow and sucks  Dancing on the pre-sear  to my chest, props a sugary, blind voice, or  only buzzing, pale in light.  Spirit is for a little bite.  You turn to the coat of view, it all again.  The only truth you'll ever hear is my mama mama.  My dad, the day you even come over clear of him.  My soul snuck past your castle, shitter bros your killing.  The truth in the shaman points the way.  Look at the storm at this glassy heat.  The truth would cycle.  We are the long night there, and dead men's troubles.  video app now and start listening to the very best in paranormal talk entertainment, including  the network you're listening to right now, the paranormal radio app, free in Google  Play and the iOS app store.  So by this time I became a little more proficient with a camera and I was able to capture  some footage here and there. On one particular night we seen an object high in a sky  cruising by and this time I did something different. I grabbed my search lights, half a million  cattle search lights and I pointed directly towards the UFO towards the object. It stopped  and it sped away immediately with enormous speed, almost as if it was startled by my light.  About half an hour later the object is returning stopped high overhead and it's just  exported into a large circle of light and this kept going for a number of seconds, almost  half a minute. It just gave me enough time to dive below and grab my camera. I was able  to capture this footage and this one happened on July 14th, this particular footage. On July  12th, two days prior to this recording, this is where the major event happened. Both of us are  standing outside, searing about our engine was on. Your passing through this parts of this  town area, therefore the engine had to stay in. We noticed a light cruising high above.  Only this time it didn't go. You just started descending directly towards us and we were looking  at each other again. What is this? What is this now? And sure enough, it was coming down. We were  intelligent, almost like a plane, but coming down from this high point and it was something  horseshoe shaped. It had a number of red lights at the front of the object and a large  squareish area on the stomach. It looked like a perfect horseshoe flying reverse.  It flew over silently with the most part. I think I could hear some kind of buzzing, but  it was very, very fuzzy because my engine was on. But something was going on. It wasn't very loud.  As it flew over us, it had a huge rectangle light in the back of its hull, something I never seen  before. I would say that the point was maybe, the height was maybe, I don't know, 2,000 feet,  2,000 feet above us. It was followed by a similar looking object, but with less lights,  less light, different lighting distribution. But again, this huge squareish light in the back.  They buzzed the six times altogether. Three flights for each object that's six overflies.  It was absolutely mesmerizing. This is the object I painted on a cover of my book,  followed. People can see later on. What was fascinating about this particular sighting is that  the video I captured when it was analyzed stopped framing blown up. It shows a almost identical  looking object that we have in a book that we've seen two days prior. It would be impossible.  It would be impossible. I did not have a bank of computers and a board to manufacture this  or fake it in any possible way. Actually, you cannot even-  see it until you stop the frames. You just see a large light lighting up. So they were there.  Must have been a same type of object. When it blew up two days later, it was probably  much higher up. Another very particular video segment that I think you have, Nick, is  I was able to capture, I'm an over when the object came, stopped, and instantaneously  blinked out. It's appeared. I was able to capture this in three different occasions,  but only once it was in perfect focus. I was described by Mufan Jafri Sanio,  video investigator, who has worked on my videos up on returning to Arizona after all these events.  So yes, we've seen the object several more times or objects sometimes. Sometimes,  like I said, there were two flying unison in high distance of blinking out. A few times,  I was able to exchange my light signals with it blinking four times, back and forth.  The answer, there was absolutely, and I felt almost like being on some other planet like some  kind of a very, very psychedelic experience, a very mind-boy experience to have an object  to a known origin blinking lights back at you. So some kind of rudimentary primitive type of  of communication was established there. Now, on late night and early morning between July 26th  and July 27th in the morning, yes. This was where a very anomalous event happened,  and it was to be a pivotal point on my entire investigation of this case later on,  which opened many new doors and new vistas for me later on. My friend, Donald,  he's a very simple type of man. He doesn't read very much, he only has a  rudimentary education, maybe eight grades of school. I never went to college and I never seen  reading a book actually. This will become important later, this particular aspect of it.  He was selling the boat. I was asleep. Well, around five in the morning I woke up and made some coffee  and it was my time to take over because we kept having these little ships, maybe four to six,  seven, eight hours. I was staring. I noticed he had a very bloodshot red eyes and he was  complaining of a headache in two spots. So all them, well, just go below, get some sleep, take an  aspirin, take a towel, you'll feel better. I'll try to steer as long as I can. So sure enough,  you went to sleep. Around 11 o'clock, 11 30, he wakes up, looks around and drinks some coffee  and informs me they had a very strange dream. This time we were only about a week away from  making landfall back in to California. And I told him, well, that sounds interesting.  What was the strange? Well, what did you dream? I said, well, I dreamt that I was back home in  Lukaczikay, a man's old town in northern Arizona. And in my dream, I was standing outside of my  hogand, which is a traditional Navajo home made up. It's very circular made out of eight sides  in the door almost points to the east. Now, there are some other structures around there. In his  dream, he said that he was standing outside with his brother. The report looking skyward, and they  noticed a huge object full of lights, crown shaped, full of lights, kind of like a neon displayed  advertisement sign flying over their town, very close to their hogand, linking lights and said  they were changing almost like a light bulb is going off and on. And I said, wow, this is strange.  Was you pleased to be able to put this down on a paper, make some kind of drawing before you  forget it? I already compiled a large dossier of sightings in my, in my, in my, in my logbook here.  So why not add this? Since we already been over being followed by these things. So yeah, he had read  just sat down, his smile took a pen and he drew this very enigmatic drawing. It was circular on the bottom  and the crown is in his profile. There's some dots and some partitions and some of them curved,  there was a middle divider and said, this is very strange. You know, how would he come up  yourself like this? It's almost like a, a design of some kind, something from a dream. So this is very  Then this kind of wiggly reminded me of a strange dream experience that I've had prior to meeting him in 1997.  Now we all know that 1997 I live in Phoenix, back in Phoenix, Arizona, back then there was a major UFO setting known as Phoenix Lights, enormous triangular boomerang top objects to flow over town.  I've never seen those in that particular event, but I recall that I was asleep in my room. It was totally pitch black. I live alone in the little one better apartment.  pitch black. I'm dreaming. I'm dreaming was a guy that exploded with UFOs. There were balls, there were saucers, there were rockets flying by.  Almost sudden they're all moving apart, moving away and it comes just like a mothership type of object that came on the scene, which to me also look kind of crownish.  I couldn't see much detail and this was such a beautiful dream and I wake up from the dream as I'm waking up. I cannot move. I have a sleep paralysis.  I cannot move, but my eyes are opening and I'm realizing I'm in my bedroom, but somebody is standing in a doorway at the foot of my bed.  On a doorway to the living room, to the kitchen area also. And I can't move, but my eyes are open. I'm saying, who's this? Who's there? Who's looking at me?  Next thing I know, I see this dark torso, one arm that lifted up and this ghost-like figure just flew right through the ceiling.  Disappeared. So this, in a way, his drawing activated my memories of this dream that I had prior to meeting him in 1997.  So I felt this is very strange. I was very, very happy, very glad that he was able to put this in a paper.  So I think you have a picture that you can display for people and it's also displayed in my book and many other places.  And some video shows have done. People can see what it looks like.  But anyway, about seven days after these events, after this dream event, we have made a landfall.  San Francisco, it was a cloudy late summer day, which always isn't San Francisco. It has some of the coldest summers in the country.  We went underneath the Golden Gate Bridge and we anchored in the area of the Marin County, in order to the city itself, which is called Richardson Bay.  We dropped the hook there and we had to recuperate for a couple of weeks to see in the sidewalk.  We're going to do it with the boat. Are we going to stay there, go back to San Diego or what?  So the decision was made to leave the boat and storage. And after a while, go back to Arizona, we both lived because we had to work.  We've been sailing and enjoying our software for too long. So before actually leaving in San Francisco, I decided to do something about the sightings.  Since the coast got already took an interest in it and I wanted to find out any kind of a UFO type organization or a reporter who would be willing to listen to my story.  I made numerous calls and I was turned away and disregarded, laughed off until I found what was paper which was interested in the story.  Marin, independent journal, I was told to come down for the interview within a couple of days and introduce to a lady named Jane Fletcher.  We listened to our story and promised to make an article about it sometimes later. She also introduced me to a psychologist Peter Davenport to whom I made a report, talk to him, sending my materials.  And he had advised me what to do, but once I returned to Arizona, I heard a contact, told me to contact Mufan and gave me a name for a gentleman named Tom King, who has actually recorded some of the Phoenix lights in 1997 during your original events, who was becoming an expert in videography.  So I was very thankful to Davenport and we secured our boat, thank Mrs. Fletcher about the possible future article and we left back to Arizona.  Back in Arizona, within a few days, I called Mufan and the San Art team, three member team led by a gentleman named Jim Kelly.  He brought along Judy Wines, who was led to become a state director of Mufan and a man named Jason.  Ingram. Kind of listened to our story together and then he separated us. Ingram stayed with me  and Judy Warren spoke to Don to take his account to all of events. We filled out the official  Mufan report form. We gave him the copy of the videos which already prepared and they left  the tank test at the left and said they'll be in touch to go back if there's any other strange dreams  or intuition events or recalls or anything else that we could fill in. So we thanked him and  they left. Within a few days, Don left Phoenix. I stayed in Phoenix to just where I lived. He went  back home to look at you, to see his family. It'd been a long time. So we were apart for a while  and then on September 22nd, he calls me and he said, I guess what? And I said what? What happened  now? What's happening? Well, I've seen the UFO with my family in broad daylight came over our town  and I took a picture of it. He said, no, you're pulling my leg to this. This is not serious. Are you sure?  So yes, it was there in broad daylight about 2 p.m. standing over town towards some mountains  in the background. Just come out, as they're called. And I was able to capture a couple of shots of it.  My little camera, a little throwaway caught out camera. He stayed here for 40 minutes altogether.  Me and my niece, we looked at it through binoculars. So this is fantastic. How could this be?  Would you please tell me those photographs? He agreed within a few days, they were in a mail  and I took them along with our ocean videos to Tam King. We sat down and he promised me a report.  He looked at all the materials and the only thing on the photo was this little white spot.  And he said, not to worry. He can enlarge it to see what looks like.  And he ruled out any kind of airplane, any kind of a balloon, any kind of obvious,  it couldn't be a satellite or a bird. There are no helicopters there. The only thing I ever  flies there are jetliners. They leave along nice jet trail behind them at night or daytime.  And nothing else. They don't even have a helicopter. No, no sight seeing flights.  There were no toy or a personal drones like we have today back in 2000.  Only military had some large, large ones to attack to use in war operations.  So there were no drones. There were no toy balloons. All the hot air balloons there in Albuquerque,  people taking them for trips. Nothing, it is just an area. So there were no wings. Once  he large the object, it showed something acorn-shaped and there was no indication of any wings.  So it was in the meantime, I continued on with other aspects of the investigation.  Through Mufan, I met this very great lady. Her name was Ruth McKinley-Hauver,  who was a very well established member of UFO community in Arizona.  And she was professional psychiatrists, very well known and connected with Professor John  Max, peer organization. He kept in contact with a number of psychiatrists or psychologist  interests in the field, in the abduction field. And she was one of them. They are all little  groups and she would forward this information, whatever she could gather from Hypnosis or other  events to straight to John Mac. So this was very well established. I met her at Mufan and I became  more or less a fixture and all the meetings in international meetings, in law in Nevada,  San Francisco. We met there because my boat was so there. I got to meet Stephen Friedman. I met  but Hopkins, Jim Mars, Travis Walton, all through her. Very interesting. But not to jump  to far ahead. I decided to have a hypnosis session with her to see if there's anything else  that could happen during this voyage. And it was fascinating. First of all, I didn't think I was  going to be able to get hypnotized, but I was. It was very good. After a while, I kept losing her  voice. She should go to a Kippen calm and to relax and you guys are slowly sailing and you're  seeing this light in a sky. Very soon I'm losing her voice and I find myself outside of  boat floating just by body. I could see the dark ocean below us and nothing else. I can find a boat  and there was no dawn. Nobody just myself. What am I doing in the sky? Next thing I know,  I see the saucer sticking to a cloud outside of a cloud with some yellow lights and below.  And I was wondering why is the saucer here in a cloud? Next thing I know,  I'm some kind of little enclosed space, like a little car or something beige color.  And I could see a wall of green light to my right. And I felt some kind of a commotion around me.  And this made me lose my cool almost at a heart attack during this session. I couldn't bear it  to be there anymore. And I was very excited. My heart was pounding. I couldn't breathe very well.  And luckily she brought me out of the scenes. She said, your mind did not want to go there.  But during this time, as I was going through this with her, I sent out my ocean  ocean videos to Jeffrey Sanio. And a month later after the supply session,  he brings me the results. Mail is made a result. One or two that he found anomalous is a big light  which shows a craft. And the other one would a craft disappeared. And he said in his own report,  all of this is laid out in my book. I have a written report. He said that nothing could  disappear as fast. It just blinks out. One frame is here. The next frame is gone. So he said,  airplane lights would take quite a while to extinguish, and his thing was gone in one frame.  So then I was really mesmerized, but all this. And I decided to explore further. Now, where could  this thing go? Sanio really didn't want to get too much deeper into this. You only sent me what  he could see. Very conservative type of investigator. So I took this video segment for the studio  in Phoenix. You know, they don't deal with you. But they could do whatever you ask them to,  you know, the professionals. They all kinds of computerized equipment and enhancers and whatnot.  Not other than, please take the short video with his light stops and blow it up,  clean it up as much as you can. You see what's in there. It cost $300 out of my own pocket.  I was so intrigued. I wanted to find out what this is. And sure enough,  it crystallized into some kind of a flying saucer. Obviously flying saucer craft, two plates  inverted. I think you have that deck. You can show it to people. The next frame is gone.  They couldn't explain it, you know. And we all know the speed of video frame is 130th of a second.  So I still wondered about that. And I had a good friend who was pretty handy with computers.  I asked him, let's work on this. Let's find out how this thing disappeared. Of course,  the people in the studio, they couldn't tell me anything. Nobody could tell me anything.  So we took the dark frame and we started enlarging and enlarging and maybe about 11  levels of zoom. We find a single tiny microscopic white spot. Only four pixels.  So this thing disappeared from being visible from point A to point B to one three to a second.  Now, speed of the video frame is a speed of light to the christy, 180,000 miles a second.  So when you divide it into 30 parts, you get the speed of 6,200 miles. This thing took off  from being visible to two invisible at approximately 62,000 miles an hour,  130th to a second. And this happened a month after my hypnosis session showing a saucer.  And there were also reports from Hawaii, from Mexico and California before during and after  our sightings, what people seeing approximately same things actually I found a report for  Davenport's new fork net. I found a report to man seeing a saucer type craft sticking  out of a cloud over Hawaii, over Oahu a few months after our sightings. So I don't know how much  more verification do you need. When a second subsequent session with Dr. Root, I was able to  get hypnotized very well. But again, I couldn't get very far. I see this huge  black eyes staring at me almost tranquilizing me. It seemed like a new everything about me. It cared  about me. There was some kind of love there. And I could see a little bit of wrinkled skin,  blueish, gray skin on the side of this eye, which also had a yellow type membrane or a yellow  membrane on the bottom of it. But it kept staring at me. I couldn't move. I couldn't do anything. Again,  I started getting very excited, very disturbed, and she had to bring me out of it. So you said,  your brain just doesn't want to go through this thrift door. I don't think this hypnosis can  really help you very much anymore. So we stopped. So for a number of years, my book came out and  decided to write a book, followed, which gave a complete assessment of the voyage itself and the  events. In the first part, the second part is an analysis. The best is I could, with the knowledge I  had back then. The knowledge that I heard from people from experts, the shows I watched, other  witnesses. The best I could is written the book from 2002 at the level that I knew then. So in the  meantime, I was trying to promote the book. I went a couple of little speeches around Phoenix,  while I was showing San Diego, and a couple of radio shows and things of that nature. And then  in 2004, this is where I had a major breakthrough. And how this happened is absolutely phenomenal.  Absolutely phenomenal. And this opened a new door for me to investigate this further and understand  the entire phenomenon from it. Donna's drawing that he drew on July 27th was to be the key.  I was invited to speak at the college Navajo Community College at small town of Salie,  maybe 12 miles south of South of Lukacchikai, only college there. I spoke about my book and I had  a bunch of videos to show them, talk about UFOs. It was a very nice, nice meeting. And I stayed  in the area and it danced, it was a dance guest for a few days. But the college also had a nice  library of all kinds of Native American artifacts, books, paintings, drawings, museum type exhibits.  And I spent a lot of time browsing through there several hours in those days that I stay there.  There's not that much really much else one can do. And one book in particular caught my attention.  I didn't even know what I was looking for. It's almost like being led to a certain books and certain  materials. It was called the warrior shield and a star by Professor Oricology in New Mexico,  Pauli Shazma, who was her name. I think she's still alive. She's selective.  We're a little late in maybe 80-90 years old. It was a fantastic book. It showed some ancient shields  in which one can obviously see entities sitting aside in the legends. These shields could travel  through the air, cause rain, and they could take the honor flying very high, very fast throughout the  sky. And most of these shields from her book actually don't even exist. They're just tethered lifts  and pictograms. Some of them are displayed in a slot-up way in New Mexico. That's what she mostly  got through materials from and some others also. So fascinating book. And they're right next to her  book. There was another book called Pueblo Shields. Maybe very slim little book. Nobody, everybody  could just pass right by it. I opened it. I started leaving through it and on a page eight, I believe,  my Georgia straps. There was a drawing illustration of an object of your shield, which almost  exactly matches Don's drawing from his dream. I almost dropped a book. What does this mean? And I  know Don had never seen this book or never talked about it until like this, sir. He read a Bible  a few times, but I can't say a very, very simple man. And I didn't know what to do. So I started  suspecting that the dots and lines mean something, especially on a shield. It could also be a good  defender. You know, if you're finding somebody wearing a shield that can confuse them for a second,  and then you can club them with the axe or deflect an arrow or a club or whatever, a war type  for implementing.  Telepath is a weekly digital newsletter filled with the latest paranormal news, trending  topics, and fresh articles from some of the most popular critical thinkers in the community  today.  Stay informed on your favorite paranormal podcasts and live streaming talk shows, interact  with the telepath and upload your paranormal story or pics.  It could be featured in an upcoming edition, sign up right now for the free Telepath  newsletter at paranormal.radio.  That's paranormal.radio.  Then I had to find out about shields, so how were the shields made?  What are they?  You know, I didn't know anything about this type of research.  So I found out this would mean that a buffalo hide and each warrior had an individualized  shield.  It wasn't like being in a Christian army, Spanish army or Roman army.  Here's your shield, grab it and go fight them, you know, they'll look the same.  Maybe the noble men are a big warrior, it's a different type of shield, but no, each shield  was made specifically for a single warrior while the painting was applied in a buffalo  hide.  It was done to a ritual, only the medicine man, especially appointed medicine man could  that knew a certain chance could do the spainting for each individual warrior.  So that was that aspect I had to learn about actual historical aspects of making shields.  Then a second thing I started counting the dots and dash lines going through both the shield  and dance drawing and the ancient shield at 142 dots in it.  So I first think back then when I was 2002, 2004, it was, we had internet but it wasn't  like today, you know, he couldn't jump all over the place.  It took some real hard research.  I put the number of 142 to see what I can get, you know, what anything about 1942.  And first thing that comes up, it's a losing to a biblical psalm, 142, well, he was in  the cave.  You know, I'm not a religious man, I'm an atheist, you know, I never even read the Bible.  But it talks about the soul that has trapped in the cave, is praying to Lord to release  him.  And one day, he will be released and be among the righteous that his enemies are stronger  than him, that the sprung a trap for him and he needs to get out of this cave.  And they will be recognized, which is just strange little Psalm 142, you can sit in the  Bible yourself.  Then I start accounting, dance drawing, his dots and his dashes, the shield, original shield  had eight partitions, no, I'm sorry, five partitions and dance had five partitions on the  bottom, you know, on the top, three partitions on the bottom, all together, 81 dots in  a circle and 32 dots in the profile.  So all together, 145, 84, 145.  So I started learning more about the shields, trying to follow the story, where did these  shields come to this book?  What was this entire story?  And I find an article from newspaper in Utah from around that time, that people are fighting  over the shield, there were several tribes trying to claim the ownership of it, the Navajo's,  the hopies, the youths and Apaches, everybody wanted to possess some several other smaller  tribes in New Mexico area, they all claim the ownership to it.  And this shield was found in 1927, I believe, or 26, by a man named Pectol, from Pectol.  While he was walking around, looking for minerals, I believe, with his family, with his  daughter and his wife, they found his little crevice and dug in it and found three shields.  This particular shield was one of them, very beautiful, and the later, they were in  his positions for a long time until the federal government took him displayed him at  Granite Reef, I think it's called the National Monument in Utah, and he was in this  place for a number of years, while the court case was going on between these tribes fighting  over the shield.  shields all three of them and it was finally awarded to the Navajo tribe in year  2005. Almost like a biblical illusion. So then you have 19.26 and down shield  down is drawing 36 dots a top 26 dots in the middle kind of draw like a serpent  for the middle and 19 dots on the bottom. 19.26 and 36 and it was 36 years old when  he had this dream. On July 26th in Detroit when July 27th July 26th is a  my new year it new year too. Amazing stuff. So then by this time my mind is totally  blown up. I wanted to just to explore further. So 145 again I put the  number into the computer and the first thing that comes up is the illusion to  Sarah's cycle which is a cyclosolar eclipses. At least 42  viruses that are constantly happening and they can stretch for 12, 15  hundred years from the first partial eclipses and it travels to the  epithelial region become full eclipse and then later on it peters out to the  north side of the globe towards the north pole. So there are 42 cyclos  constantly circling. So Sarah's under 45 the first eclipse was Sarah's  under 45 happened in 1639 at the same time the discartes lived and wrote  Sir Bacon who worked in cryptography. Also from this particular shield the  little sample was taken in order to settle the court case. A small sample of  buffalo hide was taken to UCLA in the 70s to try to date it and a radio carbon  dating shows years. Year of the buffalo's hide when it died approximately 1640.  So now you can see how this became a some kind of a message. A cryptogram. So then I  tried to to redraw his drawing because it was really kind of a it wasn't exact  so I put in a much better much better presentation. It was very very difficult to  draw the circle and I tried to match the edges the nine edges to the drawing  itself because when you put a bottom like it was in his dream that he saw the  bottom would not match the crown. It just wouldn't match the central section to  wish the serpent is going would not meet the if you didn't meet the lines of  the side of the shield is just it would be a far smaller it would be nothing  like the like the drawing of the circle itself. So then I started viewing it  thinking about it in different manner. I thought that maybe that's assume this is  a UFO something manufactured something factory produced wherever the factory  was. At this time see I kept thinking of the entire phenomenon is being  extraterrestrial and a few years ago I totally throw away this idea. This is  something far bigger. But anyway going back to the shield I started viewing in  the manner that this is something manufactured. So if you have nine sides and 32  dots on one side, let's assume if this is an object there must be another  side to it imaginary side and visible side. So only when I did this and I  stressed the crown around us inside circle kind of like an accordion opening  an accordion it perfectly fit everything fit and this happened on November 11th  when exactly the day that not Yasser Arafat died 1111 2004. So this was absolutely  fantastic. This became later on entire science. So the ancient shield activated  dance drawing as being some kind of a subliminal type of cryptogram and I'm  very well aware about the numerical aspects of it and later on at this point I  believe that I'm able to decipher maybe a good 75% of the entire phenomena  with this knowledge. I found things that job all ancient historic  you have for sightings as presented through every culture,  ancient Egypt and going farther back  into the political politics times  and with the modern sightings.  So you have ancient stuff,  you got the new stuff,  but I found the meat, the connective tissue  between the two,  it is through the mathematics and geometry.  So one can at this point,  one can, with big safety,  you can, you can discard it,  extra trust for hypothesis.  And one of the very few people who have some strong arguments  against it is also famous,  one of the best explorers in the world,  Jacques Pale, everybody knows Jacques Pale.  He's not an ET proponent.  I read some of his work and I totally agree with it.  But even he, he only goes back to,  he goes to middle ages,  he will go back as far as Egypt.  The first sighting of the Pharaoh, about 1500 BC,  but the Pharaoh,  they're describing the UFOs flying over them  as circles of light.  They had no clue what it is.  At the same time, they're looking at their pyramids,  which is, which is connected to this phenomena  in mathematical and geometric ways.  And everything else before them is absolutely fantastic.  And I'm still working on this today.  And this would be the subject of my new,  my new books on David,  when I could sit down and write it actually.  Every aspect of this requires the utmost  of our sciences,  what physical anthropology,  physics, mathematics, biology, history,  every aspect of it.  And how is one man,  one simple man like myself able to put all this together  without help?  Nobody pays any attention.  And this is my point today.  This is where I'm at today.  And I think I could conclude with this.  That is absolutely fascinating, Nurb.  Well, this, this blew my mind, man.  This is absolutely, I can, I can give you,  I can send you some info on it.  Please do to listeners,  all information and the details and the drawings  and the videos, everything Nabs got is below this episode  in the description.  I think Ned, because you spent time at sea  and you take note of everything in the log book,  storms, what you eat.  This is why we have so much detail  about what you saw and of experience.  Yeah, yes.  Well, you know, after a few couple of sightings,  you, you have to do it.  Because you know, if you're with us,  if you're for some place in a large city flying over people  or, you know, bus or airplane, some place,  you may be interested in the airplane, okay?  When you're alone in the ocean, it's looking at you.  Only you, your friend, your boat, it's coming to see you.  You know, there's no, nothing, I'm ambiguous about it.  And therefore I had to sit down and start jotting these things  out on the paper and other people have seen it.  You know, I tried to do as much as I could.  This is way more than just a chance meeting  in the middle of the ocean.  There was so much more to it.  Well, I believe, oh, yes, there's far more in Lukatreke.  There's far more, I'm just discovering new things.  You know, I'm not, I'm not the liberty to talk  about all these numbers, but it's numerical.  It's also lines of positions.  There are new discoveries that I've made in Lukatreke.  So it is almost as if we were destined to meet,  as if I was brought to Europe and from Europe,  to America, when my father, to meet down someday  and down was an instrument, he was a kind of  recommended antenna that this knowledge came through.  It also could, could do with the, with the former life,  because the reason why the shield was given back  to the Navajo, there was only one old medicine man,  Don or James, I forgot his first name.  His last name was Holiday.  He was the only one that knew the ceremony of the shields.  It could still sing the song.  And he knew about it.  He was a very, very respected medicine man.  And he ascribes the ownership of the shield to an old warrior,  named many, many goat right here,  who was killed in skirmishes with the Spaniards  back then at that time.  I tried to find his name in his historical annals,  and I still cannot find it.  But this is the only reason the Navajo tribe got the shield  back in 2005, after my, after my discovery.  And this is all written in newspapers.  I consider the copies, not something.  There's a whole nog prop, stands for a national  appropriate grave appropriation agencies  that certain tribes are, or individuals conclaimed  for their ancestry from the United States.  government. So this is absolutely mind-blowing stuff. And I believe the phenomenon itself has  been here since the very, I actually am fine. I'm fine again to go back to the time of  astralopitatines. It's very possible they've seen it and homo erectus, a gentleman.  The reason I'm finding this is through the black triangle phenomena for a scene right now  and I have seen in town of town of wide. I forgot to mention this sighting in which I recorded  in 2009 with a different friend, a huge boomerang and a large triangle shape craft to flow over us.  And I got the video and there's far more information here that I have  than I'm not a liberty again to disclose yet. But it drives, it connects everything to be this  with earlier events. It also ties the sighting to other UFO events. I found the reason why they're  coming and it's very subtle and it's mathematical. You can chase UFOs for next 50 years if you  want to take extra shots, talk about propulsion. And there's only thing most people here today  are discussing is the Roswell, what crashed, which General said, what Senator who recorded this,  who said that, the other guys are going to offer a century, they're talking to Syrians,  they're talking to people from Andromeda, people. It's absolutely mind-blowing stuff, how little  we know. But my friends, I have found a connective tissue or what this is. And I believe it's something  that quags us with us in some kind of a no-time environment. There's lots of time disturbances  involved with the sightings. For example, we have two similar cases with Travis Walton  and Armando Valdez in Chile case. I don't know if you're familiar with the case with five soldiers  in a Takama desert, they were guarding their post there. This was in 77 to 76. I mean, about the  same time, not too far from what Walton experience. They have seen two objects, high in a sky,  which started landing. One of them landed high in the distant hills, the other one landed nearby the  group. And they were all confused, looking at the object. And Armando decided to investigate it. He  was a man in charge. He was only in his about 25 years old. The other soldiers held him back. Please  don't go there. It could be dangerous. He said, no, no, I have to do it. And you walk right into the  light and disappeared. He was going for 15 minutes. He came out screaming like a mad man. The  object is left in the meantime, saying something, he never felt like he was, he didn't know where  he was. He never felt like he was actually abducted. But he said, they kept that he heard the wars.  We know who you are, but you don't know anything about us and we will be back or something to  the effect. But the problem was, even though he was going for only 15 minutes, he's watched.  The time has stopped, but the date, the date and his watch showed five days later and he had a  five days of beer growth. Five days of beer growth, he was clearly shaving just 50 minutes earlier.  And at one time, while Travis Walton was in Phoenix and went one of his presentations, I asked him,  what happened with your clothes pants, your shirt that you had on during the experience?  Did you ever use a restroom? Did you saw your shorts? You made your pants. He looked at me funny,  said, no, I gave you a way to a ground saucer watch investigators. He turned them over and they closed  into the analyze. But he doesn't remember solving his pants. Now, think about it. If somebody was  going for five days, he'd have to use a restroom. Even if he were knocked out and come out.  Either number one or number two, he doesn't recall it. So this testified, he was also going for five  days. This five days seems to be a norm here. So that means that time is flowing different than  a ship that is flowing here. How it's done, don't ask me. Maybe some physicists would have  an answer. But this is coming from some kind of a dimension in which time, as we know,  doesn't exist. It stopped. Therefore, the phenomenon is always showing a same appearance, doing the  same thing over and over and over again. It looks the same. And this trying was my friends. This is  nothing that was made up from the United States arsenal. It is nothing that came out in 18  as David Marler is talking about in his book. But this is ancient. It's always been here.  So we're dealing with something. It's something tumultuous. These are not space aliens.  They've probably been here longer than we have. Yeah. Every hour culture, every religion,  technology is talking about this and their actual connections, mathematical connections leading  to this.  Like I said, it's going through the earliest recordings that one made from Trent Trino in  Indonesia, a Java man, homo erectus, he made the little etchings in the shelf or something  they've seen.  In the jobs we had other triangles later on, they were known in Africa and came from Africa  170,000 years ago and later on, this transferred into the goddess, worshiped throughout  the world.  You find the same numbers in the Pacific and in Russia, in South America.  In our culture, in our culture, it is a reference to the triangle where we shape the craft.  That's what it is.  It's not any kind of a white god coming over, like on a boat with a beard trying to  a civilized image is after some kind of a calamity of it.  Have you started on your new book now?  No, I'm still gathering evidence, I've got a pile of it.  See, it takes off in many different directions.  You have to be proficient in anthropology, you have to be proficient in biology, in history,  as you're pathology, every possible mathematics, geometry, ufology, I mean, it's a enormous  job.  I can just work on one leg, I may start it with a shield thing, even in the softest sight.  People, you know, you've got to be pulling on people's sleeves and nobody wants to talk  and it's very hard, very, very hard.  It's very much like a spider's web, isn't it?  Everything is just connected.  Well, yeah, unless you're short in a proper way, people want to believe that they're  going to scuff it.  The secrecy, I believe that there's somebody pulling the strings, if this came out and  it was made it out to people in a very comprehensive way, it just could have very negative  effects in entire religious systems and anthropology and history itself in our entire being.  Never mind the military and safety measures that you're talking about through UAP and whatnot,  that's a separate issue.  If you don't shoot at them, they're not going to shoot back at you.  So at this point, I've even lost my interest in chasing your foes.  I've heard enough stories, it's here, it's proven, you know, but what more proof do you  need?  Scientists have seen this.  Yeah, we know that stage are we anymore that they are, they are, it's as simple as that.  Yeah, it is a thing, we have to move beyond this now.  But the problem is, if it's even they, you know, it could be the consciousness itself,  this environment, it which diffuses, it could just take up the shape, remember the Navajo  illusion to the, to the mother of the other.  So of their calling would be a changing woman, changing woman, they can change.  I think these operations, Marian operations, they're using these things to reinforce this  system.  Some, some, the Jack Boleko's control system, they're shaping our destiny, they have convinced  Constantine the great to take Christianity, he had a dream, and they showed up in a shape  or cross.  And our army had seen it, this has been recorded, and this is not just by museums, but  there are certain American values that I can compare to newer and older cases that justified  this.  So Constantine the great takes Christianity and Christianity spreads to Europe.  So they can affect our, our historical moves forward.  And they're also here watching us, because of the destruction of the planet that's going on,  look what's going on, the fires and everything else.  And there's another danger which is bigger, people don't even talk about it very much, worked  on recently, several independent scientists and universities, it's not so much that the  ocean levels are rising due to melts in the ice fields and Antarctica mountains and Greenland.  That's dangerous, yes.  We could be extinct very soon, because as the ocean warms, the Peter Plankton, which is  the beginning of a food chain in the ocean, oh, over the planet, regular plankton, they eat  Peter Plankton and the other animals, several animals, the other, it's a whole food chain collapse.  And the forest, Amazon, elsewhere, only about 40% are responsible for resupply the oxygen in  our atmosphere and that would collapse too and they're already under attack themselves.  Peter Plankton is already migrating north and tropical fish are already found in the Mediterranean  and projecting within 100 years, but most likely less, we could lose our oxygen, we could  drop dead.  Of course, there could be some survival.  and other, you know, maybe in space station, maybe in the moon, some kind of habitat  sort, but not for very long. This intelligence has been around us and it's been warning people  about this. So we're in great danger. And I believe that people, they already have captured people,  all these people disappearing in forests. You can track these people disappearing for  the last couple of years, mysterious experiences. A witness, a reduction witness, Beth Danderson,  about whom Raymond Fother has written five books, describes seeing people in some kind of  plastic or glass containers, people from all walks to life, from every race, from every age,  children, women, Native Americans, blacks, whites, Chinese, all over the world, being preserved,  almost in their time, within these containers, these bees are taken hurt through wherever they are  habitating at the moment. So they could be preserving us for repopulation or life elsewhere,  samples, same thing with animals. It is animal, animal utilization process has also been going  there for thousands of years. It's nothing new. Why? Absolute mystery. Anybody who tells you that  they know where to come from, but they are, it's absolute nonsense. I agree. And it's the more you  think about the possibility is the more mind blowing it is. Yeah. But I have a heap of findings here.  I just need to sit down and organize it. It's very hard. You're dealing with corona dealing with  dealing with joblessness, you're dealing with health, dealing with people who are  irresponsible. It's very hard. Yeah, it's very difficult. Very difficult times, isn't it? Yeah,  but I think there's some kind of a hand here is pulling a wool over it, trying to prevent  from all this knowledge to come out. This by the secrecy is very deeply ingrained.  And we're deeply installed on our communities and our society today. So you can talk about  talk about low green men, about areas in measures. That's fun. And majority in 1995, 97% of people  have no clue what this is, or even have an idea, even the witnesses. There is a bigger picture  to all this. Yes. Yes. And I believe as to do with that, I believe that's to do with birth and that.  I think they know us. Each one of us, this is why there are so many abductions by so many experiences,  so many manifestations that is all over the place. They know each and one of us from the life before,  from this dimension of no time, from which I believe our physical world springs in,  springs into existence and is being maintained. This is something beyond our can.  Almost God like, God like powers, I would just say a discount of pure age, your entire life,  this computer age, geography, mountains, locations. I found GPS positions that correspond  with this, and shapes, and numerical values. The UFO comes, is not just living traces of people  seeing this direction, but that direction it has to do with the position, where it's coming to  elevations. Number of population, UFO is taking all of this into measure, into consideration,  why it's there, and you is coming for you to tell you something. Absolutely fantastic.  I think before you just got to be able to listen and understand.  Oh, if I show you the stuff you would make sense, it's got to hard to just  blow it out here. That's amazing. And you definitely have to come on again as soon as you get  this next book sorted. So, you know, you're always more than welcome to come back.  Thank you very much. Thank you very much for having me. And it is people like you and few others that  keep this alive. This is, I think, the most important issue you're facing today.  I agree. I agree. And it's important that this information gets free,  to be deployed, you know, to as many people as possible.  That's great now. Absolutely fascinating. Great talking to you.  Second, appreciate your help.  All right. You take care.  Thank you. Good night.  You're welcome. Good bye.  That is it for today. All information relating to nebs experiences and links to his book  followed can be found on the podcast website, UFO Chronicles podcast.com.  Just follow the link below this episode in the description. And if you  someone you know has had an encounter and would like to share it on this show. You can email  me at UFO Chronicles at gmail.com and keep updated with the podcast on Twitter, Facebook,  and Instagram. And a big thank you to our guest tonight, Neb for sharing his encounters.  And thank you for listening. I will be back next week. Till then, stay safe and keep watching  us guys. Goodbye."