" But you have access to a spirit, a strength that enlarges and powers you.  Even better, you don't need to wait for the next big movement.  You can heal the world.  It's time for governance by grace.  Welcome to grace-arking with Jim Babko.  Welcome to everyone out there in podcast to stand.  And all of our friends, this is Grace Arky sponsored by the Zero Aggression Projects  at the state.  And by a Grace Arky mug, we have them available now.  And we'd love to share.  Yes.  Get mugged.  Send us an email from airport, wherever you find us on zero-gression project or any of the  websites that are out there.  Yes, there are a question project.  Go out to Zero Aggression Projects.  There's any of those three emails that are on the homepage.  Doesn't matter which one, say you want to be mugged.  We'll get back to you.  We'll report to you exactly what the cost is to get this mug shipped to you.  And then you can decide how much you would like to contribute to the future of the show.  We have some mugs left in stock.  And we don't care what you put in the mug.  You could use anything in that mug you want.  We are here to talk about what a great mayor is Zoron Mom Donny will be for New York City.  Yes, he's going to be the greatest mayor in America.  He's going to be without them.  I don't say that with a Hinnisar chasm.  I believe he will be very, very good for the country.  Unless he's deported because being of mixed race and all that, there's a possibility that  he could be swept up by ice.  Yeah, I, you know, this is that sad.  That's another topic for another day.  Completely.  Zoron, Zoron has the potential to be the greatest mayor in the country.  I didn't say the greatest mayor for New York City.  Yeah, but there is a difference.  There is a difference.  I'm talking.  And since most of us don't reside in New York City, we stand to benefit tremendously from  his mayor ship.  I'm going to be rooting for him.  I personally, I hope he gets it.  You don't like the other potential candidates?  I like the fact that New York gets what it really, really wants.  Good and hard.  And rank choice is helping with that.  There's an instructor lesson.  It didn't make a difference in the end.  A couple percentage points more for him, but it didn't really make much difference in  the end.  He won that race outright in the first past the poll method.  So I also want to say up front, I'm not going to get into his foreign policy views, his  views on Israel and race.  I'm not going to do any of that.  He's better.  He's not running a state.  He does not.  He's not, he doesn't have a defense department or a state department.  There's no foreign policy for New York City.  There shouldn't be.  It's kind of ridiculous that people are asking each of these mayoral candidates what their  foreign policy was.  It's not relevant to the race.  New Yorkers in the Democratic primary seem to agree.  I was actually following one of the mayoral candidates.  There's kind of an accident of history that I am on Whitney Tilson's email list.  Who is Whitney Tilson?  Whitney Tilson's an investor.  He's a very successful investment guy and he has videos where he gives people investment  tips.  But he's a very Wall Street connected part of the establishment.  When ranked choice voting, he was saying vote for me first, Andrew Cuomo second.  Do not vote for Zorran Mondani.  It was interesting because I'm going to do Whitney did not, which by the way, the reason  I was on Whitney's list, just the trivia history is that early on a friend of mine said  he was doing really good on the worldwide sickness reporting.  He was very interested in C and so he ran an email list basically during the entire worldwide  sickness that became increasingly unhinged as time went by.  He went from being a very pro public health establishment supporter putting out data to  becoming an unhinged lunatic by the time the whole thing was over screaming.  The kind of guy that's writing it all caps.  But he's calmed down now and he's back to being a New York cosmopolitan fellow of some  wealth and decided to run for mayor and participated in the mayoral debate.  And then said don't support Mondani because it was used on Israel.  Gotcha, right.  Okay.  So I'm starting to see how great this can be.  We really have to on our day and age separate the individual and their views from what it  is that came to do.  Yeah.  If you're talking about whether or not this guy's going to be elected to president or  he's going to be appointed secretary of state, then all this stuff becomes hyper relevant.  But I'm not interested in his views on these other subjects, any more than interested  in views on baptism or lasagna.  Like it's it's so what?  Yeah.  And what people do.  So there's this meme running around where he's eating rice out of a bowl with his hands  to show solidarity.  I don't care.  I prefer to leave the symbols to the symbol minded.  It's George Carla mine.  Thank you, George.  I don't think it's what we in a grace setting.  I don't think it's what we should be focused on.  I think we should be focused on what are his views and Bill, where others see trouble.  I see opportunity.  Everyone is going, oh my gosh, a socialist, a socialist, they're going crazy.  And then the other side is going, oh, we finally got a socialist.  It's going to be in the biggest city in America.  And I'm saying, well, no, there's some real opportunity here for those of us who oppose  socialism.  like sort of sarcastically or you'll say, let's see an example of in real life and we'll,  you know, resonate or not with what happens. Okay. So first off, one thing I still need to put  on the table. I have to put this one more thing on the table. So it all makes sense.  His end goal is what's called real socialism. Communism is a former real socialism. Okay. There's  several other variants that are real socialism. Okay. His end goal is real socialism.  So a lot of people like to say any time they disagree with some policy on the left, they'll go,  oh, there are a bunch of socialists. No. Socialism has a very precise definition. And again, in a  grace setting, we would use the precise definition. And the precise definition is the ownership and  control of the means of production. And he has been explicit that his political career, his  involvement is about seizing the means of production. Okay. So he is a real socialist. He is a real  socialist and so is Stalin. Okay. So at the end of the day, so was Mao. Right. So was Pol Pot. Like,  the idea here is that there are people in history who have said Castro that they are going to  seize the means of production. They're going to take over the means of production. And we have seen  this even here in our own century. This is not just a 20th century phenomenon. It is extended in the  21st century in places like Venezuela. We have seen people who's come along Maduro. They're going to  seize the means of production. Okay. So when, when the state, he's a 33 year old smiling face, Bill,  right? The fact that he's been able to do this exhibit some charisma, but you need to be aware  that he really seriously means what he says. This is not a guy that's play acting. This is not a guy.  In fact, he goes further than a Bernie Sanders would go. This is somebody who is a  seized the means of production socialist. So in, in, in city, can he do that? Yes, that city has a  lot of welfare programs. And it's also a major beneficiary of state and federal programs. Much of  the rest of New York is funding New York City. This is one of the, you know, talk to people in Western  and Northern New York. They'll tell you, right? The whole city, those states run by the city  in kind of a perverse way. And you, you live in California. So there's, there's major cities that  are kind of driving the, you know, the people in Northern California are very upset by how their  state is run. In fact, they've talked about seceding. So, you know, there's kind of the same dynamic  in New York where one city with all that population is kind of dominated the politics of the entire  state so that part of the state funds the other part of the state to some degree. So, well,  I'm with you on this. But as, as a mayor, there's nothing that for one of a better word,  there's nothing that the mayor of New York City can nationalize. You know, they can't like  seize the stock exchange or something. And then they can, they have, they can start to enter and we're  going to get into one area very, very specifically today in the, in the interest of time, we won't  get into all of his proposals. But we'll get into one area that I think is the most interesting  to discuss because it's the most obvious one to that he shouldn't be trying. But I'll give you,  I'll give you a sample or a taste of another issue. He believes that he can impose a rent freeze.  Oh, right. Yes. Okay. Yes. Okay. If you understand supply and demand, this is a disaster.  Oh, yeah, that doesn't work. Rent freeze means that on existing property on an existing lease,  as long as that person's there, that's the price that they pay. So the only way that you can't  in eviction in New York City is a very difficult multi month process. So the,  uh, feasibly, the only way that you could really change the rules and really bring rents to market  level is to destroy the building and put up a new one. This is under rent freeze. Yes. Right.  And, uh, or you can hope that someone dies because that's like the famous joke. You know, we got  this rent control apartment, somebody dies, but he doesn't want to control. He's not looking to  regulate what rent is. He's looking to freeze it. Whatever it is today, this is the thing.  So what happens is when new people come in or they want to move or something happens,  they, there's no new supply supply starts to go away.  And there's a bubble that begins to build underneath the surface, like a pimple, because  every, the demand is there, but there's not the supply. Yeah. So what would normally happen to  address that is the prices would go up. That sends a signal out to the rest of the world. Hey,  it's an profitable opportunity to be involved in rental real estate. Maybe even you need to  build some more. And people will come in and create new real estate. And there's an equilibrium  that's achieved because of prices. So yeah, we're seeing that in San Diego because there's way  more supply than there is demand for those starting at $3,000 a month studios. Right. Yeah.  Yeah. There's more supply than there is demand right now or more demand than there is supply.  There's more supply than there is demand. I don't know where the people are coming from.  They've been a four day kind of, you know, rent, but there they are. Okay. So what I'm trying to  I just want to be very, very clear here, prices send signals. Okay. And to all the actors in the market,  the person who is purchasing knows I can make decisions and they can weigh out their various  values about how they want to spend their money. Okay. And it's moral and just because supply  demand constantly tries to seek an equilibrium. And as soon as it achieves that, you have achieved  and it doesn't stay, you know, it's in flux. It floats. But at equilibrium at rough equilibrium,  you're getting the best value.  value that you could get.  Both sides.  Okay.  Now, there's cheat codes where one side could say they want, you know, the supply, they  want to make sure that they get the maximum dollar, they can use the state to play games.  And then there's the other side, right?  But, but all things being equal, that's how it's supposed to work.  What he's doing is saying, I'm going to freeze that.  That signal is no longer going to go out.  But I'm also going to take away the ability to increase the rent.  And that's going to slow the number of new housing units that come into the market.  So if you have increasing demand, but no addition and supply, the price would automatically  go up, but it's not going up in this case.  And then you end up with a housing shortage.  So here's what I'd like to say.  There's a concept by Rob Henderson called luxury beliefs.  There are certain things you can believe because you, if you risk or you take a chance  with that belief, it probably is not going to hurt you.  You can go experiment with an idea because it's not going to hurt you.  And he lays out a variety of these types of ideas.  I am suggesting that socialism is a luxury belief.  And if you look at the housing situation, it's very, it should be very specifically obvious.  When supply is not increased to meet the increased demand, that means the people at the  bottom, the people are trying to get in at the entry level, the lowest rental units,  those are the ones that will go away.  Those are the ones that those opportunities will disappear.  And it will be harder to get into that market.  Now, if you're in a luxury apartment, you got a lot of money.  This is not a good deal for you.  Because you're going to afford the top strata where there's not as much of this pressure.  So you're fine.  You're fine.  And honestly, they'll keep building for you.  They're not going to afford to pay any housing.  They're not going to build a lower income housing.  Which is where we are with homelessness in California, basically.  Right.  So Zorran comes from a well-to-do family.  And the only reason that this is relevant is not as an attack on him.  It's relevant because he can afford to be a socialist.  So his wealth, socialist world.  Because he can buy his way out of any inconvenient socialism causes.  Yeah, there we go.  So the socialists are very excited.  They're looking at New York and saying, if I can make it there, we can make it anywhere.  Right.  I mean, this is to them.  This is a big deal.  Right.  But they've made it in other places around the world.  They've made it quite a few times.  Oh, sure.  Northern Europe.  I mean, OK.  So this has been thought of Bernie Sanders has held this up repeatedly over the  the United States and AOC and as an egalitarian paradise.  Right.  So, but it's interesting what's starting to happen in all of those countries right now.  We're talking about Sweden, Denmark, France.  They're spending, they're increasing their military spending, which they weren't doing  for a long time.  Their racism is is is deepening.  And far right extremism is surging.  I just used words directly out of an article from a socialist celebrating this victory.  That's how they perceive the democratic socialist.  That's how they perceive Sweden, Denmark and France.  Far right extremism, surging racism, deepening and military spending rising.  So Bill, a question appears.  If they think that's what's happening there, why in egalitarian paradise is are these  phenomena beginning to manifest themselves?  And the answer is that the left tends to go first and the right is reactionary.  Or let me say that another way, the left manages to push the agenda forward.  They make it more the system more progressive.  That's what they're driving towards all the time.  The rights resistant.  But after a while, they get they get power back and they say, hold my beer and they begin  doing all of their worst possible impulses.  That's just what happens.  And we're seeing it happen in our own country right now because we were under a regime  that was constantly growing the state, constantly becoming more woke and progressive.  And there is now a cultural backlash.  And it's ugly.  It's effin ugly.  It is horrible as this.  We're seeing people with attitudes and behaviors that we couldn't have imagined 15 years  ago.  Oh, my own attitude and behaviors.  But I'm talking about the right.  I'm talking about the intensity of what appears to be racism.  Oh, yes.  And in other forms of bigotry, manifesting themselves, people getting caught up in culture  war, wanting the destruction of other people.  One of the top advisors, not in the administration to the current president of the United  States, is a woman who suggested that the new camp that they're going to open up that  they're calling alligator something.  I hate even dignifying all of this that this is an opportunity to feed 65 million potential  feedings of alligators.  Now, the illegal immigration level in this country is allegedly around 15 million.  65 million is the number of Hispanics in the country.  Okay.  Some people are now saying it was a joke.  It was tongue in cheek.  But you know, we're seeing what we're seeing happening now in reaction to what happened on  the left, right?  People overreact when the correction finally comes.  The correction is an over correction.  People have heard of this pendulum of history, right?  Well, it swings both ways.  That's how a pendulum works.  So the further it goes one way, the further it's going to go.  come back and in these Nordic countries, you're getting the pendulum swing. The reaction  is happening now. It's just like the French Revolution, Jim.  Okay. So you exactly, so you only think of, so the socialists only think about their victories  and they don't think about the fact that there won't be people who come along who won't  come along. They don't. They just don't take that into account. They say, this is going  to be paradise. It's all great. We should all have it. This is the way things should be.  And they don't think about the fact that the reaction will follow their behavior. You're  not liberating people. You're enslaving people to your agenda of what the ideal human shape  should be. And you have a one size fits all, procrastian bed approach. And this is how it's going to  work. So it's sort of a sort of an infinite loop, right? Exactly. It just keeps happening. So,  and it happens because of the error of determining that certain people are not individuals.  People don't matter as persons pursuing their own individual happiness. You are forever part of  this or that group. We slice you up and we think of you as part of a demographic.  So demographics is fine for doing research and so forth. But when you start to implement policies  based on demographics and you say this group wants this and the other group wants the other  thing and this group should pay for it and all the rest. But you start making good and evil  in every situation. And by the way, the people who are bad, they don't tend to respond. The people  that these new world people, the new socialist man people, the people that are bad in their view,  don't suddenly go, oh, you know what? I see now you're implementing all of these things. And that's  pretty cool. You must really like humans. No, they get really ugly. They get uglier and uglier and  uglier and uglier and uglier. That pendulum swings back that direction. So, you know, Stalin had a solution  for this. It's called gulox, right? That's how you solve that problem. These people don't fit.  They won't play along. So we're going to have to figure out a way to punish them. That's what real  socialism leads to. So we're not playing games here. I mean, first it creates short shortages  and reduces wealth. And then it actually leads to hunger. And because there are people who are trying  to figure out how to survive and not playing by the rules, because the rules are so awful,  it leads to police states. Yeah, it becomes more authoritarian over time because the problem becomes  the people who won't play ball. Oh, sure. Go along with it. And for very good reasons.  If you take this pendulum thing situation, we've got going on right now. There's another term that's  begun to make its way back into common parlance. It's a political science concept that's been around  for a very long time, hundred years at least, but I don't even know the origin of it, but it's called  horseshoe theory. And in horseshoe theory, the way it works is you have left and right, right? You  can think of them as being kind of outside. But the shape of a horseshoe is it comes down. The points  get closer to each other. Yeah, closer and closer. Yep. And upside down you with the legs bent in.  Yes. And the left and the right of that horseshoe get closer to each other in terms of their behaviors  and even their values. Well, that's what we're seeing right now, right? The one thing that doesn't  change is they're hatred for one another. Yes. Yes. And as they get closer and closer together,  it's harder and harder to stay separate. Yes. And so what do they do? They resort to violence.  Yeah, they go to war situations. They go to war. And you know, you can go, listen or watch our  Renee Girard episode. We will put it down in the show notes. It's our most important episode in  the history of the show. And the purpose of that episode is to lay out or explain the entire theory.  But this very beginning of the theory is is is is me as me, Mrs. They start the the rivals start to  look more and more alike in their behaviors, their attitudes, their mannerisms. They begin to mirror  each other or or mimic each other. One or the other. But it's a direct response back and forth.  And you'll hear as they're intensifying, you'll hear them talk about well, we have to be this way  because otherwise they'll kill us. Right. We have to be as rude as we're being because they're so  rude to us. We have to be as loud as we're being because they're so loud at us. We have to threaten them  in the same way. We have to get the power. We have to it's constant fight. Like we're going if we don't  destroy, we will be destroyed. And it gets more and more heated and more intense. Yes.  Well, I think all of this is stuff that has to be said from a grace setting. But let's go back to  to the politics. Let's go back to the politics for a second. Because of the nature of the political  machine, the way that it works, the conflict machine, because of the way politics works.  Mom Donny is going to be the most popular character in the Republican Party.  You might think it's going to be Trump. You're wrong.  Mom Donny is the guy that they can hold up because they need an enemy. And he is the perfect enemy because he is the  easiest to scapegoat. And I don't just mean this in the juritian sense. I mean this in the literal.  Like if I want to straw man a human a movement, this is the guy I'm going to hold up.  So I had a friend suggest to me and I understand why he's coming from. I think it's very,  I think it's a normally astute insight that the Democratic Party must be crumbling. If this is who  they're going to put up, but it's not the Democratic Party that put this guy up. It's New York City  Democrats that put this guy up. If you were to run this guy for president.  president, he might have a hard time getting a single state's worth of electoral votes.  He certainly isn't going to win the Democratic Party nomination.  So I don't see him as some representative head of anything in the sense that like, oh, this  is the future of the Democratic Party, or this is the future of the country, save for  the fact that AOC Alexandria, Cassio Cortez becomes famous because she held this role,  which he is now going to steal from her, should he be elected.  And every Republican consultant knows what they will be able to do is they will be able  to write letters to their constituents.  They'll be able to write them in crayon for God's sake.  They'll be able to say, Zoron is coming for us.  Mom Donny, this mom Donny, that mom Donny, the other thing, and they will get people lathered  up.  They will get contributions and activism off of this ideal that they want everybody on  the right to understand the Democratic Party to be.  And he's not going to stop them because it's good for his political career too.  He's going to play into it because it works for him as well.  But one of the things that could happen here should happen here is that everybody kind  of ignores this guy and we steal man, the Democratic Party, for who they really are and  steal man, the Republican Party, by the way, I'm not fans of either one.  And then we could have a real rational debate about issues and we could actually solve, maybe  solve some issues, solve some problems.  But that's also going to happen.  This is about fighting.  This is about war.  This is about sides.  This is about imitation and the best guy to fight is the one that they can make look like  the greatest Satan.  And here shows mom Donny.  He is now their bad guy.  It is the same thing, by the way, is the left.  Their bad guy right now happens to be their most popular Democrat is Donald Trump.  The consultants on the other side have done the exact same thing.  So the new face that you will hear from the right, he'll be on Fox News, it'll be all  over all, you know, all national review, all these people on the right, they're going to keep  talking about this guy incessantly.  And the more that he does, the happier they will be because he will give them hits and clicks.  He will give them views.  He will give them listens.  He will give them all the things that they want.  He will be the best tool that they can use to fundraise.  Well, to end game on that doesn't look so good.  In New York City.  Yeah.  Okay.  I'm sorry to New Yorkers.  I apologize in advance, but I'm just going to tell you, you could move.  There are many nice places in the country that are much more affordable.  You could have land, but the property value in my area, the cost of living is so much  more affordable.  You say, well, I don't want to put up with this or I don't want to put I don't want to  live in Podunkville.  Okay.  All right.  So you're paying a luxury fee to live in this rather crowded place and good for you.  Okay.  But you could leave.  If this policy, if the policies there are so bad, you have the option to exit.  So in our federal system, we have these little almost petri dishes, these laboratories  of democracy.  And so we can go and put a laboratory up in New York City.  The rest of the country is insulated from mom Donnie's behavior.  It will be there that this behavior occurs.  And then we can all sit and watch the experiment.  And on the basis of the fact that we can watch this experiment, this is why I say this  will be a good thing.  Now, I told you I had a joke.  And I'm still not ready to tell it in my own notes, but I'm going to put it in here now.  I feel this important moment to do it.  I managed to delay you by 28 minutes.  So my and it is this, it's told by Billy Crystal.  And it's an old joke.  So it's we're going to hit an irony in the joke itself.  Apparently his daughter came to him one day and said, dad, dad, did you know that Paul  McCartney was in another band before wings?  Now this is funny to people of a certain age.  It is funny to them because they know that Paul McCartney was in another band.  You've probably heard of it.  It was called the Beatles.  He was part of the most prolific powerful songwriting team in music history.  And they had tons of number one hits.  Every year for a period of time, they were the most productive decade in the history  of the music industry.  I mean, so everybody knows everybody's at least heard of the Beatles.  Okay.  There were four of them and one of them was Paul.  Okay.  But the Beatles broke up and Paul went off and started another band.  And you can infer from the story that as she comes to her dad, Billy Crystal's daughter  is but a young teenager.  She doesn't know the Beatles because that happened when either she was either before  she was born or maybe more likely while she was a very small child.  And before your kid, here's the punchline of this whole thing really, not the joke punchline,  but the bottom line.  And that is we're all born young.  We're born ignorant.  We're born unaware of what came before us.  The study of history is incredibly important because you find out that oh my gosh, and even  the study of philosophy to a large degree, people have already thought like how many times  have you read a thought from somebody in the past?  And like, wow, it applies so much to today.  Yeah, it's totally cyclical.  Yeah.  I mean, these things come up.  They're part of the human experience again and again and again.  And you don't really hit them until a certain awareness or age.  I don't want to say age, but you know, there's a pointed life where other things matter  to you than that weren't part of you.  previous life. And if we could elect only people like that, we'd have a whole different government  than people who like, mom, Donnie are running at 33 32. And I'm talking about all his supporters.  Oh, yeah, that too are white and young. Yep. Not minority. Not minority. White and young. That's his  base. Because remember, socialism is a luxury belief. Okay. So white and young. And I want to  focus on the young part. The young part is incredibly important here. I agree. Don't know. Here's  what I know. Okay. I'm a man of a certain age. That age happens as I'm talking to you'd be right  now. 57. I was born in 1968 graduate high school in 1986. So in 1986, in the 80s, if I say to somebody  who was born as roughly my age, if I say, Wolverine's, they know exactly what piece of anti-communist  propaganda I'm speaking of. If I say, uh, Rocky three, I think it is. Maybe it's Rocky four. I got my  Rockies mixed up here. Not a fan. Sorry. I can't help you. They would know what movie it is I'm  referring to. Oh, sure. Remember the battle with the Soviet Union that was represented in those movies.  Rambo was also another derivative idea from that era. Right. Sure. Again. And again, and again,  we were fighting the same war against the communists. There was something going on called the Cold  War Ladies, gentlemen. And there was a wall that was established in Berlin to keep East Berlin  residents from crossing or fleeing the communist government that existed there into West Berlin  Berlin or what was called West Germany at the time. The nation was West Germany. Right. That it  was, it was Germany because they didn't, they weren't unified. They were, you know, there was a wall  that was put up to keep people from leaving. And you remember the iron curtain, right? The iron  curtain was all these nations that were part of the Soviet post World War II Soviet satellite. The  Soviet Union itself was a collection of nations to begin with. Some of whom had deep historical  animosities. You may have heard of Ukraine and Russia. They were both part of the same nation at  one point. And part of what they're fighting over is a piece of property that was given to Ukraine  while they were still in the Soviet Union because they thought they were going to be around forever.  And at the time they felt like they were going to be around forever. But here's what we all knew,  Bill. We all knew. We all knew that socialism doesn't work. We all knew it was an ugly  disgusting, oppressive system. We all knew this. And I'm calling this out in exactly the way it  should be called out like I see people speak up on race issues all the time. And this is how they  talk because racism is that abhorrent socialism has real consequences when it's imposed upon people.  Listen, you want to go get in a happy hippie commune with a bunch of your friends. God's speed,  okay? You chose that and you could walk out the door whenever you want. And that makes it  completely voluntary. I don't care about the socialism. I care about the so-called democratic part,  which means I have the ability to vote to impose upon you my personal values. You are not going to  live my way. And by the way, we're going to start by taking your property. Want to start a business?  No, no, no. You go and work where we tell you to work. You do the career we give you to do,  because that's where this eventually leads. Right? That sounds to me a lot like communism. Am I  missing something here? You're not missing anything. I told you at the outset that he wants to  seize the means of production. He doesn't simply want to have a mixed economy, all-up Bernie Sanders  style. He wants to seize the means of production. He wants to figure out how to do that. So New York  will be an excellent petri dish for all of us from the outside to watch the experiment go on.  And the reason I say to you that he will be a great mayor is that because everyone is born so young,  we have young white people following for this. And we need them to see real time, first-hand,  how this works. Now, will they all get the lesson? No. And I'm going to show you in a minute how  they're going to fail. They're going to fail to get the lesson in many cases. But not everyone will fail.  It's been too long. We've lost the plot and we don't have the Soviet Union. It's a great enemy  right now. And so perhaps the only way that this can happen is for New York City to, and it  is doing it very voluntarily, sacrifice itself. And say, you know what? We decided we want to teach  the rest of the world starting with all the residents of the United States how bad socialism is.  And we're going to see if we can give this guy a chance. So I not only want to see him win.  I want to see him be able to implement his agenda. I want us all to be able to talk about his agenda.  I don't want to talk about him. I'm not interested in attacking him. He may be very sincere  and real on what he believes. And so are a lot of people who are supporting him. They believe that  this is going to, that rent freezes, for example, are going to make the world a better place.  They won't understand until it hits and hurts them. I'm sorry that that's what it's going to take.  But maybe enough people can watch, right? So when you were growing up, I don't know if your  parents had a conversation with you like this, but my dad did. You know, you could look at  somebody else's behavior and the consequences it was leading them to, right? You don't necessarily  have to go make the same mistakes they made. You could watch and go, well, there's something I don't  want to do, right? Because I see where it leads. So we could all watch New York City and say,  well, they tried on socialism. Socialism seems so kind and sweet. And it makes, you know, it takes  care of the poor and it raises the oppressed classes and it doesn't. So all that stuff can,  and all the rhetoric about how sweet it is can be very enticing. But let's see it in action.  Yeah, let's just...  We'll find out what it really is made of.  Now, New York City can still be spared.  They can repent of this and do something better,  but I really don't, at this juncture,  better is gonna end your commo.  And that's just more of the same of the bad  that's been there all along.  Let's try on one of his ideas.  I told you we were gonna focus on one idea  at the time that we have available.  Yeah, walk me through it.  Grocery stores.  So he wants to open government grocery stores in New York City.  New York City is actually pretty well taken care of  in the grocery chain.  They have a very high density between major grocery stores,  local markets and bodegas.  They have a, there's no shortage of supply of food.  And the profit margin, we've gotta say the stuff from.  The profit margin on grocery stores in this country  is about one to two percent.  It's like nothing.  And he is accusing them of price gouging.  What are they supposed to do?  So, you know, if you're gonna say, would you go take a job  that gave you a one percent profit margin?  I guess if you had a lot of customers  that might be worth something to you.  But if you were to go start a stand,  like a hot dog stand with a one percent profit margin,  you would not.  You'd be better off going and getting a JOB,  than running your hot dog stand, right?  Or your bodega or whatever.  So, so this guy wants to open a bunch of grocery,  well, five of them.  He wants to pilot five of them right now, okay?  So, I'm gonna make two predictions upfront.  And then we're gonna talk about the grocery industry  itself a bit more.  Number one, before year five,  and possibly a lot sooner,  there will be some explanation for why the shelves  are mostly empty.  The store is dirty and or unsafe,  and why so few people go there.  Let me repeat those things.  The shelves will be mostly empty.  The store will be dirty and or safe, unsafe,  and few people will be going there.  And you will hear about this.  And he will then not only have an explanation,  they will have people that they blame.  Let me give you the most likely people to get the blame.  The police stores are unsafe.  It'll be the police fault.  They're not doing enough job,  doing enough to protect the people in the stores.  The fact that shelves are empty,  or that they can't keep the stores adequately stocked  will be blamed on the competition from the market.  Stores that actually already exist,  some of which, by the way, will be put under some pressure,  the ones that are closest to these stores,  will be put in some financial pressure  that maybe they will go under.  There may be fewer grocery stores  in New York City by the time we're done with this.  The more success he has in opening these stores,  the more leeway he gets, the more that one will be true.  Or he'll just blame someone else,  but the one person he will not blame,  the one person his supporters will not blame,  will be mom Donny.  They will not blame socialism.  There's some other outside flaw in the system  that we'll need to be dealt with,  but I'm gonna go back again.  Mark this.  You know, we're sitting here roughly 40 minutes  into the program, Mark this.  I'm making a prediction.  It is very likely that the shelves will be,  will have a lack of stock on them  that they will be dirty and or unsafe,  and that too few people will go there.  So let's talk about grocery stores,  because there's some insights.  And I gather these from a reason.  They put up two exome articles,  one of which is by a friend of mine,  very young talented writer.  You will be hearing a lot about is  that the years go by is the inject,  and the Castro.  He says that these stores will operate  without the profit motive.  These five stores he's gonna create.  As if profits are dirty word.  Profit is what allows for expansion.  Profit is what allows for people to create retirement.  Funds profit is what causes people to take risks  and create new things for us.  And so when someone opens up a grocery store,  let's say Bill, you wanted to open a grocery store.  What you're doing is you're taking,  you're not gonna live in your grocery store.  You're not gonna sleep on aisle three  and watch television in aisle nine, right?  That's how it works.  Everybody else gets to trample through your property.  Everybody else gets to take things off those shelves  and in return for some slips of paper.  Or now digits on a card more than likely.  They're gonna walk out with those things.  And you're gonna, oh man, now this thing's not right.  I gotta put more stuff on my shelf.  And you're gonna keep doing that for them.  And they're gonna keep coming in and trampling.  And you're gonna have to clean up after these people.  So this is at your home.  This isn't your car.  This isn't a luxury item.  You've made something available for everybody in the world.  And the reason you do it, your motive is profit.  But somehow this is a dirty word.  We can't have people acting in this virtuous way.  We have to do this with no profit.  Well, let's take the profit out of it for a second.  Say he's running all these stores is a not-for-profit.  So at the end of the day,  there's plus minus year at zero.  But along the way, he still has to earn enough money  from the store to pay the employees  to theoretically give them raises next year.  Yes.  So all the other, I'm glad you brought this up  because this experiment exists in the United States  in five different locations.  Okay, reason reported on this.  I'm just gonna give you one.  Erie Kansas.  And the reason that they have it  is that they're a small city.  In fact, in all five cases, these are small communities.  They're not mega-metropicists like New York City.  We're not talking about Dallas or Los Angeles here.  We're talking about smaller places.  And Erie Kansas, they purchased the grocery store in 2020  because they didn't want it to close.  The city did?  The citizens.  The city did.  The city did.  They operated it for years, but it continued.  to post a loss. So you remember I told you that he was going to say that too few people came through?  That's what happened. The average purchase, the average purchase at this store was $14.  They needed it to be 50. And that's per month. So the customer comes in, that customer has a  certain amount of purchasing power that they're going to exercise over the course of 30 days.  They needed in order to be profitable to be at 50. They were at 14.  And so last year, 2020, just keep throwing money at the back end of that.  They closed it. They closed it. Okay. And that's true of a couple of these five.  There have been open during the 2020s. Okay. In New York City.  So there's ways, there's various industry ways that you can measure whether or not there's effective  grocery penetration. They have a thousand stores approximately serving 8.5 million people.  So there's an 8500 to one ratio. Typically for a market to be viable, it would be 15,000 to one.  So most of the rest of the country as much closer to the 15,000 to one, they've got 8,000 to one.  And it's like taking a wet sponge and adding five drops of water to it.  There's more than one way to do this, but that is one, there's the industry,  I'm not finding the other one here has another way of measuring whether or not they have effective  penetration. But, and we'll put both of these articles and I'm referencing down in the show notes.  But they have enough grocery stores. Another complaint that Mom Donny has is that they're not  taking welfare programs, specifically supplemental nutrition assistance, which is SNAP  and women infants and children, which is often called WIC. But that's not true.  So what is actually the truth is that these grocery stores are not required to take these  programs. And this is true across the country. They're not required, but most do. In the case of SNAP,  100% of the 1,002 grocery stores in existence in the state takes now. And in the case of WIC,  the 82% are taking, are participating in WIC. So is this another case of truth? Is whatever I say  it is today? Yeah, well, you know, he's trying to say that these, all they're just greedy  capitalists, they're, they're price gouging the people, prices of food have gone up. So they're  guilty of price gouging these people. The way he's going to do it is that he's going to  put in these additional grocery stores, they're going to be such wonderful pilots that people will  flock to them because they, they're not interested in profit. And then this will open the door  for more stores to open. I predict this is going to go exactly the opposite. Yeah, yeah, he needs  a lesson and it's got to be an economic one. He needs to learn it. Okay. One more place that I want  to visit before we're done here. And it's not in the United States, Venezuela, because Venezuela went  to socialism. And one of the things they did was they took over the grocery stores. And  the outcome was absolutely catastrophic. Daniel D. Martino of the Manhattan Institute, who was there,  his family had a business data. They manufactured shoes if I remember correctly, but his family  was forced to flee to come to United States for a better life as immigrants will do. And we're  grateful for this particular immigrant coming to the United States and Satan and being part of our  experiment. He said that the stores themselves, the opening of these new stores was subject to  corruption. Their palms greased form. It in terms of not just the store itself, but what got on the  shelves, they ended up having rotten food frequently. They had a very high like on the shelf,  like you go in the store food rots. But what your grocery store does, they're like,  we're just no way in the world. We want this food going out because our customers will come here  anymore. So they take that food off if there's any, if they've ordered incorrectly. Well, you know,  it's the government running everything and profit ain't a motive. Who cares if we, you know, we  ate or didn't order or we ordered too much. And if we ordered too much, you know, let's see if we  can get, leave it on the shelf a little longer. Who cares how soon we get it off, because it's not  gonna affect our bottom line one way or the other that profit motive.  That's not just it causes good behavior. Take that out. You remove a lot of the incentive behaviors  that keep people doing the best things that they can do to serve their fellow man. And he says,  the food got rotten. And eventually people became dependent on these stores because it crowded  out the stores that already existed. Yeah. So this is what this, what Zohran, mom, Donnie is  setting us up for. So I'm watching a video somebody set me. This was just recorded. And we'll  put up the link. It was on X. But it's a Cuban who is in who is fled and come to America.  And it's his visit to an American grocery store. He's been out getting the tour from the locals.  He's got on an athletic jacket. And he's enjoying being in the country. And he holds up  these large sections of meat that were just meat wasn't even available in the market most of the time.  It was a rare thing that was it's not consistently available there. But here are these huge,  huge chunks of meat that he's holding up in two hands, right? And he is exuding sheer joy at the  luxury of what is around him. So it is interesting that the Soviet Union's fall actually is tied  to a Houston grocery store. No kidding.  Yes. So Boris Yeltsin is the last president of the Union of Soviet Socialist Republic.  He comes to visit the country.  At Houston is George H.W. Bush's hometown.  And so they had the meeting in the Houston area.  And Yeltsin says, I do not want the capitalist giving us any propaganda.  I would like you, my staff, to go find us a grocery store when we have a down moment.  I want to go visit this grocery store.  I want to see how the reality versus the American propaganda for myself with my own two guys.  So he was understanding of how his state worked.  They would have taken a government official on a tour of something that looked to be the model.  They would have cleaned it all up and made sure everything was perfect for that particular  visit, not what it typically is on a normal day.  So he's aware of this because he's he's played the propaganda game himself.  So he says, no, pick out a market for me.  So he goes to a Houston grocery store and he has blown away blown away by what is on the shelves and what's available.  The, again, the sheer luxury of the whole thing, just like the young Cuban man we just discussed.  And there's photos of this.  We know that he was at this grocery store.  It was his last state visit to the United States before the fall of the Soviet Union.  And he basically told everybody is like, if this is what's possible, what are we doing?  They were running out of money is what they were doing because communism doesn't work.  Yeah, it's expensive.  And so I don't know.  I said earlier that this was a luxury belief to be a socialist.  I don't think people appreciate what a miracle almost every part of your daily life is.  The fact that you have conveniences that are delivered to you involve a lot of people doing the right things.  Quick story for everyone.  We're recording this show very early in the morning because we sat down in a studio to record it originally at a normal reasonable time of day.  And we're in so early that Bill, you know, he's eating breakfast before we come on folks.  He's sitting there eating breakfast, whereas we're playing the music.  Because it's early where he's at.  And we were very frustrated because what happened that caused this is a piece of software broke down.  There was an update to one piece of software that didn't match with another piece of software and boom.  Bill would disappear every time he spoke.  And I like having him here.  So we, we were rescheduled and we're sitting here two days after we originally planned a record.  And we were upset, Bill.  In fact, I was really upset full confession because I was inconvenienced.  But the fact that we're doing what we're doing right now, every element of this requires tons of coordinated events,  not one, not two, not five.  There's no one person that understands how this video gets to everybody else who gets to watch it.  There's not one human being on the planet that understands that phenomena.  The myth of socialism is that somebody like Zoron Mabani can sit on high and he can tell you,  I know how to build the better grocery store.  And I know how to provide free bus service and I know how to control rent and so on and so on and so on.  Because he individually knows how to do this.  He's so brilliant.  It can be centrally planned and it'll all work out just fine.  If we had to rely on central planning, if there was one person who needed to know every part  of the components necessary to get this show from the two of us and we're not in same state folks,  Bill's sitting in California, I'm in Ohio.  So there's a miracle right there.  And then to get it to a place where you're able to watch it, there was somebody that needed to know  all of that.  This would fail, catastrophically so.  They couldn't keep all the plates spinning.  They couldn't amass all the knowledge necessary to make that happen.  So when you have this Cuban fellow holding up two large chunks of meat or you have the leader  of the Soviet Union coming over and going, what are we doing here?  It is an acknowledgement that there is a miracle happening and the miracles are happening in  front of you all the time and then you can become so common that they're mundane.  They're like pennies on the floor.  You don't even see them anymore.  You just take them for granted.  So we have areas that socialists want to address and some of the things that they're concerned about,  their concerns are incredibly valid.  But you share some of those concerns.  We share many of them.  But if you have a pain in one part of your body, you don't solve it by pounding the snot out of another.  Yeah.  Socialism is bad.  It's destructive.  It is dehumanizing.  And I don't see any grace in that."