" Yeah, yeah.  Yeah, yeah.  Walk up in the morning and to God be the glory.  Thankful for another day to tell my story.  Put my opinions in the universe and let them orbit.  I'm front of the dirt and saw what I dirty my might need.  Orbit, miss, bang, bangs on me like the nigga nor be.  Had to refuse them cause my bitch no restin' she good just as I doubt my son's up  and kiss my daughter forehead.  Tell her we gon' get this money to my back.  It's more bit remember livin' in the apartment.  Now we plan more get you ain't gotta like a nigga record.  It's baby, I'm blessed and I keep that big with me.  We like BTS and Liggs as you sip your coffee.  Fick their cigarette and let a nigga fan.  Yeah.  We back.  Oh, we back glist and eggs podcast.  Episode 73, I'm Yehostia Tekaba.  Who's behind the camera?  The coolest co-host in the world.  Big ice cup cat.  Yes, sir.  Ski.  This episode 73.  Now.  This is the bait.  Trying to get my weight.  Big cat don't be budged.  So I was trying to make the rent.  Episode 73, but Big Cat was like, now you know when it's days.  They like to do the knowledge man.  I want to see no guest on Wednesday.  That's a fact though.  And I was like, no, I raised the rent but no heart.  You know what I'm saying?  Okay, who it is.  You can be whole.  You look goddamn live.  It could be whole.  You weren't put a whole on the side of that.  I will put a whole on the side of that.  We're gonna put a whole on the side of that.  Everybody out of the box.  So we are here.  Episode 73, the actor Kyle dot com for all that merch.  Get that merch.  New merch drop.  We got puzzles.  Here it goes.  The Mate, Kyle.  I shot glad feet on.  No.  A podcast might just disappear.  They're gonna give me my great.  There.  We'll have dessert.  Here goes a piece of wax.  Well, dessert.  We'll just get mac kinda, baby.  I take cow.  And all the power in these hands.  We got new merch.  We got.  We got puzzles.  All right, we got shot glasses.  We got plant cards.  So if you want to get down with some space and that cousin feel today, let me know you know  I said fuck up.  I'll get to the second.  H  Hm.  Big Joker.  Right after I woop y'all ass and kickball him.  Yeah, we bring her home to trophy.  We got the trophy.  Who's we?  Me and my team.  All right, you know, it was full of us.  All right.  We send it.  We sent our name in and so give one feeling that name.  Listen, it's the big ice cups.  Big cat nice.  Cat and ice cups, baby.  The anti column, the panda rush.  Hey, there we go.  The panda rush.  The answer call.com for the merch.  The on t at the on t call.com for all advice submissions.  The new music Monday is coming back.  Mm hmm.  Very special.  There's been a bit on air about a time you see this.  Uh huh.  Um, for yourself, for your music submissions.  Also at the also the on t at the on t call.com.  We are going to create a new email.  Strictly for the music submissions.  So we can funnel them joints right to big ice cup.  Yeah.  With the host.  Yeah.  With the most on new music Monday.  The on t dot cow on all platforms.  Big cat.  G on the score K to 89 on Instagram.  Big ice cup cat one word on tik to.  Yes, sir ski 657234.  X that 6 5 7 2 3 4 3 4 4 7, which is open up that phone call.  That phone line when we're on the exclusive.  You know, the very private stream.  The live just for the kids.  That's why you got to join that patreon eight dollars and that's eight dollars.  We got a couple of voicemails today.  And we're going to keep that phone line open.  I was feeling real Howard Stern.  Mm hmm.  I'm fucking with that.  I like that.  Yeah.  Yeah.  Yeah.  Again, the glisten ex podcast on patreon or you can just hit the link in the bio.  About to be about a boom.  BIA award nomination.  The polls are open vote sending that vote.  We need that vote.  We'd like that vote.  We deserved that vote.  31 1.  Yeah.  Let's go 2 for 2 for 2 baby.  Make sure when NAACP award.  Oh.  Oh.  No, put it in the air.  Put it in the universe.  We got it.  Make sure I want to be to the war and yeah, WACP.  Yeah.  After that, I'm getting a poll, sir.  Oh, yeah.  It's on the Kendrick date.  Yeah, yeah.  After that, Nobel Peace Prize.  Oh, oh, oh, oh, oh, oh, oh.  Got it.  Got the young man put the guns down, picked the books.  Oh.  And it, well, they still got the guns.  No, but they know how to use them.  They know how to use firearm ready.  Yeah.  Responsible gun on them.  Huh?  Part of members of Naga.  Yeah.  Fuck.  Fuck, magga.  Yeah.  I just got off the phone with my brother, 19 keys.  Oh.  I'm feeling very enlightened right now.  You know what I'm saying?  I'm going to flow in.  Yes, man.  They don't even see.  I ain't even sitting in my chair.  You're just hovering into your style in the air right now.  So Saturday, y'all will get episode 74 with Duran Bannar.  Mm-hmm.  What a great, what a great interview.  It was a great interview.  What a cool guy, man.  No, definitely dope.  That man talks in the song.  Yeah, yeah.  For sure.  A lot of singing.  Yeah.  You just bust out singing.  Yeah.  Doesn't care.  Big cat.  Yeah, what did I miss? Oh my god  Did we miss anything do we miss any plugs no, no, what did I miss?  Obviously Drake did  First of all Drake let's just clear the air on some alright  The selfie with the the B12 as abs was nasty. Yeah, just this nasty man  It's like you just don't learn got a tummy tuck  He looks nasty  Etching sketch ass, no I'm saying abs. Yeah, I'm waiting to his story five  You have the arms the match  Matt talking about  300  Yeah, and he said fuck see yeah  BBL me, you know what I'm saying  Drake it's a couple things is just like it's not clicking bro first of all  You're 40. Yeah, okay, so it's okay not to have abs  But if you all 40 have natural have napper just get in that gem  But did I miss a couple workout routines? That's what you missed  What did I miss  The alcohol down put the put the low-pose down. Yeah, no he didn't drink it a little bit was  Virginia  Oh, no, he's drinking a lot of sugar in it. Yeah, you gotta put that down baby Drake. We you know I'm saying the one spritters  Yeah, it's your white cloth. Yeah, come on that salsa my name  You know you like a nice white line spritzer. Yeah  My fresh e-shah  Yeah, put the hookah down. Yeah, put the hookah down. You're 40 my leg. Come on. Don't you try to run up that heel?  To much e-shah to my sister  Well, and I miss  You missed the fact that you have opened up a lawsuit against Vegas for a diss track  Okay, Drake let me tell you a couple things all right few things we'll cover a couple things  We're gonna obviously use to land a Vegas didn't teach you anything you ain't Americanized enough. Mm-hmm. Okay first thing we niggas don't like the Polish shit. No  okay, so  Not like us video dropped July 4th, right. What did I miss?  Drop on July 4th. Come on, but you ain't low  We all got the same internet. Yeah  Okay  Now outside of the outside of the beef nice little bomb. That's a good boss. It's a pop. Yeah, but Drake come on with this on the Bron  Now those are 40-year-old apps. Yeah, yeah  True ass  Yeah, yeah, yeah, million dollar body. Yeah  True abs on it. That's true abs. Yeah, go work out with a brunch. I'm gonna work out on the Broadway  You can't do that number. Yeah, yeah, fuck that up. You could have gotten in there with the Mar  Can't take it in the more distant  Let's Americanize Drake real quick. Mm-hmm. All right  Guns do not scare Americans facts  My nigga you could have had a football field full of guns nobody's scared. That's the average white man  So have a white man in fucking Arkansas  Yeah  It's a white it's a white man in Arkansas right now with just as many guns as you had in that video  And that's light that's just one that's just one bunker. Yeah, one house is one crib  You can't scare Americans with guns go listen to average Joe. Yeah  Hmm never seen that many guns in my life. I was paranoid like a thief in the night  But need it revenge drop the nine ball  You ain't never listen to it. You ain't listen to overly dedicated in our country tomorrow  So you wouldn't know that we're not we don't you went on scary easy when it comes to the  Artillery, right? I literally the American way my brother  If anything niggas got excited when they see  Drink is this the next TI  Next to yeah, yeah, you still from everybody now you still in T. I flow. Oh  Buffer bar yeah, you are bar for bar. He's still from TI  He was the first one with unrecognizable guns. I was seeing that many guns  The baby Drake yeah with the baby droopy. Yeah, yeah never seen that before. Yeah, that's a you could slide me in  He was just there was this and that  I said where would you at with all them guns that can't be Canadian approved? I don't think so  I don't know Canadian law. Oh, thanks. So don't feel like  They don't feel like the Canadian way, but you can't scare us with guns and you can't  Try to call niggas snakes and you have a open lawsuit against niggas for a rap battle  First rap battle also in history real show hip-hop. Wait, you don't want to battle you know more you you're a police  I tell you what Drake  There is a viable path ahead  There is a path for you  We saw iced tea do it to perfection. Oh  You know your police go be a  Drake is the lead detective oh  Got to cut the braids off. He got to cut the braids go low cut. I can see it  Now that might be dope  Tell me you're right. Yeah, get you a nice young 21 year old partner  We know this the only way you'll do it in 21 might be too old. Yeah  Oh  Hmm Toronto undercover.  I'm telling you, Drake, we got you on date. Get used to hearing this.  Can you use to hearing this?  You can see it now. It's a runs on undercover special victims unit.  Oh my god.  Baca here this shit is starting sweating.  I'm still here.  I still!  What if he never blew up?  Whoever's on the flute?  Who else did that flute?  If he was solo, he was going crazy.  That's crazy.  Baca here that got down flute.  Oh yeah, Baca starts sweating bullets.  Yes, we need to be able to see Baca anywhere near a minor.  Oh shit.  I'm telling you, Drake, you got a pathway to freedom.  You just lawn or the SVU Toronto and just stop.  Stop dissing.  Okay, nobody care. You can't dislabor on nigga?  The bra on the golf court.  Golf court's talking about a real nigga.  Yeah, yeah.  I said, I don't think I'll pick up them clubs.  Fuckin' time out.  Yeah.  You learn from Mike.  Oh my god.  You're doing?  I mean, never seen Kobe pick up the clubs.  Kobe was, I'm finna stay in his basketball shit.  Yeah.  I have to pee.  LeBron out there with Steph Curry and Mike Jordan.  LeBron's seen...  And the bits.  Yeah, bet it up nigga.  They don't know that's what they go on the court's.  Yeah, yeah, yeah, yeah.  Yeah, yeah, yeah.  Yeah.  He ain't on, he ain't on there being friendly with nigga.  No, no, no, no.  The bets being placed on it.  Yeah, 100,000.  They say that's where the deals go down.  Yeah.  They're the bets.  They're a bit placed.  They think you know what I'm saying?  What did I miss?  Let's talk about this.  Let's talk about what you might have missed.  This clips rollout.  Fire.  Man, those guys are great conversations.  Yeah, yeah.  Shut up, say something that's so fire.  About this rollout is you got the album title,  let God sort of mount.  And then them getting interviewed by the creator of Fear of God.  Ships kiss.  Magnifique.  Masterpiece.  Magnifique.  And then they speak so at Brett.  Listen, first of all, great job on whoever raised those two fellows.  Yeah, because not only are they scholars up the dope games.  Look at that.  Shakespearean.  Oh, yes.  Yes.  Yes.  Yes.  Take your crack.  Elevate.  Yeah.  Elevate that crack.  Why you made crack looks so good.  Laura Willan makes a round of round with Jesus in the backseat.  Black Jesus.  Black Jesus.  Dress, swank it in the breeze.  Get it.  And then, right around the front of our Virginia B.  He's on the type of dope.  Laura Willan.  Laura Willan.  Laura Willan.  Get the dope off.  You get this back off to becoming very unvought guard about how they sell this cocaine.  Yeah.  Malice, no malice.  As a Mr. Beets.  Has not.  Time down.  He's a rapper.  Poetic.  Mm-hmm.  Megas have you over 500,500,000.  What we call fakasha.  Oh, I had to look that up.  What the fakasha?  What does it mean?  It's just bread.  It's very, very expensive bread.  Yeah, yeah, yeah.  That's the bread that take time.  If you can't buy that out, store.  Yeah, yeah, yeah, yeah.  Now you got to get some yeast later on.  That's right.  Fakasha.  You got to put it in the oven.  Yeah, with the fire.  Yeah, yeah, yeah, you got to score.  Yeah.  Yeah.  Yeah.  Oh, shh.  Shh.  I got to push the teeth with just keeping it.  Without push the teeth, just keeping the ball going.  Yeah.  Dilling with this bush in the industry.  His brother is having a spiritual war.  He's going through a battle of consciousness.  Yeah.  And push the teeth like fuck it.  I'm going to keep going.  I'm going to keep it going.  Right.  I'm going to talk about cocaine as if it is art.  Yes.  It is as it is like a basket pain, then go cocaine.  I mean, cocaine keeps the word economy going.  It does.  That's JP Morgan.  You got 500 kilos like a zero zero zero.  Are you ever singing that?  Yeah, you watch.  You watch the video.  Yeah.  You had a 500,000 kilos.  What the fuck?  And jalapeno pepper.  Plus cans big cans.  Can you sniff that out?  Can you sniff that out?  Can you smell past the jalapeno juice?  Fuck the dog.  OK.  How good of a drum and chip.  I require a different type of dog.  You can truffle pig, nobody else.  But shout out to the clips, man.  Let God start him out.  We'll be dropping wet.  It'll be dropping in two days from the time this is.  Yes.  Yes.  Oh, I can't wait.  And we got our tickets.  We got our tickets.  We are in the mezzanine.  August 14th.  We did.  Oh, well, if you listen to this now yesterday,  what is it, the abso show?  Oh, so.  What a life.  What a life.  Yeah.  We ain't changing just the circumstances.  What did I miss?  Let me tell you what I missed.  All right.  I missed the times when I really believed that Gillian Bala was going to give us a million dollars worth of time.  Goddamnit Gill.  Goddamnit Gill.  Play the clip.  So I think it's no talking about it.  And not so much while low.  While low, he's going to be out in the street making it happen.  My low will run outside in the rain.  Rylo will cry in front of 100 gangsters about how serious he is about keeping him out the street.  But Gillie, what does Gillie do?  What the fuck is he talking about?  Just saying anything.  Just saying anything.  He got the chicken.  He just went through his head.  I'm going to do that by, of course, putting out music, but also helping brothers where I can.  Because I feel like we need more of that.  Like, you know, we was having a conversation off the record before we came on cameras.  Just about, you know, the old generation to the new generation and how it wasn't enough passing out of guard.  You know, so that's something that I wish to tap into as time goes on.  You know what I'm saying?  Like, I want to definitely have a reputation for looking out for, you know, dope artists who coming up, but who's also competitive.  You know what I'm saying?  Like, I think it's not enough for that, especially in the genre of, or in the space in the hip hop world that I exist in.  I feel like it's not enough for us, lyrical, helping each other out.  Because we, you know what I'm saying?  We trying to outshine each other and be the best or whatever.  But yeah, I mean, I think we go all causes this.  And I think it can be dope to give each other the help of hand.  Even if you trying to take my head off, you should do that.  That's what you should want to do.  You know what I'm saying?  So yeah, that's just, that's always been my mindset on it.  Like, you know, I come from that competitive nature of it.  And here's a sport man, and I love the game.  Now that's, that's a million dollars worth of game.  Right.  Even if you coming from my spot, I'm still not over-nother doorway for you because you can't take away the legacy.  Right.  Can't take away the legacy.  Can't stop the motion that I already got, right?  Can't stop this motion.  Especially now, not rap, but shit like, right.  We know who Ray Von is now, right?  Is that what I'm saying?  But, ain't gonna stop us from listening to Joey Bada.  For sure.  And ain't gonna stop Joey Bada from being unique.  For sure.  And you can't, and then ain't gonna stop that finals,  versus that he dropped, tearing all of them niggas ass up for the Joey.  You showed niggas all right.  And I'm really OG and it's just,  I can really rap.  I can really rap.  I can really get with you.  Yeah, yeah.  But have at it, you know what I'm saying?  Let's see how Gillian Guadalupe responded to this.  Let me speak on the passing of the guard, right?  Cause a lot of young and I'm not speaking on you,  but a lot of young and in the game,  people are like, be looking at me like,  man, they've been doing it for so long.  They're one put a young one, they're one pass it off.  They're one, but you guys just stand there one time,  say somebody like funk flex.  Somebody like DJ Cosme Kev,  even at the radio stations for the DJ clue.  DJ Greg Street.  Shops.  You feel what I'm saying?  At one time, they was young DJs.  Just hoping to get on.  You feel what I'm saying?  Oh, LeBron James.  He was a young player that was just hoping to get to the league.  When the nigga do a whole bunch of build up,  they name driving.  Yeah.  He just knows that bullshit.  I don't see how this is going to end positive because,  what do they have to do?  Anything with what Joey said.  Right.  All right.  We haven't fun today.  Now, I'm telling you,  shit if you're gonna get deep.  Okay.  But I started out something like,  you know, last week,  you gave my 30 minute recap.  Yeah.  You know what I'm saying?  All right.  I'm saying now when they get there,  they try to hold on to that shit as long as possible.  Because at the my dream is done at the month.  I also feed my family off this.  LeBron James in his 23rd year.  He ain't now once you said he,  he, this the new king.  That trying to go out there and work.  Okay.  That's a lie.  The Bronzians has a whole show dedicated with Steve Nas dedicated.  They're showing other basketball players  and giving them props.  He'd have told you that it was his future.  He'd have told you,  Lucas, the future like several times.  I also like terrible comparison.  Right.  There's literally nothing you can do  to take away from LeBron James's legacy.  I think it has a billion dollars from Nike.  Yeah.  He has a school.  Yeah.  He's in great shape.  Magnificent.  I'm talking about.  Terrible example, Gilly,  for this Hater shit that you've been,  he's been a drop to Hater of the year.  Cool.  I feel like coming.  I feel some Hater on the year can take like,  this has got to be top five Hater shit of the year.  All right.  I just feel it because you're bringing LeBron into it.  Let's hear this here brother.  Let's hear this here.  Let's hear this here.  Now I'm not saying that you can't uplift some young,  some young, young, young,  get in position.  Put the reality of it is,  ain't new trying to put no other  than in a position to take his job.  I just feel like if you really believe.  that you that then I shouldn't stop you.  But if I'm an OG right and we all work different and I  fuck you mean if you are you are OG.  We gotta put down the weed.  I don't want my nigga steve a nice smell.  At some point you all niggas gotta put the blood down.  I want to know what your real mind thinks right now is very THC and fluence  thinking.  Put the weed down. Pick up a book.  See that. That young is that.  I knew that he's moving to him with the culture right now.  Everything around the board.  The young can't be everywhere around the board.  They're young gotta come take my job.  I can't put that young position to get me out the way and now I'm running around  can't feed my family.  I think I think it's too much money I have for all of us.  You know what I'm saying?  But it's only a certain amount of positions that's right there.  Now you gotta put the same right.  But I feel when I say Tom, he liked it.  But at the same time it's like when are we going to shift from the individual mindset  to the collective one?  I'm not saying I could do this.  I said that.  That's what you just said is that's how you are supposed to.  It's right.  You know what I'm saying?  It's all meaning and minds.  And it's like.  First of all, has anybody that listened to me and I was worth a game?  Stop listening to me and dogs worth a game because they heard grease needs part kids.  Probably.  Or they probably just listened to both now.  Right.  You can't.  This is a lack mentality, bro.  It's a lack mentality.  This why niggas don't respect the OG's right.  When is enough enough?  Well, you gotta ask yourself that this how I feed my family.  But we also had to look at patterns.  Look, if we want to bring in LeBron and Jordan and things like that,  LeBron is not playing the best basketball of his career.  I'm pretty sure he put his I'm pretty sure at the peak of his career though.  Yeah.  He's putting that money up.  Right.  If you really care about how you feed your family and feed your kids,  then when you get in the money, you gotta put it up.  Right.  Can't blow it all.  Right.  You came by 200 fucking cars.  You can't just blow the money.  And you can't make it seem like it's gonna last forever.  There is no proof.  There is nobody that can show you that it lasts forever.  There's peaks in there's valleys.  Right.  When you have to peak of your career and it almost feel unreal,  what they sound like what?  200 not not 200 was like 50 million, 100 million dollar deal.  Mm hmm.  Can't nobody take that money away from you, man.  Yeah.  That's contract.  They owe it.  They're contractually obligated to give you that money.  So when is enough enough?  You're supposed to be like boom.  Hey, see, this will happen.  When you, when you, when you, when you, you want to the mentorship of the white man,  I don't know you over there bar stool sports with that racist day port.  No, it's giving you a million dollars worth of game.  Me, those were for they don't get these niggas.  Nothing.  I'm starving.  Let them starve.  They're gonna put and put over on Caitlin Clark.  Oh, shit.  Wallo was quiet because wallo, yeah.  I think, I think Wallo is more in line with, I mean,  wallo's proven it through his career that he willing to give you some real game.  Put people in position.  Mm hmm.  I don't know them, brother person.  So if wallo is in the same mentality of guillies, at least he ain't,  he ain't show.  Show.  Because that's a crazy way to think.  It's a million dollars worth of game, but I won't give it to you.  You know what changed the show name?  We got a change the name of the show.  Yeah.  Because it telling niggas put the guns down.  Don't go to priest telling me,  that was worth getting the same F for F.  That's free game actually at this point.  At this point, anybody could tell you that.  Shit, your mama was telling you that before you heard it getting wallo.  Put the guns down.  And only Jeff Dale or Hill.  Jeff, jail, death or hell is three options, right?  We've been hearing that since we was 10, 12 years old.  Facts.  That ain't no gang.  So where's the million dollars worth of game coming out?  Now the way that Joey put it out there.  Now that's the million dollars worth of game.  Good game.  That's good game.  I didn't cemented myself.  They can't take it.  There's a lack mentality.  Right.  It's a lack mentality.  This is why I hate the cookout so much.  Oh, now a white person, you're, you're open that gate up for them.  This ain't nothing to do with guillies.  This is a pure example.  This is a lot of old heads think this is how a lot of niggas think in general.  Okay.  A white person can sing a song and do a dance and show a little rhythm.  We'll open up the gate for them.  Flaggays.  Flaggays get open.  Yeah.  Whoa, whoa, whoa, whoa, whoa.  Now we'll celebrate them right into a fucking bag.  And then they'll call they stuff their originator of it.  Mm.  You talk about I'm not gonna put in position for what a podcast.  Put him in a wap.  It's fine ain't no nothing niggas up there at Barsto sports  Because y'all are over there in the own system where it's only room for one nigga at a time  We seen that in Hollywood when it was Eddie Murphy  Yeah, it was Eddie Murphy when it was Martin it was Martin when it was Will it was Will when it was Kevin Hart  It was Kevin Hart  We enter into a new guard of things where it's room for everybody, bruh. It's room for everybody  Everybody can eat it's eight billion people in the world, bro  And only niggas thinking I ain't enough room for everybody enough money for everybody  You can't even write niggas  You're gonna walk okay right now niggas check that the bar still wrote down no, no  But it ain't enough money  If they could write the check for you they could write the check for somebody else especially somebody coming up under you  The issue is  You don't got the money  You're looking at the numbers  And you know that the show in and of itself is past this prime  Now it's a staple like the breakfast club right you know  I'm saying it's still gonna be people that tune in because they like to get on with one of those  They like the dynamic but while you know  First four years of podcasts we can only hear so many prison stories. Yeah  So now we got to get into the real game part  Gilly had to shit million dollars worth of game. He was doing Instagram. They kind of blew him up  Because he didn't make it in the rap game  And they blew up and they had a and they had a time and they become a staple  You know artists when they go on they put when they go on they roll out  And they doing a press tour million dollars worth of game is a stop, right? That's that solid y'all are part of black media. Yeah  What are you talking about you you can't leave room for niggas? I bought all this shit myself  Oh  We don't want to be on bar so we good you don't got to work about us  It's this is a gate to get this latin mentality  Why the young niggas don't feel like they can listen to the og's cuz you'll say something like that  Loud and proud he got the youth he got the streets. I can't fuck with him in no type of way  So I got a block his blessing  I got to make sure I keep the gate closed so I can secure my position. How about this?  After you signed the X X amount of million dollars worth of con billions of dollars worth of money  Put the money up  Invest the money properly  Invest the money properly make sure that your kids gonna eat for the rest of your life  So you ain't got to worry about that  If you can't do it with 50 million you can't do it with 500  You do things and small and how you do small things how you do big things  We know that the overflow don't don't last forever so why we in the state of overflow. We got to put some none  The even squirrels know the winner is coming in you  Telling young niggas  You you more talented than me you more gifted than me know that this the thing this the this the big who raw and  This is the this the bubble that just burst in real time niggas realized they ain't getting a million dollars worth of game out of y'all  That's what it really come down to now we've been lying in proud supporters of wallo  I've been I've been loud. I haven't really seen I think Gillie's funny  You know he got the cultural context. I used to like watching them when he was beefing with niggas on the DVDs and shit come on  Yeah  Yeah  But gilly since when?  Was it okay for Daniel son the challenge Mr. Miyaki  Damn you started block Cassidy shining Philly. Yeah, cuz he's saying no you that's always been who he is I guess  Man gill come on cuz that ain't it that ain't it  It just ain't it that ain't the way we have to undo that way of thinking that's a lack mentality  Because now you making it seem like the the the the blending saying the blending  Like you the only one can get a 50 million dollar check right?  But if the next year I'm eager what people I'm gonna stop listening  Just got somebody new came along this is media  Charlotte man perfect example  What did Charlotte man do?  You can look at fuck fuck who he is as a person in whether you like on my dislike. I'm right  When when breakfast club was on that syndicated shit and they was the biggest show in the country  He took that influence and power and built this on network black effect and what is he do with that?  He puts other up and coming people in black media and  Positions to become the next Charlotte man you understand so to speak it is not necessarily  Recrame how he do media but give them opportunity express themselves in media absolutely right not worried about them taking his position  He's charlotte man to god  You know who he is you'll get lit again get lit a king  Damn you just gonna lift him out up  You gonna lift you gonna lift he gonna draw the bridge back and let Nick is falling to the mo because you the king  Come on, cuz I don't need the way to do shit now. We got a change name of the show  What we go change it to?  Maybe a little bit of game  Just a little bit  How to make a really me is a little bit  Ties on bitter might not even get you no game  This is a, is an issue, you know what I'm saying?  Is a gatekeeping mentality, right?  Gatekeeping.  Um, but in order to become a gatekeeper,  yourself, somebody had to hand you to keys.  Hmm.  So imagine if the person who put you in position spoke a good word for you, I imagine if  the gatekeeper that came before you would have extra out.  Or maybe you feel like ain't nobody put you on your position because  Nick has let it had his self-made mentality.  Self-made.  It's a boss.  It's a boss.  Well, he's an employee.  I wasn't going to say it because it was, it was the, I know he was taking it.  I don't, I'm going to say it.  Barstool sports.  Employee of barstool sports.  Me, though, where the game made, I was perfect.  Man, it's not like the odd brothers man.  We hope y'all, we want most success and more blessed to come to you so you don't feel  like somebody coming to take.  For X.  But the fact that you think like that means somebody is coming to take that spot.  Yeah, he's got the pressure.  You under the pressure.  You feeling the pressure?  They had a meeting.  Yeah, we got to do something about them.  I'm going to take a look at this.  Can't let them just take a spot.  Yeah, I'll take a lot of spots, huh?  Nah, just what?  It's too late, man.  It's too late, man.  It's too late, man.  Nooning the new world order.  We putting a lot of cream.  No, man.  We just over here doing our own thing, man.  Yeah.  And y'all love it.  You know, people get shot out of the joke, man, for standing on that.  All right.  Let's talk about the importance of being a great character actor.  It's all our character actors out there, right?  Now, for people that don't know, the character actor, maybe the person that appears  in the film, to the ads, to the story, you know, we got our star and the journey that they're  going through, right?  But without the support and cast, we see this in straw, okay?  So the movie straw.  As good as Taraji did, she did it at such a level that besides the bank teller, everybody  else was like, God damn, man, she's, I mean, leaps and bounds ahead of them as far as acting,  right?  Yeah, yeah, yeah.  We could see the acting.  We didn't get immersed or lost in the universe of what Tyler Perry was trying to create  because there was one clear star there.  And without character actors and without people who helped build onto the blocks of  this universe, we don't get lost in the story.  We're not captivated by it.  You need a good character actor, right?  There's people that make careers off of character acting for sure.  Somebody like a Jeffrey Wright, even though he has been lead in some films, think about  him in the Man's Shurian candidate.  You know, think about him as people's Hernandez and shaft.  Think about his role in Westworld.  He be smoking shit.  But think, let's think even more about his role in Man's Shurian candidate where he really  brought you into that universe like damn, damn, damn really done God in some shit.  Look at what that does to me.  What was they doing?  Y'all on that island?  Yeah, yeah.  You know what I'm saying?  Think about, um, there's just a bunch of people that have made careers out of being great  character actors, great support and cast members.  And they didn't show up and say, well, I should be the lead.  They showed up and said, this is the role that I got.  I'm a Plato.  Fuck out this role.  Shit.  Big guy's cut.  There you go.  The thing is, is that, you know, in order to be a great leader, you have to first learn  how to be a great follower.  You have to be able to follow direction.  You have to be able to address the spots where you are subordinate and be great at  subordination, right?  Um, because it's subordination ain't going to get you nowhere, right?  Right.  Um, but so long as the goal is to be a leader, you know what I'm saying?  A lot of people don't have aspirations of leading anything, which is why they can't follow  anything.  So if you show up in your role, it's to be, you know, guy number three, you can't just  phone it in because it matters to the context of the movie.  It makes the film.  Once we see acting, it ruins the fantasy for us.  It ruins the film.  There's a lot of people that play their role in centers.  We are understood that Michael B. Jordan being the twins with a star.  But let's talk about Del Rey Leno.  Without Delta Slam is that movie.  What it is without Mary is the movie.  What it is without any is the movie.  What it is we need great character actors to play alongside the lead.  And sometimes in your life, you're going to find yourself being a character actor.  And how are you going to show up?  Cause you can't be a great character actor.  Damn, showing it's going to be no good lead.  And there's people who make careers.  I've been just a aim.  I'm put I'm on the books.  You feel me?  I'm showing up and I'm going to be in support.  I'm the part of the support and cad.  Somebody like Morgan Freeman has played great character acting roles throughout his career.  And because everybody ain't gonna be Denzel some people just got that it factor where hey they to start for life right  But this the the point of the film a  good film  Where you gotta remind yourself you watching a movie  You know I'm saying because great film really pulls you in like goddamn  Nick I am on the whole another world right now everybody is acting they ask off to the point where they believe it so you believe it right  and and and and this is the part  Where where they missing on me and dollars worth again. You're not gonna be the lead forever  You're gonna have your season of leadin and sometimes you go back and you gonna be in the background with him to follow his done  It wouldn't the phone  Started out character actor had his lead roles went back into the character actor, but he maintained a career  He didn't take it for granted when he was in front when he was in the spotlight, but you also have to understand don't last forever  But with efficiency consistency good business practices showing up treating others  properly on work forever  Gate keeping and cutting people off at the knees  Guess what be careful how you treat people on the way up?  Because your day is coming when you on the way down and they're on the way up  And they gonna remember how you treat them. It's important  It's just in the game of life  To understand when when you and your season of character acting. I haven't been there before  I don't support it plenty of people and when when when the spotlight was on there. I ain't hate I  Wasn't mad about it. I  understood what I wanted for myself and I understood that this is an opportunity to take this opportunity to learn  You can learn a lot of things from watching other people and how they operate when the light is on there  And now that I'm my season where the light on me and  Trust me I  Could feel it. It's only gonna get brighter  It's important for me to the people that's outside the spotlight that I can pull them into at any time I need to I  Could pull a big hat huh?  New music Monday  We got a little surprise or even though they don't even know they don't even know what to have with the new music  What they don't know how to pull my brother into that light  But you also  Have to understand that people are not gonna use your brain to do their thinking  So there's an issue with  the in the intelligence of having an ego, right?  That that ego of intelligence where you want people to use your brain to do they thinking  And we quit your car people were stupid when they don't think the way we think right?  cop people dumb and  Disregard their experiences and the things they've been through in life and things like that and I'm guilty of it as well like sometimes  I just feel like they're doing something stupid  You know I'm saying but they're not gonna use your brain to do they thinking it we got to give people grace  But we also have to understand  That it's okay to leave people to their own devices sometimes, right? You can explain it  You could great use great analogies  You can give them a whole playbook and they could throw the playbook away and say hey  I got my own place written up already and you got to be graceful enough to say okay you do that  but also  You got to be generous and kind enough in your heart and not say I told you so if they circle back saying you was right  Because they not using your brain to do their thinking and  We we we falter a lot with that with because because we see other people's potential and we know what we would do with that potential  Not a let us down when they don't follow the blueprint that we would have set up for them  Right, right and we do this align relationships women do this a lot  They see a man and because of the way that way that you think about things because of the way that you would capitalize on certain  Talents or skills because of the network you don't build for yourself because of the things  Experiences you don't have and things you don't learn and gather the tools you don't gather throughout your life  It's like oh, I know exactly what to do with his skill set  I know exactly what to do with his potential and  Then you start living in a reality of a potential you projecting on them because of your brain  Hmm  Now you resent him when he don't use your brain to do his thinking  Or you resent him when you build them up and then he leave you  Building niggas  I built a nigga building nigga workshop  Left before white bitch  Can he told ya building the workshop left before red bone  Building the workshop left before Latino. Oh  You  Because you want him to use your brain to do his thinking you want your home girl to use your brain to do your do her thinking  I'd have had plenty of niggas that I wish would just take my brain for a moment  But I got it also understand the times when my brain wasn't giving me nothing to work with man  But nothing give me nothing bad ideas and we all been there you grow past it your brain is yours and  It's and it's and it's got a lot of insecure with show experiences your memories  Knowledge your information only only you got that use your brain and maximize yourself and be thoughtful and mindful of others on your way up  You could call you could pay the road for a month. I can't make them travel it you could bring a horse to water  You can't make them drink that's okay because guess what?  The same way you let that horse to water. There was another horse close by watch. Oh shit  Then all I had to do was follow down is with a water and somebody gonna want to drink that motherfucker  Mm-hmm  And they're gonna get you to credit, but you got to be patient you got to be kind sometimes the people you wanted to happen for ain't gonna happen for  But don't close the gate on them don't be fearful that they're gonna take care of your take your position  What I'm up. I can tell you what they going through  All right  to shop at ancient men.  Ha ha ha ha.  My finances.  My finances.  We were in the blooming deals and I was like, oh my god.  Ah, it's so expensive.  I'm gonna go back and shop at ancient men.  It's a monkey business right there.  God damn it.  God damn it.  I'm not gonna tell you about that struggle a bit.  I'm gonna stop at ancient men.  Ha ha ha.  My finances.  My finances.  We were in the blooming deals and I was like, oh my god.  Whatever.  Feel the best fashion.  Look man, um.  That's some crazy,  what am I gonna tell you, my life was off?  I had this up at you now.  I feel you oh girl I relate.  Oh girl let me tell you,  I had to shop at ancient men.  Praise Jesus.  I ain't gonna lie.  They would have had to end the recording.  You know the box would be some on ass.  I've been on my really trauma dump.  I would have snatched that week.  Yeah, yeah, yeah.  Just, yeah, this is a struggle to live,  but you're gonna bring up H&M.  But don't tell me you are coming forward to beating them all.  I can't afford to get to them all.  I really shit.  That goes your mic.  LAUGHTER  The intake strikes again.  LAUGHTER  Ahh.  LAUGHTER  Five-time.  Five-time.  Five-time.  LAUGHTER  I tell you, man, you know, we have to do better as a community  with our response to abundance, right?  And understanding.  You know, Justin, just in, um, come up here now.  What if I was, well, I wanna be the one that.  If anybody's gonna start an organization, it's gonna be me.  I can't have Justin Elizabeth Brooks up here talking about how he's doing things  for the kids in English, would.  Fuck Justin Elizabeth Brooks.  LAUGHTER  That's like crazy.  That's how crazy he's in his head.  Yeah.  No, you got a platform.  Okay, come use the platform.  Mm-hmm.  So we get the money to these babies.  Right.  Oh, speaking of, who mojanao?  Mm-hmm.  What happened?  Oh, we 60% there, baby.  Oh, man.  All you gotta do is give a dollar.  Mm-hmm.  Power of a dollar.  Mm-hmm.  I wanna have some more details lined up next week.  But I'll tell you, the power of a dollar, 65, I think it says 65% of the go.  65% or 69, one.  Let's do it.  Well, we over halfway there.  Let's do it.  Thanks to your donations.  And we appreciate your support.  I, you know, I'm doing what I can to support that, brother.  Y'all have done what y'all can.  And every dollar counts.  Every dollar counts.  You know what I'm saying?  We talk a lot about tied in an offering, right?  Grandma used to be faithful about tied in an offering.  What can we as a community use 10% of our income to do some good?  Well, I gotta give it to the pastor.  You can give it right back to the community.  What does that look like?  You know what I'm saying?  What does that look like?  You need to find the organizations that are doing for the community.  We give you one right there.  You made $100 this week.  Give $10 to the, it was a mojo now.  Help them babies.  They gonna have their book bags.  Good food, health and wellness centers.  We gonna get their mind right, you know what I'm saying?  Kids out there, I think that we disregard a lot to its food insecurity.  Yeah.  And a lot of these kids ain't gonna eat as well.  When school is out as they will when school is in because they depend on their meal.  And think about the effects that that has on their mental health of a child.  Think about the inclination to just go ahead and jump out there and get in the street and say,  fuck school.  Right.  You know what I'm saying?  Cause you see him exe.  But I would say right now just start with a dollar.  Let's build that trust up.  You ain't gonna miss that dollar.  But they gonna benefit so greatly from it.  Right.  Just one.  Who will be right back after this commercial break?  We back.  All right.  So conversation we was having last week.  Um,  I saw a lot of people start.  They wanted to talk about the class warfare.  And they say like the real issue,  the real warfare is class warfare.  And I, you know,  these things work as a peer to me, right?  But.  Foundationally,  um,  they like to separate people in class and they like to cast people to the lower cast based on race.  Um,  and we,  the first layer that has to be addressed is,  um,  the racism issue and specifically poor white racism,  which is used as a veil.  Four classes, right?  The,  the rich upper class white people as racist as they may be.  Are gonna give opportunities to black and brown people if it can make the money.  Right.  Um,  the,  the racism aside.  Now you might can't give them certain rooms.  You might not be privy to certain conversations.  You may be being used as a pawn,  but they will pull you up if you can make them some money.  Um,  and,  and if you take on their mentality,  which is more of a capitalistic thing,  if you,  if you take on that,  that serial capitalist exploit of mentality that,  that mentality of individualism,  they're welcome to you on end.  The black blue light does exist.  But let's talk about poor white racism and the veil that it creates for the  class,  whereas a shield for their egos and their inferiority complex.  It's hard to be racist when you start to see things like a LeBron James, right?  Or,  and,  and that just,  contextually in sports.  But black people being great in every facet of it.  Black people being great in academics as well,  in engineering, all these black inventions  that are actually propping up your home right now.  You gotta donate a lot of innovation  that exists in this modern world to the mind of black people.  your Zoom call, your basic algorithm for the internet,  the code itself, these come out of black minds.  So it's hard to prop it up as racism  and as black people being inferior to you  when black people have done so many superior things  to that of the average poor white.  And the poor white only has their skin to hang on to.  And I have the accomplishments to hang on to.  They haven't really been, this is why they like to say shit  like what white privilege, like I'm poor,  and my family on drugs will be going to prison just like,  you know, and they like to liken it  to the struggle of black people  while having no context or any resemblance of that same struggle  and actually perpetuate that violence  and racism against those people who they say  they have no privilege over.  And it's just an inferiority complex.  And we need to make, we want to make class the bigger issue  because it is a big issue, but it's like a pyramid scheme.  And it serves as a need to ignore how vile  and ultimately evil racism is and has been  for the black American and other groups of people  of color throughout this country.  And people throughout the diaspora, colonization  and in and of itself is just vile and evil.  When we talk about the cannibalism,  you know, just getting down to the point of eating a person,  we talking crazy.  We talk about the trail of tears.  In fact, in blankets with like all these different diseases  that these people carry and passed off  to give people smallpox by the thousands.  You understand what I'm saying?  The disgusting nature of race may be the reason  why people want to hurry up and skip past it.  Because if you really examine the evil that people have done  and what's been permissible  due to their racism and due to their, you know,  rationalization of it, right?  They try to rationalize it academically.  They try to prove scientifically  that black people are inferior yet so and subhuman.  So we can do these things to them.  You know, but this is how you get your advances in gynecology.  This is how you get your advances in some cases in sociology.  Used to be seen as crazy for not wanting to be on the plantation.  So they rationalize these things as a way to carry out evil  and to justify their position and power in this country, right?  So as we get, you know, post post industrial revolution,  post industrial revolution,  reconstruction, black people coming up with all these inventions,  black people gaining capital for themselves,  black people building communities for themselves  and those communities constantly being destroyed out of pure envy.  This doesn't match up with the narrative.  These people are subhuman.  How are they gaining capital?  How are they building towns?  How are they reading books?  They're supposed to be subhuman.  They're supposed to be an inferior.  How are they building?  How are they surpassing me?  Then we get to the technological age, right?  Black people blowing up on all these different places.  And it's the racism that will keep a black person  that is a creator from reaching the same amount of like,  you know, financial heights that some mundane and mediocre  white creatives do, white creatives get on there,  talk about nothing.  What they got to do is be conventionally attractive  by the European standard.  They throw millions of dollars at them.  Black creators put a lot of, a lot of time,  creativity, nuance, complexity into their content  just for a fraction of it.  And then when we go back to situations  where we talk about gatekeeping,  the people that could give the opportunities don't  out of fear of losing their position.  Because these people are younger,  more in touch with the culture,  more in tune with the post of the streets  and the youth and bringing skillsets that these,  these other people don't have and don't know how to have  because they didn't grow it with the same technology.  They fear themselves being replaced.  The reality is unless you're just gonna be a relic,  everything gets replaced.  And you should allow people to replace you with grace,  but that poor white racism, right?  It's insidious.  It's infected to brain.  And it's also an indicator of poor socialization  and uneducated thinking, especially when it's internalized.  How many black people are walking around  with the minds of a poor white man, hating themselves  and rationalizing others hate towards us?  Rationalizing violence against us,  hanging out with you, recreating things like  George Floyd's death.  You ever seen that?  You seen him saying, doing shit like that?  How much more insidious is it when it's internalized?  And you try to justify this dude on the internet right now  on TikTok, just terrible head of hair.  Black dude, terrible head of hair.  The most discriminated man in this country by far  is the white man.  This is a black boy, said this with his full chest.  get a little vial when it's internalized.  So this is a fight that black people are up against too.  Not only are we up fighting against the class issue and the race issue, but then they internalize  anti-blackness that we deal with from our own community.  When we stumble upon new information outside of our community, we take it and we run with it.  Somebody makes a point that sparks your interest outside of your community.  You want to hear where everything else they got to say.  Somebody within your community say something that you agree with sparks your interest.  You ain't going to say the wrong thing.  You ain't not any downfall.  So even if we don't get to a central point where we need to get keepers held, y'all get keep  ourselves all the time.  is Jay-Z said, crabs in the barrel mentality, right?  They can tell you the crabs don't belong in the barrel.  We got to address the barrel.  Why are we even in here?  Yeah.  What a fucking mind of barrel?  Yeah.  The prepare me for the air fryer.  I understand the anger that comes along with this knowledge, right?  The anger when you go back and you study that history and you see how vile some of  their actions were against us, how disgusting some of those actions are.  It can make you hate white people.  That's why we don't like watching out at trauma porn.  I'm not enslaved movies because that's how you mad at white folks.  But the reality is you need to know what was done.  You need to know the mentalities that are out there against you.  You know, go watch a movie like the order.  The order was showed you like in these places unseen in these places like Utah, Idaho,  Southern Oregon, things like that.  These people really exist in pockets of white supremacy,  area nations, Nazis.  These people really exist in pockets and they hate you and your existence.  And they wage, they gain a lot of capital.  And are able to put people in positions of power in politics through lobbying and support,  right?  So yes, the class issue is something we have to address.  We have to understand that like the reason why they don't want solidarity between people  of color.  The reason why there is a push and an agenda to create a narrative about the black  American.  So everybody stays away from us.  So everybody looks at us as something to look down upon.  You know, if we want to put it on two sides of this coin and the black side is here and  the white side is here, there is always a push to assimilate to that white side through  capitalism through, you know, through anti blackness and things like that.  But the race issue is where it starts because the race issue is how you internalize anti  blackness.  The racism is how you buy in to stereotypes about black people that haven't been proved  to you, right?  Also, you go set up shop in the worst of the worst.  The most poor and the most undecaded black people you go set up shot up with there.  Yeah, you will have confirmation bias of those stereotypes because that's what they hope  to stand that that's what they hope to assimilate.  That's like the entry point to assimilate into whiteness.  Why I want to be like these niggas and ignore all historical context and nor the world  in North Carolina, ignore Jim Crow and go back to the root and ignore slavery and it's  a fix.  It's very present day effects.  You ignore all those things.  So you can't assimilate into whiteness because assimilating to whiteness is assimilating into  the upper class.  And the class issue is a big issue and the class issue is is is is the bigger war because  by perpetuating racism, we stop people from thinking about class and we stop and they  don't see themselves as equal to each other.  When we are shout out to the to the garbage men and the union out there and Philadelphia  that is on strike trying to get their wages.  We should support that.  Yeah, it's a little uncomfortable.  It's think a little bit.  But these people, but do it without them.  Can you do it without them?  What do you know your look like even if you live in the suburbs?  What does it look like outside your house if they don't come for a month?  They deserve a good way.  They ask him, look $100,000 ain't crazy in today's economy because it really rounds out  to about 65, 75 at the taxes and once in just before inflation, it might be a little less  than that.  So as a people of working class, we have to support each other and all of our efforts.  We have to understand that like even with these ice rays and things like that, how it's  going to affect the Haitian American and it already is.  How is going to affect the everyday black American if you give mistaken for being an immigrant  and and birthright citizenship don't mean shit.  So fuck your fucking birth certificate.  But if we can't see beyond like everybody wants to move on to the class issue, y'all  not looking beyond race.  So it's a class issue and then we'll get the if we get the class issue figured out, you  can't figure out the class issue without solving the race issue.  There's a real solidarity that can contain anti blackness.  There ain't no solidarity that contain homophobia or transphobia.  There ain't no solidarity that contains  misogyny or massage noir. It just don't exist.  And all of these different obstacles that they put up in this in this working class to keep us divided  is how they are so able to be successful in the class war.  They keep us fighting each other over menial things and over things of identity.  And if we keep fighting over our identity, then we won't really see how we're identified in the bigger picture, which is as they working class.  The lower 99%.  People that make everything happen that day to day. You remember when niggas was essential workers.  I was driving trucks. I ain't COVID. I ain't stopped meeting. I was going to state the state still.  If it's essential in the time of need when the country got a shutdown,  then it's essential every day of the week.  And we have to be able to put ourselves in a position where we respect everyone, no matter what their occupation is.  Billionaire worship has to be out the window.  Because what are they doing for you?  Crating big, beautiful bills.  That's what you get out of a billionaire worship.  And that's what you get from poor white racism. People that supported just because the faces of those billionaires are white.  Because if it was Jay Z and Oprah present that big, beautiful bill, they executed them niggas.  So even when we even when we come up to the issue of class,  and racism being a proxy war for the ultimate war, which is class warfare.  And that's how the top 1% of 1% thrive because you can't get past the identity of a person.  Because you can't get out your own way about how it affects your identity and who you are.  You've been sold a lie. You've been sold a fallacy of white supremacy.  But inaction is white inferiority.  The rich going to keep getting richer.  And you know what I was going to be so poor? You're going to have to live in virtual reality.  She's like black, black, million, black mirror. You'll be like Daniel Kula on that bike.  He's not Apple.  So I make cool little bill. We're gonna, we're gonna take a quick break and then we're gonna get into this advice.  Ow.  We back.  Advice for a creative trying to stay creative.  Good afternoon, Mr. Kyle. Hope all is well.  I just wanted to reach out and tell you how much I love your content and what you've been  doing for the community and the culture. You along with other in your space have helped me  tremendously with figuring out who I am and what I want to stand for and how I want to navigate  and aim my community. I recently graduated with a BFA. Just said, I'm cool.  You trying to sneak past the camera. Let me just go and get past it.  And then you're trying to creep this way.  Pay as the guy damn.  We already said you was in the building, baby. You look good, man. You look good.  I recently graduated with a BFA and fine arts majoring in advertisement,  advertising. I'm pursuing a career as an art director. Hopefully in the near future.  I've been creative my whole life and listening to you has kind of helped me find some inspiration  to create more. My question to you is how do you stay creative and motivated when everything feels  like everything is against you. I know life after college has its ups and downs, but it's still a  bit disheartening. The job market sucks. Thanks again for just spreading positivity and trying to  help us look at things in our community a little differently. I always recommend job to everyone.  I talk to whenever I have the opportunity to also want to send you some artwork I created for you  in Bigcat. Try to do no IG but can't send photos through DM's which is understandable.  Just want to show my appreciation for what you do. And I know that you already have someone who  does all your art and graphics. I don't want to step on anyone's toes or be disrespectful. She  doesn't amazing job. But if you ever need any artwork done or posters made for any events you'll  be doing I'd be happy to help. Do I have a blessed day? It's artwork is dope too.  Yeah, it's pretty good. Pretty good. The thing is, if you were creative, you're going to stay  creative. The world punishes creativity because they need us rigid. They need us robotic.  You know what I'm saying? Jobs got to get done. We were just talking about it. They need you to  remain working class. Creativity expands past just working. Creativity is the exit  the art of creating. The only creation that this country likes to praise is the creation of jobs.  You know what I'm saying? This will create, you know, we're going to put a toxic chemical plant right  next to this black neighborhood is going to create a thousand jobs. Yeah, and I don't think it's going  to have cancer about 35. But we're creating jobs. And we also are creating an entryway into the  big pharma. You know what I'm saying? If you're creative, you're going to stay creative. I think  more than anything, your will to be a creative has to be greater than their will to  make you work in class or just make you a worker be. If it ain't in your heart, right? There's plenty  of people out here who cool with what they do. They're happy with what they do. And more power to  than we need people like that. It's something for everybody. But if it's in your...  heart to be a creative just create and and and and create from a space of just pure creation  and purely just what's in your mind putting it out into the physical because that's  really magic and eventually the way these things work is this doors open up for you.  Opportunities open up.  You know being an art director, those, those like fine art skills, vocational skills are  very important to like preserve and culture and preserving the arts which is very  needed for any functional society.  And as they try to do away with those things, we need more people to that's going to  get a fine arts degree and go farther because those are the people that preserve art  and culture.  If these people had it that way, they would do away with all relics of the past unless  it serves whatever they agenda is presently.  So just keep going what you're doing.  We appreciate the art art looks great.  Trifecta advice.  Oh shit.  Dear Dante, be guys.  Cop.  My name is blank.  I'm 27 years old originally from Mobile Alabama.  Oh shit.  We got him.  We got him.  We got him.  Mobile legend in the building.  So I make cool.  Oh shit.  My bad.  Me too.  He's over there.  Remogen.  We got some of that cools in building.  Shout out some of that cool from Mobile Alabama.  But I've lived with most of my life.  I have a deep love for film but I haven't had the resources or connection to bring my  visions and ideas to life.  I've written script outline concepts, created bits and pieces of my ideas, but I'm unsure  where to start.  Do you have any advice on someone like me can begin building a path in film.  I'm telling you right now.  In order to go big, you got to start small.  She has more, right?  But we're just going to address that.  In order to go big, you got to start small.  You got to sell fine.  Now, you've seen people like this.  How many content creators came up off of Vine,  off Instagram, off of TikTok,  just creating like in a real way,  acting every part out.  Look at Joshua Neal.  And conductance is a Joshua Neal in his family.  He just lost his mother.  But look at someone like Joshua Neal  who was creating his own content on TikTok.  And then just starting a movie with Kiki Palmer.  And says, direct it by Easter egg.  You have to do the work.  You know what I'm saying?  You want the big budget stuff.  You got to start small budget.  Tyler Perry, for example.  Low budget, low budget plays.  Just start out with plays.  Well, you can see the microphone on his forehead.  But it was about getting it out.  And at the while, all the imperfections fade away  and people just focus on the plot and the story.  People focus on the characters.  But if you're not willing to do it in small bits,  then you're not going to get an opportunity to do the big one.  You've got to put out the small bits.  You got to put it out the low budget.  Just put it out.  Right at three minutes, script.  That way, every platform will allow you up to three minutes.  Anything on Instagram over three minutes,  they won't share it to a new audience.  TikTok, you can go as long as you want.  YouTube, short, three minutes.  YouTube, videos, make a 24 hour film if you want to.  It'll live on it.  Take forever to render an upload.  But you can put it out there.  But if you're not willing to start small,  write a three minute script.  Get the ideas out there.  The small ideas become big concepts.  Okay, so my advice is start putting out three minute films,  three minute short films on Instagram, on TikTok.  And look at the reaction and understand that these small bits  are laying stones, laying stones to the path  that you're trying to see yourself go down.  But if you don't do it in small bits,  you're not going to get the big opportunity.  You got to work.  You've got to vision all you want.  But if you ain't doing nothing but dreaming about it,  it's going to stay a dream.  You got to chip away at that motherfucker.  Also, I wanted to ask something a little bit more personal.  I have a complicated relationship with my father.  I love and care about him.  But I don't fuck with him as a person.  He's been emotionally absent.  Been emotionally absent.  The night is one of his own kids.  Treats women terribly, including those who genuinely  genuinely care about him.  It's confusing because he says he loved me,  but his action shows a deep disrespect for women.  Can someone really love their daughter  or her own such toxic views towards women in general?  No.  Because his daughter doesn't become an exception.  You can love your daughter until she becomes a women.  And you hate women.  I'm going to tip you to come as a woman.  Come women.  Come women.  When they become women, you hate women.  Yeah, yeah, yeah.  These women folks.  Yeah.  Got them cocky-bines and harlot.  Yeah.  I think it is.  You take them for whether you already know who he is.  And as much as you want to preserve,  you are his responsibility, not the other way around.  And oftentimes the parent, especially the toxic parent,  will put the responsibility of maintaining the relationship  off onto the child.  And that's not the child's responsibility to maintain a relationship.  That is the whole of the responsibility of the parent.  If you're a child, cut you off, you're a shit-pan.  You don't never hear great parents talk about getting cut off.  You ain't never heard it.  And the responsibility lies on the person who created it.  All right.  So as bad as humans are, gotta blame God.  You know what?  You know what?  Just for some perspective, that's fine.  What if God was one of us?  Just a slob like...  One of us, dum, dum, dum, dum.  Lastly, damn.  Damn, it's more hard.  I'm gonna wrap this shit up right here.  We'll get us up to you boys, man.  Lastly, my sister makes really good music,  but she lacks the resources like me, connections to put for.  I love to support her journey.  I send over some of her work.  Please keep in mind, it's very low budget.  Just as dumb we can when we have.  All right, we're gonna play this shit on new music Monday.  And she said when I'm a film,  PS, please don't say my name.  We don't get that out, man.  So stuff.  We'll check some of your music.  I'm gonna play it on new music Monday.  All right, big K, you ready?  Somebody's boys and girls?  Let's do it, baby.  Hey, dear, honey.  Hey, big, I go, hey.  I just want to say congratulations on your job to say  the best bought-to-profit.  Excuse me, the best pie case in the world.  I wake up early.  I'm a nice, just nervous.  But yeah, I just give you some grace.  Don't tell me too bad.  Also, I'll show you the best of all.  And I've seen where y'all were talking about, you know,  the millennials and how we're in this idea of individual business  versus community.  And I just wanted to explain why I'm in there actually.  I'll say bye.  On this issue, I've had with my feelings.  So I was really, no, me and my kids.  And it's always been something there,  but I've never really understood what it was.  It's a reason to lay if you came out the down list.  We celebrated her birthday, but she brought friends with her.  And I'm so sure this friend was making threats behind my back.  She was saying stuff.  I can kind of feel the energy was off.  And so with that, I just put my husband off.  Like no son of a thousand.  Like, you know, there's no men in there.  Like I've been going to this issue.  It says we were keys where.  And I'm okay with never speaking to her again.  So I've become once you have somebody  who's making threats over listening.  Like I had, I didn't say anything to this career.  We didn't have any issues.  I was a little bit on we had a good time.  He'll I boost in favor of things.  So everybody has a good time.  But once we started that threat about taking me  with my keys over some dumb shit.  Like I was just like, yeah, I'm not with it.  So my question is, do I continue on the note time of time?  What my husband is.  So if I think she does want to make a million.  No one that should probably always have this liability  of this, you know, in different towards me  and get that community into the deal with it.  Or do I keep the note time set going?  Because I'm one of those people like to expose me  as fuck you twice.  It's all.  So yeah, again, congratulations on the sixth thing.  Big podcast and the world of big access to the USA.  I keep going with our dough and love.  Yeah, first back.  We like you too, Steve.  Fuck them.  Yeah, real shit.  Oh, okay.  So I think that there's a misconception about what I was  saying last week.  Because I was saying that like there is an overcreation  which is cutting your folks off.  But I was talking about in instances of just like pure  just disagreement and things that can be hashed out.  When we talking about like pure toxic shit,  when we talking about like envy and somebody like,  they showing you that they hate you.  No, fuck that.  Fuck that.  You gotta keep people like that out your life.  They're gonna hinder your progress.  And I'm saying it goes for everybody.  Even when it comes down to your parents,  if your parents do to their toxicity,  our hindering your progress in life,  our shooting down your dreams.  If your parents are haters, you gotta get them about your life.  You understand what I'm saying?  Like I'm not saying preserve shit.  I ain't the nigga that's gonna say,  well, at the end of the day is family.  No, sometimes it's fuck family.  Real shit.  Sometimes it just gotta be fuck family.  Cause familiarity breeds contempt.  And sometimes the nigga's be very contentious, very hateful,  very envious of who you are.  The reason why I said an entendum  with building online communities is because  when you get into building these online communities,  but you have cut off all the community  that you have in your reality and your real walk in life,  you're gonna need a place to replace that.  So you're not living in an echo chamber of individualism.  So if you find a place where you have to disconnect  with a cousin, disconnect with a sibling,  disconnect with a parent,  you're gonna have to find a space of recreating  those relationship dynamics in your real life  that can't just exist online.  You know, we need mentorship,  we need people we can call for sage advice  and not just chat rooms or discourse  where we could trauma dump on people.  We need people that we can actually reach out and touch.  And sometimes the relationships you build with your friends  are stronger than the bonds you have with even your own siblings.  Okay?  So yeah, somebody like that, talk to you,  making friends, talking about taking care of your,  taking your kids away, fucker.  Talk them!  Hahaha.  All right, let's get one more in there.  We get a party.  Y'all were sending these four and five minutes,  shit, man.  It's telling you, man, I ain't gonna list it.  All right, man, figure out what you want.  And say it and wrap it to fuck up sum it up some net shit off  Mid in 30 minute. We need a minute. We need a hot 92nd. Yeah, you know what I'm saying. That's why I look  I look at two minutes as the max yeah  Mr. Deonte coyo oh my gosh and big ice cup  Read a knock a nigga out whenever it's available. Okay. I love that for y'all  I just want to call in because I think y'all are so dope  I love what you guys are doing and I love the perspective  I love that char root for black women and for black men and you're really pumping out the knowledge for real  I just wanted to speak on something that really resonated with me  um  You had mentioned about  coming to terms with the fact that  uh  You were gonna have to be okay with being a shrimp driver, right?  and once you came to that realization and  You were okay with that  Things aren't to happen for you doors hard to open for you  um and that really resonated with me because I too went through that experience  Um, I'm a singer so I'm always doing stuff. I'm always trying to do stuff at least and nothing was really panning out for me  And I feel like when I finally accept it like maybe this just isn't for me  Maybe I need to focus on something else or just focus on  What I can focus on at the moment. That's literally when I said in that that's literally when things started  to shift for me and I just really want to  Bring that to a lot of people's attention like you're really out here speaking truth  like really allowing black people a safe space to really  Process their emotions  Maybe process things they don't understand it's just a very dope experience  I tell everybody about your all because it's so enlightening like and not only that  y'all are recognizable to the culture so people listen and I think that's what the dopest thing about it is  So I just wanted to submit and shout out love to y'all because I think y'all are amazing human beings and more success and more bookings  book and baby you hear you hear me  I just love that for y'all I really do and  Let the lights all y'all families and peace and blessings  Thank you sesame  If you were Philadelphia right now  That's how we end in the show  If you were Philadelphia right now  Go to the ball stools sports  Studio and take away all the mics  Then bring them down here to more drugs or what we give you the biggest real million dollars worth of game nigga  Now, thank you sis this a thing uh submitting  Submitting is not easy right but  You know, like they say like you know  You got to be appreciative of what you got before you get moh  You got to show God you can do this what we just talked about  We just talked about it  If you're not gonna do it in small instances if you waiting on the big budget film to come just present itself to you  Oh lion's gate the wine steam brothers. They just oh, I heard you was a great filmmaker here  Let's give you fifty million dollars. I know no no no no no you got to take the talents  And you got to take the things that you got and work with what you got you hate your job  But sometimes you got to submit this one. I'm at this one. I'm at  If you're not gonna show gratitude for what you already got. Why would I give you more?  I don't you know my kids they don't they know they know how I get down  My son was in that bitch in a bed. I could have been bought a nigga a new bed a year ago  But I told him when I bought his new bed. I said if you break this mother. I go like you broke the last one  You gonna be sleeping on the flow. Mm-hmm. Guess what he did for a year. Slipping that guy down flow  You think they knew bad bro  Absolutely not because if you're not gonna take care of what you got if you just running through shit like it  Don't mean nothing like it don't have no value and you're treating the things that you got like like they worthless  You're what you gonna do when I give you a lie?  I give you ten thousand dollars. You blow it in a day. I'm goddamn sure not giving you a million  I mean goddamn you're gonna make some folks which round this bitch ain't  Not even yourself  Teacher man aficion but the thing is sometimes  You know if I'm ever gonna teach you how to fish then you want them to buy the rods for you too  You want them to go find back. No, you gotta have some initiative mother. I'm gonna talk to you how to fish  It's up to you to go get the rods  It's up to you understand what bait go for what fish  You just gonna see her in complain like damn mother could tell me how to fish in give me no fish  You're like damn he taught you the most important skill. How to catch them motherfucker  You could feed yourself damn you I'm not gonna feed you too  that  Yeah  It's about how you do how you do when you got a little  Then you could be  Trust it with a lot  So I appreciate you I appreciate you reaching out you with what you do when you in the shadows  Determine how you gonna act when you get in that light like they say money don't money don't change you  It just make it more of what you are you  I hope that money don't change you  They're gonna use to have some shit, baby. You're gonna talk about he want to AI artists  Gonna  Click while you ahead all right?  We let you slide with the snitching allegations all right because we know that they're waiting to technically snitch  That was the Alfred plea and they because I know about the law because they're only real criminals  Hmm huh you don't know about that no-low-contendary  Ha ha ha  They're gonna like me to know play a couple of no-low's fucking talk about  I ain't guilty, I ain't not guilty.  You make him just in the middle of it.  I'm in the middle of it.  Hopefully, I'm like, get myself off this shit.  You don't know nothing about no low-contendration.  Now you do concirery things, snitching.  Because your whole identity and everything  you know about the streets comes from that cell phone,  nigga.  So you don't know about the Alfred plea,  and that man really didn't snitch on nobody.  No.  But stop that AI shit.  Stop.  But we AI you, nigga.  You don't think I can make fuck you mean with the chat GPT?  Huh?  It's been episode seven, me three.  We got to brother self-make-home.  We built it.  Time was up to him.  He was so good.  Oh, my God.  This is fucking bad, my God.  I'll stick the wrappers.  I was head, man.  It was head, man.  I'm going to do my new music Monday.  Because I got videos and new music.  I got music coming.  Yeah.  Sample tape.  Ladies love, cool.  I'm from Mobile Alabama.  I got raised to the bag like Jim Jones.  Yes.  Cool sweats.  From Bad Dream.  Nice.  I hope the fans don't grab tape.  My girls.  I think that's the jimmies in the mouth of your head.  To my bank bank bank, to my whole gang.  When you brought the name thanks and she just go bang  When they come, it got me ricocheting baby  Cause I freakin' spanking man, it's in my crick-stepped sack  It's day nine, double-line triple  Whoa, whoa, whoa  We just get it, get your gun  Go on, get your gun  Let's have fun, let's have fun  What's up?  What's up, John?  Think I used to love it  Yeah, I used to love it  I said it's you  Sorry, I got it  Aww, this dude's going to be dumb, so  What's up, hey buddy  Let's have fun, let's have fun  What's up, what's up, what's up 123?  I know what you want  Alright, let's cancel a new music Monday  So make a little zordered talking  I'm just glad that's just glad  I just have to show you what the power is  I just have to show you what the power is  Aha, give this thing a bout it here  What career?!  Is a million dollar worth of game?  I ain't even going to make a shit  You're a gilly?  Yeah.  I can't lay the niggas take my position.  Nah, I can't take my spot.  Hey, let's you take my spot.  This has been episode 73.  I'm your host, Deontay Cobb.  Who's behind the camera?  The coolest co-host in the world.  Big ice cup, cat.  What did I miss?"