" Caleroga Shock Media  From Washington DC where there is no list, we never said there was a list.  This is ballot.  That's right, and good news from the TSA for a change.  Let's hit this!  So the Justice Department just released a memo saying there's no Jeffrey Epstein client  list in their files.  Which is probably the most disappointing news conspiracy theorists have heard since they found  out the moon landing was real.  Attorney General Pam Bondi had previously suggested on Fox News that she had this mysterious  client list on her desk ready to expose powerful people.  But now the DOJ is saying, sorry, no list exists.  Which is either the truth or the most elaborate game of the dog ate my homework in government  history.  The memo also confirmed that Epstein killed himself in prison back in 2019, which investigators  concluded years ago.  But telling conspiracy theorists that Epstein actually committed suicide is like telling  kids that Santa isn't real.  They're just not ready to hear it.  Right-wing media personalities who spent years promoting these theories are now calling  Bondi a liar on social media.  Nothing says we trust our own people, like immediately turning on them the second they don't  deliver the scandal you ordered.  The White House is now defending Bondi, saying she wasn't talking about a client list,  but rather the entire investigatory file.  So basically they're saying she had papers on her desk about Epstein, which is probably  true most attorney generals probably have papers on their desks.  Revolutionary stuff.  Meanwhile, FBI director Cash Patel and his deputy Dan Bongino, who both gained fame  questioning the official Epstein story, are now saying investigators got it right all along.  That's got to be awkward.  Spending years building your brand on conspiracy theories, then having to run the agency  that debunks them.  The memo criticizes people for perpetuating unfounded theories about Epstein, which is  government speak for please stop making our jobs harder with your YouTube research.  They pointed out that spreading conspiracy theories doesn't help combat child exploitation  or bring justice to victims, which is a fair point that probably won't stop anyone.  Elon Musk even got involved last month, posting that the files weren't released because  Trump was on the list, then walking it back.  So now we've got billionaires casually accusing presidents of crimes on social media, then  going never mind, like it's a deleted tweet about pineapple on pizza.  The whole thing shows how conspiracy theories work in politics now.  You promise the smoking gun get everyone excited.  And when reality doesn't match the hype, you just blame someone else for lying.  It's like ordering a mystery box online and getting angry when it doesn't contain Jimmy  Hoffa.  So Ted Cruz was vacationing in Greece when devastating floods hit Texas, killing over  100 people, and his office says he came back as fast as humanly possible, which is apparently  politician speak for he finished his gyros first.  his office released a statement explaining that the senator was already in the middle of  a pre-planned family vacation when the flooding occurred on July 4th.  Within hours, he was making phone calls to governor Greg Abbott, Lieutenant Governor Dan  Patrick, and President Trump to coordinate federal assistance.  So he was working the phones from what I can only assume was a very scenic Greek beach.  A tourist spotted Cruz and Athens around 6 p.m. Greek time on Sunday, which was 10 a.m.  in Caraville, Texas, where people were dealing with the aftermath of deadly flooding.  The tourist Michael Rockio snapped a photo and told the Houston Chronicle, I get it.  He's on vacation.  But after what happened, vacation or not, you should have been back on a plane on his way  back to Texas.  Cruz's office insists he left Athens Sunday morning and was back in Texas that night,  then on the ground in Curville early Monday morning.  So technically, he did return quickly, just not before someone got a photo of him, apparently  enjoying Greek hospitality while his constituents were dealing with a natural disaster.  This is the same Ted Cruz who famously flew to Cancun during the 2021 winter storm that  left millions of Texans without power or water.  He later called that trip, obviously a mistake, which suggests he learned his lesson about  vacation timing.  Well, sort of learned his lesson.  The difference this time is that Cruz's office is emphasizing all the phone calls he  made while abroad, which is the political equivalent of saying I was working from home when  you were actually working from a Mediterranean resort.  Sure, you can coordinate disaster response from anywhere with cell service, but optics matter  and politics.  Cruz defended the Cancun trip by saying his daughters wanted to go, which was widely mocked.  This time, his office is going with the pre-planned family vacation angle, which sounds  more official, but still raises the question of whether maybe family vacation plans should  be flexible when your state is underwater.  The tourist who photographed Cruz said he's not even a Texan and is openly critical of  Cruz's politics, but still thought the senator should have been heading home.  When your vacation photos are being taken by random critics who think you should be doing  your job, that's probably not a great sign.  At least as time Cruz didn't blame his kids for the trip.  Progress, I guess.  What if everything you've been taught about happiness is wrong?  We chase careers, approval, more stuff, hoping it'll finally make us feel fulfilled, but  it never sticks.  What if happiness isn't out there, but already inside you, just waiting to be unlocked?  Discover the book, the happiness experiment.  Every person has a unique happiness type, and when you understand yours, everything shifts.  You'll stop chasing and start creating joy on your own terms.  Whatever your happiness type.  with a free happiness type assessment.  Go to MyHappinessType.com.  That's m-y happiness, t-y-p-e.com.  It takes just a minute and it might change your life.  Then grab your copy of the Happiness Experiment  at Book Semillion.  This isn't just a book, it's a practical framework,  a journey in work.  It's a tool to help you reconnect  with the happiness that's been waiting inside you all alone.  Pick up the Happiness Experiment  and start your happiness experiment today.  And good news for Ted Cruz.  So the TSA has quietly started letting travelers  keep their shoes on at airport security,  ending one of the most universally despised rules in air travel.  After nearly 20 years of forcing millions of people  to shuffle through checkpoints in their socks,  someone apparently realized that maybe this wasn't  the best system.  The shoe removal requirement started in 2006,  almost five years after the so-called shoe bomber,  tried to detonate explosives in his footwear  on a flight from Paris to Miami.  So for two decades, every air traveler  has been paying the price for one guy's failed attempt  at terrorism, taking off their shoes  and hoping the airport floor isn't too gross.  The TSA hasn't officially announced this change,  which is typical government behavior,  quietly implementing a policy shift without fanfare,  probably hoping no one notices until it's fully rolled out.  A TSA spokesman gave the classic non-answer.  TSA and DHS are always exploring new and innovative ways  to enhance the passenger experience,  which is bureaucrat speak forth.  We're doing something, but we're not ready to admit it yet.  The change was first reported by a travel newsletter  written by a former TSA officer,  who said he'd seen the soft-launched air force  and received an internal memo about it.  He pointed out that technology has advanced enough  that officers can now detect threats  while passengers are wearing shoes,  which raises the obvious question.  If the technology has been capable of this for a while,  why did it take 20 years to implement?  This is potentially devastating news for TSA PreCheck.  The $80 program that lets you keep your shoes on  as one of its main selling points.  The former TSA officer said he believes a huge shift  is coming to PreCheck, because letting regular travelers  keep their shoes on will significantly diminish  the value of the program.  So people who paid for the privilege  of keeping their shoes on might now be wondering  what exactly they're paying for.  It would be like paying extra for Wi-Fi on a plane  and then finding out everyone gets it for free.  The whole thing highlights how arbitrary  some security theater can be.  For 20 years, we've been told that removing shoes  is essential for safety, and now suddenly,  it's not necessary anymore.  Either the threat was overblown to begin with  or technology caught up and nobody bothered  to update the policy until now.  This could be the first domino in a series of TSA policy  changes that make air travel slightly less miserable.  Next thing you know, they might let us keep our laptops  in our bags or bring full-size shampoo bottles.  Although knowing the government,  they'll probably find some new inconvenience  to replace the shoe thing just to keep us on our toes.  Or should I say keep us on our shoes?  Portions of today's show were made with the help of AI.  Now stick around for this interview and I'll see you tomorrow.  I'm so excited to talk to you, Carl.  Talk to me a guy who's had this illustrious business career.  What made you decide to write a book on happiness?  You could have gone in some of your directions.  Well, actually, I didn't, Donnie, I didn't decide to write a book.  Something happened.  This happiness experiment happened in real life  in real terms.  I had no idea about a writing a book,  but I saw it working.  The experiment was working.  My friends and family were getting happier.  They're increasing their happiness.  And I saw it.  So I thought, I need to write about this.  And so that's when I got into writing the book.  And talk to me about pre-questing.  Talk to me what it's about and how it's the foundation of things.  Well, it came about through three major things that happened  in life.  When I almost died in a plane crash,  if you read the book, you'll find out  whether I survived or not.  Heh heh heh heh.  The other thing that happened was I got a call  from my sister in England.  She told me her husband was dying.  He had six months to live.  So I flew to England.  And she was in my well.  And I said, Janet, you're in my will as a bequest.  But that's something you need right now.  So I'm going to make it a pre-quest.  I'm going to bring that bequest forward  and pay it to you now, while you can enjoy it.  And your husband can fill fill his last wishes.  She was overjoyed, burst into tears, of course,  and said, oh, this is great.  My brother was there at the same time.  I said, Barry, since I've done this to for my sister,  I'm going to bring your bequest forward.  Make it a pre-quest.  He said, oh, that's fabulous.  Thank you very much.  You're very generous.  His wife went ballistic.  She said, this is too much money.  It's wrong.  I don't want anything to do with it.  I'm stormed out of the room.  So that was a real surprise.  Anyhow, she got over it.  And the next thing that happened is I  look in my investments.  I got a lot of money sitting in investments,  not doing anything, wasn't working for me,  wasn't working for my friends.  So I said, why don't I use this money for my own success  and happiness?  Also, for my friends, the people that helped me get  to be wealthy and successful.  That's what I did.  So it's not a one-time thing.  This is kind of a lifetime experiment, if you will.  Yeah.  It turned out that way because I didn't want to just give  people money and say, be happy.  I said, I want this to enrich your life  be something special.  So I'd like you to think about it.  Plan something.  Great happiness plan.  There's what's a happiness plan.  I said, when I get that, I'll give you all the money.  I'm going to see how it works out.  So you talk about coaching and grants to reshape and change  lives, which is timely given what's going on in the world today.  Yeah.  And the thing is that it wasn't.  just about the money, Donnie. The money's important. We love money. It's good to have it.  But what really worked with these people was the planning with a happiness coach. They thought  about carefully what they wanted to do that's going to enrich their life, make them happy.  What things they love, things that they were fascinated with. And they wrote all that down with a  happiness coach. They had a plan. And as soon as I got the plan, I said, here's the money, all of it.  It's all yours. You don't owe me anything. No strings attached. And they went off and started  becoming happier. It's incredible. So the inspiration for this was just your death experience.  Well, that was part of it. But it was a number of things that happened. First of us, very,  very grateful for the people that helped me to become successful. And I wanted it being  grateful is terrific. Okay? We love that. You talk about gratitude and gratitude, journaling, all those  but the real thing is expressing the gratitude, telling somebody how much you care about them,  appreciating what they did for you. Writing a letter, it doesn't have to be about money. It can be  possessions. It can be money. It can be attention. It can be time. It can be knowledge. You wisdom  that you share with younger people. But it's what you're doing while you're still alive with  accounts. When you're dead, it's over. And such a good, it's such a simple but brilliant point.  And how do you think, let's say, play this out that people kind of really buy into this  intentional happiness and pre-questing. How does the world become a better place? Let's take this  up 10,000 feet. I would be great. The reason I wrote the book is I want this idea to get into the  world. So that certainly the wealthy people, they can do the pre-questing, make themselves and their  friends and family happier right now, or they're still alive. The other thing I want the book to show  how these people planned, thought about their happiness, created a happiness plan, and then worked at,  and to become happier. And others can learn from their experiences, reading their plans,  and then doing the same thing. And in the back of my book, there's a workbook which goes through  that step-by-step and a plan to increase your happiness. How do we get this into the workplace, into  schools, and kind of really to your point, get this in there? You know that would be lovely. If it  went into the schools and I think in high schools, this would be a really good subject, but on the  curriculum. What is happiness? How do we achieve happiness? What's it all about? What is happiness?  It's a great question. You have to read my book, but put it in short. In short. Emotion will know  what happiness says. It's feeling good. It's joyful. It's exhilaration. It's loving life.  It's that's what it is a feeling. But it's also a mindset. You have to think that I deserve happiness.  I want to be happy. I'm taking my happiness seriously. So it's hard and mind, not just one or the  other. So it's that combination. But really, I get a whole chapter in the book on what is happiness.  And it's a great chapter. You'll love the book. A lot of people, I can't cannot wait to read it.  I'm so excited. I'm just turned on listening to you. A lot of people equate happiness to financial  success and things. And what am I going to learn the book about that? Well, happy money is important.  Okay. Let's get that off the table. It's not going to buy you happiness. The good use of money  is really important. How you do it? But it's the mindset. It's the pursuit of happiness that counts.  Taking your happiness seriously. Wanting what you want and what you want is important. Your dreams,  your purposes in life. What you want to achieve in your career. What you want to  with your family. What you want to achieve. The purpose is all around. What you value. Are you pursuing  those values? Are you living those values? This is what it's all about. Money helps. But it's all  those other spiritual things. If you like, psychological things that really are the root of happiness.  And as we all know, some people are very rich and they're very unhappy. And this is very  a lot of people. A lot of people are really happy. I would say money could solve problems,  but I can't buy you happiness. But you certainly can throw it at problems. But that's about the  extent of it. So let's play this out. How is the right now the world could use this more than ever?  So how does let's say if I just did this fantasy and said, okay, everybody's going to  everybody's going to do this prequest. Everybody's going to do the happiness planning.  What does the world look different? Well, as you know, Donnie, when you're happy, your family tends to  be happy. Your friends are happier and happiness ripples its spreads. And if this idea gets into the  world, which I'm working very hard to do, I got to enter the world talking to you because you're  going to buy lots of these books and you got to tell all your friends about them. Right? So I am.  Yes, I am. If this goes into its spreads, it ripples. It doesn't state just with you. It goes  down to your family, to your friends and to your community. And if a lot of people do this, and it's  not just about wealth, its possessions, its time, its love, its wisdom that we can share with others  why we're still alive here and now. And if that gets into the world, and there's a lot of people  start doing this, and this that the happiness level in the world will increase little by little.  And I'm, I'd be very happy about that. Mr. Barney, it's been inspirational talking to you. I am going to  get this book immediately. I can recommend that just based on what we've talked about to anybody,  because we all could use a little happiness. I appreciate, appreciate you taking the time.  Happy to be here. Thanks, Barney. You know the silhouette, the squint, the voice that cuts like a blade.  Clint Eastwood isn't just a movie star. He's a myth, a mayor, a cultural fault line,  and maybe the last great American icon. Eastwood reloaded tells his story one chapter at a time.  The hits, the flops, the chaos between the scenes. Because legends aren't born, they're built.  Eastwood reloaded. Listen now wherever you get your podcasts.  You can call me, James.  I spent 23 years designing aircraft  that officially don't exist for agencies you think TV made up.  Until I started asking the wrong questions,  Navy ships are recording objects moving at impossible speeds.  Infrastructure is failing in coordinated patterns.  The moon looks smaller than it did 10 years ago.  None of this is a coincidence.  The official explanations don't add up.  This is paranormal aliens.  Where we connect the dots, they don't want connected.  If you're hearing this, you know where to get podcasts.  Follow paranormal aliens.  New episodes weekly until they shut me down.  Hey, my name is John Pothoritz.  I'm the host of the commentary magazine daily podcast.  We try every day to give you a sense of where America is,  where the world is, where Donald Trump is,  where the Democrats are, where the Republicans are,  where American society is, and where it's headed.  Lively significant, important topics of discussion.  Please subscribe, Apple, Spotify, wherever you find podcasts.  The commentary magazine daily podcast."