Speaker A: Craftsman days are here at Lowe's with big savings on the tools you need. Save $100 on the Craftsman V26 Tool Power Tool Combo Kit now at $199. No matter what the project is, Craftsman's high quality high performance products empower you to build on Stop by your nearest Lowe's store and check out the full line of Craftsman tools today, valid through 618 while supplies last. Selection varies by location.

Speaker B: Well, let me tell you what's coming up and it all ties together as promised. Kennedy just banned the 800 million dollar funding package that Biden already had prepared for the NIH to fund Moderna and others to come out with MRNA so called bird flu vaccines for humans which they were going to then start using on the public which of course would cause mutations in humans and they hope cause a jump of the strain into humans. That's exactly Fauci's mo So that is a spectacularly important move. Last week they banned anyone below 65 taking the COVID MRNA. They're set to release in the next few months. Massive reports discrediting all the so called MRNA and the classical so called vaccines that are behind much of the cancer and autoimmune diseases on record. So that's coming up. FBI Director Cash Patel says information will be released soon that FBI operatives and partners on the ground on J6 and then it was a staged event and an organized stand down by Pelosi and the mayor of dc. We already knew this but now they're going to release the evidence that they have. Massive that's coming up. Also first doge rescissions bill to hit Congress next week. We're also going to be getting in to the Democrat party and the incredible disarray that they are in. We also have the softball championships for 4A in Minnesota in a shutout softball game championship where the pitcher shut them down and dominated. One man defeated all the girls. Talk about an assault on humanity. Talk about evil. We've got a lot on that subject and more coming up. And of course it's now broken today what I predicted months ago when Jamie White, our wonderful reporter was murdered just a few miles from where I sit outside his home. He was killed and it was racially motivated because he was white. No pun intended. And the man that's now been charged with capital murder on screen had a rap song he produced about killing Jamie because well the white boy came outside, hit his damn ass with a nine and it goes on from there. We will continue to break all this down and more today but the first thing I want to hit is something that in the mid-1990s into the 2000s, I covered and I interviewed many of the journalists that Robert F. Kennedy Jr. The head of HHS just talked about a few days ago on the high wire with Dale Bigtree. And that is that Fauci, starting in 83 until 2000, tested deadly so called HIV drugs that they knew turned off people's immune system and actually gave them AIDS symptoms so they could falsify the reports like they did with Remdesivir for Covid and then say it was the recommended drug worldwide to then get hundreds of billions in Western government funding from the US and other nations to then quote, send aid to Africa and Latin America to kill people with the so called HIV AIDS treatments. That is his specialty. Just like Bayer got caught in the 90s in their own documents in Australia and France and Canada knowingly putting HIV and hepatitis in their Factor 8 blood product that killed millions of hemophiliacs and also gave one of our reporters brother who is a hemophiliac, hiv. But they learned the science and how to not take the drugs and so he didn't die. And perhaps if that reporter, I didn't think to ask, would like to come in later in the broadcast with me and talk about it, I think he's okay with it. You should hear about it because you can't swing a stick in the dark and not hit somebody who lost family or who got really sick from these murderers. And there were the executives of Bear openly saying, hey, there's too many hemophiliacs, let's kill them. Now get ready for this. In the late 1990s, I interviewed the investigative journalist and I'm going to get her back on. Who found the mass grave in New York full of dead black children murdered by Anthony Fauci. Do you hear what I just said? He doesn't just have the larynxes of hundreds of beagles removed and then put their heads in mesh cages with flesh eating flies and maggots. No, that's just to make sure his researchers are evil and we'll do whatever he's telling them. He does this all over the world. He does it to children in India and in Nigeria and in South Africa and in Mexico and Brazil and over a hundred and twenty other countries. He has been Joseph Mingalot 2.0, the angel of Death. He, under Obama's orders, created COVID 19 at Chapel, North Carolina, moved it to Peter Dasak Ecohealth alliance in Wuhan for cover, had the so called vaccine already on the shelf that's all come out two years before and rolled it out they would block doctors in the US around the world. Famous movie Dallas Buyers Club is based on true story who were giving people that had HIV real drugs that were curing them and they knew it. Instead of boosting the immune system they gave people drugs that killed their immune system. What does the HIV spike protein do? It turns off and kills your T lymphocytes, the white blood cells that command the other white blood cells. What does the new MRNA shot do? Mass produces the spike protein but the way it's released it turns off the white blood cells, doesn't kill them but has the same effect. That's all on record. So he runs the same play over and over again. I'm going to tell you this again and play RFK Jr. The HHS head talking about it and it's in his book the Real Dr. Anthony Fauci that they premeditatedly and it's not hundreds of the New York Times says it was thousands in the US alone They mainly targeted blacks. They would go into a single mother with two or three children. And in court documents that came out even the New York times the early 2000s finally reported on it and say well you got a 3 year old, an 8 year old and a 12 year old. And we say we've tested them and they have hiv. Most time wasn't true. How are they getting it? Children. And we're going to take them to a secret research facility and if you don't sign these papers we're going to take them all and they murdered them. You understand that? So I want you to understand who we're up against. And Hotaz is his attache, his aide de camp, his protege. That's who these people are. And you have to understand this. They go out and get the best brightest young minds in high school and college and recruit them into these Systems since the 50s. My father, a physician was recruited into it when he was 14 and told he was joining a feeder program for NASA under Eisenhower's whiz kid program that continued into Kennedy. Kennedy obviously know what's going on. Eisenhower warned of the technocrats scientific elite that couldn't be trusted because he found out what they were doing. But it continued on. He was in MD Anderson cancer research facility in the secret of areas. I had people to sign up with their rights that were terminal and they would test lethal drugs on them. And my dad noticed the scientists got off on it. Literally love killing people. He said I don't want to be part of this project. They said, oh, don't worry, We've got another project for you. And he won't tell me what that project was. But when I was a little kid, he told me about this when I went to get my driver's license, he said, don't sign the organ donor card. Dallas hospitals kill people who have car wrecks that are young for their organs. A decade later, 60 Minutes broke the story. So that's my own personal experience. And my dad, interestingly enough, was involved with a hospital he owned with partners in the Dallas Buyers Club, actually helping people. I remember that at the time, people coming over the house, meetings about it. They made the decision when I was playing chess with her doctors that they were going to supply the drugs. So that just shows you what a small world this is. My dad fighting what Fauci was doing in the 80s, and here I am today fighting Fauci. Small world. So you have to understand, they do this to our military. They do it to anybody they control. They use them as guinea pigs. And it's pure evil. And I'll show you mainstream news articles admitting it, but trying to whitewash it in the 90s and 2000s. But this story is evergreen and is important to understand what we're up against. The premeditated evil. Now, why would they put young whiz kids in projects? They do something in Europe and put them in these research facilities watching this to get them used to it and to see if they will take part in it with the other mad scientists. We adopted Joseph Mingala's project Operation Paperclip on record. We adopted the Nazi weapons programs, rocket programs, JET programs, intelligence programs, eugenics, medical experimentation programs, while at the same time we created the Nuremberg Code, explaining that that's the death penalty. And that's who Bill Gates represents and his father, who headed up the Maine World Eugenic Society after Thomas Watson died. The owner and founder of IBM. It's a cult. The Bill of Melinda Gates Foundation's real name. Look it up. They've had award ceremonies and said it themselves is the World Population Control Foundation. And that's what they're doing. They want to play God. They want a world treaty with the UN to take control of all of our bodies. They've got the outbreak, FEMA camps in every major nation built, ready for medical martial law and disease acts which they said they'll use to bring in total control. So continuing to expose this is beyond critical. There it is. World Population Foundation. All right. It's actually The World Population Control Foundation. And you can even pull that up in the New York Times. Lenanguardian, the nickname for. It's called the Good Club. A corporate global government to carry out an 80% depopulation of the planet. Just type in Bill Gates, Warren Buffett, George Soros. The Good Club. All right, so here is HHS Secretary Robert F. Kennedy Jr. Exposing Fauci and a mass grave. One of many. 95% of them, plus almost all of them black. Where's the naacp? Where's the liberals? You see, they hate black people, so they ship drugs their community and give them gangster rap and fast track them to prison, tell them to kill whitey. So we all kill each other. They keep their friends close and their enemies closer. And then a young black man thinks white people are his enemies, so he goes and kills Jamie White and then raps about it. He doesn't know who his real enemy is. The globalists. All of our shared enemy here is HHS head talking about Fauci's secret Joseph Mengele experiments with what he knew was lethal drugs. Here it is. Tony Foushee made sure none of those kids had guardians, which is illegal. And then he hid what he was doing from the boards. He took foster homes in six states.

Speaker A: And he turned over to the pharmaceutical industry.

Speaker C: He made sure that the people who.

Speaker A: Were running those foster homes were not.

Speaker B: Even, did not even have medical training. Most of them were immigrants who came from the Dominican Republic. They knew nothing about medicine or responsibilities.

Speaker A: And they were sick.

Speaker B: And they realized slowly what they were involved in doing to these children, that they were torturing these children.

Speaker C: And.

Speaker A: And there's videos of these children, an.

Speaker B: Old BBC documentary that will make you cry.

Speaker A: I promise you.

Speaker B: You cannot look at these without weeping. One of these kids, a 12 year.

Speaker A: Old who's trying to protect the 8.

Speaker B: Years old and he has a tube in his stomach and he's telling them.

Speaker A: I tried to fight them.

Speaker C: And this is what they do.

Speaker B: If you fight them, you can't fight them. You need to just take the drugs. And the kids didn't want to take them because the drugs were making them horribly sick. And Celia Farber, who's this amazing researcher who worked on this chapter for me and did a lot of the original research on it, she actually went up to Hawthorne, New York, to the Gates of Heaven cemetery. She found the cemetery where Fauci was disposing of the corpses of these children who died in his illegal experiments. She found an open pit.

Speaker A: It was actually covered by a. I.

Speaker B: Asked the carpet she opened the carpet.

Speaker A: And she saw hundreds and hundreds of.

Speaker B: Tiny little coffins stacked haphazardly upon each.

Speaker A: Other because these are children who have.

Speaker B: No parents and nobody was there to protect them. And Tony Fauci treated them as collateral damage. And his objective was to enlarge the.

Speaker C: Markets for these pharmaceutical companies who he.

Speaker B: Had partnered with by allowing hiv, these toxic, toxic chemotherapy drugs to be given to children. And then the next experiments, which are.

Speaker A: In the next chapter, which are equally horrendous, is his experiments on Africans.

Speaker B: And the Gates foundation has been indicted in the Netherlands and in India for their illegal, lethal experiments ongoing on children with all sorts of nasty stuff. All right, so let me show you some articles and flashbacks here. Fauci's NIH funded experiments on AIDS orphans in New York City. They did all over the country, but New York and Maryland were the worst. Guinea pig kids. Fauci's legacy of cruel experiments on kids. Yeah, not just beagles. AIDS test on foster children violated rules. AP AIDS drugs tested on foster kids. These are from the early 2000s, but then a few years ago, they came out with whitewashes on it and they said, yeah, they reported the researchers disturbing higher death rates of the children they gave the drugs to. Well, and then they didn't have it all the world. They were creating fake tests, then certifying it was safe. They knew what it would do. Turning off your immune system, turning off infection, fighting blood cells. Why would you give somebody that if they're having an autoimmune issue? A lower immunity. What's the coverage shot do? Exact same thing. NIH tested AIDS drugs on foster children. Npr, but, oh, four years ago, everybody's exposing this again. AP articles misrepresent Fauci link research involving foster children. Then they whitewash the number of deaths and say it's wonderful and no big deal. Associated President John Solomon says AIDS researchers enrolled foster kids in AIDS research studies without independent advocate protection. Now they were locked them up, wouldn't let them escape, took them from their parents. It's far worse. Here's the report. The experiences of New York City foster children in HIV AIDS clinical trials. Vera Institute of Justice, 2009. Go read the report. Research involving wards of the state, vulnerable children. Now let me take you up to where we are now, unpacking the story of Fauci and the painful experiments involving dogs. I mean, where they killed them was with maggots. But let's look at what's currently happening all over the Western world. But let's zoom in on Canada right now. They're coming for the kids. Bureaucrats study euthanizing autistic youth that are wards of the state. Well, they actually tried to pass the regulation last year, but there was such a furor by the medical community. Finally had some soul. They backed off and said, well, we'll implement it in 2027. Trudeau said, but they're still bringing it where if, if you decide you're depressed and you're a child, well, you have your year of age at five, they say to be killed and they convince you as a ward or they just say, oh, the kid wants to die. This is Joseph Mingle of stuff. Because if you can get away with killing kids, you can do anything. They don't want to just kill him in the womb. Canada fails to rule out. Oh, fails to rule out euthanasia for autistic children. Document show California letting more girls in track championships amid trans controversy. Oh, we'll just put more girls in against the boys. Maybe the girls will actually win. Just all these sick, sick jokes. It's all part of just undermining society, attacking our children. Last night a man single handedly carried his high school in Minnesota to a class for a softball championship. He pitched 14 shutout innings in back to back games to defeat the defending state champs. 14 shot out innings. You are shameful. Sorry excuse for a man, says Riley Gaines. I totally agree. The point is, it's all part of the same system. 12 year old was sent home from school because he said there are only two genders. This is all total brainwashing, a total assault on humanity. But now they're doing their mass medical testing on everybody and telling you that, oh, the vaccine's safe, it's effective, it's been tested. Yeah, it was tested in rats. 2013, 14, 15 COVID 19, Chapel Hill and University of Texas Galveston showed you the studies and it killed half the mice and rats very quickly. And all of them didn't live as long. Isn't that nice? Isn't that sweet? Hey, if you take the shot, you can't get Covid, you can't spread it, says Rachel Maddow and all the rest of them. Oh, but they don't get any trouble for taking money to knowingly lie. No, Alex Jones needs to pay a million dollars he doesn't have for doing things I never even said. Because they're the good people. They're the Democratic party, they're the eugenicists, they're the globalist death cult. But the good news is RFK junior cancels 800 million big pharma vaccine experiment for bird flu vaccine for humans that on record would probably cause in a mutation by injecting people with it. Amazed by how RFK Jr is overperforming faster than I even thought he could. And totally delivering as he just incrementally but very quickly dismantles the death cult operation. The fluoride in the water, the poison dyes going after the geoengineering going after the poison shots, killing all these different big programs. It, it's powerful. And in September he launches the full assault to discredit the whole thing with all the documents we know they already have and the internal documents they've been trying to destroy. But they're able to still get from NIH about what the COVID shots really did. So when RFK Jr comes out and last week nobody's taking the shot up to 65. You're 65, want to kill yourself and take coverage shots, knock yourself out. They're going to ban that next. And then now saying we're not doing human bird flu. Nope, you're not going to put that out in the population. It's too dangerous. It'll cause mass mutations. They want to start doing the quote trials and then suddenly you're going to have a bird fluid that jumps into humans. That's the plan. That's what they do. That's what they want. And the power structure is just the death cult. The mad scientists are in total panic mode. But this issue that I just covered earlier that most people don't know about, I mean I tell other journalists about other talk shows. Well, you know, Fauci did secret experiments on tens of thousands of black kids mainly and killed a bunch of them and covered it up, put them in mass graves. They're like, oh yeah, right. Because that doesn't sound real, does it? Oh, Fauci had hundreds of beagles put in paralyzed and, and cut their larynxes out so you wouldn't hear them yap. And then had flesh eating maggots eat them. You know, that's beyond a Cronenberg nightmare. That's who these people are. You go, why do they do that again? They do thousands of tests he's funded that we know of just like that on humans. You name it. Because they want to test the researchers. This is a formula that Joseph Mingala and others developed and the CIA adopted his medical program. So it sounds like Mingala. It's because it is the angel of death while we pass the Nuremberg code. The Nazi head scientist that loved to torture children to death. Fauci is his protege. Fauci spirit animal is Joseph Mengele. Do you understand? So here they are, very upset on corporate media about what Kennedy's just done. Here it is.

Speaker A: Administration has canceled a contract with Moderna for the development of a bird flu vaccine for humans or Angelica Peebles joins us now with more. And you could, you could conjecture a lot of things about this between RFK Jr and vaccines and MRNA. What, what's behind all this? Angela? Yeah, good morning, Joe. So this is just the latest in a string of events that we've seen related to Covid vaccines over the last week. And what's happening here is that the Trump administration is canceling a more than $700 million contract with Moderna to develop a bird flu vaccine and other pre pandemic influenza viruses. And so what's really notable about this is that obviously we've seen this, you know, you know, we've seen bird flu tearing through birds and also dairy cows and the risk to humans. And so what we saw in the Biden administration is that they really ramped up this work and they were helping to fund, they were going to fund a phase three trial to see if we could use MRNA for a bird flu vaccine if it indeed spills over to humans. And now the cancellation of this vaccine is quite a surprise. Maybe not a surprise now, but you. Because we had been hearing rumblings about this for the past few months, but, you know, we just saw this contract ramp up right before the last administration left. And now you have the Trump administration saying that they felt like, after a rigorous review, we concluded that the continued investment in Moderna's H5N1MRNA vaccine was not scientifically or ethically justifiable. And they're saying that it's not just about efficacy, it's about safety. And so it's interesting to hear them really casting doubt on just the safety and the efficacy of MRNA vaccines as.

Speaker B: A whole, because they're deadly. And they've been trying it for 25 years and in every trial it kills people. So they never did it. So listen to what she said. Oh, the bird flu has been tearing through cows. Doesn't kill cows and birds. No, in almost every case, the birds aren't sick. They have a PCR test at it, turned it up way high, 30, 40 times. Say they're sick and then kill, killed hundreds of millions of chickens. You wonder why the egg prices went up. No, the, the government, the Agriculture Department, the FDA has been tearing through. And the same thing in Australia, same thing in uk, same Thing in Europe, it's about a war on the food supply. As the outgoing climate czar said John Kerry a bunch last year. We got to cut food production by half at farms or people are going to starve. Ireland, the Netherlands, Sri Lanka, massive destruction, shutdowns the uk. It's a war on the food people. They don't just cut off the Keystone pipeline and blow up the Nord stream energy, they cut the food off. The post industrial world agenda 21, the Rio de Janeiro treaty, 1992. You're living it. Then by 2030 they want to start the forced masty population to at least 80% which is Bill Gates's stated goal in the good club as they call his world Depopulation Bureau. It's a nickname, so that is a big deal and nobody's buying what that witch just set up there. Oh, they're trying to protect everything's killing the cows and birds. No it's not, you lying witch. She's just reading a script. All right, I want to get to a bunch of other really important news and a biggest update yet on the murder of Infowars reporter Jamie White. But first we have saved here at Infowars, that means you have saved by supporting us and spreading the word. Hundreds of millions of lives in the aggregate. People that didn't take the poison Covid shots, people that are aware of the geoengineering, the fluoride, getting pulled out, all these states, all the things that are happening. We were the progenitors, we were the fountainhead of this. Recognized by the bad guys and good guys. That means you are so thank you for your support. We sell things to you that empower you so you'll like them and want to come back get it again. It's symbiotic. We have the very best super nutrient complexes of the known, certified best super compounds known on earth to supercharge your energy, your health, your immune system, your clarity, your skin, your sex life, everything. Irish CMOs. Incredible shology. We have the best incredible turmeric. We have the strongest by light years. Incredible optimal human. The ultimate kitchen sink green drink, ultimate life force. The incredible spike protein detox, overall blood cleaner. Everybody should be taking it. Even take the poison shots. Almost everyone's continually infected because it's nanotech. HIV spike protein circulating everywhere on record. You need these products and they're incredible. But of all of them, the ultra methylene blue that HHS secretary loves, we have the best medical grade. USP cleans out your mitochondria, cleans up the cellular process like Nothing else. And gives you incredible energy, clarity and focus. You've seen the rave reviews. You've heard the rave reviews. It's incredible. And until Sunday at midnight. So it'll be the first of June. That's two and a half more days. You can get a free bottle@the AlexJonStore.com right now. Right now. Buy two bottles already discounted. Get the third bottle free by four discounted. Get two free and you get 50% off if you subscribe. Cancel any time on all your orders of that product going forward. As long as you don't stop your subscription with one click just in your profile. This is the best deal ever. Even though we're going to sell out very soon. And more, it's coming in because I want those of you who've been on the fence despite all the rave reviews, everything you've seen, who haven't gone to the auctionstore.com that isn't owned by me. So even they shut down M4s, they can't get it. It's our sponsor for the auctions network. It's so critical to keep this mission going, but the product is amazing as well. Get your ultra methylene blue and become a subscriber as well right now and back. This important work that we're all doing together because you're not just backing the infowar. You are the infowar. You share the reports, you have the word of mouth, you pray for the broadcast. You buy the products. Why the selection of Patriot apparel? What an adventure to wear. Then why does selection some of the best designs the alexjonestore.com and everybody should become a VIP. You get $40 to spend the store each month for $30. You can cancel any time. $30 a month is you 40. If you're gonna buy anything, everybody should be a VIP. You get special deals, special offers. Everything is lower priced at checkout automatically when you're a VIP. Thealexjonestore.com we're saving lives. We're making ourselves healthier. It's a symbiotic relationship. It's a 360 win. The only way we fail is if you don't take action. The alexandstore.com but regardless, share the live feed right now at Relox Jones on X and infowars.com forward/show. And we'll be taking the first 30 minutes where I expose Fauci. Caught with a mass grave of dead black kids in New York and posting that to X. I suggest you share it. We got to discredit these People because they're getting ready to try to launch new bio attacks. They've been bragging about it. This is a life and death existential situation.

Speaker A: All right.

Speaker B: I said months ago when Jamie White was murdered execution style with one 9 millimeter bullet through the carotid artery outside his home in South Austin, there was probably gang bangers and probably racially motivated because it's 1521 depending on the area you're in. White's being killed. It's open season. And now one of the people that supposedly pulled the trigger, he's been charged with a capital murder. The arrested all four of them. They've all been charged capital murder because it was part of a crime and in the law it's seen as then premeditated. They're all accessories. Two are juveniles, two aren't. And the police are putting the affidavit that the murder suspect rapped about killing Infowars writer Jamie White. White boy came outside, hit his damn ass with a nine and we'll put the mug shot of this individual up on screen for folks very, very sad, very very disgusting that that is what we have come to. And you've got the DA and the defunding the police. It's just serious crime, massive violence. Three new arrest suspects wrapped about homicide of Infowars employee kxan. The Abbot David says one of the lyrics included mention of White's name and reference what happened including white boy came outside, hit him with a damn nine. Read the rest of what's in the song at infowars.com Rodney Charles Hill, 17 and in his mug shot he doesn't look like he's too upset now. I did a 16 minute report before we knew this last night about the new people that have been charged and I said probably racially motivated. But we don't know that. And now clearly it was at least partially. The full reports up on x@infowars.com we're going to play about 11 minutes of this as we go to break and it is tomorrow's news today. But we love you Jamie and our prayers go out to your family. We thank the listeners for all their support for Jamie and his family now. But this is really disgusting. And again it goes right at the feet of the Soros. DA Crimes more than doubled since he took over five years ago. He lets people out of jail with no bond that shoot people in cold blood. And if you defend yourself he throws the book at you. Famous cases we've seen when Antifa comes and points a negative 47 at you and you shoot the guy in your car, well, you go to prison, the governor has to pardon you. So it's all part of the communist destabilization operation which live under here is part of my report.

Speaker A: This data led us to the identification of four suspects. All have been arrested, all have been charged with capital murder. In this case they are identified as Eloy Camarillo, a 17 year old Hispanic male arrested on April 30, a 15 year old juvenile arrested on May 5, juvenile male. A second 15 year old juvenile male arrested on May 20. And Rodney Charles Hill, a 17 year old black male, arrested on May 27. Just to clarify state law so you guys understand why they're charged the way they're charged. In Texas, the offense of capital murderer includes intentionally committing murder during the course of kidnapping. I'm sorry, during the course of a kidnapping, a robbery, a burglary, an aggravated sexual assault, obstruction or retaliation or terroristic threat. In this case, the suspects entered Jamie's vehicle, also a key of soul, with the intent to steal it. In the state of Texas, when a person enters a vehicle with the intent to commit theft, they're committing the offense of burglary, burglary of a vehicle, making Jamie's murder a capital offense. Additionally, Texas law stipulates that that a person can be held criminally responsible for the actions of another. If in the attempt to carry out one felony, another felony is committed by one of the conspirators, all conspirators are deemed guilty of the felony actually committed. Therefore, all the suspects in this case have been charged with capital murder.

Speaker B: Two more suspects, bringing the total number to four, have been arrested in the brutal execution style murder of our great reporter and good personal friend, Jamie White a few months ago. The Austin Police Department has done a really great job tracking this down and bringing these alleged perpetrators to justice. They're all facing the death penalty for capital premeditated murder. Because when you go out as an armed gang to carjack and rob people and then somebody gets killed, they're all guilty. And I absolutely agree with that. So death penalty for bandits that kill innocent people. And again, the scourge of white people being killed in the crime statistics, you're 10, 12, 15, 20 times more likely depending on what area you are in the country. It's all above 10 times more likely to be killed if you are white. I Hispanics, particularly black folks. And this was a group of three Hispanics and a young black man. Two are juveniles, two aren't. So we only know the names of two of them, but we do know their race. Only reason I point that out is imagine if we had thousands and thousands and thousands of white people in gangs going out and murdering blacks and Hispanics. It is, it is open season on white people for whatever reason. And I'm not saying this was particularly racially motivated because you've got these Hispanic and black gangs killing each other and, you know, killing their own race and it's terrible. But when a white person here or there kills a black person who's innocent and it's terrible, you never hear the end of it or even it's questionable like George Floyd. And then you hear that there's this epidemic of white people out committing all these crimes and whites are attacking Asians, basically doesn't even exist. It's, it's just made up. And you got all these Soros DAs with the crime waves, not prosecuting violent offenders. And you've got all these illegal aliens in sanctuary cities that have committed crimes being let loose. And you've got in many cities up to half the cops being let go, including a third of them here in Austin by these leftists. And it has created a crime wave. It has created just an explosion. And now places like Denver, 60% drop in homicides in just the last 130 days, all because of violent TDA and MS.13 being arrested and deported. We're seeing numbers 25% down in D.C. because of deportation. So Trump is bringing aid and relief from these gangs and the Democrats are trying to protect them and these judges are trying to keep from being deported out of the country. Now it looks like all these individuals were US citizens, but the two we do know of, you know, busy wearing their Mexican flags and, you know, running down America. You can just kind of see the cold blooded gangster attitude that, hey, I'm just going to go ahead and execute this white guy because he's a white guy deserves to die. I don't know that was in their minds. I just know it continues to be the same story over and over again. And why is it we had a white guy executed a few weeks ago in North Austin by a bunch of young people and it's, it's out of control. So our hearts and prayers go out to all the victims. Nothing can bring, you know, Jamie, you know, back. It's, it's very, very painful for his family and for the crew. But at least these perpetrators, alleged perpetrators, are not going to be out there and able to do this. And I expect they're going to get the death penalty and that's a good thing because they took Jamie's life. And we just send a message to these young thugs, whether they're white, black, Hispanic, whatever they are, that this open season crap is over. So, again, nothing can bring, you know, Jamie back to us. Every time I see this picture, it makes me sick. He's such a great guy, so smart, so classy. And the left literally trying to protect these gangs, trying to, you know, have the prosecutors just turn them loose when they commit all these crimes. And so much this death and destruction lies right at the feet of the Democratic Party and Soros, the rest of them. But in the EU and the uk, it's the same thing where it's just open season on white people. And then the media tries to cover it all up, but it's not working. People know the truth. We got Tommy Robinson just got out for months and months and months of solitary confinement for rightfully exposing Pakistani Islamic child kidnapping, rape, gangs. I mean, you know, the ultimate crime is exposing the fact that it's open season on white people. But. But more than them just targeting white people, it's that if you go to Pakistan or these other countries, they're way more violent, way more dangerous. But we are taught that only white people can do wrong. And the west is evil because the west has a big conscience and actually wants to be good. On average, it has the Christian ethos. So the left manipulates that liberation theology and says, we'll be a leftist. You know, Jesus, you know, wanted open borders. And, you know, the Pope, the last Pope, said, we've all got to, you know, submit open borders up at Vatican City, wouldn't take anybody in. It's all hypocritical globalists using thermal populations to conquer the west and brainwash them and turn them into communists, basically. Well, a lot of them coming here, Communists to begin with, like from Venezuela. And so, no, it needs to stop a moratorium on all immigration until we get control. The 25 million, that's what it is, that were shipped in under Biden, and until we find and save the children that were trafficked as well. And that's starting to happen. So, Jamie, we love you. You'll live forever. And we just really, really appreciate the awesome police for the job they're doing, despite the fact that they openly, to us, you know, even attacked the Soros DA and said, yeah, it's just absolute hell, you know, the job they've got because they got rid of a third of the cops, then some quick, because the demonization and not being backed when they're, you know, in dangerous situations. And then about half of what was left got put in more social work, PR type garbage, so. So Austin's got about a third of the cops. It used to. And thank God we still have a second amendment to defend ourselves. That's one of the few things holding back a total crime takeover. Here's the full local newscast.

Speaker A: At approximately 11:56pm first responders were called to 2336 Douglas street about a male who had been shot. That male was identified as Jamie White. He was pronounced deceased. The Travis county medical. I'm sorry. The Travis County Medical Examiner's office conducted a postmortem examination and ruled that the manner of Jamie's death was a homicide and the cause of death was a gunshot wound of the head. Evidence found at the scene led us to believe that the suspects in this case were attempting to steal Jamie's vehicle, that he confronted them, and that he was shot as a result. During the investigation, we relocated surveillance video from surrounding businesses and residences. We were able to identify the suspect vehicle as being a black Kia Soul. That vehicle was identified as having been been stolen from an apartment complex in Kyle on March 9th. That vehicle was recovered abandoned by the Austin Police Department near Springdale Road on March 10. We located surveillance vehicle surveillance video from the apartment complex where the black Kia was stolen in Kyle.

Speaker B: That video.

Speaker A: From that video, we learned that the suspects were driving a silver Kia Soul when they arrived to steal the black Kia. We were able to identify that vehicle, the silver Kia Soul, as having been stolen on March 10 near Springdale Road, very close to where the stolen black Kia was abandoned after Jamie was murdered. We were also able to locate license plate reader scans of the stolen silver Kia's license plate. Using all that data, the locations and the times. The locations included where the silver Kia was stolen, the location where the black Kia was stolen, the location of the license plate reader scans, the location of Jamie's murder, and the location of the black where the black Kia was abandoned after the murder, along with very specific time frames from each location. We served search warrants to cell phone carriers for the cell tower data for those locations in very specific times. Using that data, we were able to identify a cell phone that was communicating with cell towers in those locations at the specific times. We then served a search warrant on that cell phone to that cell phone carrier for the call detail records for that particular device. And the data showed us that the individual who. The individual. That data that we got back showed us who the individual who owned that phone was communicating with immediately before, in fact, the Republican movement, the Patriot movement. I shouldn't even use the term Republican anymore because we're so much better than that. Republicans are so much better than Democrats, but patriots are so much better than either. This populist movement has been so accustomed to losing, to being the underdog for so long that I think for a moment there, we lost our footing as we gained total power in this administration. And it's not just the White House, but it's the Senate and the House of Representatives where we dominate. And now it's just becoming clear where the Rhinos are. Frankly, the Rhinos aren't even really rinos. The Rhinos are just what the Republican Party turned out to be the whole time. The Republican Party itself is a rhino in the sense that it's not actually living up to its values, principles or promises. But now it's becoming clear where the real issues are, where the real obstacles are, inhibitions are. When you have the Mark Levins and others who we thought were bastions of conservatism, where you have the Ben Shapiro's who used to have billboards outside of Los Angeles that said drive conservatively with a radio station listed there, now we're seeing who really just wants war, war, war, war, war. Who's just compromised. But we have these rogue judges. This was breaking yesterday, but this has been an ongoing strategy that the first thing they do is they immediately block executive orders from the Trump administration because there's been so many and they're just so massive and awesome and amazing and apparently the establishment and the leftist population population just wants us to lose and suck at everything and compromise all of our interests all the time. But the strategy is Trump signs executive orders, then a judge blocks them, then the Supreme Court supports Trump and it's not even like split by conservative versus Democratic judges. You have even left wing, left leaning Supreme Court justices that are siding with the Trump administration on some of these executive orders that are blatantly obviously constitutional for the President of the United States. Don't get me wrong, I understand that there's gotta be a number of the executive orders that have been signed and administered that are questionable and should be litigated. I get it. Every president signs executive orders. And after all, we do have checks and balances. You can't just rule by executive order in the United States. It's not temporary dictatorship. But that's not what Trump's doing. The vast majority, especially the most popular ones, the most famous ones of these executive orders have been blatantly explicitly constitutional. I mean, name tariffs, for example. Oh, Congress is the one that's responsible for levying Texas. Yeah. And the American people. But the president of the United States has explicitly delegated the task of international trade agreements. And tariffs are leverage in international trade agreements. So yesterday it came out that Obama judge blocks Trump from canceling Biden era parole program that ushered in hundreds of thousands of migrants. Then we have the Supreme Court ruling today, just before the Alex Jones show began about an hour ago in an 8 to 0 ruling, reigned in judges just a little bit as rogue judges wage a war on the Trump administration. The high court limited judicial review in cases related to energy and transportation projects and infrastructure. And of course, the breaking story is that the Supreme Court ruled in a 6 to 3 decision, I believe that Trump is allowed to terminate the legal status of 500,000 people in the United States, half a million people, something that was blocked just yesterday. But here's Fox News clip 26 Breaking down the latest Supreme Court ruling countering these rogue judges who are simply trying to obstruct the Trump administration by any means necessary despite the fact that Donald Trump won the popular vote. Watch from the US Supreme Court, the president has notched a win a moment ago. The U.S. supreme Court has allowed the Trump administration to revoke the temporary legal status for hundreds of thousands of immigrants. Now, they come from four countries, Venezuela, Cuba, Haiti and Nicaragua. They, they came into the country through an app that was established during the Biden presidency years. And for the moment, it appears that the Trump team who they've made it their objective to deport those who came in illegally. This would be a win for the administration handed down by the U.S. supreme Court just a few minutes ago. So that's the latest watch on that from Washington, D.C. and here's MSNBC and clip 51 telling the same story. Let's watch their analysis. Justices now allowing the Trump administration to revoke protected status for half a million immigrants from Cuba, Haiti, Nicaragua and Venezuela while the appeals process plays out. Gary, fill us in. Yeah, it was a 7 to 2 decision. That means that all the conservative justices and Justice Elena Kagan voted together on this case to allow President Trump to end these product protections for more than 500,000 individuals from Cuba, from Haiti, from Nicaragua and from Venezuela. Justice Ketanji Brown Jackson and Justice Sonia Sotomayor dissented in this opinion. They said, quote, it undervalues the devastating consequences of allowing the government to precipitously upend the lives and livelihoods of nearly half a million noncitizens while Their legal claims are pending. Now this all becomes become. Homeland Security Secretary Kristi Noem had been seeking to end this Biden era program that allowed these individuals from those four countries to live and to work in, in the US for up to two years. And now it was that two year deadline that the, that the Trump administration was unhappy with and was trying to move up and to get these folks out of the country. Now, in terms of what is going to happen next, these individuals are going to have to find another reason to be in this country, another legal reason to be in this country that could come via a student visa, that could come via a different type of work visa, but there has to not be through this program, at least while appeals are underway. Now, this could of course change, right, because the appeals court could reverse what the Supreme Court has said here and that it could go back to the Supreme Court. But this all started where a Massachusetts US District judge said these administration could not just sweep this away entirely without these individualized determinations. Now, the Trump administration argued you can't individually determine with 500,000 people in any sort of specific amount of time. It needs to be done faster that the judicial branch has been weaponized by the left. When they can't win the executive branch, when they can't win the legislative branch, then they just buy the judicial branch. Soros for years has been doing things like not only arbitrage in the United Kingdom, crashing economies and currencies in order to become a bond villain. And he's been not stopping at things like buying hundreds of radio stations or other media outlets. Obviously they're all working for the same deep state operation. He's been going beyond the fact that he funds NGOs that basically dictate foreign policy all over the world for the United States of America. This is something that Mike Benz outlined beautifully on Tucker Carlson's podcast recently, but he's been funding things like district attorneys and judges, elections that most Americans don't really pay attention to because we're all distracted with who's the president, what's Congress doing, what's happening at the federal level. Meanwhile, Soros is scrambling around and collecting judges like a madman. And this is what happens then, then when the people finally rise up against the political class that has sabotaged them, exploited them, sold them out by electing a MAGA Congress, a MAGA Senate and House, and a MAGA President of the United States, a populist movement, then all the legislation or policies that are passed by these leaders, the very policies that the American people voted for then the judicial branch can just come and say, oh, actually, that's against the rules. They're like a bad ref in a sports game. I'm sorry, can't do that. Oh, sorry, can't do that. Just blowing the whistle all the time. Erroneously Bad calls all the time. And here's clip 61 of Stephen Miller. Really just absolutely annihilating these rogue judges last few weeks. Yet even just yesterday we saw whenever a judge rules against this administration, you say they're going rogue. Do you think a judge should just rubber stamp what your White House does? If not, what checks and balances do you think should be in place for this White House? It is not the job of a district court judge to perform an individual green light or red light on every single policy that the President takes as the head of the executive branch. Just think about the premise baked into your question. Respectfully, Pam, you're saying that when the American people elect a President of the United States of America. I'm not saying the. Well, it's the implication. Who is the sole head of the executive branch? Let me finish. I will answer the question happily. But look, when you have these kinds of lazy assumptions built into questions, it makes it hard to have a constructive. What is a lazy assumption? I said, you all had a win. You said, no. You said, is it my expectation? I'm speaking. You said, is it my expectation? It's not just you, it's the whole media. In other words, when you hear sentence, it is a completely fair question. You say, jugs rule.

Speaker B: No, no.

Speaker A: And I will gladly answer it when you say, do we think district court judges should rubber stamp each action? There is a premise that is built into that. That is absurd. The President is the sole head of the executive branch. He's the only officer in the entire government that's elected by the entire American people. Democracy cannot function. In fact, democracy does not exist at all if each action the President takes, foreign policy, diplomatic, military, national security, has to be individually approved by 700 district court judges. That's democracy. So there's 15 communist crazy judges on the court that each of them as a team working together, can block and freeze each and every executive action. Joe Biden was allowed by that same court system. Some of them turned 20 million. Why did Trump put these crazy communist judges, as you call them, on the. You heard, you heard, you heard President Trump himself say that the Federal Society and Leonard Leo has created a broken system for judicial vetting. And God knows this time around, we are not. Does that mean he doesn't support picking Amy Coney Barrett for the Supreme Court. What it means is simply this and nothing more. We're not going to be using the federal society to make judicial nominations at all going forward. But, and the fact of the matter is, the entire establishment, I guess it's not even really the establishment anymore of our political class, has sponsored the undermining of the integrity of this nation for years and years and years, namely under the Biden administration. When they knew that he was insane, when they knew that he had cancer, then they lied about it. Now they're acting like they're surprised about it all while they facilitated and allowed for the invasion of our country to the tune of 10, 20 or even estimates as high as 30 million people, 30,000 of them at least, military aged men from China. We've talked about it numerous occasions on this very network. You've seen the footage a million times. I don't even need to show you. You've seen what it looks like when 30,000 Chinese men stand at parade rest at the southern border. How did they get out of China? Why are they here? And why is it that these judges were nowhere to be found when the invasion of our country was totally allowed? It wasn't even a Trojan horse. They didn't even have to sneak in. We just let them in. And it's because there's no such thing as judicial review anymore. There's only democratic dogma, weaponized lawfare. And so what we're seeing now is the people versus the political class personified in this administration. When they push back against the Trump administration, they're pushing back against the American people. And I think Stephen Miller said it beautifully. I always knew it to be true, but I never really thought of it like that. The president of the United States is the only political office elected by the entire people of America, the entire population. And so when they push against that administration, they are really pushing against us. And it wasn't like some shady victory that he had where he stole the election like Biden did in 2020. He had the popular vote. More people voted for Donald Trump than any other candidate. And it wasn't even close. It wasn't nearly as close as they said it was. They tried to steal it, but it too big to rig. Here's Scott Jennings last night. This is clip 32 talking about China and how our immigration policies and our open borders over the last four years have been exploited by our enemies who are undermining our own national security. This is the real national security threat, not domestic white extremism let's watch. It is obvious to me and should be obvious to everybody that China and other foreign countries are sending people here for nefarious purposes. And not only that, they're taking up slots in universities that could be taken up by American students. It's not just China, though. Look at what happened at the Harvard commencement today. You got people up there again with the anti Semitism coming in from foreign countries. I don't understand why people believe that we have to continue to take in people from around the world who fundamentally either despise America, hate America, want to tear down the west, or want to spy on us. We don't have to do this. Thank God Rubio is taking the lead on this because I think he's the right man for the job. It may not be all of them, but it's going to be some of them. And why not?

Speaker B: Look at it.

Speaker A: I'm going to show clip 34 next. This is Democrats victimizing every instance of a criminal alien. And we've seen this over and over again, where the Democrats famously will take one anecdotal thing and they'll use it to make claims about a systemic issue, and then they'll totally ignore that approach and do like the inverse where they'll totally ignore that a single individual happens to be a member of a gang, happens to be a drug runner or a murderer or a rapist, and they'll advocate on his behalf. So when we're deporting people back to their own countries where they're imprisoned in their own countries for crime that they committed in their own countries, we have Democrats flying over there frantically trying to meet with these people to get them back into the United States. Will they do no such thing for the Otto Warmbiers or the journalists who have died in prisons in Ukraine, the American journalists who have died in prisons in Ukraine. It's absolutely unbelievable. Here's clip 34. Immigration case, though. You said this person might be the victim here, and I'm not disputing that this letter might have been made up. This person's not a victim. Ramon Morales, age 54, has entered the United States illegally at least nine times between 1998. Since 1998. Criminal record including felony hit and run, criminal damage to property, disorderly conduct with a domestic abuse modifier. So even if this letter was made up, he should be deported immediately.

Speaker C: But here's here's my question.

Speaker A: This is another case, and we've talked about a few of them on this show, where you get an illegal immigrant who's in the country for a number of years, who's come in and out of the country, who has a crim, a long criminal record. And I think people are going to look at this story and say, wait, wait a minute. Why is this person here right now? Yeah. And you see the look on their faces too, as they watch Scott Jennings basically murder their entire worldview right before their eyes. The only unborn child they ever cared about. This leftist philosophy which they seek to manifest and give birth to, just slaughtered right before their eyes because they know that he's right and they know that they don't have anything to say. And so they try to recharacterize what he says back or what we say back or what we do. You can't have these people in the United States of America. I don't even want to. Americans here who are criminals, of course we shouldn't deport them. There's a reason that we isolate people from civilization or society when they're dangerous and they violate our rights. I mean, frankly, the entire purpose of a government is to ensure that the rights of individuals are not violated by third parties. The government's supposed to protect borders, enforce contracts, and protect rights. That's all that it's supposed to do. Those are like the only three things that it always fails to do. It tries to do literally everything else except for the three things that it's supposed to do. Here's Cuomo in clip 18 talking about how the right is using a single homicide to justify this political movement against allowing the invasion of our country. Let's watch.

Speaker C: Feel about the parties.

Speaker A: They are the problem.

Speaker B: They are the root of this binary.

Speaker A: Battle to the bottom. The division is almost exclusively manufactured. We are fighting over culture issues and controversies that are completely made up. We divide this country over a single.

Speaker B: Homicide of somebody and it's absolutely wrong.

Speaker A: What happened to Lincoln Riley, is horrible. It's one too many any way you want to look at it.

Speaker B: But it is also an artificial issue.

Speaker A: We have crime issues in this country. Our homicide problem is not from illegal immigrants. Okay? Yeah, but there shouldn't be any.

Speaker B: There shouldn't be any of a lot.

Speaker A: Of things that we haven't made a top priority. The division is manufactured. Okay, Cuomo, now do George Floyd. Oh, it's a problem that we use this one story to make the claim that illegal migrants are committing crimes and murders and rapes in the United States of America. All, oh, that's a problem when you guys literally burned down the entire country because of the questionable death surrounding. George Floyd backed it up, paid for the bails, sponsored the burning of cities. Police precincts burned down. There was a single person in Louisiana who got the bird flu in California justified a state of emergency because of that. A single person. But, oh, we can't do it. It's unbelievable to me, the cognitive dissonance of these people, this movement. It's totally dishonest. And it's the same rhetoric that we see when they talk about the South African refugees that we've taken in. We've taken in what, like 50 South African white farmers or white people that are fleeing the country because there are stadiums full of people in South Africa calling for their murder. There are cemeteries, crosses lined up, cross after cross on the road of farmers who have been murdered. Then we had a headline last week where it said, of the over 25,000 murders in South Africa last year, 25,000, only 1% of them were white farmers. So it's not a genocide. It's the same angle. That's what they said. Oh, so 250 white farmers were murdered because they're white farmers? And you don't think that's a genocide? You don't think that they're being eradicated because of their race? And we're seeing the same rhetoric from our own side. Here's clip 23 of Don Lemon saying that we should just ban white people from the United States. Remember, he had the Muslim ban.

Speaker C: And I said, well, why isn't anybody.

Speaker A: Trying to ban white guys from this country? And you would have thought that I had, you know, cut off, you know, a left, you know what? Or I had taken their firstborn kid or whatever for telling the truth and what the statistics were showing with the FBI data. Why do you think that.

Speaker B: Why do you think that these white.

Speaker A: Dudes, these white guys are so triggered. Why are they such snowflakes? And they claim other people are. First of all, every single time I see Don Lemon now, he's in a trashier room, a cheaper room. He's literally the opposite of the American dream, where he started at the top for no reason. He was just born into fame and public figureness. And then he gets fired. And you see him in this, like, kind of cool high rise in New York, talking about the new studio that they're building. And then all of a sudden, you never see him there again. Then you see him in the streets, and then now you see him in a Holiday Inn conference room. Like, where is he? Next time we see him, he's going to be studying long division in an inner city school. Literally the opposite of the American dream. But it's neither here nor there. We got more news to cover on the other side. I'm going to get into the Golden Dome stuff, the Tapper stuff, the Democratic Party's attempt to rebrand itself, who they've hired to do that. How disgusting it is. But folks, you have to go to the alexjonestore.com and support us, but not just because we need your help and we're fighting against the globalist and the New World Order and we're trying to save humanity from the depopulation agenda of the evil satanic cabal, but because these products are actually awesome for your mind and your body. Whether it's the methylene blue, which is great for your energy focus, dropping off that extra electrons for your mitochondria, the battery powerhouses of our cells, or enabling your body to absorb oxygen more efficiently so you just generally feel like you have a breath of fresh air, or whether it's the ultimate life force, which is just an amazing blood cleaner. So good for your body for so many reasons. It empowers the engines of your body, responsible for detoxification. And there's also been a lot of discussion recently about your mental and physical capabilities while you were in office.

Speaker C: You can see that I'm mentally incompetent and I can't walk and I can.

Speaker A: Beat the hell out of both of them. Do you want to reply to any of those reports? And also to the fact that there are some Democrats who are now questioning whether you should have run for reelection in the first place.

Speaker C: Why didn't they run against me then?

Speaker A: Because I beaten them. Do you have any regrets? I mean, it's sad at this point. I saw this new clip today. I'm going to show you. It's clip 19. Tapper has been doing this bizarre PR tour where he basically goes on podcast after podcast or news station after news station and talks about how terrible of a journalist that he is, in an effort to sell books, famously, of course, covered up for the fact that Biden was in decline even though everybody knew it. Now he's writing a book, acting like he. He's revealing for the first time that Biden was in decline the whole time, even though everybody knew it. And he's using the same rhetoric and all these appearances, things like when I reflect on my coverage, it gives me a sense of humility. He's always talking about reflecting on his coverage and having a sense of humility. Humility. And it's obvious that it's been focus grouped what he's supposed to say, but I don't know who he hired. Whoever he did hire to manage his public relations should be fired immediately because his career is tanking similar to Don Lemon's right before our eyes. Let's watch. But would you say that looking back at the body of your work over the past duringduring the Biden White House, that you could have brought a level of skepticism, scrutiny and curiosity to this story? I think, I mean, of course I don't think there's any, there are very few members of the legacy media that I couldn't, that I don't think could say that. But I will say that in October 2020, I interviewed Joe Biden and I asked if he would take a pledge to be transparent about his health. And in October 2022, the only time I had an interview with him during his presidency, I pointed out that the American people think he's too old. Whenever he's asked about that, he says, watch me. They're watching him. They still think that. I had skeptical interviews with Karine Jean Pierre in 2023 and after the her report, I had Kate Bedingfield come on the show and I was not Robert Herb Basher. I completely thought that he was accurate and I didn't understand what I was seeing from the White House or from other journalists that didn't see what we were all seeing. So I think that there is reporting that I'm proud of that are also, that is also part of the record. But on the whole, I wish we had broke. I wish these 200 sources had talked to us two years ago. And I wish I'd known what I know now. I would not say I was incurious. I would say that I was one of the many people who was asking about this and was lied to over and over and over. And it wasn't just, you have to remember the Biden people were not only lying to the press and they were not only lying to the public, they were lying to donors, they were lying to their cabinet secretaries, they were lying to Democratic members of Congress. A cover up. And like I said, this was almost a successful one. Even though we all saw him aging, we didn't know he was, you know, he had these moments of non functioning suggests that there's a lot of people in on something and whether they were doing it because they believed it or they had been told it, I'd still, at the end of the day, for all the criticism of the media that I'm not pushing back on that I agree with at the end of the day, the Democrats did this. At the end of the day, the Biden family and the politburo did this. And yes, there were those of us who should have pushed back more. But if you can't get any official to tell you it's really bad behind the scenes, let me tell you how bad it is. I don't know what more we could have done, and I wish that those people had been more willing to talk to the press. Well, you could have told the truth like we did here at Infowars, like Alex Jones did, Owen Schroyer, Harrison Smith, myself, and frankly, basically anybody with a podcast or any audience whatsoever. Everybody knew Tucker Carlson was reporting on it from his podcast, that he knew from insiders that Joe Biden had to be hopped up on amphetamines, that he was delusional, that he was only operational for, like, four hours a day. They were sundowning him and celebrating the fact that they were giving him ice cream cones, as if it was just, oh, look how cheery and friendly and relatable the President of the United States is. Yeah, maybe relatable to anybody dying of dementia. Oh, that guy's just like me. But not to the American people whatsoever. And frankly, this is why the legacy media is just dead. This is why the Tappers are on the decline. I'm gonna play clip 36 here in a second. Apparently, Tapper's ratings Now, less than 100,000 people even watch his show. It's like primetime CNN television. Less than 100,000 people. It's absolutely absurd that these people have any legitimacy whatsoever. The only time people pay attention to them is when they're mocking them. It's like nobody watches the View. People just watch clips of the View getting destroyed by everyone else who makes sense in an entertaining way. Nobody watches cnn. They just watch CNN get destroyed. I mean, the smartest thing CNN ever did was hire Scott Jennings to. To sit there in studio and destroy them live on tv. Because that's the only way anybody can handle consuming any of their propaganda as if it's immediately just annihilated by rational thought, reasoning, patriotism. They think, oh, Scott Jennings won't be able to bring us down. He's outnumbered. But the truth doesn't require more soldiers in and of itself. It is enough light to eradicate all darkness. Here's clip 36. How much money did Donald Trump give you to endorse him? $100 million.

Speaker B: No, he gave me.

Speaker A: No, he gave me nothing.

Speaker B: Gave you zero.

Speaker A: He gave you zero because you Thought, I think that this is what's best for the country, given the two options.

Speaker B: I knew the resistance that it would face.

Speaker A: But how much did Beyonce get? She had $10 million. 10 million. Hold on. She talked for, like, three minutes. That's good. What do you mean, that's good?

Speaker C: I mean, that's enough.

Speaker B: That's too much.

Speaker A: No, no, it's plenty. It's perfect. 10 million.

Speaker B: It's a good deal.

Speaker A: The taxpayers money.

Speaker B: I mean, it's a good deal.

Speaker A: All these people that are, like, donating money to the Democratic party and they're 20 million. Say, use the crazy thing, mutants. They're $20 million.

Speaker B: They spent a billion dollars.

Speaker A: They're $20 million in debt. And Trump offered to pay their debt. He's like, we have a lot of money left over because most of our media was too. Called it earned media. I had to look it up. So earned media is essentially whenever he's in the news.

Speaker C: Yeah.

Speaker A: Or when he's getting interviewed on shows or on podcasts. Yeah. That's earned media.

Speaker B: And that's what he did.

Speaker A: Well, as for Jake Tapper, to tie it all in, I just read last night Jake Tapper has his lowest ratings in a decade. He's doing less than 100,000 viewers in the key demographic. And it's because Jake Tapper is a liar. Okay? He's a feckless coward who refused to cover Joe Biden's decline in any real way. And he slapped his name on this book that Alex Thompson was already working on. So nobody should trust Jake Tapper. It's like the Hunter Biden laptop. They said it's Russian disinformation. It's not real. It's fake. We're all looking at the pictures and the videos from the laptop. So Jake Tapper, he can give Lara Trump an apology, he can express contrition. No one will ever trust him again because he tried to tell us not to believe what we were seeing with our own eyes. And they tried to gaslight us time and time again. And Americans are over it. They're changing the channel. So let's talk about what Democrats are.

Speaker C: Doing now, because the Civil War is fascinating to me.

Speaker A: Yeah, he's absolutely right. Nobody's buying it. Nobody gives their precious time to listen to someone lie to them unless they're trying to analyze the nature and motives of the lies. I mean, a lot of what we cover here are claims and reports from mainstream media outlets. And then countering them, we consume the news at an astronomical scale here at infowars. And so do so many others. But the only truth it can really tell you is what you read between the lines, because the lines themselves are the lies. With Joy Reid show I famously. Not famously, but I loved to call it read between the lies because that's exactly what it was. And look, I'm going to show you this clip of Biden apparently speaking for the first time since his cancer diagnosis was released to the public in clip 38 here. But he's not like this now. Suddenly he's always been this bad. And I'll show you some clips to give examples of how everybody knew it before. But let's go to 38 first. It's about something profound.

Speaker C: Our politics have become so divided and so bitter.

Speaker A: All the years I've been doing this, I never thought we'd get to this point. But we are our troops don't wear.

Speaker C: A uniform that says I'm a Democrat.

Speaker A: Or I'm a Republican, says I'm an American. I'm an American.

Speaker C: That's who I am. I'm serious about this.

Speaker A: I'm not joking. And folks, our politics has become, as.

Speaker C: I said, so divided.

Speaker A: They wear the uniform of the United.

Speaker C: States of America, the only nation in the world. Literally not figure. The only nation in the world founded on an idea. An idea.

Speaker A: Every nation was founded on geography, ethnicity, some unifying principle, but not an idea. Liberia now do Liberia.

Speaker C: The idea when America was found out.

Speaker B: We hold these truths to be self.

Speaker A: Evident, that all men and women are.

Speaker C: Created equal, endowed by the creator of certain inalienable rights, Life, liberty, pursuit of that we meant it.

Speaker A: That's who we are.

Speaker C: That's what makes America the most unique nation in the world. Literally, not figuratively. In fact, folks, you know, for generation after generation, the profound idea has been.

Speaker A: Defended by ordinary citizens who stepped up.

Speaker C: And answered the call. Because of them, American democracy has endured for nearly 250 years. Every generation, every generation, every generation has to fight to maintain that democracy. Every time. Every generation.

Speaker A: Because of them, our government is still of the people, by the people and for the people. They you can dress them up while you can't. Take him anywhere, folks. Here's. I'm gonna show you a couple clips of people doing impressions. Some of them knew, some of them from years ago. We always knew that he was a lunatic. He lost his mind. It's no surprise. Let's watch 49. If you told me to do impression.

Speaker B: Of Biden, I go, I don't know what he sounds like. But then when you hear someone do.

Speaker A: It, you go, that's it? Yeah. There's young people online that do some amazing.

Speaker C: But Biden was just, you know, kind of.

Speaker A: Kind of initiatives of my father lost his job.

Speaker B: Yeah, that's it.

Speaker C: No joke. No joke.

Speaker A: No one thinks it's a joke.

Speaker C: Not getting around here.

Speaker B: Come on.

Speaker A: Like the following flaws problemato in the Declaration of Impedance. The people all men are secreted equally.

Speaker C: Excuse me, Created, pardon me, Pirates of Caribbean.

Speaker A: Every debate. He just bullied whoever was up there. The only one who did pretty good in the debates against him, which actually helped him. That worked out for him because Trump's whole thing is he tries to get in the other guy's head. Dude, can't get Joe's head. Joe's not in there.

Speaker C: Good luck, dude.

Speaker A: Biden is Trump's kryptonite in a debate. Yeah, we always knew. And that was true. That was a great bit. Until June 30th or 27th, whenever the debate was this year. Can't remember the exact date when it was just undeniable at that point. There was no plausible deniability that he was a lunatic. He lost his mind and he should not be the President of the United States. And now they're acting like it's a big story that it was Jill Biden's chief of staff that was actually running the White House. It was run by the deep state in committee because the President United States was sundowning or taking a nap or incoherent or. Joe can't meet right now. He's not feeling very well. Putin famously telling Tucker Carlson that he hadn't heard from the President of the United States since the beginning of the Ukraine war, the closest escalation toward nuclear war that we've seen in decades, since the Cold War, frankly. And you're not communicating with Joe Biden. Well, why not? Vladimir Putin? Oh, it's because everybody and their mother knows that he's lost his mind. And the United States of America is being run by staffers and interns and intelligence officials and cabinet members. And Jill Biden and Hunter Biden. Joe Biden's not even signing the pardons himself. Apparently Elizabeth warns behind it. Or citing the executive orders himself legislation. Apparently the only thing he really did sign himself was the pardon for Hunter Biden. That was like the last thoughtful cognitive thing that Joe Biden did. Of course he would pardon his own son. It was wrong. He lied and said he wasn't going to do it and then did it. Hunter Biden certainly doesn't deserve a pardon at all whatsoever. But I understand blood is thicker than water. But the blood of patriots is thicker than water. And patriots spoke on November 5th. But the Democrats are freaking out because they've lost all support, especially among young men. I'm going to show you clip 21 here in a second. But apparently they're investing like $20 million in trying to figure out why young men don't like them, even though it's abundantly obvious. And part of that hiring decision was to hire this woman, Olivia Juliana, as part of their efforts to reach out to young men. Overhead cam, please. This behemoth right here. Look, young men like the movie 300, not Olivia, who's 300 pounds. I want 300 Spartans, not 300 pounds. Okay? I want a future that's plausible. I want to reach self actualization. I want to be not told that I'm inherently evil because of my race or gender or sexuality. But okay, I guess maybe we should listen to Olivia. Let's look at clip 21. I'm happy that she's spending time on college campuses. She also said she's lost 65 pounds. That's a great start for her. She looks incredible. I'm happy to see where her journey takes her. But I also know a thing or two about men, okay? I know what boys like. I actually do know because I am a man and I've been dealing with them my entire damn life. So let me tell you why men left the Democratic Party. Number one, they're tired of apologizing for their masculinity. Right? If a guy sits too comfortably, he's manspreading. If he's explaining something, he's mansplaining his max. His masculinity is always called toxic by the left. Men to want to have to constantly apologize for being themselves. And then the Democrat Party. I don't know about this Olivia Giuliana person. Can you guys even define what a man is? How can men feel welcome in the Democrat party when they can't define what a man is? And I'll also say there are tons of dads and brothers out there that don't want to see their girls sports teams infiltrated by men. They don't want open borders where you have Abrego Garcia and folks coming in who rape, maim, and kill young women. Men want to protect. They want freedom, liberty, and they want to protect their household. You don't see that on the left. No, absolutely not. And you're right, they. All the left does is they. They call men toxic. They have just been demeaning them. Let's hear from calling Olivia Giuliana herself. Apparently she's responded to some of the backlash. Here's a clip. The reason why Republican messaging resonates with men is because men want bad things. Right. Men want to have sex and, like, own women. Right. Like, they want to dominate everybody. And Republicans say you get to do that. And then Democrats can't say that. So we just lost men. It's over. Right? Like, what are you talking about? Like, a lot of times it will be men. Like, what is going on? Like, we're. There's a lot of men that don't think that way, obviously. And it's just such a negative view to take on, like, half of the human race. Well, I also. I also think it's just so abundantly clear that the people who say these things don't actually spend time talking to young men. You know this because I can tell you, not a lot of young men are talking to her. I spent a lot of time on college campuses, and I spent a lot of time with young men. I love young men. I love frat guys. And in that, I realized, like, even the ones that identify as conservative are almost always pro choice. They're almost always pro gay marriage. You'd be surprised at the number of them who support a Black Lives Matter. And so I feel like people just kind of lump them into this box when the truth is, again, a lot of them are with us on the issues. They're just not part of our coalition. Yeah, but those aren't even issues. The pro choice issue. You can get an abortion in the United States. Yes, states can make it illegal or difficult, but you can still get one. So that's not an issue. She's like, a lot of them believe gay marriage should be allowed. Yeah, but that's not an issue that was ruled on years ago. That's not a new issue. That's an old issue. Oh, Black Lives Matter. A lot of support of Black Lives Matter. That was, what, five years ago? They don't get it. They're hanging on to the past. They're living in the past. They're trying to resurrect issues that have been solved or never were issues to begin with. And frankly, it's indicative of their number one incentive, which is to keep these problems problems forever, because they don't know how to pivot and create a new platform. You want to win over young men, then start adopting patriotic, populist, traditional values. I am all for the Democratic Party winning over young men because what they need to do in order to win them over is become the populist party, has become the conservative movement, the MAGA movement, the Make America Great Again movement. But they won't do it. Fact of the matter is the Democrats have accomplished nothing other than keeping young men at home and shaming them to the point where they're involuntarily celibate into their 30s, living at home into their 30s, feeling like losers, feeling morally inferior because they've been told just because of their privilege they can never have an opinion on certain issues. I mean, here's clip 40 Fox did a segment the other day on stay at home sons. Watch this. It's a major problem. And you know, Speaker Johnson has been talking about those maybe deadbeat folks that are on Medicaid. And maybe some of those folks are the stay at home sons. We don't know. But I'll tell you this. Leave it to Gen Z to rebrand laziness and social awkwardness as something cutesy like a stay at home son. They did much the same thing with quiet quitting, where you can go to work and do less. And if you call it quiet quitting, it's somehow better. But Laura, I gotta tell you, this is also a big problem when it comes to, I think, declining birth rates, people not getting married and having children. You know, that's a big problem. They blame it on women. Well, look at what young women have to choose from. The pickings are slim. Yes, we might have a feminism problem in America, but it's the feminization of men. There are a lot of young women out there that want to get married, they want to have kids, they want to have stable families. But there are a lot of young men out there who want to live in mama's basement and order doordash. And therein lies a big part of the problem. Look, here's the deal. This is a major issue, the stay at home sons thing. The vast majority of men living in their parents basement into their mid or late 20s, even early 30s, don't actually want to live with their parents. What happens is they graduate from high school, they go to college, and they get some degree in sociology or psychology or just a General Business administration degree, which is so common, the market's so saturated, you have to distinguish yourself in other ways. Doesn't really mean anything. And then when they get out of college, they have a tremendous amount of debt with no prospects because they haven't been taught how to network. And not only do they have a bunch of debt because of the way our education system is set up with Student loans, but their money's worthless. That they do make because inflation is insane, because our money's a lie. So they have to pay off all this debt for an education that brought them no value while they're working jobs that high schoolers work, door dash, whatever. And they have to live with their parents because the interest rates are so high and the down payments on the houses. 10, 20, 30, $40,000, the average cost of a house, just totally out of reach for young men. So they live with their parents, and if they live with their parents, no woman wants to marry them because you don't want to get married and move in with your husband's parents. And so they're lonely and they engage in hookup culture. And because they're engaged in a hookup culture, the only women that they're associated with or they interact with are part of the ho culture. And so they start to believe that no woman could be trusted, and they all just want to hook up and they're all cheating. And then they become bitter and hopeless. They have no money, no woman, no family. They live with their parents, they don't have a really good job, their education is meaningless, and they're straddled with debt. This sounds like an economic issue. It's a cultural issue as a result of the inflation and the policies of the Democratic Party. Oh, yeah, yeah. We'll facilitate you getting in as much debt as possible for a worthless degree while we brainwash an entire generation of people to believe that everything about you is pathetic and you're a loser. And. And not only are you a loser, but because you're white and straight, you're probably a racist or a rapist. So as a white man, you're not supposed to be able to go to church, you can't have a job. You're supposed to make tons of money. But if you do make a bunch of money, it's because you're white privilege. So it's not because of any merit of your own. You're not supposed to live with your parents, but you can't buy a house. You're not supposed to want to get married, but you can't find a woman who wants to be with you because you live with your parents and they just put you in this circle, this trap of misery and suffering. And then they have Olivia Giuliana speculating as to why is it that we lost young men. I don't know. Maybe because all young men ever wanted to do was fight in a revolution for freedom and then have a wife that smiles when they come home in their own house. Something to be proud of, taking all.

Speaker C: That away, tariffs continue, because without the tariffs, our nation would be imperiled. We would really be imperiled. I think I can say that with great surety, Scott and Howard. And so we were very happy to get that decision, that big decision yesterday and today. It's about a man named Elon, and he's one of the greatest business leaders and innovators the world has ever produced. He stepped forward to put his very great talents into the service of our nation, and we appreciate it. And I just want to say that Elon has worked tirelessly, helping lead the most sweeping and consequential government reform program in generations. And, you know, the kinds of things that he's. He's found and his people have found. He's brought a group of very smart people in, and they found things that are pretty unbelievable. I have to say that the numbers that we're talking about are substantial, but they're going to be very much more substantial with time because many of the things that we're working on right now, we're going to have to remember Elon as we find him. But the numbers could double and triple because many, many things. We don't want to go out with them until we're sure, but we've found things that are unbelievably stupid and unbelievably bad. With the Department of Government Efficiency, Elon delivered a colossal change in the old ways of doing business in Washington. Doge has installed geniuses with an engineering mindset and unbelievably talented people in computers. I actually asked Elon one time what's. What's their primary thing? And they have a lot of primary things, all having to do with being smart. But he said the thing that they're really the best at is working with computers so that they can't be outsmarted by somebody that's not so honest. That happens to also be good with computers, but not as good as these people, but the mindset and the senior ranks of every federal department and really changed. And with Elon's guidance, they're helping to detect fraud, waste, and modernize broken and outdated systems. So, as you know, we're talking about various systems and changing systems. And, you know, sadly, it takes a long time to do that. You'll change, let's say, a system at IRS and computerize it properly, where the job can be done in one tenth the time. But it takes. It takes sometimes years to rebuild those systems. But we've started. In many cases we've started. I will say that this has less to do with Elon, but the air traffic control systems, we're bidding out to the best companies in the world. Those systems right now, they were, the previous administration was horrible what they did. They spent billions and billions of dollars and in the end it didn't even come close to working. They, they tried to hook up wire to copper and it can't be done. And they just spent billions of dollars and just wasted money actually made the system much worse. So we're going to get a brand new modern system. Congress is working with us on that and we're going to get it done as quickly as we can. But it's in the works and once it's done it'll be good for 30 years. But we have a system that's 48 years old and would have a modern computer hooked into a very outdated computer and they don't hook up. I mean they didn't hook up. So after spending billions of dollars they turned on the system. And in never any cases from local to countrywide, they never worked. More than 75,000 bureaucrats have voluntarily left their taxpayer funded jobs to come out and really do the do the job. Countless wasteful and unnecessary contracts have been terminated. And you know that we have terminated many, many contracts. And many contracts, Elon, are right now being looked at. And it may be six months, it may be almost a year in some cases. We're going through procedures, we're going through courts. And we'll remember you as we announce billions of dollars of extra waste, fraud and abuse. Just as an example, Doge cancelled $101 million for DEI contracts at the Department of Education. $101 million. And that was just a small section of the Department of Education. $59 million for illegal alien hotel rooms in New York City. And the landlord never made the kind of money that he made in the last short period of time. $59 million to a hotel in New York City. $45 million for diversity, equity and inclusion scholarships in Burma. In Burma. Does anyone know about Burma? $42 million for social and behavioral change in Uganda. $40 million to improve the social and economic inclusion of sedentary migrants. I can say it's $2 billion to Stacey Abrams and her environmental movement. There was $100 in the account and all of a sudden they found $2 billion in the account. And, and I assume that's being looked at. I don't know, I'm not sure, but I assume that's being looked at. Think of that. $2 billion. And then Lee will tell you there's another one over there for $20 billion being spent on another environmental crisis. 20 billion. Not 20 million. A lot. Not 200,000, which is a lot. So think of it. In her case, you have a hundred dollars, and now all of a sudden, she gets hit with an infusion of $2 billion just before I take office. $20 million for Arab Sesame street in the Middle East. Nobody knows what that's all about. Nobody's been able to find it. $8 million for making mice transgender. So they spent $8 million on making mice transgender. And those are better than many of their. I could sit here all day and read things just like that. But we have other things to do. So it's much, much more than just that. We are totally committed to making the Doge cuts permanent and stopping much more of the waste in the months to come. We want to get our great big beautiful bill finished and done. After that, we're going to be. We put some of this into the bill, but most of it's going to come later. We're going to have it cauterized by Congress, affirmed by Congress. In some cases, we'll make cuts. In some cases, we'll just use it in a different layer to save the money. But it's hundreds of billions of dollars. Doge has also fully modernized the federal retirement process and continues to work very hard on the IRS modernization. But we're taking that over with Doge. Many of the Doge people, Elon, are staying behind, too. So they're not leaving. And Elon's really not leaving. He's going to be back and forth, I think. I have a feeling it's his baby, and I think he's going to be doing a lot of things. But Elon's service to America has been without comparison in modern history. He's already running one of the most innovative car companies in the world. You look at his factories and compare them with some of the old factories we have, and it's a big difference. And the most successful space company, and I guess in history, you would have to say the largest free speech platform on the Internet, et cetera. Yet Elon willingly, with all of the success, he willingly accepted the outrageous abuse and slander and lies and attacks because he does love our country. I know that very much. He loves our country, comes from another country, a country that's going through trials and tribulations, I would say. But he's all about the usa, and Americans owe him A great debt of gratitude. So I just want to thank Elon for his time as special government employee. Can you imagine? They called him an employee, but it's a special government employee and for coming and helping us. And he really has changed the mindset of a lot of people. A lot of people thought, you know, maybe we'll cut 1% or 2% or 3%. Then they said, wow, we can cut a lot more than that. And we're going to do it very surgically. We're going to continue on a. On the march. We're making America great again. When I was in Saudi Arabia, and we were in, as you know, three really great countries, predominantly the three. Qatar was great. UAE was great. Saudi Arabia, incredible. What like, such an incredible experience to be in those three countries. But the crown prince of Saudi Arabia, and I must tell you, the leaders, the great leaders of the other two that we just mentioned, they all said the same thing, that the United States is the hottest country right now anywhere in the world. And six months ago, we thought it was dead. It was like a dead country. And it would have been a dead country if we didn't have the right result on November 5th. It would have been a horrible, horrible situation. Was going on with the borders with transgender for everyone, men playing in women's sports and so much more. But they were saying, the hottest country anywhere in the world. And then I played that little clip because I was one person who was respected, but or two people, because Joe was in that one, too. Joe's a good man. But that was one group of people saying something about the success of what we've done over the last four months. They cannot believe it. In the one case, they said they've never seen anything like it as long as they've been doing what they've been doing. They've been doing it for a long time. So I just. I want to thank Elon for helping. And again, you know, the United States right now is the hottest country anywhere in the world. There's no country is hot, and we're doing really well. We're. We came. When I left. We had no wars. We had no problems. We defeated isis, we rebuilt our military, and we had no inflation. And when I came back, we had a lot of inflation. We had wars all over the place. We had the embarrassment in Afghanistan, where we gave up billions and billions of dollars of military equipment. The most embarrassing moment in the history of our country. I believe. I believe that strongly. We have Russia with Ukraine. We had the attack in Israel in October. The horrible attack. October 7th. Horrible, horrible attack. Nobody has ever seen anything like it. And now we have something where we're really healing a lot of that. We stopped India and Pakistan from fighting. I believe that could have turned out into a nuclear disaster. And I want to thank the leaders of India, the leaders of Pakistan, and I want to thank my people also. We talk trade, and we said we can't trade with people that are shooting at each other and potentially using nuclear weapons. And they were. They're great leaders in those countries and they understood and they. They agreed. And that all stopped. And we're stopping others from fighting also, because ultimately we can fight better than anybody. We have the greatest military in the world. We have the greatest leaders in the world. We put one of them in charge of the Joint Chiefs of Staff, as you know, General Raisin Cain. And we wiped out isis, completely wiped out ISIS in three weeks. They said it would take five years, and we did it in three weeks. And that's the way it is. But we don't want to have to use our military. We want to be peace through strength when we can, and that's the way we're going to have it. So I just want to thank Elon and all of his people. Most of those people are staying. Almost all of them are staying, and they're going to be with us. And you're going to see the results coming long into the future. Even a year and two years later, you're going to see a lot of the results. And those hundreds of billions of dollars are going to be adding up, and they're going to continue to add. It'll be interesting, really interesting to see what the final number is going to be. But again, Elon gave an incredible service. Nobody like him, and he had to go through the slings and the arrows, which is a shame, because he's an incredible patriot. The good news is that 90% of the country knows that, and they appreciate it and they really appreciate what he did. And I gave him a little special something we have here.

Speaker A: Thank you.

Speaker C: A very special that I give to very special people. I have given it to some, but it goes to very special people. And I thought I'd give it to Elon as a presentation from our country.

Speaker A: Thank you.

Speaker C: Thank you. Thank you. Take care of yourself. Thank you.

Speaker A: The luck on this is amazing.

Speaker C: Large luck.

Speaker A: Well, let me say perhaps a few words that this is not the end of Doge, but really the beginning. My time as a special government employee necessarily had to end. It was a limited time thing. It's 134 days, I believe, which ends in a few days. So that comes with a time limit. But the Doge team will only grow stronger over time. The Doge influence will only grow stronger. I liken it to sort of Buddhism. It's like a way of life. So it is permeating throughout the government. And I'm confident that over time we'll see a trillion dollars of savings and reduction in a trillion dollars of waste and fraud reduction. The calculations of the Doge team thus far in terms of an FY25 to FY26 Delta are over 160 billion, and that's climbing. We expect that number will probably go over 200 billion soon. So I think the Doge team is doing an incredible job. They're going to continue doing an incredible job and I'll continue to be visiting here and be a friend and advisor to, to the President. And I look forward to Times being back in this amazing room. By the way, isn't this incredible? Look at this incredible look. I mean, it's stunning, I think, the way that the Oval Office, how the President has just completely redone the Oval Office. It's beautiful. I love the gold on the ceiling. It's pretty nice.

Speaker C: Yeah, that's been for a long time. That was plaster. Nobody ever really saw it. They didn't know the eagle was up there. And we highlighted. It's essentially. It's a landmark, a great landmark. And that's 24 karat gold. And everybody loved it. Now they all see it when they come in. So it's been good.

Speaker A: The Oval Office finally has the majesty that it deserves, thanks to the President. So I look forward to continuing to be a friend and advisor to the President, continuing to support the Doge team. And we are relentlessly pursuing a trillion dollars in waste and fraud reductions which will benefit the American taxpayer. So that's it, really. Thank you, Mr. President.

Speaker C: Thank you, Ian. Great job.

Speaker A: Thank you. Thank you, President Trump. The President mentioned that you had to deal with, obviously, slings and arrows during your time at Doge. There's this New York Times. Some of the people, you know, some of the media organizations in this room were the slingers. There is a New York Times report today that accuses you of blurring the line between New York Times. Is that the same publication that got a Pulitzer Prize for false reporting on the Russiagate? Is it the same organization? I gotta check my Pulitzer. I think it is. I think the judge just ruled against the New York Times for their lies about the Russiagate hoax. And that they might have to give back that Pulitzer Prize, that New York Times. Let's move on. Next question. President Trump, Biden aides who used to work here are in talks with Republicans in Congress to go and testify about what they did or didn't do to possibly conceal President Biden's decline. Do you think that Dr. Jill Biden should also have to come in and testify about what she did or didn't do?

Speaker C: Well, I hate the concept of it. It's the wife of a man who was going through a lot of problems, and everybody that dealt with him understood that. And I guess it came out during the debate loud and clear. That was a big, that was the biggest signal of all. They have to do what's right. The country was. There was a lot of dishonesty in the election, as you know, 2020, that's been now caught. People understand it. It was a rigged election. And when you go further out, when you see the auto pen, I mean, I think the auto pen is going to become one of the great scandals of all time because you have somebody operating it or a number of people operating. Because I knew Joe Biden. Joe Biden wasn't in favor of opening up orders, letting 21 million people into this from prisons and mental institutions and gang members. He wasn't into that at all. And you know, who signed the, who signed these orders, proclamations and all of the different things that he signed that set our country so far back, that was, that was so bad for our country. But the auto pen, how would it work?

Speaker A: Like, we're in the Oval Office right now. If there was a group of rogue staffers that worked for you who wanted to advance a bill or an executive order without your knowledge, how could they do it?

Speaker C: Well, it's very hard because I'd read your newspapers or your media the next day and I'd say, well, I didn't approve that. And I would find it. I mean, they wouldn't get away with it for long because I'd say, I never signed that. Who the hell signed that? Auto pens to me are used to sign letters to people because we get, I think they said, 20,000 letters a week. And you like to be able, when somebody takes the time to write a letter, it's nice to sort of write back. And auto pens are meant for that. Auto pens are not meant to sign major proclamations or tax cuts or borders, anything having to do with the border, which is so important. And if it happened on my watch, I would be able to see it because the Next day or sooner, I'd be reading about something that I knew nothing about. And who the hell signed this? So I almost never used the auto pen. In fact, yesterday I was signing about 81. I think it was 81 proclamations and statements to people that I think should be signed by us. I think when you write letters to foreign dignitaries or presidents or prime ministers, you should be signing those letters. Not done with auto pension. I understand he signed almost everything with an auto pen. It's a very dangerous thing. It really means you're not president. Whoever operated the auto pan. And we think we know who that is, and it was actually more than one person. But that's not what the presidency is all about. I hardly used to hear.

Speaker A: You reinstate.

Speaker C: The tariffs on China. You said that they violated the agreement.

Speaker A: With the U.S. well, they did.

Speaker C: They were. They violated a big part of the agreement we made. You know, if you read that whole statement, I was very nice to them. I helped them because they were in trouble with the stoppage of a massive amount of business. But I'm sure that I'll speak to President Xi and hopefully we'll work that out. But, yeah, that's a violation of the agreement. Yeah.

Speaker A: Please, Mr. President, can you give us an update to the latest ceasefire agreement that Israel has agreed to, but Hamas still considering.

Speaker C: Well, they're very close to an agreement on Gaza, and we'll let you know about it during the day or maybe tomorrow. And we have a chance of that. And I think we have a chance of making a deal with Iran also. They don't want to be blown up. They would rather make a deal. And I think that could happen in the not too distant future. That would be a great thing. If we could have a deal without bombs being dropped all over the Middle east, that would be a very good thing. They can't have a nuclear weapon. We want them. We want them to be safe. We want. We want them to have a very, very successful nation. Let it be a great nation, but we can't have that. They cannot have a nuclear weapon. It's very simple. And I think we're fairly close to a deal with Iran. Yeah, please.

Speaker A: You said just now that you look forward to being a friend and advisor to the President. So do you expect to continue advising the President and Doge informally, or are.

Speaker C: You going to sort of shift your.

Speaker A: Focus entirely to your. Well, I expect to continue to provide advice whenever the president would like advice.

Speaker C: I hope so.

Speaker A: I mean, yeah, it's. I expect to remain a friend and an advisor and certainly if there's anything the President wants me to do, I'm at the President's service. You said that there was a trillion dollar promise for cuts. Yes, I think we do expect over time to achieve the trillion dollars. But what have you found in your time here?

Speaker C: Was the biggest roadblock to getting those cuts?

Speaker A: Was it the Cabinet or was it Congress or something else? What was the biggest roadblock from your work? It's mostly just a lot of hard work. It's really not any one person or Congress. It's going through really millions of line items and saying, does each one of them make sense or does not make sense? Obviously at times when you cut expenses, those who are receiving the money, whether they're receiving that money legitimately or not, they do complain and you're not going to hear someone. And then we have to just work through the process of stopping the spending where there's often literally no defender, nobody even knows why the money's being spent. It's truly absurd. I mean, we find situations where there are millions of software licenses with zero people using them. Zero, exactly. This is the quizzical expression. You're like, surely if there's millions of software licenses, someone should be using them. No. And then we just got to go through the process of saying, okay, look, if no one's using the software, we need to terminate this software license agreement. That's everywhere in the government. By the way, Mr. Musk, what do you think would be easier? Colonizing Mars or making the government efficient? It's a tough call, but I think colonizing Mars and making life multi planetary is harder. And as I said, we do expect to achieve over time the trillion dollars of savings. We can't do it in like a few months. But if you say by the, I think the official end of dosh, which the President may choose to extend is the middle of next year, say by the middle of next year, with the support of the President and Congress, could we achieve of savings? I think so. We're on track to do so.

Speaker C: Do you have speech that Congress has been.

Speaker A: Mr. President, you had mentioned earlier in the week that Doge had become a whipping boy. And as the President mentioned, you went through a lot to go through this process. Was it worth it for you and what would you change? Yes. So what we thought was happening was that if there were any cuts anywhere, then people would assume that was done by Doge. And so we became like essentially the Doge boogeyman, where if you know, any cut anywhere would be ascribed to Doge, you Know, a friend of mine's daughter who's at law school at Georgetown, thought that Doge had cut the Senate, you know, the internships, but the legal internships for the Senate, and we have nothing to do with that. So if they have been cut, it's not to do with us, just as an example. So, you know, it just became a bit ridiculous where anything, any cut anywhere, was sinhadosh, and including things that made no sense and we would agree, made no sense. So there are many things that occur in the government because it's the banal evil of bureaucracy. It's sort of the. The frankly, largely uncaring nature of bureaucracy. As the great Milton Friedman said, money is spent most poorly when it is someone else's money being spent on people you don't know. And that's how federal spending is. And then you can't really even blame the individuals because the way the government works is complaint minimization. So when you do try to. When someone within the government tries to stop that money being spent, there's usually someone that complains, and then their manager will say, it's not worth the trouble, just pay it anyway. That happens over and over again. I think it was an important thing, I think it was a necessary thing, and I think it will have a good effect in the future. Thank you. President Trump. This week there was a video on board a plane that showed the first lady of France slapping her husband, Emmanuel Macron. Do you have any world leader to world leader, marital advice?

Speaker C: Make sure the door remains closed. That was not good. No, I spoke to him and he's fine. They're fine. They're two really good people. I know him very well, and I don't know what that was all about, but I know them very well and they're fine. I got a little shiner here.

Speaker A: What do you think about the Bernie plan? To avoid being swept in every battleground state again by spending $20 million to study how to speak to American men?

Speaker C: Well, you know, they spent 2.8 billion, we spent 1.5. We spent much less. We spent about half of what they spent. And at the end, they were $28 million short. They had to be. They spent 2.8 billion. That's a lot. But they couldn't get 28 million at the end, and now they want to spend. I read that they want to spend money to learn how to talk. That's fake. You don't want to be fake. You shouldn't have to hire consultants to say what America needs because, you know, then they should be. The consultants should be running the deal, not them. But I read that they want to spend a lot of money in each state. So we won all seven swing states, seven out of seven. We want a lot more than that. We won the popular vote. We won everything. And they want to spend money to find out what they did wrong. And, I mean, I can tell you what they did wrong. I can tell you every one of their programs. When they say men playing in women's sports, I would say that's not a winner. When they say transgender for everybody, I think that's not a winner. When they say open border so the entire world population of criminals can pour into our country, I don't think that's a winner. I mean, I can. I just gave them that for free. But I don't know if they'll change their ways. I see them all the time. I see people that I know in Congress, Democrats. They're trying to justify some of the things I just said. You can't justify them. They're, you know, I always hear the 8020 issues. I say they're not 80 20. They're 96. They might be 99 to 1. They're not 80 20. They wish they were 80 20. And they're wasting a lot of money if they're going to continue with that nonsense.

Speaker A: Mr. President.

Speaker C: But back to me.

Speaker A: Listen to the Apprentice. You mentioned once in 2012 that Diddy was a good friend of yours back then. He has since found himself in some very serious legal trouble. Would you ever consider pardoning him?

Speaker C: I. Well, nobody's asked. You had to be the one to ask, Peter. But nobody's asked. But I know people are thinking about it. I know they're thinking about it. I think people have been very close to asking. First of all, I look at what's happening, and I haven't been watching it too closely, although it's certainly getting a lot of coverage. I haven't seen him. I haven't spoken to him in years. He used to really like me a lot. But I think when I ran for politics, he sort of. That relationship busted up. From what I read, I don't know, he didn't tell me that. But I'd read some little bit nasty statements in the paper. All of a sudden, you know, it's different. You become a much different person when you run for politics and you do what's right. I could do other things, and I'm sure he'd like me, and I'm sure other people would like me, but it wouldn't be as good for our country as we said. Our country is doing really well because of what we're doing. So I can't. It's not a popularity contest. So I don't know. I would certainly look at the facts. If I think somebody was mistreated, whether they like me or don't like me, it wouldn't have any impact on me.

Speaker A: Mr. President, you big, beautiful bill.

Speaker C: On the big, beautiful bill, Would you.

Speaker A: Like to see the Senate build in some support for your tariffs on the big beautiful bill, or should that be a standalone bill?

Speaker C: I have great support on the tariffs. I mean, I was so honored that we got that ridiculous stay lifted because that would have taken away presidential power. It would have taken away everything that was granted by the founders. It would have been a terrible thing. And it would have, most importantly, would have left us vulnerable. We have a lot of countries that use tariffs on us and use them viciously, actually viciously. And if we didn't have the power to use tariffs on them and instantly not when you go back to Congress and try and get hundreds of people to agree on something that would take months to get just one simple proclamation. If we didn't have the power to counteract their powers and you wouldn't have a country left. We have to act fast. We have to be fast and nimble, as they say. And that was a really great moment, I think, yesterday when that stay was lifted. And hopefully now we'll go to court and just win that battle, because if we don't have the power to do what they're doing to us, we are going to be a great nation no longer.

Speaker A: Elon Musk was once idolized by folks on the left and the same country before joining your administration. Now he's considered a hero by conservatives. Why do you think this man, what he's done in American life has been so politicized?

Speaker C: His life has been amazing. I mean, I look at so many different things. I look at. I look at that rocket being, you know, guided back into position. I've never seen that before. I thought it was a space movie. I thought it was a movie. You look at what he's done in terms of communication, it's been unbelievable. So many different. Even tunnels going underground, not having to go through all the process of going, you know, he's got a company that does that. He's got so many different companies. Starlink as an example. He saved a lot of lives, probably hundreds of lives in North Carolina. I don't even know if you remember, but I called you they needed Starlink in North Carolina. And I didn't know what the hell Starlink was. I said, what is it? Who owns it? He said, do you know Elon Musk? I said, you happen to know the gentleman this was before his government said. And they said, we really need it because North Carolina was literally became an island. It was. People had no communication, they had no access to anything and they were dying. And I called up Elon and you can't get it because it's so successful. It's very hard to get. And he had so much of it brought over there. And they told me it was unbelievable. It saved a lot of lives. So, you know, he's just done a lot of things. I don't think, frankly, I don't think he gets credit for what he's done. But he's. And he's a very good person too. You know what if he wasn't a good person, if he wasn't. But he did the same things, you know, I'd probably maybe speak differently. He happens to be a really good person who loves the country. Mr. Musk, I want to make this beautiful bill.

Speaker A: You had indicated this week that there were some things you didn't like about what had passed in the House. What changes do you want to see the Senate make? And you had also indicated there are things like about the bill.

Speaker C: What would you be suggesting he pushed.

Speaker A: Senators to change in their version?

Speaker C: Well, I'll tell you, I'll go first. It's an unbelievable bill. It cuts your deficits. It cuts, you know, it's a huge cutting. But there's things I'd like to see maybe cut a little bit more. I'd like to see a bigger cut in taxes. It's going to be the largest tax decrease or cut in the history of our country. I'd like to see it get down to an even lower number. I was shooting for a slightly lower number. I would have liked to have done that. But with all of that being said, when you look at the tax cut and the fact that the original tax cut, which made us so success, we had the most successful four years in the history of our country, the economy. And this is going to be even better. And you see that by the reports that came out just yesterday or tonight, I guess they were released this morning at 8:00, you see the kind of numbers where somebody that's a pro is like, whoa, I haven't seen numbers like this since I've been doing this. You know, these are human emotions of professionals that have never seen numbers like. And we've just, we've just started. The bill is a great bill. It's going to be jiggered around a little bit. It's going to be negotiated with the Senate, with the House. But the end result is it extends the Trump tax cuts. If it doesn't get approved, you'll have a 68% tax increase. You're going to go up 68%. That's a number that nobody's ever heard of before. You'll have a massive tax increase. If it does get approved, you'll have a large tax cut, the largest we've ever had. When you add the past tax cuts that we got you, the Trump tax, they call them the Trump tax cuts. It's an amazing bill. It does amazing things with all of that. It's going to be adjusted a little bit over the next coming weeks and I think it's going to be passed. The Republicans want to pass it with all of the great things it does, including an extension of debt. It's the extension. We have to extend the debt. If we don't extend debt, we're in default. Now the Democrats might like our country to be in default, but in 250 years we've never been in default. That was handed to them by a very well meaning man that gave it to them because he thought it was the right thing to do. It could have been their problem before the election, but this man thought it was the right thing to do and he was well meaning. I don't hold anything against him for that. But that was put on our plate when it should have been on the Democrats. September 28th, a famous date. It should have been taken care of by the Democrats. But this person, a man of power, gave it to us so that in June that comes due. Well, we have to take care of that because if we don't take care of it, we have a country in default and we don't ever want to have a country in default. You know, I'll tell you, a certain Senator Elizabeth Warren said that she would never, ever allow a default on our debt. She would never let let it happen. And she would like to get rid of the debt ceiling, what's called the debt ceiling. I call it the debt extension extension because we really need an extension that she'd like to see that gotten rid of. And there are many people that agree, many Democrats agree with that. But we gave that through. And you know, I don't want to say an error. He did it well meaning they gave that to Us, it was a Democrat problem just before the election would have had a huge impact on the election. And to our benefit, we won anyway. But to our benefit, but felt that really for the good of the country we should extend that. But Elizabeth Warren and various other people would like to see that. Her whole career she wanted to see it terminated, gotten rid of, not being voted on every five years or 10 years. And the reason was because it's so catastrophic for our country. And I always agreed with her. That was one thing I agreed with her on. Now I haven't spoken to her, but I would say that if you asked her that question now, she'd say no, no, it's their problem. But it's a very unfortunate situation. It's a very unfair situation. And she happened to be right on that it should be gotten rid of or it should simply be extended. But that's one of the things that gets taken care of in this bill that automatically gets extended for a four year period. And it should be. But I agree with Elizabeth Warren on that. I think you should get rid of it. It's too catastrophic.

Speaker A: All right, folks. While Musk leaving the White House, he will continue as an unofficial advisor. Official says he's gonna be around a long time. And Trump announced the golden dome, which is gonna be intimately connected with SpaceX. The future of how energy is harnessed from the sun and directed to the surface of the Earth. Everything is changing. I mean, we live in unprecedented times. The best time to be alive is now. But I want to show you this clip of just what Elon Musk has accomplished so far, what his impact has been so far. This is Glenn Beck on Elon Musk. Elon Musk as he stood up again and again, technological sovereignty, speech, enterprise, for the radical, dangerous idea that the individual, not the institution, should shape the future. I think there's going to be a time, and hopefully it's not too far in the future when the heat is cooled and politics have moved on, that society will acknowledge not only what he's done, what he's given, but the sacrifice that he just went through. But that'll happen, you know, at a time when the real effects of everything, I mean, when, when the future that he is helping shape right now, better or worse is really taking root. That's when he'll be recognized, once this nonsense is over. The thing I like about him, he never asked us to trust him. He never asked for our loyalty. But I think he does deserve our respect. You know, I don't care what side of that I don't care who you voted for. How do you not recognize what this man has done for humanity? Especially if you're somebody who believes in global warming? What he's done for humanity, what he is still trying to do, the incredible.

Speaker B: Strides that he has made and the.

Speaker A: Bravery that it has taken for him just to stand up. I remember he. He walked away from his side, didn't.

Speaker B: Expect his side to leave him.

Speaker A: But once he had a different opinion of theirs, they just abandoned him. He lost all of his friends.

Speaker B: He lost everything.

Speaker A: So today, as he is leaving, I would like to say Elon Musk, thank you. Thank you. You didn't play the game, you changed the game.

Speaker B: Thank you.

Speaker A: Thank you for reminding me and so many other Americans that progress has never come in polite little packages. It's never been polite. The truth rarely comes dressed in approval. But I think you did some things that are absolutely remarkable. And you're going to continue to do things that are remarkable. Go in strength. Know that history will catch up to you.

Speaker B: You're way ahead of the game.

Speaker A: Thank you, Elon Musk. And look, it's not an obituary. Just because Doge has accomplished its mission doesn't mean that there aren't going to be more missions. Doesn't mean that Trump isn't intimately connected to Elon Musk for the duration of the term. And it's all about countering depopulation, ensuring that humanity survives, even if there's a cataclysmic event on the planet Earth. Ensuring that not only does humanity survive, but it survives in an environment that's worth living in. And I'm not talking about the environment, I'm talking about freedom. And look, we had this announcement last week of the Golden Dome. I want to show you this clip, break it down and unpack it. And then we'll go to break and have our special guest on. But just watch this one minute promo of the Golden Dome. 43 denouncing the Golden Dome. Because space is the new frontier. We dominated in the ocean and now space is the high ground. And so if we establish this infrastructure before our opponents, before the Chinas or the Russias or some globalist neonato entity, then we ensure that the United States of America has the high ground into the 21st century, which is total military and energy dominance, which can save our currency and frankly, our population. What we are determining right now in this age of humanity is who is going to rule over humanity indefinitely into the future. Whether or not it'll be anyone, frankly. And we have to decide. Are we going to allow the CCP to run the future? Or are we going to allow the globalists to run the future after some cataclysmic collapse of everything that we love and hold dear? Or are we going to ensure that America is always a free country by establishing dominance, by getting away, of these antiquated economic systems policies? Are we going to become the enemy? Are we going to have such power and dominance that we use it to surveil our own people and inhibit our own rights, violate our own rights, erode our own freedoms and rights? The purpose of life is to reach self actualization, to become the best version of yourself, and that requires a certain amount of freedom. You can't become the best version of yourself if you don't have the freedom to do what it takes. And so if we are to save young men, if we are to save humanity, we have to simultaneously establish dominance, fight for the truth and guarantee freedoms here in the United States of America, regardless of what's happening anywhere else in the world. And that's what Elon Musk and Donald Trump have been fighting for under this administration. It's what Alex Jones has been fighting for for 30 years, ensuring total victory over the New World Order and our other enemies and Satan himself, who has weaponized globalism against humanity itself, who has weaponized environmentalism to the point where we're not trying to save the planet so we can live on it. We're trying to sacrifice humanity to the planet for the sake of the planet. They want a big, green, empty planet with the sun blocked out, so everyone's in total darkness. And look, I know it feels like we're winning a lot, and we are winning a lot, but things are more dangerous now than ever because everything is at stake. For the first time, everybody is going all in. China's going all in, Russia's going all in. The globalists are going all in, and the United States of America is going all in. And we're going to see who's got the cards to win the hand to win the future of humanity. So it's our last chance. This is our shot. What happens between today and the end of Trump's term in 2028 will determine the future of humanity. And speaking of last chances, the best way to support or ensure a victory for us, to ensure that we have all the cards that we need to win this hand for humanity, is by going to the alexjonestore.com it's our last chance to save humanity. It could be the last chance to save infowars it's certainly the last chance because this weekend the special deal ends for buy two, get one bottle of methylene blue for free. Now, I like to think of methylene blue as the product version of what Infowars is, because Infowars is about broadcasting the truth, making you informed, sharp, focused, intelligent. Best version of yourself, best version of this country. I mean, Infowars mission is to inform the masses, speak the truth, fight for freedom, fight for humanity. And that's what methylene blue does. You could hear the show in the background, is that right? So when we called Steven, you can kind of talk about this, you actually had the show on. I heard Jones in the background when Colin called you. Right? Yeah. It's the truth. I listen to it every day. I love the show and love the products and so excited to be here. This is incredible being here. Well, it's an honor and a pleasure to have you here. It was as exciting as winning the truck. Yeah. So tell us a little bit about what you did for the Air Force. So, crew chief, four years in the.

Speaker C: Air Force down in March, Air Force.

Speaker A: Base, Southern California, working on the KC10s, which is a military version of the commercial airline airplane that we're familiar with, the DC10. And our main purpose was to carry troops, carry cargo, carry fuel for in flight, refueling, got to travel around the world, meet a lot of neat people. And as a result of that four year stint, I was able to get a civilian type license called a ANP license, an airframe and power plant license. And as a result of that, I've been working in the airlines for about the last 30 years.

Speaker C: And so really recommend that to everybody.

Speaker A: Young people, get out there. What do you think about these planes that are falling out of the sky and windows are malfunctioning and doors are malfunctioning? What's going on? There's so much redundancy out there as far as safety is concerned, it's hard to believe. But I know with the work that I was involved with when I was a line mechanic for five years and.

Speaker C: The work that we assigned to our.

Speaker A: Guys, right now, safety is the number one priority. So, yeah, we got to get to the bottom of that. So what do you think about Trump's announcement of the golden dome? Was it reminiscent of anything that you saw or witnessed in terms of Air Force technological development between 87 and 91? Defense first. I'm glad we got a president in there that's prioritizing it. So let's give a listen. You know, safety. Yeah, absolutely. So what'd you buy in the store? Well, I've been buying a lot of things over the years, but the winning entry was the gummies, the Irish CMOS gummies and the Shilajet. And then also this small little coin here on your shield. With your shield on it. With your shield or on it. Yeah, that's a great coin. Alex tells the story. His mother is a historian, and apparently Alex was talking to his parents about what he should do regarding the legal stuff that we're going through. Should I fight back? Should I? You know, just trying to figure out what decision to make about the future of Infowars and what he can do. And the Spartans had a saying, come home with your shield or on it, meaning if you were gonna run away from a battle because you lost it, you would drop your shield so you could run away. So you either die in the fight or you come home victorious. And so that's what inspired the design for this point. It's about honor. Yeah. And so we originally launched the silver version of the coin, and then when that ran out, the design was so popular and so cool that we offered the challenge coin version of it. So you can get it for much less than the silver fundraiser coins. And by the way, in terms of what we have coming out in the next couple of weeks, astounding, amazing products. But that reminds me, it is the last chance this weekend, this special deal ends to buy two bottles of methylene blue and get one for free. So you haven't tried the methylene blue yet, have you?

Speaker C: I haven't.

Speaker A: I have three bottles waiting for me at home. I'm going to try it with my son when I get back home.

Speaker B: But I don't.

Speaker A: You're trying it right now. You're trying it right now. He's going to try it now because we have to see. We have to let the effects kick in and try it. So this is a soda water. What I do is I pour half a glass of methylene blue and then you're supposed to. It says that you. That the daily dose is two droppers. I only do one, so I'm going to start you off with one. Yeah, that's sounds good. Look at that. This is USP grade, highest quality methylene blue that you can get. Nate, you were heavily involved in sourcing this. Can you talk a little bit about where you get it from and how it's made? So the majority of methylene blue on the market, whether you see it on Amazon or wherever you see it, is, I would call it. I mean, it's B.S. it's bunk. They're bringing in cheap Chinese dye from, from China and trying to sell it as a supplement. And it's not right. This is, this is not stuff that you want to put in your body. The stuff that we have, the stuff that's on the alexjonesstore.com is USP grade, the absolute highest quality in the world, methylene blue that you can get. So, you know, we, we source the best methylene blue. It's made in Florida, so it's 100% made in the USA. And then we added a little bit of flavor to it because if you've ever had methylene blue, it's got, you know, it's got a little bit of, a little bit of an aftertaste. Right. But we added a cool mint flavor to it. Oh, methylene blue. Without this flavor, it tastes like a battery. It. Yeah, yeah. Have you ever licked a 9 volt battery? Yeah. Which I used to lick 9 volt batteries. We can tell. Yeah. Thank you. Make you feel like you're plugged into a battery. It feel. That's where I was going. I'm like, it, it makes you feel like you're plugged into a bat, you know, into the wall, into some electricity because it's, you know, give it 30 minutes. Is that how long it takes for you, Chase? 15. 15. Oh, it's faster on you. Okay. But I hardly eat during the day. The reviews that we've been getting on the Alex Jones store for the methylene blue are the best reviews we've ever had. And they're from real people saying, hey, you know, I was sluggish, I was, you know, didn't feel like myself. You, maybe you're 40, 50 years old and you've lost a step and you take this methylene blue and you're able to go a little bit longer, you know, at 3 or 4 or 5 o' clock in the day when you get that, you know, typical crash, people just keep going. They just, it's almost like unlimited energy. But yeah, it lights you up like a Christmas tree. You feel like you're plugged into the wall. Look, I've taken all sorts of drugs back in my day over the counter, under the counter, black market, you name it. And this is by far the most powerful substance that I have ever legally consumed without a prescription. I agree. I mean it. What do they say? It's, it fuels the mitochondria. Right. And I think in today's day and age, of all the chemicals we're attacked with whether it's from big pharma, you know, the big food corporations putting trash in our food, we lose, you know, a cellular connection, and we lose, you know, a lot. And I think what this does is kind of bridge a gap maybe, and, you know, bring. Bring us back to where we should be as far as, you know. I tell you what, Stephen, I can tell that you're in the military because you're down in that methylene blue. You know how to drink it. I don't know how fast you're supposed to drink this, but it tastes good. Tastes. Yeah. First impressions. Tastes like a soda. The taste is pleasant, and I like it with the seltzer water, you know, the. Yeah, yeah. Yes. And so we'll see what happens. Awesome. Well, I'm excited. Tell me what you think about the Trump administration so far and how they're doing.

Speaker C: They're doing. They're really going against the grain, growing.

Speaker A: Against the current, doing the best that they can. Saw some announcements with the HHS cutting funding on bird. Bird flu virus. You know, the Doge kind of deal, cutting out the waste in government. Totally love that. You know, we got to. We got to try to turn the country around before the midterms. Yeah, the bird flu thing was just disgusting. What they tried to do, it was after Trump was elected, but before he was inaugurated. They tried to rush MRNA vaccines for poultry chicken farms all over the United States, and they tried to use the bird flu as an excuse to do it. So what happened was we had this COVID pandemic, then they forced MRNA vaccines on the entire population. Everyone figured out not only were they not safe and not effective, but they were deadly. So they lost total popularity to the point where people aren't even taking any other vaccines at all anymore. Because after what happened with mRNA, who wants to even try it? Obviously can't trust big Pharma. And so how is it that they can still sell MRNA vaccines if nobody agrees to get vaccinated? Well, they thought, why don't we have a pandemic for poultry instead of for people and use that to justify giving MRNA to the poultry? And if you look at what happened with the chicken farms, there was a 400% increase in chicken farm fires the last four years compared to the four years prior. So it was an artificial scarcity. They're blaming it on this bird flu, which is like a nothing burger of nothing burgers in terms of its danger to humanity. And then they're trying to usher in MRNA vaccines, which we know can be developed later on so that not only does it vaccinate the poultry or the livestock, but it vaccinates people who eat it. So they're trying to vaccinate you through your food, unwittingly get you it one way or another. Yeah, yeah. And I think ultimately what this is about is some kind of Machiavellian, utilitarian national security approach where the national security apparatus is very concerned about war with China, especially since we're diversifying away from them, we're establishing dominance in space, their demographic is shrinking rapidly to the point where they can't fulfill manufacturing demand for the U.S. market. And so as China becomes more and more desperate and more and more vulnerable, it also becomes more and more dangerous. It's like a dog backed into a corner. And biological warfare, obviously something China knows a lot about, given the China virus that we've experienced. Obviously something that is a major risk for war in the 21st century. And I think the national security apparatus is thinking, look, we need to be able to inoculate the population on a whim, even if people don't agree to do it. Because if there's a bioweapon attack on the United States and we have a vaccine for it, but nobody signs up for the vaccine, then everybody will die and we lose our tax base. So that's their Machiavellian kind of sick, utilitarian approach. And they use these other things as an excuse to usher in that of level control. There is never an excuse to take away freedom, you know, and try and replace it with security. It never works.

Speaker B: It.

Speaker A: Has it ever worked. I mean, you look back at all the dictators in the past. Yeah, what, 200, 300 years. It's never. What's the Benjamin Franklin quote? Those who would trade. Yeah, trade, trade. Freedom for security will have none and deserve either. They. Yeah, they deserve neither one of them. Yeah, that's. I mean that's just abundantly crazy. So, Stephen, cybertruck, some cash on top. Are you, are you road tripping it back home? Like, what's your next? I will be taking a big chunk out of it this, this afternoon and this evening. And there you go. Probably, probably two day type trip. It's a long way back to, back to Atlanta. It's about a 13 hour drive. So we'll get there, we'll get there one way or another. Well, that cybertruck is amazing. It's got 340 mile range, I believe, and it charges super fast. It's the foundation series, which is one of a. Yeah, they don't make it anymore. No. Yes. I don't think it's the first edition, and I think it goes 0 to 60 in like 3 seconds. So, you know, it's sports car. We experience that. Yeah, yeah, it was fun. It's a blast. And I want to mention this. We try not to talk too much about the giveaways because we're so focused on the news and out. And these products that are amazing for your health trucks are fun. We love them. And they've helped these giveaways help. Help save infowars. And when I look at the numbers, you can tell that it's having an impact. But I want to tell you about something that the big league guys have done because they're just so incredible. Traditionally speaking, we do one giveaway at a time, and then when that's over, we have to wait a few weeks and then we launch another one. And they figured out a way for us to set up a system where for two weeks in every cycle, whenever you spend any money on the alexjonestore.com buying anything you can possibly imagine, it enters you to win multiple vehicles simultaneously. So we've had the Raptor available for the giveaway for a couple of weeks now, I think. Nate. Amazing. 25 Ford F150 Raptor 4x4, plus $10,000 in cash. It's got 450 horsepower. I mean, this thing is absolutely a beautiful American machine right before our eyes. In an age when we face just total assault and attacks on Americana, we've got something that's got a semblance of masculinity and work embodied in one product. You know, then that's. I've never really driven trucks or anything because I've never really worked hard with my hands. I did manage a painting contracting business years ago for about a year before I went to college, and I just never really had the need for a truck. But one time, I remember I was telling a friend of mine this story. I seldom cry. Usually I cry when I'm inspired, not when I'm sad. I was with a very close friend and somebody passed us on the road in an F150, which is, by the by, by the way, the most commonly owned truck among millionaires is an F150, because it's contractors who work their butt off. And they. Sam Walton. Yes. Yep. And this old beat up 150 goes past me on the road this years ago, and I just made the joke to the girl that I was with, said, how would you like me if I drove that? Just kind of Testing her. And she's like, I wouldn't. And I thought about the fact that the most common vehicle among millionaires in the United states is an F150. And I thought about the 80 hours a week that that man had to work in order to accomplish that status. And that he was driving a beat up truck because he probably paid cash for it because he doesn't want to go into debt because he's responsible and he's providing for his family. And all of the policies at the time, this was years ago, that our government was issuing out, were inflating the dollar. So stealing his buying power, eradicating his income through taxation and shaming him in all pop culture, media education institutions for being a white male, heterosexual man who just wants to own a business, capitalist values, wants to better himself and provide for his family. And I shed a tear. Girl was like, I've never seen you cry before. And that's what I love so much about these vehicles that we give away, is that they embody the message and the philosophy behind the network, just like the products do. I said that a little bit in the last segment. And we've got this Raptor that's available, but for two weeks only. I believe, Nate, you can get both. You can get Both the Ford F150 Raptor or the Ford F250 Lariat. The new one 4x4. Did you say it's over 500 horsepower? It's over 500 horsepower. It's a 6.7 liter powerstroke turbo diesel. So it's got, you know, 1200 four foot pounds of torque. This thing will literally pull a house down. You know, it's got a leveling kit, 37 inch tires, 20 inch wheels. And the cool thing is anything you buy from the store gets you entered to win this promotion. Right? So you could buy a coin like Stephen did, you could buy a bottle of methylene blue, and it automatically gets you entered to win. And probably my favorite part of all of it, for all the VIP club members out there, all the subscribers, if you're a subscriber at the alexjonesstore.com, you get two times the entries every month. Every month, as long as you're an active subscriber. So it's just a great promo, you know, for the Alex Jones crew infowars, for all of us, you know, to give back, you know, to the people that have supported you for years. Right. You know, Stephen's been a 15 year listener, I'd say, you know, supporting the store has paid off in a big way. Right. And it's, you know, I don't know, I think it's a win, win for, for everyone, for the listeners, for, for the store. Because you know, instead of paying, you could take, you could take the money that's spent on these trucks and you could go buy $80,000 in Facebook ads if you wanted to or Google Ads, whatever. But you're fueling the machine that is censoring us, enslaving us. Right. However deep you want to go with it. And it's an anti human message. What we do here is we give back to the people that support us. And it's a pro human message. We support ourselves. We support ourselves like minded individuals and great people like Steven, you know, can, can win a sweet truck. Absolutely. Well, at thealexjonesstore.com I want to ask you your thoughts about this, Stephen. We've been very aggressive in developing new products, launching new products as rapidly as possible, sometimes too fast. Sometimes we launch a product and people don't even notice it because we launch another one so quickly in succession afterwards. And look, these products are amazing. We do a couple of things. We do the research on what's good for people. We find a way to provide the highest quality at the lowest cost and we pitch it out. And the only reason we sell supplements, not the only reason, but the main reason we sell supplements is to ensure that infowars remains independent media. We don't rely on pharmaceutical advertisers because we want to be able to talk trash about Big Pharma when they're killing millions of people with their inoculations. Yep. And what they don't talk about is there's so many natural ingredients in the world. Think about a lot of these, you know, products that, that Big Pharma develops. They develop them from natural herbs and products that come out of the rainforest, Amazon, wherever. Right. So all these products, all these natural supplements, there are scientific studies that say, hey, we did a study for six months using this much of this supplement. That's what we do. We put those supplements, put those ingredients in these supplements. So you're getting high quality, the highest quality, you know, herbs, vitamins, minerals, whatever it is, you know, at a super low cost like Chase said. And it helps fund the InfoWars. So it's a win, win. You're promoting a healthy lifestyle. And I don't know. Well, the craziest thing about it is since we launched the Alex Jones store and we became a lot more aggressive about launching these new Products. The biggest impact, not just for America, but for me personally, has been seeing Alex's transformation because he really does take the products. He takes the shilajit, he takes the methylene blue, he takes the CMOs, gummies and others. Optimal human, you name it, he takes all the products and his health transformation. I came from worrying about how much longer he was going to be on the air to now I'm like, all right, 30 years. 30 more years. We're only halfway done. This is the Act 2 of Alex Jones. In the two act play, that is the defeat of the globalist. But what are your thoughts on Alex's transformation? Yeah, you really see that on. I watched the video feed on X and it's impressive. It's motivating to the rest of us and how we can be better people, you know, healthier and better for our family, better for our country, better for the world. Absolutely. Well, Stephen, it's been an honor and a pleasure to have you on the show. Nate, did you want to say something? No, I'm just kind of reiterating that. I mean, watching Alex lose all the weight, right. And I've saw him, you know, right as he started that transformation and right as he really started getting into it when he started, you know, doing the fasting and the diet stuff. Stuff. And then these new supplements are introduced and he starts, you know, testing samples and stuff and likes it and starts seeing results. I think the big thing, biggest thing is consistency, right. If you're consistently eating a clean diet. Real food, real food. Just eat real food, right? That's all you need, real food. And if you have some kind of exercise routine and you have a good supplement routine with high quality supplements, it's, you're gonna, you're gonna see results over a, you know. Yeah. Amount of time. Well, and here's the deal with the, with Big Pharma and the globalists, they don't want to solve any problems. They just want to treat the problems or exacerbate them. Pharmaceutical companies have no incentive to have a healthy country because they make all their money off people who are unhealthy. And with these supplements to ensuring our success no matter what happens to infowars. And frankly, it's essential to assuring America's victory in this conflict between good and evil that is unfolding in this century. Between artificial intelligence in China and the globalists and the censorship and surveillance and the information war and the space wars, which are beginning to unfold right before our eyes. It's more important now than ever that you go to alexjonestore.com and it's not an expense, it's an investment. It's an investment in your health, both body and mind, and in humanity, a species of which you are a part of. And I want to show you this clip because we aired Trump and Elon Musk during their press conference today where Musk is stepping away from Doge. He was scheduled, by the way, to step away. It's not like he was fired or he's resigning. It's just the end of his term. Unlike so many others in the political class, he actually walked away from power, staying on as an advisor. Going to focus, I don't know, on ramping up SpaceX as much as possible to facilitate the launch and operation of the Golden Dome. But at the end of the press conference today, after we began to cover other news, Donald Trump responded to the question of the auto pen. Let's watch.

Speaker C: And auto pens are meant for that. Auto pens are not meant to sign major proclamations or tax cuts or borders. Anything having to do with the border, which is so important. And if it happened on my watch, I would be able to see it because the next day or sooner, I'd be reading about something that I knew nothing about and who the hell signed this? So I almost never used the auto pen. In fact, yesterday I was signing about 81. I think it was 81 proclamations and statements to people that I think should be signed by us. I think when you write letters to foreign dignitaries or presidents or prime ministers, you should be signing those letters. Not done with auto pens. I understand he signed almost everything with an auto pen. It's a very dangerous thing. It really means you're not president, whoever operated the auto pen, and we think we know who that is, and it was actually more than one person. But that's not what the presidency is all about. I hardly used to use.

Speaker A: You realize that we almost had nuclear war with Russia over this Ukraine issue, that we almost had all out nuclear war with Iran over this economic war we're in with China. We almost had war between Pakistan and India, which is really a war between the United States and China. We almost had a Chinese annexation of Taiwan under the Biden administration. The whole economy almost totally collapsed, where instead of working one dream job to provide for your family, you had to work three crappy jobs to provide for your family. While the Biden administration bragged that unemployment was at record lows. Yeah, you want to know when else unemployment was zero percent among minority communities in the United States? 1862. So we're slaving away while we're on the cusp of extinction, while our borders are left wide open and all of the world's super villains just seize power, acquire power, acquire property, acquire money. A redistribution of wealth from the poor to the rich. The antithesis of the story of Robin Hood we all hold dear. This is the problem with the auto pen. This is the problem with what just happened. We have to solve this problem so it never happens again. We had a political system in place that allowed for the operation of the White House to be under the auspice of who knows who, while the President has lost his mind. And I believe. What was it? Was it Nero that was a lunatic that always played the liar and he was terrible at playing the liar, but he forced people to applaud and show up and act like everything was normal while Rome burned. There have been other examples throughout history where the leader has been a madman. And not just throughout history, but in shows like Game of Thrones, the Mad King, the Mad King, these lunatics who lose their mind and just let the kingdoms unnecessarily burn. That's what the auto pen means. That's the story. And right now we are in a major, major power shift. And throughout history, the only time a power shift like the ones we're seeing right now have ever taken place have been through civil wars or revolutions or world wars. If you want a One world government, you have to have a One World war. World War I, League of Nations, then World War II, United Nations, World War 3, One World nation, own. That's how it's happened traditionally. But the problem is we have the technology and the weapons now that if we get into another world War, we don't come out of it. We all just lose that war. We all die. Radiated men will eat the flesh of radiated men on the surface of a planet with a blocked out sun and just massive toxins, the likeness of which not even ultimate CMOS could get out of your body. I think it's going to be a little too much. And it's not just the fact that we have the technology to basically set the entire planet on fire, but we have the technology to bring down electrical grids through cyber attacks. So many vulnerabilities and so many angles. And our dependence on oil for our currency has been the reason that we've been in every conflict we've been in basically since World War II. Iraq, Afghanistan, Libya, constantly just pumping as much money into the Middle east as possible. Frankly, it's directly tied to why we pump money into Ukraine. We didn't want Russia to take over Ukraine because we didn't want Russia to be able to divert agricultural exports away from Europe and into China, making China independent of US agriculture because China's independence is the next step toward China's waging of war on the United States. And so what we are doing now, what we are seeing right now, is a development of this technology both in artificial intelligence and in space, that's going to give the United States omnipotence in the world because we'll have the universal high ground, decentralized, secure for missile defense and dominance. And the same technology that's being developed for this Golden Dome, not to be confused with the Iron Dome, will potentially enable space based solar power, infinite energy from the sun wirelessly transmitted to the surface of the planet. And when that takes place, we'll be able, with our partners like Saudi Arabia, to license out infinite energy to the world, demand that payment for this energy be made in dollar denominations and totally get away from the petrodollar and eradicate, eliminate every incentive for the United States to ever be in a war again in the Middle East. It's not a step toward utopia, but it is a step toward world peace. World peace is actually feasible despite the fact that we'll always be corrupt to some extent or fall into some extent. We could at least establish world peace. And here's China in clip 17 coming out and talking against this Golden Dome. Why is it that China would be troubled by the United States having a massive golden dome in orbit around the planet that would just enable us to intercept any missiles to our continent. Why is that a problem? Let's watch this clip. I'll read you, it's in Chinese. I'll read you the subtitles and then we'll unpack it. The US pressing ahead with the deployment of space based Golden Dome shows that it has continued to expand its military, which would stoke an arms race there. Such acts violate relevant principles of the Outer Space Treaty, heighten the risk of turning outer space into a war zone, trigger an arms race and undermine the international security and arms control regime. The US actions are tantamount to once again opening the Pandora's box. This proves again that no country has done more than the United States in militarizing outer space and making it a battlefield. China urges the US side to stop expanding its military buildup in outer space and to take concrete actions to uphold global strategic stability. So they're coming out against this Iron Dome saying that it's an escalation even though it's defensive in nature and likely going to catalyze the space based solar power technology, at least to some substantial extent. While they were just caught days ago, I can't even remember if I printed the article or not. Conducting dog fights among satellites in outer space. We're the ones militarizing outer space while China is having satellites do dogfight drills. I mean, the Space wars are here, folks. Star wars and the Terminator met, they had a baby, and it became reality in the 21st century. And so what we have to decide as the United States of America is not whether we should dominate or whether we will dominate, but we have to decide whether we will become the empire in the way that we do it or maintain the integrity of the rebellion against globalism. Because China is a cutout of globalism, globalists and the Chinese are actually in competition with one another, not on the same team, but the globalists want to use all the same means, modes and methods that the CCP has used nationally. China is like the nationalist version of globalism. I know it sounds like an oxymoron, but massive surveillance, total control of the currency, social credit scores, eugenics, depopulation, basically everything the CCP has done to its own people over the course of the last 50 years, including the Great Leap Forward, that's exactly what the globalists are advocating for in the name of something like environmentalism or equity or diversity. And so if you want what happened to the Chinese people by the Chinese Communist Party to happen to the world, then let the globalists win or let China win and expand. And so this step toward this golden dome technology is part of a Cold war happening right now between China and the United States. And it's much more dangerous than whatever Cold war took place between China and Russia. In fact, I want to show you clip 42. Elon Musk is famous for being the first innovator pioneer to create a rocket that could land again. Now China's doing it. Let's watch. There it is. That's a Chinese rocket. Looks a lot like SpaceX technology, doesn't it? Looks a lot like intellectual property theft. And for those of you who haven't been following the developments in Space or Space SpaceX, the importance of this is if we can use reusable rockets, we can get things into orbit for much cheaper. I think NASA would spend $2,000 to $5,000 per kilogram to get something launched. It's estimated that SpaceX, through Elon Musk's leadership, is going to be able to accomplish $10 to $50 per milligram in launches. So why is China trying to do this? Why is the United States trying to do this? Why is SpaceX trying to make launches so cheap? Well, because they want to do so many more of them and they've announced this explicitly. And why do they want to do so many more of them? Because the new frontier is space. And he who dominates space will control the earth. It's omnipotence, it's the high ground. And in order to dominate space, you have to have a massive array of satellites for surveillance, for targeting, for things like Internet and remote areas. Forward military energy through solar, space based solar power. The future's all in space and the war is already happening right before our eyes, right above our eyes in the heavens. And ultimately what we have to do is ensure that we elect leader after leader beyond this term of Trumps who believe in, who have subscribed to, who have the mission of being stewards of this massive transfer of power, this massive disruption, without causing massive all out war. It's unprecedented. This will be the greatest innovation of Elon Musk or Donald Trump. Greater than whatever he did at PayPal, greater than whatever he did at Tesla, greater than whatever he did at Space X, greater than whatever he did with Xai or Twitter. This will be the ultimate American innovation, finding a way to manage massive disruptions and transfers of power without shedding any blood whatsoever. It's the pro human, team humanity motive. It's our mission. Think the globalists care about peaceful transfers of power after they explicitly advocate for depopulation over and over again? Or justify how shrinking demographics aren't a problem because AI and robotics, Larry Finks and others. And so you've got the first disruption, which is the advent of artificial intelligence, which will completely disrupt every industry on a massive scale within 36 months, certainly within five years, maybe even sooner than 36 months, everybody will have a job, but it's not going to be the job that they have now. And there's going to be an uncomfortable transition period. Artificial intelligence will become our educators, in many cases, it'll become our doctors, it'll become our lawyers, it'll become our tax advisors, it'll become our writers, it'll become our journalists, it'll become our coders, it'll even become our entrepreneurs operating as agents on behalf of people who set this technology free. And one of the best things about the Big Beautiful bill, though I do agree with Trump's sentiment on it and Musk's sentiment on it that it should it could have been even better. One of the best things about the Big Beautiful bill that nobody's talking about is the 10 year moratorium on regulation. At first it was alarming and shocking. This big beautiful Bill says for 10 years after the passage of the bill, no state or local government may engage in any regulation of artificial intelligence whatsoever in any way, shape or form. And at first you're like, oh no, that's not a good idea. We need to totally be intentional about the way we roll out this artificial intelligence. And then you realize, oh, the only way that we can ensure that artificial intelligence doesn't become a weapon of a technocratic globalist elite exclusively is to protect individuals and innovators on the ground level. The only way that we were able to have a massive industrial revolution, for lack of a better term, in computer technology in the 70s and 80s and 90s was because it was possible for Steve Jobs and his buddy Wozniak to start a computer company out of their garage and then compete with IBM and Microsoft on a global scale within a matter of decades. A decade at first, and then now decades. And if we allow the Sam Altmans or the globalists or others to do what so many other industries have done time and time again, that is spend millions upon millions, if not billions upon billions of dollars on lobbyists, in placing judges, in placing congressmen, in placing senators, in buying presidents, in buying different bureaucrats that advise presidents. If we allow these corporate fascist, technocratic globalist entities to control and dictate the regulations on artificial intelligence, then what we're doing is we're allowing them to ensure a monopoly. Because there will be exceptions in this legislation for these companies, or the regulations will be such that only these companies will be able to afford them. Just like during the pandemic, all the mom and pop stores had to close while the big chains bottom up. That's what these major corporations do. They lobby for increased regulation, not decreased regulation in all of their fields so they can ensure they don't have to worry about any competitors springing up at the. It's like weed killer for them. And so the fact that this big beautiful bill had a 10 year moratorium on any state governments or local governments regulating artificial intelligence whatsoever is not a danger. It is to ensure that I as an individual can do an AI startup, or you can have an AI startup, or some college kid can have an AI startup that competes with the establishment big wigs in the space that diversifies and decentralizes the technology to ensure that it's not a weapon wielded just by Sauron, but that the Ring of Power itself is destroyed and everyone has their own sovereignty, both at an individual scale and at a national scale. This is the way the technology is inevitable. We just have to catalyze the spiritual maturity to handle it and the policies to protect ourselves from its weaponization, while simultaneously ensuring that we have a government that protects our rights and doesn't violate our rights. And that is held accountable because the United States is about to become exponentially more powerful than it has ever been before. And if our rights remain vulnerable.

Speaker B: If.

Speaker A: Our political class remains unaccountable for its actions, then that power that it attains, that it acquires, won't be just weaponized or wielded against our enemies, but it'll be weaponized and wielded against us. And then America would become all that we've been fighting against. Globalist surveillance state with social credit scores, central bank, digital currencies, all financial transactions monitored and controlled. Oh well, they'll never come after me. They won't have to. They'll have artificial intelligence do it for them. Because we've been very good at collecting data for many years. NSA data centers, astronomical sums of information. Every email, every text, every call, video footage from all of your devices with cameras, audio recordings from all of your devices with microphones stored in these massive databases by the US government. And up until now, they've only been able to search based on keyword. They have certain alarms set, trigger set to notify a real person when something has come up. And that real person then actually monitors and looks into it and then takes next steps. But the science of informatics is how do you pull useful information from a haystack of data? And with artificial intelligence, the way that it's being developed, the government is going to have the power to ask AI for any information. Who should I go after next? What order should I take out? Which political dissidents? How should I do it to ensure that I'm successful? It'll be able to wield this against us and actually use all the data that we've been blindly giving all of these corporations, whether It's Facebook, Instagram, YouTube, Google for years, just giving our data away. Ah, nothing ever happens. Ah, nothing ever happens until it does. Just giving your DNA away to 23andMe, while it's bought up by companies that can sell that data to the CCP so they can develop bioweapons that specifically attack you based on your genome. And the natural response is, we have to stop this. Oh, you can't stop a tsunami from coming, but you can prepare. You can't stop an earthquake from happening, but you can prepare. You can't stop a volcano from erupting, but you can prepare. And so let us wield this technology while doubling down on the fight for freedom and humanity. Because if the United States is going to become exponentially more powerful than it's ever been before, then it becomes the most dangerous national security threat to its own people that it has ever been before. And a great threat it has been to between 9, 11, Gulf of Tonkin, USS Liberty, you name it. I mean, we know that these are Machiavellian utilitarian entities that are running the most dangerous and sophisticated intelligence operation that's ever existed on the face of the planet, as far as we know in written history. And frankly, our history might be much longer than what is written over the course of the last 6,000 years, but maybe it's been 30 times that we've wiped ourselves off the face of the planet. And it just keeps getting erased in ice age after ice age or younger dryas after younger Dryas. And so if we have failed 10, 20, 30 times before to save humanity from cataclysm, then let's not use that as a sign that we should give up. Let's use that as a sign that we should try harder. In fact, not even try. There's do or do not. There is no try. Either go to the alexjonestore.com or do not. There is no try or I love you guys or I support you guys if you're not in the 1 to 2% of people who have actually supported us in a real way. And I know it's tough out there. It's expensive. Inflation is crazy. College debt, credit card debt, bankruptcies. But it's not an expense, it's an investment. And it will pay back with interest 70 times, seven times over. Because when you get these products at thealexjonestore. Com, not only do you experience the benefits of products like methylene blue, which are incredible for your body's ability to absorb oxygen, passing off extra electrons to the mitochondria in your cells, which act as the battery for your cells.

