" Hi, I'm Jordan McDonald, staff writer with GOVCAI Omeedian Research.  And today, I'm joined by Mark Gorack, director of the Cyber Academic Engagement Office  and Principal Director for Resources and Analysis at the DOD.  Mark, thank you again for coming back onto the program.  Oh, thank you for having me. I appreciate it.  Mark, the Cyber Academic Engagement Office has maybe been around for about a year now.  It's doing some excellent work, but I wanted to ask since it started and I believe  August 2024. How has the office grown and what progress have we seen come out of it?  Well, Jordan again, thanks for having me and giving me the opportunity to talk about the CAEO.  The CAEO again was stood up under the NDAA from FY24 and like all authorization acts,  it gives us a directive to stand up the office, it gives us authorities,  but it didn't give us resources. So the first step I had is to ground up some resources to  build a higher and I hired Diba Hadi as my principal director. So she's the one who runs daily  ops and I've kind of given her the mission to establish the office. So what does that mean to  establish an office in the department of defense? It means the first thing we need to do  what are we supposed to do? Besides what the NDAA says to do, how do we make that happen within  an department? So the first thing you write is a charter to kind of lay out that plan of how you're  going to execute this office. And then there's a DoD instruction. So it's called a DoD eye that we  have to make to be able to tell the other components what they expect them to do to help us  establish the office. For example, we tell the components that they have to work with us and we  port to us and their academic engagements. The other thing we're doing this past year is we're  meeting with all of our organizations that we know of who are working in this space. So the NDAA  specifically highlighted five different entities and we've met with all of them and we're actually  changing the focus. So for instance, in our academic outreach with schools and the past, the schools  kind of determine the requirements for research and for capacity building. Now we're turning that  around and saying no, no, no, the department will determine that and we'll put that out to the  academic community and then we're going to ask them for what they deliver, what capability are they  delivering to the department. The other thing that we've done is we've established a mission  and vision and to simplify what my belief of the actual mission is is to inspire the next generation  of cyber talent. That's a very overall encompassing, you know, objective to try to do  working with all this, the schools. But I think there are so many people out there in grade school  and high school who really don't understand what the department or the federal government has to offer.  Nor do they understand this is a national challenge. Part of our job is to help the nation.  Where goes DoD so goes the nation? So we're trying to establish that interest, at least put that  nugget into youth of today to say, hey, this is a potential curve path. Stay in STEM, stay in  math. Keep your nose clean, right? And you have opportunities then that you wouldn't have had  otherwise. So that's the main gist of what we've been trying to get done. In addition, we set  out taskers to the entire department asking, tell us everything you're doing in cyber academic  engagement. Well, our list got back of 300 plus different entities all doing cyber academic  engagement. So it sounds like we're doing a lot. But with two people, very difficult to get  after all of those and even meet with them all and find out specifically what they're doing.  But my all of my other vision besides inspiring that next generation is how do we work with academia  and the department to make that more efficient? So I don't want to do. I want to coordinate  in the great. So if cybercom has a hot research issue in cyber, I want to grab that requirement  and I want to put out to all of our schools, we have over 480 schools and say, hey, here's  a department requirement we have. How can you help? And then work that in exchange and then say, great  schools, x, y, and z were selected. You work directly with cybercom and delivering that capability.  So that is our overall goal. That's easy to say. That's entirely difficult to do. So picture yourself  as a school, who do you contact in the department of funds to get research dollars?  Everyone, there's a from resources, research and engineering to each of the services, to the components.  At the trough, they have to know all of that's which means they have to have a huge  research capacity of people, instructor, a huge number of people who actually research all of that  and can actually fill out all those grants and do that. I want to make that simpler where I can now  just be that integrator so they can have, so they'd open up to more schools. Because right now,  the big schools, so the ones who are getting most of the money because they have the staff  to be able to apply for all the grants. Well, what about the junior colleges out there? Who  have one professor doing this? How do they compete? I want to make that point in field a little bit  more level and how we go about doing that. We're still determining. But those are just some of  the initiatives we've worked on the past year. Yeah, you know, the last time we spoke, I think  it ties into the law.  larger DOD mission of trying to fill that gap of workforce talent.  I know you mentioned that there's still about like 7,000 jobs that you're looking  in the fill.  So 20,000?  7,000 mission critical?  Mission critical.  Okay.  Yeah.  Help me understand why the office is so important in reaching that goal of filling those  gaps and getting that cyber talent.  Fresh out of college, fresh out of wherever they're coming from, getting them while  they're young.  Yeah.  So two parts of this.  I think this is one of the reasons why I also love my job is because I am not only on the  cyber functional community for the department, but now with this new title and owning  the academic engagement side and inspiring that talent.  So I look at the cyber academic engagement office as generating talent.  And then I look at my workforce innovation director of then utilizing that talent, right?  recruiting that talent, training that talent, developing that talent, and then retaining  that talent.  So I think the two go really well together.  Now there is some overlap because within our academic engagement, we have current employees  in cyber who also go on get scholarships.  And so that's a little bit of an overlap for example, but the two are tied together perfectly  and they have to work very closely together because I want the workforce innovation directorate  to determine the requirements of what we need.  So like we just said, we're short over 20,000, but 7,000 critical.  So if I'm given out, you know, scholarships, I should be given scholarships to those who are  studying in those mission critical areas, not just in general, but that's put the requirement  out there that we actually truly need where we have the greatest need today.  And that's how the workforce can influence the academia.  And again, have the departments set the requirements and not just have each of the schools  say, yeah, I'm majoring in cyber or data science and you know, you get a scholarship.  So that's had the department determine those requirements and those needs.  And it even goes further.  I have 480 schools out there right now under the National Centers of Academic Excellence  for Cyber.  Every single state but one we have.  So it's also regionalized.  I need talent in specific areas, like Augusta, Georgia, right, for help our Army cyber.  So why won't I be incentivizing schools near there at a higher rate than other schools?  That's the requirement generation, I think, that I owe from the WID perspective workforce  innovation director perspective to the CAO of perspective to execute.  And I understand that as you're looking for a cyber talent, you're looking for a specific  cyber talent.  You want them to have certain skills.  I know at the start of the year, you mentioned that one of your big goals for the year  was trying to branch out into a skills-based assessment of cyber talent.  How has that gone?  How does that tie into the year general, 2025 goals for the office?  So before I go to skills-based hiring, let me talk about the defense cyber workforce framework.  Because this is key.  The other thing we have done this year is we're changing the paradigm of the requirements  for our National Centers of Academic Excellence in Cyber to be focused on specific work  roles from the DCWF.  That determines the knowledge.  Each work role is the knowledge, skills, abilities and tasks required to do a job.  That's like a resume builder right there.  If you're going to graduate from school in a cyber degree, because cyber's vague, but  you know this work role, exploitation analyst.  And now you've studied based on those case sets.  And now your education filled those case sets, you're almost a shoe-in then to go into  a job because you've identified all the requirements for that job.  And that's the way we influence talent generation also, is we give them the requirements  we need.  And then the academic system can train to those standards and educate to those standards  and then we can bring them in.  Having said that, we don't hire a lot of people right out of the school.  And one of the reasons is we don't have enough entry-level positions.  But in addition, I talk to a lot of graduates who say, I can't get a job in the federal  government.  I'm like, okay, well, what's on your resume?  Well, I went to school.  I'm like, that's not good enough.  So we have all these other programs out there for expiryential learning.  Where you had how many cyber competitions have you participated in?  What senior project did you do?  What did you actually deliver as part of your internship?  If you don't have all of those other experiential learning opportunities, which we have to  provide, but you have to take them to the mob on it, then you're not going to have  the experience or the qualification to get in.  They're not going to look at that resume.  So now moving on to skills-based hiring.  We've already put out from the workforce-directed side.  You can't hire today-based and cyber-based specifically on education, experience, or  certifications.  So your pedigree.  Well, if you can't hire based on any of those directly, then how are you hiring?  So I have to have an alternative system.  We will do skills-based hiring this year.  When I talk to you next year, I'm going to say we did it.  Okay, I'm going to hire at least one person with what we're working on one work role right  now and happens to be cybersecurity.  And we've already had our first pilot and we've proved success that it does distinguish  between qualified and non-qualified.  That's the first step.  Almost too much so because almost 90% of the pilot population were not qualified.  So at least we could determine that.  That's a start.  Our second pilot we're going to run right now.  And by the way, when I say skills-based hiring, just to be very clear, because people think  of this as different terms.  I am talking about going to a cyber range, which is, you know,  and hands-on keyboard where you're actually doing the requirements required by that  work role. I am not talking about a self-assessment test. So right now we have two  instruments. One, the first one to read it to see if you're initially qualified is a  40-minute assessment. We took a three-hour assessment and wheeled down to the  specific task required in 40 minutes, just to see if you're in the ballpark  of being qualified. If you pass that one, we then have almost a four-hour assessment  in the lab. And that judges a little bit more. We're looking at teamwork, we're  going to resiliency, a little more of those professional skills involved too,  because that's very important to figure out through. And then we're looking at  very specific skill sets. So that second phase, if you pass that, which we had only  like 2% of the population pass that, you're ready to do the job. So again, first phase,  first pilot done, so far, great results, but we will get to skills based on how we have to  get to skills based on, and then the issue is how do you scale it? And how do you keep it  updated? Because the test is going to change every time you take it. So with artificial  intelligence enabled scenarios, we're going to move through scenarios, you'll never see  the same scenarios twice, keep the content refreshed, that all cost money to do. And then  to scale it is going to cost more. So those are the things we're working through now.  And that's something we can expect within the next year. I will get to skills based on  the next seven months. By the end of this calendar year, I'm going to hire at least one  person and prove I can do it, scaling it will probably take a couple of years. Because  there's a lot of legal ease that I have to work through. But again, the environment we're  in right now is perfect for this. I look at this challenging environment we all say we're  in. And how do I use that to my advantage? And I think this is one of those areas where  the environment is ripe for opportunity to make radical change like this and make this  this happen. So I think we're in a good spot.  You know, the office is in a very unique position where it engages not only the DoD at  large with getting people from all walks of life to get engaged with the department. But  the commercial sector and academic sector, could you help me understand how the CAEO  continues to engage with, I guess, all facets of society to bring in cyber talent. And what  initiatives are you? I guess pursuing to bring in, you know, universities and industry  partners into the fold. Yeah. So that's a great point. Because when we look at our total  force, we are a total force of academics, industry, military civilians within the department.  And I look at it as a partnership. So if we're not training together, if we're not educating  together, then how are we going to work together? Yeah. So it is a team effort. I don't  look at this competition at all. I look at it as we're on the same team. So that also applies  to our academic side. So first of all, specifically on the academic side, we have to do  two things. We have to expand our current 480 schools. But we also have to reach areas  that we're not reaching today. We have few programs at the middle school level. We have  few programs at the high school level. We need to greatly expand those programs because  that's where the youth of today are making their decision on career paths and they're making  decisions on what courses they take if they stay into the math or STEM or if they go  onto the arts, which is still great. But we have to motivate those kids and give them that  pathway forward. Then we're also working with in these two states right now for  junior in Minnesota, actually. And they have coalitions established with academia and industry  to bring together faster training, faster curriculum, incorporating the latest, you know,  industry is bringing the latest injects that are out there and bringing them into the  curriculum. And also through camps and weekend activities that we can partner together because  we can't afford to train every single American child out there. We need industry to help us  with this. And then we also have all of our partners who are helping us with hackathons and  cyber challenges, tons of those events are going on that not sponsored by us, sponsored by  industry. And we need to leverage those. We also have lots of partners out there from nonprofits  to actual industry who are taking on certain populations and helping us, whether they're transitioning  military and they're offering cyber skills to train them, was military spouses or whether it's just  under served communities. And how do we get those applicants into these programs to learn what  cyber even is? Those are all critical engagements that I think we have to enhance. And it's  basic communication and coordination because a lot of these communities just don't know the  opportunities exist. You know, one of my dream goals don't hold me to this this year. But I think  within three or four years I'll have this down. I want a national high school level competition,  cyber competition, cyber event, the national level will be regional finals, the national finals.  And then the winning team will get a scholarship to the school of their choice for four years. Of  course, one of the NCAA schools. Absolutely. So I just think that what in the second  kind of right to actually sponsor that from the department  and have a national wide challenge  and then have a scholarship awarded  to those students upon graduation.  Why do I think it's a great idea?  They've very proven they have the aptitude  and attitude to do the job.  They already have the knowledge.  They just want a national competition and cyber.  So that to me is the perfect population to make this happen.  And then also how many people  do we have a reach through that  that don't make it to the nationals,  but they still participated.  And the exponential effects of that are huge, I think.  Yeah, absolutely.  I am really excited to see that.  I know I won't do this here,  but in the future we will definitely be interested in how I'm doing.  And I hope an industry sponsors it.  Right, I mean, I'll put in for the scholarships, right?  As a carrot at the end,  but I want industry to come in and sponsor it  because most of these kids will not go  in the federal government.  Most of them will serve the nation,  which we desperately need this population.  So I just think it's a win-win across the board.  I just had to make those relationships  and those connections and then put the program together.  Yeah, absolutely.  It makes this job very exciting.  I love the opportunities that we have  everyone I talk to who's in this space,  who's dealing with talent and talent management  and inspiring that next generation.  They're all so motivated.  It's very impassionate about it.  And it's inspiring to me.  So I love my job every day.  I love my job every day.  Oh, Marcus, always a pleasure.  Thank you so much for joining us again.  Thanks, Jordan.  And looking forward to seeing how the office develops  in 2025 and 2006.  Great.  Thanks, Jordan.  Govcast, along with cybercast and healthcast,  is a production of GovCIO meeting research.  For more podcasts and to check out the other shows,  head to govciomedia.com."