Speaker A: Hi, friends, my name is Dr. Syndra Campoff, a national leader in the field of sport and performance psychology. Every week I'm on the local radio sharing my top tips on exactly how to develop the mindset of the world's best so you can accomplish all your dreams. Get ready for a jammed packed episode focused on practical tips to help you get after your goals and step out of your comfort zone. Let's go.

Speaker B: Time to check in with Cindra Campoff today. And today we're talking about leveling up your belief in yourself. Cindra, start us off with a quote.

Speaker A: I love this quote by Dr. Caroline Leaf. She said, affirmations are not wishful thinking, they are rewiring your brain.

Speaker B: So what inspired this topic for you today?

Speaker A: Well, today what inspired it is, you know, I love watching sports and I remember watching Serena Williams in 2015 and she was battling illness and pressure and her own personal doubt when she stepped on the court at Wimbledon. And you know, she wasn't physically her best, but mentally she was. And I later read how Serena repeated this before her match and she repeated it over and over again. She said, I am strong, I'm a champion and I've got this. And even if she didn't feel like it, you know, she spoke it into existence and she ended up winning her sixth Wimbledon title. Many times people call this the Serena Slam. And she didn't just win because she silenced all her doubt, but she won because she spoke louder than her doubt.

Speaker B: So we're talking about our own self talk then. What is really important for us to know about the thoughts that we have swirling around in our brains?

Speaker A: Yeah, I think one of the most important things is just to know that we've developed our thought patterns really early in our lives and we all have that negative disempowering voice that protects us from harm. But as adults, sometimes we don't need these thought patterns the same way. And you know, they maybe instead of protecting us from harm, sometimes they can sabotage our success or get in the way of our fullest potential and not allow us to reach our goals or our life's purpose. And I think, Lisa, what's helpful to know about that is it's really freeing knowing that these thought patterns are really habitual and automatic, which also means we can rewire our mind and we can think more on purpose. And what I would say is what we have to do is engage in daily mental conditioning. And when we do that, we develop new neural pathways. And so your thought patterns contained gaining new awareness and intention. I think that's really exciting to know that you can change your mind.

Speaker B: Well, I know. Now everybody wants to know, how do we do that? What's the first strategy that we can put into this mental toolbox that we have? And why is a mental toolbox even important?

Speaker A: Great question. So today we're going to talk about just four quick strategies you can use to rewire your brain. And I think they're really important because, again, we are programmed for this negativity. And so we really need strategies to combat that. And the first strategy we're going to talk about is something I've talked about in beyond grit called the 3 op. And it's really a practice on reframing difficulties and reframing those difficult and stressful experiences as learning opportunities. And so when you're experiencing a negative opportunity or an obstacle, what's important is to ask yourself the question three times. What's the opportunity? What's the opportunity? What's the opportunity? That's the three app strategy to really help you looking for what's good in difficulties.

Speaker B: So what's another strategy we can use?

Speaker A: Another strategy you can use is just questioning those disempowering thoughts. Many of our thoughts limit us, and they're false. And so, you know, second thing you can do is just notice yourself talking to yourself in a really disempowering voice and just asking yourself, is that actually true? And what's the thought that would serve me better right now?

Speaker B: And how about a third strategy we can use?

Speaker A: A third strategy you could use is just continuing to be mindful of what triggers your negative thoughts and emotions. And the idea of just, like, noticing your thoughts and your emotions from an observer's perspective or standpoint, and just asking yourself what actually triggers your negativity or your frustration or your anger awareness is the first step on really gaining control of your mind.

Speaker B: All right, I'm going to ask you for one more tool that we can put into that mental toolkit.

Speaker A: Sure. One more tool would be imagining your own success. And we know just imagery is a powerful tool because your mind doesn't know the difference between something you physically imagine and something that's real. So just asking yourself, you know, what's something you could imagine today that's really powerful about your future, about your day, about this month, about next year.

Speaker B: All right, Sandra, how do you summarize today for us?

Speaker A: Well, these are really quick strategies that we could go deep into each one of them, but they all help you remain optimistic and kind of seeing your life through this really clear lens. And so just channeling your truth allows you to really see different situations and solutions and opportunities again, to rewire your mind. And I think what's important about that is the future of your career and your life really depends on your ability to see the opportunity and the difficulty and to talk to yourself even more powerfully than you do today.

Speaker B: Syndra, give us a power phrase to start with. Talking to ourselves powerfully.

Speaker A: I level up my self talk to level up my life.

Speaker B: Level up my self talk to level up my life. And Cindra, if people want to follow along with your teaching or maybe check out a podcast of yours or read your books, where do we go?

Speaker A: Yes, absolutely. You can head over to Dr. Syndra.com and everything I've talked about today is in one of my books, Beyond Grit or Beyond Grit for Business. And you can find out more information again@drcndra.com way to go. For finishing another episode of the High Performance Mindset, I'm giving you a virtual fist pump. Holy cow, did that go by way too fast for anyone else? If you want more, remember to subscribe and you can head over to Dr. Syndra for show notes and to join my exclusive community for High Performers where you get access to videos about Mindset each week. So again, you can head over to Dr. Syndra. That's D R C I N D R A dot com. See you next week.

