" Hello, welcome to this episode of 10,000 posts. It's the show about how everything is posting.  My name is Hussain. My name is Phoebe.  And it's very hot, very hot in London today, where we both are. And that means that there  is a good chance of some goofiness happening because I feel like whenever the heat, whenever  it goes above 25, I feel like my brain functions a bit weird. We're in the goofy zone.  We're in the goofy zone. About 27, you're in Goofs.  Yeah, and we're like at what? I think it's over here. It's about, I think it's like 29 to 30,  which is to say we are very much in the sort of like we're well into the goof zone. Some fun  stuff may happen. And to join us to beat to be goofy and just have a bit of a strange time,  we are joined by our friend Rebecca Jennings. Rebecca, how's it going? It's going great. And I just  checked the temperature in Celsius here. And it is 30.5 degrees Celsius.  Wow. So we're like almost insane. Like, although what? What would you say is like the goof zone  in New York? Because obviously like, first, he's like fairly, I don't know if it's like a normal  temperature for you guys, but it's not like outrageous. No, this is pretty normal for us. And also,  like it's obviously we have a completely different infrastructure. We're more built to last in the  heat. But I think for us, it's about a 35. That's when you get to the goof zone. That's about 95 degrees  Fahrenheit. Some days it's over 100, which is about 37 degrees. And that's very rare. That's like  stay inside blast the aircon and pretend that outside doesn't exist. Yeah. But it's much harder  to do that when you don't have like aircon like built-in places. Yeah. Yeah. I've got like a big fan  that you might be able to like hear in the background. And normally I would like to switch off. But  like today I just can't do it. So you are going to have to deal with you are going to have to deal with  like this fan in the background. You're going to have to deal with the background goof zone, hum.  That's right. That's right. Um, welcome back to everyone. Welcome to a show. If you're like  here for the first time, welcome. We'd like to have you. If you're like here regularly,  like, yeah, I thought there is a very like something that we wanted to talk about, which was I would  ask of Erika Rebecca has like wrote fairly recently about attention spans. And the kind of like,  I thought the article is really interesting because it wasn't like a sort of like here's how you get  your attention span back or more likely like here's kind of why the sort of like the lack of  attention is sort of like a public health crisis or something like that of which like we've spoken a  a bit about a little bit and passing on the show. And, um, I think like it is an interesting subject  and it's not to sort of say, but like it's kind of completely under, um, as I completely  understated. But I feel like your piece really sort of looked into like, well, what do we mean  when we talk about like attention and what, um, RV, like what are the actual like when we  when we think about attention? What are we actually thinking about? But we'll get to that in a second  because I thought, um, we could derail just for a little second, uh, because VB you are going to explain to  to me, um, about a certain character and some weird goofy stuff happening. I guess in Austin,  Texas. Yeah, I think that's that's that's for the culmination of the of the goofiness was happening.  I do appreciate that there is a certain irony to getting our backgrounds talk about attention spans  and then immediately being like, yeah, but there's like the other thing that I see that's talking  about that. Talk about that. You could have a little bit of distraction as a treat is all I'm  saying, right? Right. Okay. We're like, we're we've put our attention on to two separate tracks.  This is this is track number one. So I've been thinking about this since I saw since I saw a post about  it. And you know when you see a post and it immediately just like sets itself to music in your brain.  Um, so instead of just like seeing the headline instead you're going like that, that, that,  that, uh, like that. Does this ever happen to you or is that again, is that the heat?  Um, no, sometimes I think it's happened to me. I didn't know whether it was happened to you Rebecca.  Sorry. Can you say that again? Sorry.  Thank you.  It's fine.  My, my attention was pulled away just like, whoa.  Welcome, welcome to the most matter episode of this.  Um, Rebecca, Sora squirrel and, um, and, and here we are.  Um, have you ever seen like a kind of like a short sentence or a headline or a post or something  that just like immediately turns into a song in your head?  Listen, I, I don't want to devalue your experience.  Never once happened to me in my life.  I've never enough, but I love that.  It happens to you. That's kind of a really lovely.  This happens to me. Not like, like, not like very often, but like every so often,  I like start writing a little kind of like operator in my head because I find something so  particularly salient. And the other day I saw a headline which, which said itself immediately  to music. It was an area. It was an instant area, which was the living king, Brian Johnson,  has been arrested for threatening Joe Rogan. And so immediately I was like, they're living.  Has been threatening Joe Rogan.  Um, and the latest, like, latest on this is the living king says he will never stop after  the arrest over the threat against Joe Rogan. So, so Brian Johnson, otherwise known as the  living king, who is, um, he's a supplement and ultra-manosphere guy. Um, he's also like, he's like  a primitivist. He's like, he's like into how he claims. Is it how he claims me and?  It can't be how he claims me and the full day. How he claims like prehistoric people,  eight. And also, presumably how he claims that prehistoric people made threats to rival prehistoric  people on prehistoric Instagram. Presumably.  It's not like it's not clear.  But he did.  He took to social media.  And you know that there's never a good end of a sentence  when something has started.  They took to social media.  No one has ever took to social media for a good reason.  A good and fun reason.  No one has took to social media to be like,  like the next person I see I'm going to buy on orange juice.  Like that's not what people take to social media for.  They take social media to like to slam people or to,  or to make terrorist threats against Joe Rogan.  So he's out on bond, Brian Johnson, the liver king.  I can't remember why he is the liver king.  Is it something to do with liver pills?  Or is it something to do with his liver?  Does he eat liver?  My understanding was like,  is he going to try and eat Joe Rogan's liver?  What's going on?  Well, he was sort of like into just like eating.  There's always like all these guys,  all these types of guys have to have.  Like they sort of begin with one thing.  And then the thing sort of like metastasizes,  but also the demands of like being a guy online means that,  like you're sort of having to constantly sort of like reinvent yourself.  And so my initial sort of like understanding of them.  And I'll be real like I don't actually know anything,  but it was about that he ate,  yeah, he ate loads and loads of liver, right?  I'm looking on the way,  I'm looking on his Wikipedia page now.  And it's like, yeah, he was known for eating large amounts  of raw, unprocessed organs and me focusing on his daily intake  of liver.  And his dietary advice has been criticized by nutritionists  for promoting potentially dangerous misinformation,  which essentially dangerous quantities of liver.  Nothing neat.  All right.  Yeah.  John's he's the guy who's like,  who's been sent to eat Prometheus's liver.  He is an evil in disguise.  I was wondering what the controversy was,  because I had forgotten about it.  And it was that he was like, yeah,  he presented himself as just like, yeah,  I only natural foods and all those natural foods are also just like  unprocessed liver.  You know, basically like as close to cannibalism  as you can get, I suppose.  And special lifestyle.  It's called the ancestral lifestyle.  And it's not your lifestyle.  It's not.  It's not.  We apologize to Brian Johnson for that.  But he denied having to having new steroids to achieve his physique  until 2022,  after which a leak of his private emails revealed that he had  spent over $11,000 on anabolic steroids and other performance  enhancing drugs.  And he apologized for his conduct in a YouTube video,  though not one where he was playing a ukulele.  I do want to go back.  So why did this come?  Why did this come out in his emails?  Was he like emailing people being like,  oh, guess what?  I am super into steroids.  I don't know.  Rebecca, do you know like any more about this?  Because I just, that video.  It's like, I'm so I'm so out of the loop.  And there are certain things on the internet that I avoid so much  because they nauseate me to look at.  And I think his whole thing, not only like the way he looks as a person,  it just like makes me feel physically ill.  So I think I've avoided everything to do with this man.  He's been in my orbit for obviously like a very long time.  But I know there's like a Netflix thing about him.  You cannot pay me to watch that.  I wouldn't be putting that thing my eyeballs through that.  Unfortunately, I have nothing to add other than I get so grossed out by him that I can't even talk about it.  But the feeling discussed is that you are like,  I just know how to be the live queen.  Oh God.  He was his live queen.  I feel like, yeah, I feel like I had a very similar thing where I just like,  I saw this on my timeline when he was sort of blowing up for whatever reason.  And I was just like, yeah, this is, he's doing a bit.  He's doing some sort of bit.  And there's like some sort of scam involved in this.  Like I'm bored of it. I've seen this.  Yes.  Do you know what I mean?  It's like fully like not for me. Like sirens and alerts go up.  Like this is not free.  And maybe this is also the reason why he's sort of acting the way that it's very much like in the same way.  But trajectory of posts where it's like, you know, that we have been trusting on the show for a very long time.  Where, you know, it goes from like, oh, here is a post that can be like definitive that, you know,  it sort of like tells us something about the way that the internet works.  And like, as time goes on, like, you know, these posts like have less and less impact up to this point now where it's just like,  I can't remember like any bit of content that has like had any real sort of impact online.  And it's sort of like organic form.  And I feel the same way about influences in general.  And I know that's like a very like, it's a very broad stroke.  But with these guys, like we these like sort of male fitness guys, like,  I think that does sort of apply because there's so many of these types of guys now, right?  And like, they all again, it's very much like they have to have like a gimmick to begin with.  The gimmick then sort of missed out like so this guy was like, liver.  But you know, there are other guys who's like, you know, they have like specific or they have like, you know,  types of training that they're selling or, you know, they're really into like a particular kind of natural creating or whatever.  And like, they make it their thing for a bit. They go on all these podcasts.  They do all the sort of like, did the media tools and everything.  Go on to like the big shows which probably includes Rogan's.  But then it just sort of gets like, you know, it just gets bigger than them.  And they kind of keep having to push more and more and more.  And the impression that I got from my very surface level understanding about the liver king was that he was kind of his sort of like usage of the steroids  came out of like the sense of when he was sort of when he kind of catapulted into being an online celebrity.  A lot of his appeal was like, oh, here's a guy who's just like insanely jacked.  Right. And you know, you got to maintain that somehow. Right.  And like, I don't know. I didn't know ever. It's like a pretty like it's a sort of thing to have pressure or it's just kind of, you know, it's a sort of disorder of his kind.  Like, I'm not here to sort of psychoanalyze.  But the impression that I sort of got is just like, okay,  this is what happens when you do just sort of become  like a character on the internet.  But why is that this information is emails?  What I'm coming up on.  What I think is funny about that is that his,  his like main thing was about being as unprocessed  as as like as possible.  But what you was saying is that you,  you're basically like you are not familiar with any kind of like  raw non mediated,  um, non kind of like self-conscious content.  Like all content is like is basically a like it's the  processed food stuff of of like create of like creativity and art.  And I mean, I'm looking at it.  That's a good way of looking at it.  And I actually think this ties really nicely into,  into some of the points being made in reverse piece actually.  Um, so I'm quite, I'm quite happy with that.  I'm quite happy that I actually had just thought.  But the only thing that I only have two more things I want to say  about the living and I promise will drop it.  Rebecca, I promise that you're not familiar to me.  But I mean, I mean, I mean, that being said, we are  planning to watch.  We are, I think we were talking about watching that documentary.  Oh, yeah.  But we're not going to make Rebecca watch.  I think that's the main thing that we can promise to her as a  friend of the show and as an honored guest that when I'm  going to make her watch this show.  Yeah.  So first of all, I really want to know what is wrong with people  who are called Brian Johnson because he is not the only guy who  has come to my attention whose name is Brian Johnson.  Like there's also, there's also Brian Johnson, the blood,  the blood boy, Mr. Blood boy guy.  Blood sand vampire guy.  That's how I think about all the odds in it in the in the in the in the  measure, who who takes all the supplements and the jaw filler,  the jaw filler and the squidward face.  Yeah.  Yeah.  But also ironically, like the least weird guy of this type of, of  this group of people, he's, he's certainly in the media and  range.  Surely he's not, I mean, he's basically I feel, I feel like he's  like the least reactionary in the sense of like everything I see  of him is just like I just want to be, I want to sort of be a  teenager.  That's kind of always not, he's not, he's not, he's not like  obviously, I'm maybe he is a fascist.  I don't know.  I don't know.  All I know is that every time I see him and there's all this stuff  about like, oh, 47 year old wants to be young forever.  And I'm like, but you look 47.  You just look like expensive 47.  You're like, you low hand.  Right.  He looks like he has the same kind of work done and the same wax iness as many, many, many Hollywood women and men.  Yeah.  And I find it so funny how he's spending millions and millions  of dollars and probably like having this very weird relationship  with his son to look worse.  And with her.  And I guess like the, like he looks like the PTA of like an  Arizona private school.  That's, that's how I would picture him.  Sorry, back around to my question.  Oh no, I just, it's just, he, he really makes me like,  talk about someone who I, again, don't really want to look at.  But at least it's not like the bulging steroid muscles.  Like I'll take the weird waxy filler and the vampire over this  like kind of creature of the liver king.  Maybe that's problematic.  I mean, like if you like look to the two pictures of those guys  and someone said like that, one of them's  the liver king and one of them is, and one of them is, is the blood  guy.  I'm not 100% sure that you would necessarily get that get it  the right way around.  I'm not, I'm not positive.  So that's, so that's something I just want to know what's  rock, because like Brian Johnson to me feels like a very, very  normal name.  That's like, right.  That's the name of like the most normal guy imaginable.  I don't understand why the two Brian Johnson's that I'm  immediately familiar with are this level of unusual.  So that's something that I think is maybe we're thinking about.  If you've got any Brian Johnson's listening to the show, please do,  please do write in and ask us what it's like to be to be a  Brian Johnson to be a Brian Johnson in a world which is clearly  antagonistic to Brian Johnson.  So I'm just in Johnson in a world where you will never win that  SEO.  You are, you are.  If you're trying to start a business and your name is Brian  Johnson.  That's, that's true.  But if you've ever like, if you've ever committed like kind of  minor felony or like, she it on someone, then you really got  something cooking because no one's going to be able to go to  you.  You think I'm going to say now about the rest of the  story is just I just really, really want to just read a couple of  quotes from this from this story just because just because I  want to and it's, you know, it's my show and I'm and that's  what I'm going to do.  Well, so Brian Johnson, the living king, not Brian Johnson, the  blood guy was was arrested after posting multiple videos to  Instagram, challenging Joe Rogan to a fight.  Then he then took to social media on the Wednesday, in  Ting is arrest.  This is a quote from from from the Texas branch of Fox News.  So I'm assuming it's correct.  What they're saying, I have been given the gift of a restraining  order, Johnson said in the video, if anybody knows of someone  else whose first name rhymes with blow, whose last name is  Rogan, I'm not allowed to say it.  He said he was going to the capital and he showed his ankle  monitor in the video.  I don't want to give any details, not any names.  That's how you get ready for a fight.  And you thought the videos was stopped, but they will never  stop.  You've got an infinite amount of venom and then we'll hug and  unite.  At some point, you have to capitulate something real tension,  real fight.  I don't think there is such a thing as an infinite amount of  venom is what would be my note on that.  So the terms of Johnson's bond include no contact requirements,  stay 200 yards away from Rogan and his family members, no  possession of firearms, ankle monitor and a mental health  evaluation.  I don't think that sounds like the worst idea, frankly.  But the but the text of the channel.  of Joe Rogan to a fight.  I just think just deserves quoshing in full.  Joe Rogan, I'm calling you out.  My name's Liffer King.  Not the Liffer King.  I'm interested in that,  because that suggests that he,  that Liffer King is more of a kind of  regional title than being the King of Liffer.  Liffer King is a different,  that's different to me to the Liffer King.  My name's Liffer King.  Man to man, I'm picking a fight with you.  I have no training in Jiu Jitsu.  You're a black belt.  You should dismantle me.  But I'm picking a fight with you.  Your rules are come to you whenever you're ready.  I think this sounds, I think it sounds like quite,  like quite generous, but.  And this video, Johnson has seen shirtless,  wearing an animal fur headdress,  and holding what appear to be two short barrel  Aor 15 star rifles plated in gold.  That's so interesting that he wants to do like hand-to-hand combat.  Meanwhile, it's like he was not a giant dog.  He's my giant gold gun.  Like he is a member of the Gaddafi's.  Oh God.  And there's, I think there's so pathetic about this.  Like it's so just like trying to do the,  what was it, Mark Zuckerberg and Elon?  We're gonna fight at some point and like,  it's so Jake Pollot, so Logan Pollot, so YouTube.  And this way that's like, honey, like we are past this.  Like you are, you were just looking,  like you look like you're like,  whoa, Vicki, and I'm so sorry to whoever knows who that is.  But it's like, it's giving like this earlier era of the internet.  That is just, it makes me feel a little bit sad for him.  Anyway, that I didn't expect.  Yeah.  Like, what?  Like it's always a fight.  It's never like, it's never like that.  It's like he just wants to be on your podcast.  Like he's begging for a spot.  He's begging for attention.  He's begging for like, like us.  He wants to be on a film with Joe Rogan.  And he can feel his like fame waning, I think,  and so he's grasping at the one thing that he knows will get him a headline.  Yeah.  His name in the same sentence as Joe Rogan, who's probably like his idol.  Yeah.  I think this is like basically it.  I do feel like, you know, and I am going to segue here into your piece,  but you know, you're right, because it is about attention.  And it's about like the things that people now think that they have to do  in order to sort of get that attention.  But I think it's also like what happens to someone who like gets loads  and loads of attention or perceived attention for like a brief period of time.  And then it kind of goes away.  And by his case, it was just like the scandal and like his betrayal of like the sort of raw organ community.  I said, like, or bodybuilding community or whatever.  But that just like, I can't believe he's taking like mass-produced supplements or whatever.  And so maybe that was sort of like the reason for his decline.  But like that's just like delaying the inevitable, which is just like, well, yeah, it's easy to sort of,  it's easier than ever.  I would argue to sort of get like a sort of disproportionate amount of attention in relation to like what you're actually doing or your presence in your actual world.  It's also like incredibly easy for that to just like go away.  Which leads me to ask the big question to Rebecca to introduce us to our article.  Yeah.  What is a tent?  Like this, this piece, as I mentioned at the top, like a really sort of sort of ask the question, like,  what do we mean when we talk about attention?  And so when we talk about kind of we want to sort of rebuild our attention spans or attention spans are going away.  Like it feels like this is a term that's often used very passively.  Or it's, I mean, it's used very frequently as, and it's not to sort of say that like the phenomena isn't like legitimate.  But it is a lot broader than is often portrayed.  So I guess like my opening question to you to introduce us to like your piece and like the work that and the work that you did for it is like,  what do we mean when we talk about or when we think about attention?  Yeah, totally.  And I'll just apologize right at the top for my voice.  I am coming off of being sick.  It's a foster voice.  Sorry about that.  But no, I think people when they talk about attention, what they're talking about is their ability to focus on like something for a long amount of time.  They feel like they can't watch a movie without scrolling their phone.  They can't read books anymore.  They need a podcast even when they're just like cleaning their house because the idea of having nothing,  nothing, no stimuli is upsetting.  And I'm guilty of all those things.  I think all of us are.  It's hard to be a person and not be like that.  And it's so funny because we worry about our kids so much like like getting a screen time with kids.  It's like we're training them to be a, oh, it's because adults use that amount of screen time.  It's like it's not like just because kids are using it.  Like, well, they're going to be using that same amount of screen time as adults.  So why not?  Because it's like what's what's what are we really worried about here?  And I started.  I was interested in kind of, and that's not really where the piece ended, but I was interested in the relationship between the attention crisis as people have called it and the literacy crisis and the loneliness crisis and how all these three things are interacting because I think they are.  When we talk about the attention crisis, we're talking about too much time spent on your phone alone at home, too much like brain space being occupied like basically being like deputized by tools like JTPT or something until people can't read anymore or whatever.  And then not enough time spent with other people doing things that we love to do.  So these three things like really like the same problems me, but it's hard because I also in the course of reporting I ended up talking to a guy that's like we have this all wrong like all of these best selling books about like how to get your attention and back are are worried about the wrong thing because you know, really like there's a certain group of people that are the only people that are actually worried about this and it's it's exactly you think it is.  I'll stop there but yeah, no, I think you're right and like I was going to like ask in an immediate follow up, but I will like to let you read.  to let your voice recover.  I will like do the pre-hand block before I ask you about.  And I think that you're right.  I think the point about the loneliness crisis  and the literacy crisis and obviously these things,  I've been trying to do as much reading as I can on them  because it's one of those,  these are phenomena that I guess observationally  and anecdotally.  And I talk about myself and I think about myself  and I talk about this too.  I recognize that, yeah,  I, you know, I, like my sort of like sense of my,  my attention span is very low.  I'll sort of like put that very simply.  And part of it is because I do have ADHD  and that has been diagnosed.  I don't take medication for it in part  because my feeling like I want to sort of see  if I can kind of work with it.  That's, that maybe is like a subject  for like a different conversation.  But I think the point that you're making about like,  you know, the sort of the way in which we understand attention,  I guess like in relation to the time that we live in,  makes it like makes this conversation  not necessarily one that you can sort of just reduce  to like phones or screens or like not just in and of itself,  right?  Like this is kind of, you know,  these are also people who are also operating  in like periods where media is very siloed where media  and like identity are kind of linked as well.  And so like we consume, you know,  the consumption of media is also sort of related to like  how and what we think about ourselves  and like the ways in which we sort of like reinforce that,  the way in which we also like use media  or like people use media to sort of understand  the world that they're sort of moving through.  And I think these are points that like the person  that you spoke to, I was named, I wrote down  but I can't remember now.  But the one who you just mentioned,  I think you're gonna have to help me pronounce his name,  Dan, is it Daniel M.W.  And why are you?  Yeah.  Yeah.  You know, he touches on some of that,  he's the one who as you reference says,  but like the way in which like the sort of broad conversation  around the lack of attention span  and the effect that that is sort of having on people,  you know, we need to sort of rethink what we mean  when we talk about attention.  And I wondered whether you could talk a little bit about  his work or like the conversation that you had with him.  And what does he say about attention  that differs from like your Jonathan Heights  or yeah, I guess like he sort of the mate,  or even like your cow new ports  when they're much more popular theories  about attention and attention spans.  Like what, why does he sort of think  that they're not why getting it?  Yeah, they all kind of go over like,  because there's so many like best-selling books  that talk about this.  And they are, like it's not that they're wrong,  it's just that like what they're talking about  is how these big businesses have stolen our ability  to focus on things that are important to us.  And that again, that's not a wrong thing.  People are more easily distracted.  One of the researchers I talked to,  she had done studies for like the past 20 years  and shown that our ability to focus on a single screen,  you know, in 2012, it was about 75 seconds.  And now in 2021, it was like 47 seconds.  And people like the survey is where people say  like I cannot focus anymore.  You know, I can't do deep thinking or whatever.  And so these books kind of diagnose that problem.  And it's also like we talk about how much more miserable  we are now that we can't focus on the things  we love to do or that we feel unproductive or something.  And Cal Newport traces this back to, you know,  the 90s, the rise of PCs and emails  and the ability for employers to track the work  that their employees are doing.  And so, so much of that time is has been kind of  became about like showing that you were doing a lot of work  and creating meetings and emails and things  that are kind of inefficient.  But like it feels like we're doing that kind of work  when we're doing it because it's like,  oh, I'm knocking off all these to do things.  But then it just makes us so,  it's like constant code switch or context switching  between different activities that aren't really getting  a lot done.  There's no deep thinking involved in that.  It's just kind of like back to this person,  okay, like setting up this meeting,  like we're gonna sit up the time,  just talk here and then like just,  and then you get, you really don't feel like  you've done a lot of that day.  And yeah, this is like a big problem that a lot of people have.  But I think what Daniel Immerwar is saying  is that the attention crisis is not new at all.  In fact, people have been talking about this for centuries.  And he uses the examples of Anglican priests  in the 18th century who worried that like the novel,  which had just kind of been invented sort of at that time,  was like distracting women from their ability to just be  very pious and quiet and novels were often like soap operas.  It was like that was too stirring for their imagination.  And it took them, it distracted them  from what they should be doing,  which was listening to the priest themselves.  And I think he talks about how attention is sort of this problem,  it's a bit unique to people that have a vested interest  in keeping her attention on their work,  which is people like us.  It's writers and journalists and academics.  And these are jobs that require a lot of sustained attention.  And it requires you to be on social media,  but also gets worked on.  And that's kind of a horrible mix of things  because social media is intentionally distracting.  And so we, as in the journalist and academics  who worry about the attention, the quote-unquote attention  crisis, we blame it on.  We blame the fact that people can't read our beautiful long works  or scholarly articles on the fact that,  it's a crisis.  But really, there's nothing inherently that says,  a book is better at conveying information  than a video or a podcast, or whatever else  we're worried that people are spending their attention on.  And so he's sort of basically the call  is coming from inside the house where it's...  like, you know, we worry about short form content and whatever, but it's like who's to say,  we are like, people are not getting more and varied information from these sources. And they are  from, you know, a heavily researched book that took years to write and is fact checked. And like,  you know, I have my own opinions about what is a more valuable, like what is a more valuable use  of someone's time and what is a better way to get information. But like, I'm not an impartial party,  you know, in every single time that we've had this debate, we're the losers. Like, it's like,  there's kind of no point in like, you can't be on the Anglican pre-side in 2025. Who's like,  yelling, you're like, who's like, scolding the public for not paying attention to what they want to pay attention  to. It's like, you have to, if you want to be a contributor in this world, you have to meet people where  they're at and find and give them something that's as engaging as these other tools.  I don't know. I feel like you can't be a professional hacer. Like, you can figure out what it's  doing. You can. You totally can. And I am. But I just thought that was such an interesting point that  like, like, again, it's like when you compliment a book or a movie, you say it's, oh, it's  engrossing. It's so good. It's like, well, that's what we criticize, you know, TikTok for. And so,  you know, it's, I thought I was, I thought I was like, a point that you don't really hear being  made a lot because it's so easy to point to the like, the evil platforms as like stealing our  focus. And like, and they have, you know, it's like, two things can be true a little bit.  Yeah. And I think, yeah, I do think I do think it's super interesting. I like, I like, I personally  tend to, tend to bristle when, when I see people using historical examples, which are meant to be  because it's like more of the same thing of, of a kind of current discursive topic because they  never, they never quite fit to me because because of the contextual differences and because of the  because of the differences of scale. And I think that when you say something like, um, this is not a  criticism of your back. Obviously, this is a criticism of them of the guy you spoke to. And it's not  even straightly a criticism. It's more it is more a disagreement, which is that I'll, well,  there's no reason to suppose that information gleaned from a tech talk or from a podcast is  necessarily of a lower intellectual quality than that which you might get from from a heavily  research and cited and supported supported book. But I think this is a real proof of the putting  as in, is in the eating because no, there's nothing inherently, um, deleterious about transmission  of ideas through either video or audio, audio format, but it is very, very apparent from all kinds  of material offshoots of what society is, is like that these are not actually terrifically good  ways of dealing with difficult concepts complicated ideas. And they also, I think something that I  have like something that I have observed, they, they produce a situation where where this kind of  information turns into a standing for people just like saying what they think about something and  then they use it as a kind of a backup for what they're saying. So like, oh yeah, like yeah, yeah,  yeah, this is what I think about this. And I saw, I don't know, I sort of had on a podcast, I saw  it on a video or whatever. And there's actually no way of knowing whether or not they did or they're  just telling you what they're telling you what they, what they think about something, which is  perfectly all right, that's like that's a, that's a system of communication. But they're using  this, this very, there's much harder to grasp a much harder to cite system of citation to back up what  they're saying. So whether or not they have absorbed any concept or any idea is I think, I think  pretty obvious that like in the main, they haven't. And like the call this institutional gate, gate  keeping if you must, but it's pretty hard to get a book out. Lots of people have to look at this book  before anyone else is looking at it. You can record yourself on TikTok saying anything, saying  literally anything. And I'm not saying that video essay or offer that matter audio format is  is necessarily a kind of poorer way of getting information into your brain. Because I don't think  it necessarily is certainly not certainly not listening to something. I definitely have listened to  things which I found very, very educational. And there are of course ways of using formal citations  and supporting and supporting the stuff that you say in these formats. It's harder, but it can be done.  But the point is is that people don't in the main do it. They, they, they get on my, or they go,  and they go on camera, they say it, they say pretty much anything. And then people who are, who are  trying to have these conversations. And like, and, and of course, like I'm not like, I'm not, I'm not  not, I'm not neutral here. I want people to read books and be interested in esoteric subjects.  And I want people to be in a position where they can meet people where they can meet non-political  or non-engaged people where they're at with complicated and radical political concepts, which is  something which people are not being given the tools with which to do that. And, and you can call  this a crisis of attention. You could call this a crisis of, you could call this a crisis of empathy.  You could call it something which is based on.  people really not having much to do with people who are not in their kind of immediate circles  and thinking that they have the world at their disposal to connect with and to talk to.  But it is an illusion because people are getting more and more isolated, the more democratised  and the more network communication gets, the more individually isolated people become.  Part of that is that there is nowhere outside for free to go anymore as everything gets  either privatised or made in support by the climate crisis.  But these are all things that connect together.  And I don't think you can just like, blithely sit and say, well, this is just like people who  hate the idea of the newspaper because that like, because that like undermined,  that undermined like structures of communicative power.  And this is just like people who hated the printing press because it undermined the power  of the church, etc, etc. But it's not. It's like, it's very much in a similar category of things,  but it's not the same. And I don't think it's a good analogy. I think it's a debate point  gotcha, which is not the same as a good analogy. I think I think that was a very, very long answer  to what you just said. I think I was going to, I was just going to add that like, I think I get what  he's trying to say. I mean, I don't, my critique of it is less strong. But I get what he's trying to  say, but it sort of rests on the basis that like, what we're sort of looking at is, I was going to  say like, I was going to say, well, it was going to be like a point about inputs and outputs,  but it was like this idea that like, okay, well, people are consuming stuff. And like, when they're  watching like a short or a video or something, the information that they're getting is like,  of a particular quality. And it's sort of like being interpreted and understood in a very particular  way, which imitates or at least can kind of like be a simulation of like, getting information from  a book or from a like, a documentary or something like that. Oh, yeah. And I don't, and I don't,  and I don't disagree with that at all. But I'm saying that that doesn't appear to be  how people use this mission. And I was in, I was going to add this like, and I was going to add  a this is a point that like Rebecca makes in the piece. And there's also just like very evident in  like other pieces trying to like, trying to sort of understand like attention and attention crises,  which is about like, like, what, what a way in which we sort of, what like absorb content passively.  You'd like Rebecca, you sort of point out that like, or like there's a better thing with a point in  your piece where it's kind of like, um, this stuff is sort of like background sound. It's like,  it's almost like music in a way. It's like, you kind of have it on because like the idea of silence  is something that like is very kind of unappealing. Um, yeah. And I wonder whether there's something,  yeah, whether there's something there in terms of understanding kind of like attention, which is  not necessarily, because like I was, I was reading, um, I was reading like sub stack the other day.  It's coming over recently. Like again, like I can't, I should have made a note what it was,  but it was like this data, it was like a data point, which was showing that like people are sort of  like watching more long form content now, they're watching like more video essays, they're watching  like longer vlogs and so on. And that's kind of like a trend that was it's sort of kind of  it's like ticking back slowly after like a very long period. And also like video platforms really  incentivizing shorts and slops and reals and all that type of stuff. Right. Um, I feel like I invented  like a term when I said slops, one of which is to say that like if there is a social media platform,  that is like unveiling a new type of like video content. Call it slops. I think it'd be fun.  So good. I think I think it'd be fun. Um, yeah, like so there is sort of like this, at least  this recognition that like people don't really like, or they're not really enjoying watching short  but and they're just sort of scrolling through it. And it in my in my way, like my understanding  based on like conversations that I've had and things that I've read is like this is actually like  a different what we're really talking about is like a different type of or a different like  method of consumption, which is like it's very passive. It's sort of like it's almost it, you know,  it could also be understood as like a reflex like you go on your phone, go on Instagram and you just  sort of scroll for reals. And if someone like asked to like, why are you doing that? You can't really  sort of answer them properly over the line. I'm kind of bored, but like it's just like a reflex, right?  And so I wonder whether there's something to that as well in terms of like the reflexes that are  also part and parcel of like designing digital like or designing like hardware. Almost every new  piece of hardware has some form of like scroll function. Like that, not only impacts like the type of  of attention that one gives to like what they're seeing on the screen, but it also sort of impacts  like the fit the way that they like physically interact with the world and therefore how much time  they really sort of like spend observing it. That makes sense. Yeah. Yeah. I think that was that kept  coming up in my interviews because there's such it's we're talking about two different things.  One is like, hey, you're trying to focus and on, you know, work or whatever it is a movie and you  can't because you want to like, you know, you have the urge to look up your phone or if you're just bored.  And I guess it's kind of the same thing, but it's like one of the one of the answers was, you know,  taking more breaks and this was the one that I really felt like because it felt like mattered a lot  because I think one of the one of the researchers I talked to said that like so much of  our, you know, worry about focus and stuff. Like we want to get into these like really like,  what's the word? Like a like a super hyper-focused mode. That's what we all think we should be doing  all the time. But really that's super unrealistic unless you are like...  doing something or unless you're running or painting or doing something very physical, it's very  rare that knowledge workers at least get into great, super hyper focused mode. Instead, what we  need to be doing is taking more breaks because when people install things like blockers on  and on their computer or their phone or social media sites, if I don't have anything to  distract me, then I'll be able to focus and instead that ends up like wearing your mind out  and it's like it makes the problem so much worse and so taking regular breaks was something that  like it seems like it wouldn't be the thing to do when you want to get into this hyper focused mode,  but it instead is. And the other thing that kept coming up was the idea of meditation, which is  being able to sit alone in your own thoughts and one of the YouTubers I interviewed and I don't know  made it to the video, but to the article, but oh no it did. But she realized that the problem was that  she couldn't stop picking up her phone whether she was overworked or if she was bored, these are  again two different things. But yeah, and it's like the even one where like with other people  where like why aren't you as entertaining as my phone is. And again, that goes to the  loneliness crisis because people don't leave their house because there like no one person can be as  entertaining as like the entire history of the world in your phone. Like you know.  I agree. Like I agree with so much with this because actually it is something that I  really like I have it as a real problem. And like I think it like it was always there in some form,  but it really got bad during the pandemic for like various reasons, right? Because suddenly like sort  of going into a going from an environment where it's like okay, at least it's sort of it's partly augmented,  right? Like I'm sort of on my phone a bunch, but like I'm also in the real world and so like  they're like I'm figuring out how they interact, but they do. And then all of a sudden you're going  into I go into this environment during the pandemic of like okay time is sort of like  all like kind of driven through my like what my technology and my phone. And I'm living by myself.  And so like there's no one but it's really sort of like tempering that in any way. And  since I've sort of been married, like it's gotten a little bit better because I live with someone and I  have to talk. Like I talked about person and you know, all that stuff. But there is also like a big  problem there, which is you know, there have been lots of times where I've just been like, you know,  we've both sort of found ourselves as like sort of scrolling on our phones despite the fact that like  we're sitting next to each other or that like you know, we're and you know, it's like this is like a very  very common problem. But it is one where it's just like oh like our lives are sort of tempered by  our phones and actually like it isn't just the case of I think it's very easy to sort of be or to sort  of say that oh like if we if we sort of like increase social interactions then all the challenges of  like digitally mediated phone like smartphone mediated like attention problems, but also sort of like  disappear or at least all sort of minimize drastically. I don't think that's entirely true. And I  think a lot of that again comes with like the ways in which like we physically now interact with  our phones. And I think the point that you made about like oh even if like you're really burnt out and  even if like logically intellectually you know, the last thing you want to do is go on your phone. There  is still this impulse to be like I'm just gonna go on it anyway. I'm just gonna check on it anyway.  And like you know, it goes from like you're checking on something to um, you know, you know, then  you're just sort of in the endless scroll. Um and I think one of the things I've been really fascinated  by in general. Um and I've seen this like on like you know there's like types of TV programs where  um they go to like a therapist office and almost all the couples are just like I'd leave like in all  these shows is at least like one of these couples that is just like yeah he spends too much time on his  phone or she spends too much time on his phone and like the phone becomes the story. Like in  it must have been like about showing like couple of therapy HBO one the couple's therapy one. Yeah  where like one of the problems is that like the partner is like checking his phone during the  therapy section. Oh my god. And he can't and he can't explain why like he can't explain and he says  he like he says there's a line that he says where it is just like I don't actually know why I do it.  It's just this sort of like reflex and it kind of comes and then it's a mixture of like  feeling like oh if there's an emergency or something's gone wrong then like I want to sort of like  no immediately which is like one of the reasons why like smartphones kind of like that's how  like one of the sort of original marketing sort of plays of it was like yeah like you know you don't  want to be outside and something wrong like something bad happens to like a person that you love so  this is like a really useful device for checking in on that. I wonder whether there's also just  this sense of like this heightened sense of danger that lots of people feel and when you feel  scared or when you feel anxious like the phone sort of becomes or like a screen sort of becomes  a source of comfort and as the notion of danger is sort of like expanded and become a lot more abstract  it's been a lot easier to then sort of rationalize it like well whatever anxieties or whatever  frustrations or whatever fear I have can be resolved by like whatever is on my phone and that's  kind of the way to explain it. Yeah no I think I thought about this so much while writing this piece  because I feel that way when the article starts out with with this very long book club that I'm in  we only read books that are like you know 800 to 1200 pages and so that's like it's about 100 pages a  week usually it's it's difficult either it's kind of a dry nonfiction book or it's a pretty  heady fiction book and so I find myself having like low grade anxiety if I'm not fully invested in it  and I'm like I have to put my phone and do not disturb because otherwise like I'll just take any  moment of boredom because I like you say like I like you like I have diagnosed ADHD but I don't take  medication for it because I can't because I have anxiety too.  It was like, it was just like, double-eat fucked.  But it's, and I realized that like, you know,  I never have that kind of low-grade anxiety  when I am scrolling my phone  because the phone is so good at destroying  anything else going on in your brain.  And it's just grabbing your attention, like,  like, you know, every minute it's a new post.  It's a new video.  It's a new whatever.  It's a new text or something.  And when I, you know, I watched,  also for this article, I watched Jean-Tille-Maugh,  this three and a half hour French film.  And I, you know, I loved the movie.  It was beautiful.  But like, the whole time, I was like,  oh, God, I should be like, washing the stove great.  Or like, oh, I need to work out today.  And I realized that like, those kind of things  are the things that your phone prevents you from thinking about.  And that's why looking at your phone is so comforting  because it's like, it will erase everything else  of your life stuff that goes on in the back of your mind  all the time, whereas like focusing on work or a book  or a long movie, it leaves more space for that.  Unless you're really, really engrossed.  And that's what we're all trying to get to.  But like getting really, really engrossed  is something that takes you while it takes effort.  I think what's interesting is that we're  like talking a lot about, like, it's difficult to get  into a flow state unless you're doing something very  visible.  And I think that part of what has been  the genius of not just the smartphone, but like the app,  but like the five apps that you do,  the kind of the dance between any check them  and then you check them and then you check them.  And then you go back to the beginning.  You start checking again.  It's like, it's hijacked this.  I suppose like very, like, Taoist almost idea  of like the importance of like drilling and repetition.  And that is how you learn something.  And that is how you approach something  correctly by drilling and by putting things  into your muscle memory, into your kind of proprioceptive  boundary making.  And that's been hijacked into, well, my thumb just does it.  The phone leaps into your hand almost.  Like, this is definitely what happens to me.  Like, I'm holding my phone before I really am conscious  that I've picked it up.  It has jumped into my hand.  I've got an app open before I've thought about it.  And the only thing that I've ever found effective  is not like social media blockers,  not the brick thing, none of that.  The only thing that I have found effective  is closing everything down when I'm done with it.  So there's an extra step in opening up  and then not just like there in the background.  But I have a completely opposite experience  to both of you, which is so interesting,  which is that my phone makes me anxious.  Scrolling makes me anxious.  The app dance makes me anxious.  Not being able to put it down makes me anxious.  It absolutely doesn't calm or blot out the kind of the anxiety  of everyday life.  It makes it so much worse.  And I think that's like, and I think that's  really interesting, just like in terms of a kind of,  presumably like a kind of neural pathway,  structural difference.  And it's not even necessarily that seeing  kind of like upsetting things on social media  is what makes me agitated.  It's anything that is on the phone.  Like playing like a mobile game on my phone makes me,  makes me agitated.  It makes my brain feel unpleasant.  It makes my shoulders higher.  It makes my breathing more shallow.  Like I don't feel good after I've done it.  After like an evening where I have forced myself to not be...  And I have to like put my phone like I draw  to not have my phone in my hand while I'm watching TV.  And at the moment, my little boy goes to bed at 8.30.  And I'm pretty soon after because otherwise I would  not get enough sleep.  So I may be up for another half hour an hour.  And if me and my partner watch a TV show without our phones,  then I go to bed feeling fine.  If we spend like an hour like reading or talking to each other,  I go to bed and I feel great.  If I'm watching TV and I'm like having a tax conversation  with somebody, like even like a perfectly pleasant one,  I feel like my brain has had electrodes applied to it.  And it's not that I can't focus,  or I can't pay attention to things that I find interesting  because what it comes down to is this also then produces  a situation I think where a lot of mass media  just isn't that interesting because it has to be,  it has to be paired down and kind of stripped of all of it's,  all of its kind of thrills and nuance in order to compete  with people's phones.  Yeah.  And so like the last time I like,  I can't remember the last time I watched like a TV drama  that I thought was any good because most things have to be made  so that you can concentrate on them while also looking at your phone.  Yeah.  And I think that that is something that also like,  that also kind of interrupts the idea that like,  that none of this has any kind of material consequence.  And again, I know that I'm not neutral on this.  Like I do want people to read long complicated articles  and I do want people to.  In.  engage in the extremely boring and unrewarding work  of important political activism.  Most of it is boring.  It's not exciting.  It's not fun.  It doesn't like, it's not like a fun video.  Like a TikTok is an inappropriate medium  for most political concepts.  And definitely for like meeting people  where they're at with political concepts  because of the length.  Like just the actual texture of it is just not suited.  I want people to read difficult books.  I'm not fast about people watching difficult films.  You don't have to watch difficult films.  I'm not gonna make you do that.  That's fine.  And like, yes, like part of that is because like,  part of that is because I'm, you know,  one of the things I do is I'm a writer.  It's partly how I make my living.  And you know, obviously I don't want people to be like,  oh yeah, no, I don't do that.  I don't read stuff.  Like, obviously like, like I don't want that.  I think it, I do think it's a really interesting point  that so much of this discussion about attention  and attention spans does come from people  who not only are concerned with whether or not  their work is gonna have any, any violence and any value.  Whether that is because they think that like,  the art is important or whether for the more kind of  present reason of like, what do I do?  I don't have any other skills.  Like, I have no other qualifications.  This is what I gotta do.  Like, obviously like that makes sense.  And it makes sense that these are also people  who require to do their work.  They require long uninterrupted periods of flow state focus,  which is very, very hard to do  with all this like a distracting shit around you  all the time.  Which is why I, like, which is why I'm very, very pro  either doing something physical with your day.  Like, whatever that might be.  And like, ideally in, ideally in nature  because I think it helps with the,  I think it helps with the flow state.  But it's not, but it's not just that.  It's not strictly that people can't pay attention.  It's the quality of what they're paying attention to  is made more troubling by the kind of falsified  democratization of the medium.  Yeah.  And just like, yeah, just following up  from what I said earlier about how it wouldn't be  as much of an issue of people really were sitting down  and watching video essays.  But it's just become part of the, part of the vocabulary  of people just like saying whatever.  It's like part of the kind of, it's part of the kind  of persuasive furniture of what people say  when they're just saying whatever,  that they saw it somewhere.  Are they read it somewhere?  Are they heard at some point?  And it's, and it's quite hard to,  it's quite hard to falsify having read that.  What was the book you're reading?  The history of the third right?  Oh, yeah, the rise and value of the third right?  Yeah, it's quite, it's quite difficult to falsify  having read that.  But you definitely falsify having like,  like a, like a short form video about it,  which just like backs up like a piece of information  which you think sounds right or like or whatever.  But I think something that I was really interested in,  in your piece, Rebecca, was, was the thing about,  and this is something that I did agree with,  which is that people actually can pay attention  to things they want to pay attention to.  And this is, this is people doing their own research.  And, falling down rabbit holes,  it's that they're not paying attention to the thing  that, you know, people who write something New York  think they should be paying attention to.  And I think, I think that's like,  I think that's a bit of a tricky one  because I do agree with that.  I do think that's actually a very,  that's a good point.  And it's not one that I really see being made elsewhere.  But I also think that if you say that it doesn't matter  that people have made themselves unable to consume  and engage with an absorb, absorb art,  because I know that there's this whole idea about like,  oh, you know, the thing about your phone,  it's got like all of like human production and human history,  like just like contained within it.  Fine, it does.  I agree, but we're not looking at that on our phones.  Like, like in the main people are not,  people are not being like, you know what?  I'm gonna see if on my phone there is like  some kind of digital copy of the horizon,  sort of the third right,  and I'm gonna read that on my phone.  They're not doing that.  Like, I think one person's doing it.  I think it's someone that is doing it,  and maybe one person is doing it,  but I think it's generally not what people are doing.  Right, but like people are, yeah, like for sure.  And then, but instead we get like,  almost fact similes of that.  It's like you read the Wikipedia page  for the horizon, follow the third right,  and you feel like you get the gist of it.  And therefore it's like, you kind of know what it's,  that which is like, it's such a hard thing  because it's like whatever like the democratization  of published thought is so good for getting people  as attention peaked and so bad at like keeping it  or like getting or getting them too.  But we would, what we, where we want them to be,  which is like, you know, like fully immersed  in a subject that matters.  Yeah.  And yeah, and I think that his point about the fact  that like we are not in, like it's so hard to say  that like our treading attention spans  is polarizing our politics because it's like,  no people are like hyper focusing on these rabbit holes  and Twitter spaces and whatever algorithms  where they are hearing.  something that really engages their attention. And we're so far separated because of that,  because we've all found a place on the internet that can absorb it.  Yeah. I think so. Sorry, I'll just say what I was going to say. And then I'll  before, literally before I forget what I was going to say, which I think is another fun  matter comment on the whole subject of this whole subject of this episode is that, yeah, I mean,  what it comes down to is like, people are more than capable of paying attention to or  sorts of things. I do think that insisting that it doesn't matter that people can't pay attention  to a difficult book or a difficult film or they, you know what, I even think reading the Wikipedia  and think you've got the gist. I even think that's like, elderly, millennial stuff. I think like,  if you're properly properly young, it's what it is, like, you have sort of heard from somebody  who has watched a short form video of somebody who has read the Wikipedia and they think they've  got the gist, but they haven't. I think that's like, I think it's much more, I think it's much more,  I think there are many more rounds of processing that this information is like going through before,  it kind of before it sort of reaches people's brain. But I do think that saying, oh, yeah, but like,  it doesn't matter. It's only like, it's only like, journalists and writers who are like,  whining because people are like, not engaging with their work because it's too long and they don't  and they can't pay attention to it. Because there are too many other exciting things to,  to grab their attention. I think, I think it's a very, very similar argument to, yeah, but you don't  need to read a book. You can get a large language model to summarize it for you. You don't,  like, none of you don't need, you don't need poetry, you don't need painting, you don't need,  you don't need art of any description, you don't need like any of these like, these like,  innate human behaviors. You don't need any of them because a, because a, like a robot can do that  for you and then that can help you be more productive because actually an interest in people kind  like reviving their attention, attention spans slow, they can, so they can read a book or so they  can watch a long complicated film. Those are, they are very, very unproductive things to do,  like within the, within the kind of the current structure of kind of AI media capitalism. They are  up, they are, they are, they are a valueless thing to do. The only thing that they do is,  is like in, in rich, the human spirit and the human community, which is not something that people  have been encouraged to think is especially important. And I think that's a lot broader than  kids can't, can't read a book because their phones are like buzzing at them all the time.  No, that was good. That was good. It's so nice to hear a husky voice.  I mean, the only thing I was sort of going to add and it was like, I feel, um, because I  obviously, like, I know that we're sort of coming close to time. But I think like the question that  I was, I got when I was reading your piece and every time I read, or like I hear and even think  about stuff like attention, or based on attention is also like, we sort of got a, like the people who  are sort of asking like about it really, one of the questions that sort of needs to be asked is like,  why do you want your attention? Right. And it's like, it feels like it's such an important,  quite like such a sort of like basic question, but it is really important because like the way in  in which like sort of attention sapping apps and stuff work is sort of on the basis that like  people, there are like preferences that people have where, you know, an algorithm can sort of like  sort out the content that you actually want to watch. So why think about like what you actually want  to put into like a YouTube search engine, for example, when it's sort of going to give it to you.  And it will sort of throw things at you that you didn't even think about like putting in yourself.  Um, we have, and you know, it sort of feeds into this idea of like novelty, like, you know,  one of the appealing things and also one of the things that makes like scrolling on a phone  very calming is the fact that like it's sort of constantly throwing novelty and so it sort of  prevents you from like thinking about stuff like elsewhere or at least can kind of like seem like a  break from that because you know, the sort of constant like push of novelty is one where, you know,  it sort of hits the right receptors, but also like, you know, there's always this constant sense  of like excitement back into a drown out everything else. And so like one of the things that  I think I struggle with when it comes to attention, but I think in general, it's really that sort of  question as to like, why do you actually want your attention back in like one answer for me could  sort of be like, okay, I want to sort of like be closer to like the people that I love and care about,  right? I want to sort of like be closer to my friends. I want to be closer to my wife, all that type of  stuff. Like the sort of very amiable things that people will say when they sort of like try to do  phone detoxing or whatever. But I feel like the underlying thing is like, well, you know, what you  what you also want to do and what you also need to convince yourself of is that your real life,  which is all like your sort of like less digital life, which is much slower, which is smaller,  which is a lot more confined depending on where you are. And it's also going to be more boring,  right? Like you want, you need to opt for that rather than like this sudden environment where like  you said, you know, the sort of constant novelty machine that's like in your pocket all the time  and is easily accessible and it's easier to use than ever before, especially like if you're in a  well-connected area, right? Like one is going to always be more exciting than the other. And so  opting for like the more dull and the slower and the kind of like limitations that come with that  is a very big ask for a lot of people, right? And it's also one where it's like, you kind of have to do  yourself because I was thinking about this just before we were recording, which is like,  at least I don't know, like I imagine like in the US with like it's sort of real enthusiasm of AI  to the point of like, oh, if you try to regulate.  this in any form, we will take legal action against you.  In the UK, AI and generative, the GPT to technology and everything,  that's the horse that every political party is betting on for economic growth and development.  Everyone wants to do that. And so there is almost this forced push of,  you need to have this AI-enhanced algorithmic software.  All the sort of things, but have driven this diminishing of attention spans,  which on the one hand, you have government ministers saying,  yeah, this is having really, really adverse effects on young people,  it's having adverse effects on just people in general in terms of how agitated they get,  how angry they get, it's poisoning politics, all that type of stuff.  On the one hand, they'll say that, on the other hand, they'll say,  well, there's also no choice, because this is just how people live now.  And so it's like, if you recognize that, the sort of being plugged in so much,  is having these adverse physical and mental health effects,  any way of weaning off that is entirely individualized.  And that sort of feels, and that's incredibly daunting. It's incredibly, incredibly daunting.  And I wonder whether then when people think about it, it's that feeling of,  I reckon that there are people that know about the amount of screen time that I have  is probably not good for me. But weaning off it or trying to get off it or trying to sort of like  live almost like an alternative way of life is going to be incredibly, incredibly difficult.  And I'm also going to be doing something that's like almost counter cultural at the moment.  And the pressure of doing that, especially if you're like by yourself or you're not in a community  of people who are trying to do the same thing, is that just must be really, really hard.  I don't, I don't know what to say about that as someone who like thinks about that a lot,  but like is done to try partly on that basis of like I just genuinely don't know if I'd be able to do it.  No, it's so I think about this all the time where it's like, I am so shocked that we still  are not seeing like a major, major like generation wide backlash against phones and the internet.  And like I see bits of it, I see on book talk, people are reading,  and you're back to do a thing, it's like people reading Daseyevsky instead of, you know,  whatever, like the book slop is coming out that like people are reading that is whatever.  But like there are little pockets of it, like, you know, people are doing like IRL newspapers  locally, but it's so individualized and it's so hyper local. And I just, it's, and every time  something becomes cool or becomes a thing, it becomes a trend and therefore it gets swallowed up by  the social media machine and then it becomes part of the thing that we're all sick of and hate.  But I also want to just go back to one thing you said, which reminded me of a different piece that  was in times last week about how, you know, your world on your phone is so big and your  world, your social world and your life is comparatively quite small. And it reminds me of the dating  scene, which I know none of us are a part of at the moment. But like there is, there was a piece in  modern love about how like men, where have you gone, come back, we miss you. And that was like the  the headline and it was about how like men, you know, you don't see men out. Like, again, like, I don't  really see this in New York. Like this, I have a lot of male friends, like go and do stuff, but my  friends who are in the dating trenches, they're like men would just rap. Like they're not even interested  in like meeting new people. They're not interested in going out. They're not interested in like  putting themselves out there in a way that's even remotely vulnerable. Because why would they,  when they have, you know, they're, they feel like they've been told like, oh, the world doesn't want  you. And also you have to put in all this effort because if you're not like XYZ, then like, I don't know,  it's just, it reminded like the dating stuff, I think, especially when we're talking about the loneliness  crisis, it's like, yeah, people are spending as much time with their friends. But they're also not  like meeting new people. They're not like going on dates and they're not like that they'd rather  kind of be safe and distracted and and whatever than like do something that's like not potentially  the most fun night of your life just because like you didn't hit it off with a new person from an  app or whatever. Yeah, I do. I like how I do what I do wonder how much of this is part of the  that like like the way the kind of mentality of suburbanism has kind of taken a grip on like even  people who are very much not living in suburban contexts. And the kind of the obsession with like  danger at the edge of the suburbs and like if you're like at home on your phone and like,  you're saying that yeah, then the day to can't get you. Like one thing I think is like,  I think is like interesting to something I want to pick up on what he's saying to which is just  I'm interested in in this because I don't find I find my phone not just anxiety producing  but I also find it boring. When I am scrolling, I am aware of being so bored. Like I would,  I would love to put the phone down and do something more nourishing than just be looking at my phone.  But I'm addicted. I'm addicted to my phone, which is why my fingers check the apps without me,  without me, without me telling them to. It's like it's like it's like eating like a really,  really massive bag of crisps. You're not even thinking about them. It's like a mechanical kind of  hand to mouth motion. And on the occasions where I've tried where I've like actively tried to  not be on the phone as much. But like for whatever reason I've been doing it, like I have like,  I have not, I've not been bored. So I think, so I think that the assumption that people are  necessarily going to find.  their friends, their family, other, like a slower, less kind of like bang, bang, bang, bang, bang, bang, bang, bang, bang, bang, bang,  it goes ping, like necessarily like boring. I don't think that's, I think that's quite a kind of bleak outlook,  actually. And I don't necessarily think, I don't necessarily think it's the case. I think just because it feels like super different.  I don't think it necessarily has to feel boring. I mean, I just, like,  if you were like talking to someone, like say, you're like, yeah, you're like, you're like, you're out,  having lunch with somebody. And your mid conversation and they take out a book and they start reading it,  you would be like, what's the matter with you? Oh, cat.  Sorry, I speak like speaking and being easy to start to the really, really nice big cat. Just wonder  what? Just wanted to cross the line. He's very large. What a big, what a big, what a big splendid boy.  Yeah, if someone took out a book and like occasionally was like glancing at the book while you were  speaking to them, you'd be like, what's the fucking matter with you? What are you doing? Yeah, don't act  like that. This is not how to act. This is no way to act. And while we're doing inappropriate analogies  between different types and types and structures of media, I think I don't see the difference  between when you're talking to someone and they're like reading their texts or they're  scrolling social media. I don't actually think there is any difference in terms of the disconnect  from other people, which I think is like a very, very bad thing. I think it's a, I think there's  kind of disconnection just because it's normalized and just because it's like really hard to break  out of it. I still think that that's a really, really good goal to have and just to kind of tie it  back to like, particularly to tie it back to like any kind of, particularly like anti-imperialist and  like like anti-climate change. I'd like left as radical politics. Like those things are  both very, very boring and very, very difficult. They are hard cells to people in the, in the  West because a lot of engaging with it properly really, really involves having to do a lot of  reflection and a lot of difficult choices, which the average person doesn't want to make. And I  think if people who are interested in and engaged with this kind of activism are saying like,  yeah, but like I can't put my phone down and talk to my wife because that's boring, then I think  we're all fucked. Yeah. Yeah, it's a good point. It's like if you can't even stomach a conversation with  the love of your life, how are you going to care about like making something actually? And how are  you going to, how are you going to meet other people where they're at? Yeah. And I actually  accept what you're saying about like how incredibly local these backlash is are, but like, honestly,  with the world, the world, the way it is, any meaningful political work also is going to have to start  locally because building, building mass movements does not seem to be something which is an element  of the present time. Shall we say? Yeah. Yeah. I think that's probably a good place to end it.  Yeah. Like start a local movement to like throw your phones like in the sewer or something.  I don't know. Maybe there are like, if there are like actual creative things that people have done  locally to sort of combat this problem, I genuinely be very interested in reading it. So if there are  like, do you send it our way? And we'd be very interested. All this to say, Rebecca, thank you so  much for both writing your piece and for coming on to talk about it. It was really, really good.  We'll have a link in the show notes if you would like to read it. But if people want to sort of follow  the rest of your work or sort of keep up with your writing, how can they do that? Yeah, you can search  me in Rebecca Jennings, New York magazine or you can follow me on Twitter or Instagram at Rebecca  with four Xs. And I promise I don't usually sound like this. And thank you. If you've made  this far listening to my horrible rumble, it was great. It was a lovely voice. We're not having any,  we're not having any slander on this show. No, it was great. Thank you. And also thank you for  doing it while, you know, your, your, you know, your sort of recovering. We really appreciate it.  And now I love, I love being on the show. Always happy to come on.  Thank you so much. And thank you for listening to this episode of 10,000 posts. We really appreciate  your time. If you would like to listen to more episodes, movie reviews, interviews with like  interesting authors, writers, artists or like lots of people actually on our paper like across like  the years that we've been doing this. It is all on our Patreon. It's five bucks a month that helps  us do the show with our ads. It helps us kind of continue running it. It helps us to kind of keep  on producing good content, which we really appreciate as well. Be sure to be used by Devon. You  can follow them at Devon underscore on our listen to kill James Bond if you don't already.  PBR have anything to plug. Um, no. I mean, just like the like, like, the, like, these  like, the, yeah, sub stack all the Phoebe's other podcasts. They're always in the show notes, but do,  yeah, do check them out if you have time. Do share them as well. And then final, most important  thing, links to Palestine aid organizations and projects in the show notes as well. Do donate,  do support rights to your MP right to basically anyone who has any semblance of power really.  All of that will sort of facilitate about the show notes. If there are also like organizations  that you feel need some more support or publicity, do let me know and we can use that section to  also like highlight those cases as well. Um, I think that's it from us on this very, very hot day.  So until next week, we'll catch you later. I have a good one. Bye. Bye. Bye."