" You won't want to miss today's episode because we're getting a rare visit to Isaac's apology to her for his atrocious sexism  Did he's insane trial conclusion love island cancel culture and conspiracies about this flood in Texas  It's a hot fourth of July. It's about to be a scorcher. So strap on your speedos grab that baby oil. We're going  Guess in hindsight baby oil wasn't the right term to use there  Is I think it was perfect. I meant like 80s wrestling baby oil with a speedo, but then I was like wait a minute  It's like your son oil did he? Yeah, he's ruined it. He ruined baby oil  They used to just be  Honest man on man action oiling up the muscles. Yeah  And then we're also gonna do the patreon tier two shout-outs for July, so stay tuned for that  Where should we start you want  You got any hot burning  Housekeeping or something  now  Well, let's start with Diddy and then we'll do Isaac's apology to her. It's usually not me in the hot seat. I know you  Usually you  Guess we all get a turn in it you up the fucking fam family ties piano so I can learn my lesson  Okay, so let's yeah, let's talk about Diddy because that is why we have to talk about the next subject  Diddy we've been covering weekly and  What who did five episodes on it catching everyone up with exactly what was being said in the angles being  presented and  Just like we predicted on this show last week  He got a slap on the wrist yeah  Big fat nothing burger mmm-hmm and the guardian posted it  I'll read you from them just to keep the legalities appropriate  The fandom guilty on two of five counts as lawyers call the verdict a great victory  The mixed verdict saw combs being found not guilty of the biggest charge racketeering conspiracy  Not guilty of the sex trafficking of Cassandra Ventura or the sex trafficking of Jane and  guilty of both the transportation  To engage in prostitution  related to Cassandra Ventura and  Transportation to engage in prostitution related to Jane  I don't why they write words they write sentences so confusing when it comes to the law. I think it's to keep stupid people like not know what's going on  understanding yeah  The verdict was delivered Wednesday morning after 13 hours across three days of deliberation by a jury composed of eight men and four women  After the verdict came down and combs nailed down in front of his chair and appeared to pray  He then he's definitely a godly man definitely  I mean come on when I think of a religious man  It's definitely ditty for sure. Yeah  He then faced the gallery and clapped  Which led to the gallery  responding with claps and cheers  Okay, which is okay insane lawyers asked for bail  Judge says now playboy  Saying that he had demonstrated a disregard for the rule of law and a propensity of violence  They're proposing the sentence anything day on October 3rd  He their judges receptive to moving that up because it  Diddy has been in jail since September 24 and he's gonna remain there until the sentencing  So that what was the date is the sentence?  That seems like going back to over third. Oh, okay  And he's getting time served. Yeah, I think so  He gets probation or something stupid. Yeah  It says that he could be because originally if they would have got him on the racketeering  He was looking up to life in prison, but now he's looking at a maximum of ten years for each of the two counts of  Transportation to engage in prostitution. So maximum 20. What's he getting?  Time served. I know he ain't getting shit  Combs lawyers say that under the federal sentencing guidelines  He would likely face about two years in prison. So yeah, he's already he'll have one year in in September  Do six more months three out in three for behavior. Yeah, that's what I think  I was like he's not he's not staying in there  They're like let's keep him behind for just one more news cycle  So something else crazy can happen so that when he gets out in three months people are distracted and  Whatever cuz like sex crimes. They don't give a fuck about they do not care  You mean the the  Prostitution across state lines charges that he's got that if you got found guilty on or what just sex crimes in general like molestation  and  rape and  Any of that it just is literally it's just a fucking I  Mean it seems like in the eyes of the law  It's a not a big deal  Yeah, and it seems like it's one of the things that people beat their chest the most about but yeah, the loudest  The least gets done about it. Yes exactly  So I imagine he'll be out by New Year's so first day out rap coming soon featuring Kanye West. I predict this featuring Kanye West  Only more on dumb enough to stay hits to the Diddy wagon  You think he's done though  You  I think he's I think he's gonna be kind of a black cloud like he's I think he's in no one's listening to him anyway to begin with  I don't think yeah, but whatever pool he did have is gone I would think so life of obscurity  You know yeah, hopefully I  Hope that man is never comfortable another day in his life  You know like you can be out because nobody gives a shit  I think the fact that he clapped speaks volumes. Yeah that he  Feels emboldened. Yep, so get ready for more of this to happen  Okay, yeah, but okay go ahead. So speaking of  done morons. Let's talk about me  You know I'm an idiot  go I saw a  I  Got a lot of negative feedback from a lot of people from the last episode. Yes  In hindsight I see why that happened when it first happened. I say what and  You just think I'm woke. I thought you were too woke  So kind of woke ass shit is this you got your people coming at me  How should we do this so  So okay, so what happens is you get several comments here there and everywhere I got a couple comments of  People saying that I was victim blaming mmm because on the last episode  We had concluded all of the testimony and we were talking about the strategies of the prosecution and the defense  Mm-hmm and I  In my head thought  Because people have to understand something here  When you're doing podcast you are performing in a way  Mm-hmm and we have to keep this entertaining and lively  right  And we free style free flow a lot of conversation and sometimes you make a misstep  What happened was I thought because what happened because with our show it's generally me  presenting conspiracy ideas  You pushing back against them right whether or not you believe in them or not sometimes you  Like if I talk about the moon landing being fake you actually agree with me  But for the sake of the show and entertainment and discussion and learning you'll say  Well, why do you believe that? Well, let's in you'll try to poke holes in the Congress a little bit of a debate sometimes  Yeah, well because it's not an interesting show if me and you sit here and agree with each other  All the whole time right what's interesting about that? That's what I used to love about Joe Rogan because he used to push back on a lot of people  I imagine still does she's out an interesting conversation  yeah  and I took on the role foolishly of  suggest and and  Look, I'm gonna run through what chat GPT said about this show. Oh, okay because I'm trying to do a couple things here one  I'm doing a little damage control. Okay, cuz I love women and  Somehow I think you truly love women. Yes, and somehow I'm I screwed up and it sounds like I presented a  message that  isn't what I believe in  But I thought what I was doing was saying hey  I'm more did he's gonna get a slap on the wrist here because I think the defense is gonna it has a pretty good argument of  And I'm talking about strictly from the world of the legal realm. Okay, which I thought I said all this  20 times and and it's like I can only  This is the problem with like woke left this culture stuff  Like I can only say it so many times before you guys are listening and rolling your eyes like okay, dude  We get it just say the fucking thing. Yeah, but  When people get like well, I don't even say people when I  When I get you say something that floods me with emotion. Yeah  I can't here I  Can't hear I can't hear your nuance of your words and what you're trying to say because my  voices of  Fuck you are so loud in my head that I can't calm them down enough to be present to hear your sight of the argument and  You have to understand that  The truth of this matter is  Is  Nobody gives a shit about this stuff it nobody gives a shit about it in the  Legal system  people that are defending the perpetrators don't give a shit about it like you know what I mean? So already people are  sensitive to it because  We've had decades of  Conversation with your point of view and and me being a male  It probably I  Don't know what feels like I'm just finally onto this. Yeah, yeah, it's reminiscent. Okay. All right, that's her  So I thought  Because because he wasn't up and I was speaking strictly from a legal standpoint. I'm saying strictly from a legal standpoint  If the defense like they're not they're not trying to prosecute him on domestic violence. Yeah  At all which is crazy because he's literally on tape doing it yeah  And they were trying to prosecute him on racketeering and having this big conspiracy of paying prostitutes and there was no  What was it let me go back to the court thing here?  So they're saying that they're trying to get them for sex trafficking of Cassie and Jane,  the anonymous person. And my thing I said was the defense is capitalizing on these statements  and text messages made by Cassie and Jane of saying stuff like, I love you, Diddy. I love  freak-offs. I can't wait for the next freak-off. Which if I don't put on my thinking cap,  I would say, well gosh, I don't know how she really feels about Diddy. She's saying this.  And now she's here in the courtroom telling me she was abused into saying these things.  And it's confusing for people who maybe don't have a ton of therapy and stuff.  It's confusing. Me and you have had tons of therapy. It's confusing for us.  Right. And I'm trying to represent the sort of,  I'm trying to represent for the people who still hold on to that sort of viewpoint  to sort of defend them and say, look, this isn't a simple thing. This isn't an easy understanding.  Because you do read the text and you say, well, I don't know. It seems like she was into it.  She's literally saying it. And it's, there's a lot of nuance there that I don't know that  they went through in the court or not because I didn't see that in the court transcripts and  breakdowns of what happened. I didn't see them call up. And maybe they did. And I just didn't see it.  You know, I asked for time today. Yeah, maybe they did. And I just didn't catch it of  pulling a therapist up to say, like, no, the reason Cassie said she loves this and she can't wait  for it and she's planning it and she's setting up the room for it and blah, blah, blah, blah.  Because she has been a victim of this MK ultra type mind control programming,  sure, right? Which is what I believe actually happens. I do believe that, right? And I don't,  I'm not smart enough to explain why that happens. But the thing that really zoomed it out,  someone said something about the one that got me really deep in the heart was like, someone compared  my ignorance of this to Twin Peaks. And I said, because that's a Twin Peaks. It's a story about  women being abused, right? Yeah. And I said, Oh, that hurts. And that was the one that I was like,  okay, I got to address this. Like, yeah, this is getting out of hand. What the hell happened?  Right. And then it kind of hit me because I was thinking about it. And I thought, okay, I kind of  get this. It's almost like the message I sent out was as if I was saying, if a woman,  a girlfriend wife is in a relationship and has domestic violence down to her. And she keeps going  back to him. It's almost like me victim blaming me. Like, well, then why did you keep going back?  But I mean, that is a thought. And that's the first reaction people will have is that is kind of  crazy. But the fact of the matter is, like, these people are traumatized and they don't, their brains  aren't thinking correctly, right? And it's not an easy answer. And it's not simple. And  and when the reality, it's like the male that's abusing her, like, that's the  the criminal here, quit dragging the woman into this, you know, right? And I was like, okay,  I get that. So I'm kind of like taking that angle there when I'm saying this stuff.  Well, because the conversation only goes there, right? We have to continue is why do you  met? And this is what I'm always saying is like, why are men like this? Right. Why does this turn you on? Why does  women who don't want these things? Why does that not matter? I don't want to fuck people or do  things that the other person is not into, but that does not slow men down. Why? Right. Yeah. I  know what I'm saying. But I think that that's an interesting conversation that never gets had  is we could sit here and look at the victim and be like, why the fuck did she go back? Why is she still  sending birthday cards and Christmas cards? Right. Right. Why are we doing all of that? And that's  those are valid. That's a valid argument. That's a valid. I thought it was a valid question to discuss.  It is. Because there's a for the handful, not handful for the however many people listening that  were like, bro, Isaac, what the fuck you doing, man? You're like, starting with the victim,  victim blaming and all this stuff. I guarantee there's one to two times as many people out there that  are like, yeah, I don't get that either. Why would she go back to him and so should. Right. So it's like,  I was trying to play that role of we need to talk about this because this is an  a straightforward thing and I need right. Right. We, you know, and that's the truth is that's the  truth. That isn't that shouldn't be off limits. Having those questions and having that conversation,  that nuanced conversation shouldn't be something that we should that has to be so taboo that  it can't be have a conversation around. And the conversation should be with what happens when you have  actual trauma, right? Right. Right. Right. We don't know that. We're not therapists. And I've never been  traumatized like that. So I don't know that. And the people that question he's probably are in the  same same position. They're like, I don't know anyone who's gone through this. I don't know how  people react to that. But if we continue that conversation, we can, we can, this it can't end there.  The next part of that conversation is what the fuck is wrong with men? And I get held,  you know, you get a couple of comments talking about how you are sexist and whatever. I get probably  three times the amount of conversation or of comments saying, Joe sees a man hater. Right.  When all I'm doing is saying, what the fuck is wrong with you guys? Wash your buttholes and your  penises and stop raping people. Women want to fuck you. You don't have to be disgusting.  It's it's bizarre. But I still even when I sit there and say how much I love men, I could say it  three times over and the conversation will always go back to why do you hate guys?  so much. Right, right, right. I'm like, what the fuck are you talking about? I listen to  horny books all day long. And every time I'm not reading lesbian horny books, I'm reading  fairies with 20 inch dicks and dragons and all of that shit. Male dragons. I'm reading  foreskin. And what's the one thing called there's I was reading, um, I was playing up our  barreons and they have and that one's real fun. Um, and they have a barb, they have a barb on their  12 inch weiner. No, it locks in and and they have a vibrator on their base. So it sounds fine. Wow.  Anywho, I'm I love men men to me. They're awe and spry hearing like the their hand eye coordination.  Really, I really, really love masculinity. I am nothing but a cheerleader. Nobody fucking hears it.  Yeah, that's fair. Nobody hears it because all I say is quick fucking raping people in wash.  Quit being weird. The fuck is wrong with you, but they can't hear anything past that. So it's just this weird thing.  I follow lady on TikTok. She interviews men and says, why are you like this? It's the funniest shit ever.  And they're like that. They're creepiest fuck. Yeah, it'll be some dude who's like in his 50s  out of shape. He's like, I only date young girls that are under 25. Oh boy. Why? What do you have in common  with that? And it's maybe it's not even true. Maybe they think that that's just the thing you're  supposed to say or maybe that yeah, maybe they think they're cool as if they could do that. Yeah.  And it's like you ain't picking up no 25 here. And there's something with men that you  get yourself worth by well, and maybe not just men. This might be a human thing, but it seems like  it's really men. You guys get yourself worth specifically out of the type of women you can pull.  Yeah, totally. I agree with that. And so, you know, is it men or just  do you see Charlie's their own 49 years old dating a 26 year old? Sounds great. I don't really  give a shit anymore. I listen, I can shit on. I can guarantee that girl doesn't have much in  common with him. Did no Charlie's their own the female actress? Yeah, I know. Oh, the beautiful blonde.  Yeah. Anyway, okay. So, I got it. I got a thing with me and my girlfriend were talking about men  since we're on that subject. Why? What is it that men can't have intimacy without attaching  sexuality to it? Why haven't we taught you that as women or other men?  Because I think of it, like, even in the military where you guys have your band of brothers, right?  And what do you guys all start doing? I don't know what. Ask grabbing,  okay. Brae be stuff. Like, it's all under jokes. But I think what it is, it's a way of having this  feeling intimate with these people, like having an intimate friendship,  yeah. You need to be tight with these men because you're your battle buddies, right?  And you guys are trauma bonded and all of this. And you guys cannot separate sexuality from that. And  you you you veil it in jokes. Like, it's your teasing each other. Right. But it's there. It happens in  football. It hit you know what I mean? We're uncomfortable with intimacy, is that what you're saying?  I think you know, I don't think you're uncomfortable with it. I think you have a direct line from  intimacy in whatever capacity of like friendships and stuff like that. And it cross wires into  sexuality that you have only have that one neural pathway. And so when friendships, this is why I  so I follow this one guy who's a therapist on TikTok. And he talks about how straight men will  have like to have sex with male bodies. But they consider themselves, I know, but they consider  themselves to be straight. Okay. Isn't that interesting? What the fuck? And I think what it is is that  men aren't allowed to like to women are allowed to sit there and we touch each other and we'll  eat like as children. We'll break each other's hair and we'll tickle each other's backs and we'll  do facials on each other and we'll do each other's fingernails and toenails. And like this is just part  of the way that we interact with each other. And it's not sexual. Right. Oh, okay. Yeah. Yeah. But you guys  don't ever have that. No, I'm uncomfortable. Even in your friendships, you know, that's why you're  like, I love you know, homo. Right. Yeah. I don't know what that is. I don't have any good answers  which is fine. No, let me know. Okay. I barely know how to be intimate period, you know.  I agree with that. And when you do feel intimacy, when you fill a close relationship, it fucking  is sparks feelings like sexual feelings because it's such a it's a it's a deep,  we grooved neuro pathway. You haven't expanded that feeling of closeness.  with, that's why people say men can't have female friendships,  like a deep, because they want to fuck them.  Huh. Okay.  And I think that there's truth in that, but I don't think that that,  I don't think that it's like, you can't ever.  Yeah, I don't think that's a universal thing.  No, but I do think that intimacy becomes, it's hard to have a close  friendship and not have.  Yeah, that's what feelings toward you.  like a close male friend.  I certainly would be keeping an eye on them.  That's for sure.  Right.  Yeah.  I think.  Yeah, I got nothing for you there.  I couldn't tell you.  It's sad.  It is sad.  I think you got a blame it on it's a mixture of blaming the parents and society,  probably I would guess.  I think it's sad that we don't allow men.  And I do think that this is also part of like why you guys.  You don't have great empathy.  You know, yeah, totally is I just feel sad for you that you have missed out on  such a rich way of having relationships.  I don't have nothing to base this on.  Sexualize everything.  I have nothing to base this theory on besides just be soaking in whatever  dumb shit the world tells me.  Yeah.  But I wonder about something to do with the caveman, right?  Where it's like, right?  Is that how it used to be?  It's like the women and the kids stayed in the cave and the caveman went out to go  forward for berries and maybe saw a line and had to kill it.  And it was like, you have to in some way disconnect from the feelings of fear and  love so that you can just go do what you got to do.  You know what I mean?  Because if you're if you're really in tune to like,  do you think that the cave women just stayed in the cave taking care of the  children?  I'm oversimplifying it, but yeah, I don't think so.  You I don't think our species would last.  Well, where did the tradition of the men joining the military versus women come  from?  I think this is well, are there battalions of women like in history?  Oh, I guess.  I think so.  I don't know.  There's well, like only the men have to put in for the draft, right?  Well, now, right?  I don't know.  Yeah, I don't know.  I just I'm freestyling here.  Don't let's not do that.  Don't burn them.  You've done enough.  I've done enough damage.  But this is something else I think that people should realize is once a crime has been  committed of rape or whatever, whatever abuse has happened.  Everything after that is now under scrutiny.  And this is where it gets so tough.  Proving a crime is different than being actually have done the crime.  Okay.  Do you see?  You know what I'm trying to say?  No.  Like he could have done the crimes.  We everybody thinks he did the crimes, right?  Yeah.  Pete, Pete did he?  Yeah.  Did he did those things?  Everybody thinks he did those things.  Right.  I don't think anybody doesn't think he did the  prove that in the court of law without reasonable doubt.  Yes.  All those text messages, I as I was saying and turned out to be true on a  percent is planning reasonable doubt because because to be fair, unless you  really proved to me that Cassie wasn't into this, I don't know.  I wasn't there.  Right.  And that sucks.  I hate that for her.  Yes.  I don't not believe her, but like you got to prove that she isn't calculating and  trying to fuck him over.  Like I just don't know this woman.  I don't know their relationship.  I think that she was being abused by him and he's a fucking dickhead.  Yeah.  But the court has to prove that without a reasonable doubt.  And I was saying...  And that's for everybody's safety.  Like honestly, that is for everybody's.  Because maybe a woman would try to fucking get money out of him.  I don't fucking know.  Right.  Like don't, don't, guess like being to be like, well, that would never  happen.  Like it fucking happens sometimes.  Right.  It does happen.  It has to have happened.  Yeah.  It does happen.  I don't know.  I'm not there.  It happens.  There's a lot of witnesses though that said.  Anyway.  But then again, that's the domestic violence,  which he wasn't on trial for.  Right.  I wish they would have just tried to get him for domestic violence.  How many years can he get for that?  I don't know.  They would have got him, right?  Probably not many to be honest.  That's why I was confused by the test.  I don't think that there's a whole lot of, like I said, that I don't think  that there's a whole lot of like repercussions for men for beeping the  fuck out of women or raping them.  There is just, that's why, I mean, not this isn't victim blaming.  We have to be realistic.  These, this is the way it is right now.  And until we change it, do not be the victim.  You know, so we have to, it's not, is it victim blaming, blaming to tell  little girls that these men are disgusting?  And we are working towards getting them to be held accountable in some way.  But until then, this is how we have to walk in this world to stay safe.  Right.  Cause if we had a daughter, I always go back to the Michael Jackson thing when,  because ever, and I've come around to it where I'm kind of like, maybe Michael  Jackson was innocent.  He was just a weird dude.  Like I kind of, I've kind of come around to that a little bit more.  Okay.  But a year ago, and plus, I thought he was guilty.  I was like, dude, this guy's weird as hell, man.  And my argument was if.  If you had a, I mean, in his case, if we had a son that was 12 and Michael Jackson, and it  wasn't Michael Jackson, it was just some weird dude down the road to had money and an amusement  park and he was like, Hey, come let your son sleep in my bed for the weekend.  I'm like, I'm calling the fucking police, dude.  Right.  You're going to prison and I'm whooping your ass.  And why is that?  It's because there's male predators out there that abuse children and for that matter,  women grown women.  Right.  Um, so like anyway, I don't really all track your, but to hear that, we have to just say, while  we still have these conversations about why men are doing this and why men feel comfortable  doing this and why other men are sitting here making excuses for these men.  We also have to protect people and be like, while we figure this out, let's not get  any more victims.  Right.  Well, that's what it's going with that is like, for the same reason a parent would never  let a 12 year old daughter go stay in some strange guy's house for the weekend.  Why?  Because like men are sketchy, dude.  Well, and like people parents don't even let their children have sleepovers anymore.  Oh, really?  Yeah.  It's like one of the highest rates of like having or you don't know if there's going  to be other children that are going to be there, like older children that they do  like, you don't have any control over this.  And it's generally the boys and men that you're worried about.  Well, it doesn't matter.  Sometimes it could be girls.  It doesn't matter.  If you don't want your child to go through trauma, we don't have to to gender any of this.  If you don't want your child to go through trauma, we should not.  We had to be more like careful of letting them go into sleepovers because that's where a  lot of trauma happens.  So now it's like, well, is that victim blaming?  Is it victim?  Are we victim blaming by making caps that go over cups for people to have drinks?  Like we don't have women have their drinks and campuses.  Is that victim blaming by putting a cap on it?  No, we can't we have to keep women safe.  Is it, would you say that it's victim blaming if we don't have the little strips that  you can put into your drinks to double check and make sure you're not getting roofied?  Like we have to do these things until we can figure out what the fuck is wrong with men.  And unfortunately, this isn't a very easy conversation.  Right.  Well, okay.  So I ran the whole episode I ran through a transcript for Chad GPT.  And this isn't a me being defensive and being like, oh, let me prove that I wasn't wrong.  This is I was like, okay, I got to understand because it wasn't just one person that said  I was victim blaming and being a fucking dickhead is multiple.  So I said, okay, clearly I fucked up somewhere here.  How, how did I fuck up?  Right.  And it goes through the transcript of, you know, this, that and the other.  I'm just going to talk about the relevant parts.  Says the whole, engaged in a deep philosophical and emotional debate about what constitutes  coercion and consent in abusive relationships, whether victims like Cassie or Jane had agency  or were manipulated.  If the victim bears any responsibility for participating in or enabling abusive behavior,  which I think that's like probably the thing that I must have put out there that is off  putting.  Yeah.  The blurred lines in relationships when power fame and dependency are involved.  And then, let's see here.  There's commentary on how abuse becomes normalized within fame and power circles.  The importance of sex education and trauma literacy to navigate such murky situations.  Then to talk about the legal strategy and conspiracy, the defense strategies presenting  text and gifts as evidence that the victims weren't quote unquote real victims.  I was like, oh, okay.  Did you say that?  Apparently, apparently I put that out there somehow.  Disgut.  No, it says it was the defensive strategy.  So I don't know if I said that or if I presented that or if I was just saying this is what  the defense said.  Let's see.  This is some of this doesn't really relate.  One of these discussions are triggering and divisive.  Speaker A, that's me, expresses conflicting thoughts and self reflection quote, I don't  want to blame victims, but I also dot dot dot.  Okay.  Okay.  All right, chat who sat here?  Oh, bitch, come on.  Let's see.  And to be fair, I didn't say this was me.  So the chat didn't like.  No, I just said, there's a trans people to people.  Speaker A and speaker B. Yeah.  So speaker A often plays devil's advocate or presents the legal defense side.  Okay, that's fair.  That's what I was trying to do.  Speaker B, that's you pushes back hard representing survivor centric views and calling out  misogynistic tendencies.  Then it says key themes, power versus consent, victim blaming versus accountability.  blah, blah, blah.  And then I said, okay, what does Speaker A think about the victim blaming versus accountability  aspects?  And it says speaker A wrestles openly with the tension between victim blaming and accountability  and their position evolved, sometimes contradictory throughout the conversation.  Here's a breakdown of their stance.  Speaker A repeatedly states they believe Diddy is a monster and the women were abused  and victims, yet they also raise.  questions like quote, you know this was going on. Why didn't you leave earlier? Quote, if  Cassie said she enjoyed the freak-offs, how do we interpret that? Speaker A. draws comparisons  to criminal accomplished laws, like first 48, if you're there during your crime, you might  be charged to blah, blah, blah, blah, then it drops a quote just to drive the point  out. I think they're victims for sure, but you should also look into things and be like,  am I doing this for the right reason? They emphasize that real abuse is messy and it's  hard to draw clean moral or legal lines. And I think that that's actually designed into  the abuse by the abusers to help them in case anything, because these are cunning people,  right? Like abusers look for people that they can get away with their bullshit.  Like they specifically look, that's like, have you ever heard women, you can't run with your  hair in a ponytail? Because it's, oh, you, what? Okay, this again, the victims shit, right? The  victim blaming that now women have to be like, don't run with your hair in a ponytail because  they can grab you by your ponytail and get control of you. Is that wild? Yeah. So you're not  as opposed to, and, and, and what is it called? Perpetrators look for the people that are  distracted. They look for the people that they can get away with, they're not looking for the strongest,  most cunning opponent. They're looking for the person that they can manipulate. Okay. So like  in this case, maybe Cassie and Jane showed signs of being able to be manipulated because Cassie  wasn't, she didn't have a record deal before, did he? Right. So he's like, okay, I've got some people  that want to get famous. Like there's your vulnerability. Right. Okay. Is it, and that's just baked  into the abuse system? It has to be. Now, here's a great breakdown from chat. The two long  didn't read breakdown. And this is where I'm going to sound defensive, but it's not me saying  it's chat because this is, this is how I genuinely feel about it and how I wish I would have  presented, which apparently I did not. Okay. So speaker A empathizes with victims, but is torn  between seeking moral clarity and legal accountability. They present victim blaming arguments  mostly to analyze and expose how others might think, but occasionally show real skepticism.  Ultimately, they struggle out loud, which becomes the heart of the episode's emotional and  intellectual tension. I said, to Speaker A blame, did he's female victims for the abuse they  received? Speaker A does not explicitly blame did he's female victims for the abuse they received,  but they do wrestle with the idea of shared accountability in a way that sometimes borders on  victim blaming, even if unintentionally, here's a clear breakdown. And this is the point I wanted to  get to. Okay. Um, it says what, what the Speaker A does not say. We don't need to go into that. It  sounds too defensive. What they do suggest and struggle with, they question why victims like Cassie  or Jane continued relationships with did he even after the abuse occurred, they bring up text messages  and statements from the victims to ask were they really being coerced or were they enjoying this  on some level? They propose the defense might argue these women were adults who knew what was going  on and kept coming back. And they struggle with the idea that if you're an adult and you stick  around in an abusive relationship, do you bear some responsibility? Speaker A openly says,  I don't want to be that asshole guy who blames women. I'm just presenting what a lot of men are  probably thinking. They acknowledge this is why women don't come forward because guys like me are  sitting here saying, well, why didn't you leave? They repeatedly, they repeatedly clarify, they are  trying to process the logic of the defense and not fully endorsing it, even though some of their  doubts seem genuine. It says, final takes. Speaker A does not blame the victims, but they do  challenge the clean narrative of total victimhood. They raised tough sometimes insensitive questions  about consent power and participation, but ultimately lean toward the idea these women were manipulated  coerced and caught in a system of abuse. They just don't always express it cleanly.  And I think that this is what I hear out of that is just because you can't prove it legally  doesn't mean that the abuse wasn't happening.  Yeah, that's fair. You know?  And I think my learning lesson, because I do hear the flavors of some of that stuff and what I was  thinking and saying out loud, is when I when I when I compare this to domestic violence and I  okay, if I try to compare those two situations together, like to me, that's a more like I would  I understand why the women go back to the men in domestic violence. But in this situation,  it's almost like I'm pretending it's something completely different when it's like it's kind of the  same thing almost. It is. I think it is the same thing. I think he I think if these women, they  they were saying they were doing these things because they wanted to be around him.  Yeah, sounds very much like kind of a domestic like yeah, you women love your men so lunge and it's  you know, anyway.  And I think that that's kind of what this modern feminism is kind of going around where they're  saying listen ladies, we can't love this heart to the detriment of ourselves.  We can love, but it has to we have to hold men accountable. And I think that that you men don't love  that narrative quite so much that we're holding you guys accountable. You need to be held accountable  and to show up in marriage and show up in relationship.  and show up in sexuality in not abusive ways.  Right.  In conclusion, I've got some points here  that chat was able to guide me through  that I want to share for the audience.  So we can all learn.  Okay.  It says, let's refine the perspective.  Before analyzing behavior, establish who held the power,  acknowledge the power imbalance first and always.  Did he was a global celebrity with immense wealth,  influencing control?  In any relationship, one party holds disproportionate power,  consent becomes murky,  and that imbalance should frame the conversation.  Number two, remember trauma distorts choice,  not intelligence.  Victims don't stay because they're dumb or into it.  They stay because abuse conditions the nervous system  to equate love with survival.  Isn't that wild?  I've never heard that before.  Yeah.  It's not that these women like what was happening,  they may have normalized it due to trauma bonding,  fear, financial dependence, or hope for change.  Just like addiction, staying can be a coping mechanism,  not a rational choice.  Let's see.  Question the system, not just the individual.  If your first question is, why did she stay?  A better one is, why was he allowed to keep doing it for so long?  Ask why there was no oversight, no accountability,  and why others enabled or ignored the abuse?  Which is true, because all those jerk-offs  that took us to stay home.  That's what I was saying the entire time.  Abuse doesn't happen in a fucking vacuum.  It didn't happen with the Catholic Church,  it didn't happen with any other religion.  There has to.  Yeah, you did so.  It didn't happen at the Playboy mansion by itself.  These abusers had help.  Why are we so willing to turn to a blind eye  and see things in the best,  just because we think it's the culture of whatever?  Why are we doing that?  Why are we, it's so strange to me.  I feel like people talk a lot about having a moral compass,  but I don't think a lot of us have it.  Yeah, and it takes me back to wrap up this whole thing.  It takes me back to the whole,  I think Diddy's a Fed, and this was all a big,  farce.  He got in trouble for going off script a little bit  by the Fed's and they're like, okay, Diddy,  let's get you back and check.  And we'll scare the shit out of him with this trial.  I think because of his drug abuse.  Yeah.  And the reality is, dude,  every major celebrity was at these parties bragging about it  for 30 years.  Yep.  And Jamie Fox was the cameraman in the 90s  and then he released his special.  He's having a car.  Diddy's the devil, I didn't know anything.  Kevin Har, National Kutcher, and Jay-Z,  and all these other assholes.  We didn't hear one peep about any of those parties.  What, none of them saw any of this happening?  That's interesting.  So I think this is just a way of placating the public.  The same way that the Epstein thing is all just like,  oh, here's your three ring binders.  Case closed, we're good.  Move on, something else.  That's the fucking truth.  Yeah.  Anyway.  Well, anyway.  So to put a bow on that, my apologies for,  you know, being insincere there on the  Invictum Blaming-esque, I would argue.  But honestly, that wasn't my intention.  I was trying to sort of present that point of view  because that was what the defense was using.  Yeah.  And on cue, that's what worked.  And now he's not gonna prison really.  And if fucking worked.  And it worked.  And I don't know.  Yeah.  I don't, anyway, I don't wanna make excuses for anything.  But next time when it comes to that,  I will do more homework.  Yeah.  Cause I surely do feel bad.  I don't want women out there.  It's not that I'm not shitting on them  or suggesting they deserve this on some level.  No.  So no, and I know you.  I live with you and I'm a fucking ball buster.  Like I would be.  I would be with somebody that didn't love  women.  Right.  I love women.  If you didn't love women, I would be not attracted to you.  I'm like, this isn't, I'm not with this fucking guy.  So that's my apology to our wrapped up.  Very good.  Speaking of apology to ours,  let's talk about Love Island for a second.  Okay.  Now, we're in the real love island.  Then we're gonna talk about the floods in Texas.  That one's gonna be red hot.  Okay.  Hot takes galore coming soon.  You thought you were offended last week.  Wait to hear this one.  So oh, and then oh, wait,  tier two shout outs.  Well, let's do love island.  No one do tier two.  Okay.  I got so many browsers open right now.  Okay. So we'll keep the sharks on  on everybody watches Love Island.  So I'll cap this conversation of what?  15 minutes.  Okay.  Does that sound good?  Yes, fine.  Do you have a lot to say about Love Island?  Uh-huh.  Is there anything particular about Love Island  you wanted to talk about?  This season has a ton of like holding people accountable  to their social media's presence  that they had before they were on the show.  Mm-hmm.  Mm-hmm.  Yeah. And if people don't know,  Love Island is a reality show where they put a bunch  of singles on a, they say an eye.  It's like a resort.  And really a resort.  Sort of make some house.  It's a house.  Yeah, it's like a mansion.  Yeah.  They make them sort of pair off,  find a significant other of sorts.  And then they periodically kick people off.  Sometimes America votes who they want to get kicked off.  And it's brutal.  It's like, cause then you're watching it.  You start to fall in love with the couples.  And you're like, oh, I love these two.  And then next thing, you know,  boom, one of them's getting kicked off the show.  And you're like, damn.  watching a, they're gonna dog get put down every week or something.  And, you know, it's really, it's, it's sleazy.  So we had the first one, there was, I don't even remember what her name was.  Yolissa.  Yolissa.  She was a Cuban.  Wasn't she Cuban?  I think so.  She was a Hispanic of someone or Puerto Rican or something like that in Miami.  Right?  Wasn't she in Miami?  I believe so.  Florida somewhere.  And she was caught on a, not caught.  She was on a podcast and she had said the N word multiple times.  Mm hmm.  Lots of times.  Which is very curious.  This is another like a contentious discussion is who's allowed to say the N word, right?  Right.  For sure.  The whites cannot.  Yeah.  The whites are out.  You're out of this conversation.  Immediately.  Immediately.  No.  It's an opinion.  But I listened to Takashi 6.9, right?  And he's Mexican dude.  He says the N word all the time.  A lot of people of color will use the N word.  And it's not my place to say whether that's appropriate or not.  But I've noticed it's a thing.  Yeah.  I've noticed younger white people who use the word now, which I think is exciting.  It's horrendous.  It's hard for me to wrap my head around that.  Yeah.  But she used it and they pulled her off immediately.  Yes, you want.  I think she was on one day and then she was gone.  And they didn't discuss it or nothing.  Just you know, I hated her bathing suit that she had on her opening.  It would have a starfish under one tit.  Oh, did it?  It was very not.  It was not cute.  And now she was gone.  Whatever.  We had on.  We have on a maga guy who loves like, I don't know.  I've tried it.  I like him.  I think he's funny and he's endearing and he seems like a good person.  But his maga stance is hard for me.  And I'm like, this isn't the place for you.  I'm sorry.  Go on Christian.  Go on your fucking.  Yeah, but most of our friends are maga folks.  So they're not on Love Island either.  I'm sorry.  If you want to be a maga person, like you that's your whole stance,  go on.  What is it?  Farmers only.  You know, I'm talking about the dating component of this.  You're going on a show that's obviously a very liberal show where these people are making  out with each other and exploring lots of connections.  And this is a very free love type of way.  This is not a traditional sense of any way, any kind of relationship should be zero.  I got where you're coming from.  Zero.  Fuck off.  You're not invited.  You don't get to come.  You don't get to have these traditional values and then come and dry hump on my Love Island.  Get the fuck step in.  You're not for you.  He is not welcomed.  I don't like it on there.  It's like you don't get to have these kind of fucking beliefs.  It's saying the show has a more sort of progressive angle because people are, they'll  be made it up with a partner and they'll be allowed to go make out with someone.  else.  Yes.  And it's very progressive in the sense.  You're encouraged to have lots of connections, talks.  I'm putting these all in air quotes.  All of, and then explore different relationships to see which relationship fits the best.  That is the point of it.  You're testing your relationship.  You match up with the one and then you get tested with others and then they bring in  other spicy hot bombshells to test your connections and all of that.  This is a very progressive show.  Gotcha.  And you know what I love about it?  Speaking of like men not having the ability to have intimacy without having sexual, like  sexual component to it.  These people don't have TV.  They don't have, there's no TV.  There's no cell phones.  They have cell phones, but like the cell phone is like in a circuit.  It's only them on their cell phone and production.  But sending a message is about what's coming up that night, what to get ready for.  You have a fucking challenge.  Get ready to have the widest mouth tongue out kiss you've ever seen for fucking 10 minutes.  Are they telling these people to kiss like that?  They might be huh.  Why does anybody kiss with their mouth spread as wide as you possibly can with your tongue  literally poked out of your tongue?  I have never seen anything like it.  Never seen anything like it.  Also by the way, I saw fucking somebody's asshole on the show.  He was surprised.  Is he alyssa?  No, it was.  Amaya's asshole.  I was like whoa.  But like here's the deal.  You don't get it like bend over in G strings all day long and think an asshole is not going  to poke out.  But if it was my asshole, that would be the end.  I would be off the fucking trail.  You don't get to see my fucking asshole on national television.  That would be the end of my life.  It's such a gorgeous place for these young people who don't know how to really talk  with each other.  They've never just sit around and chat.  Everybody's on phones.  Everybody's like if you're in a group, you saw everybody's saw their phone.  Yeah, life's busy.  It's busy.  You guys should go on the.  They're on vacation for however long they're.  No, but they're on it without a fucking cell phone.  They have nothing to stress.  So they're sitting there talking about their feelings, the entire fucking time.  Do I like this person or do, or am I just attracted to this person?  Are there chats interesting or are there bodies hot?  It's such a fun, juicy way of watching people navigate.  What is attraction actually?  I love it.  It is my fucking favorite.  But no, and then they had, what's the other guy that just got kicked off?  This guy was TJ.  TJ was like following Andrew Tate.  Also, again, not fucking invited TJ.  You don't get a big roast following Andrew Tate.  And then come on to here where there's a bunch of women.  That isn't fair.  And I think they specifically say that you can't talk about politics.  Because you can hear people asking questions without asking questions.  Yeah, because Sierra was asking Nick if he believed in evolution.  So it's a way to be like, I don't know.  Like do you believe?  And so to me, that's saying to like who are you?  Dog whistly.  It's a dog whistle.  But I think they can't specifically say like what the fuck are you?  Interesting.  It's very interesting.  But now here's the drama.  Sierra was on something talking about how she has.  Can you say the word?  I don't know if you can't say the word.  I'm not saying that.  I just did a whole 45 minute apology.  I ain't saying shit.  I got the article right here.  Let's see here.  I had to go to several articles to find this because nobody wants to say it.  Oh, yeah.  It says in January, so her name is Sierra or tag as she's Mexican and Puerto Rican.  Okay.  No, no, she doesn't have any Asian ethnicity.  Okay.  So similar to the who can say the N word.  Yeah.  It's like I thought maybe she I was like, well, maybe she's part Asian because she uses  the CHINKY word.  She said it twice.  In January 2015, so 10 years ago.  Let's see.  How old was she?  I have no idea.  She says she's 25 now.  So she was 15.  Oh, my God.  We're holding people accountable for what they said when they were 18.  So what are we talking about?  Says that she posted a picture of herself at the top of the mountain and used the slur  to describe how she squints when she smiles.  Then in February 2023 in a store, Instagram story documenting herself getting Botox saying  she loves using the injectable as a mini brow lift to open up her eyes and get that snatched  look.  So to go to a different article to get the full details, it says.  Otherwise her eyes look too fill in the blank.  Where is it?  The message read, I can also be a little CHINKY when I laugh smile.  So I love getting a mini brow lift to open up my eyes and get that snatched look.  This is not me encouraging, but more so sharing.  And it's crazy because I have a lot of questions here, right?  What strange is that this article claims.  In 2023 is a little bit more recent.  Yeah.  A Reddit user claimed I remember when she said this and I DM'd her, I DM'd her this  like not to say I told you so, but and then it had a screenshot of their alleged message  to Sierra at the time and it read, girl, that is a slurred delete this before someone exposes  you for in a few years when you're successful.  Which I don't know if this scre- who was Sierra Ortega in 2023?  Why were people uploading taking screenshots of her stories?  Why were people falling?  Maybe she had like a following.  Oh, maybe.  Instagram influencer.  Yeah, an influencer.  Yeah, maybe.  Either way, now the community on like the Reddit types, I guess.  Liberals.  You can say it.  The Liberals.  This is the problem with libs.  Like I mean, not that there's a problem with this particular, but they're very heavy on the  cancel someone into extinction because of them being inappropriate, which she was inappropriate.  No doubt.  But it's also like she's one of the favorites.  Like she's, she's great.  She seems like a good person.  She seems like a genuinely good person, her end Nick.  I could be wrong.  I don't know.  They're just assholes on TV.  Sure.  But I want to watch for an hour at night for five days of week.  So I'm like, don't, don't cancel her.  Come on.  So what do you think can Brown people say slurs?  Man, I'm not waiting on shit.  This is what's so interesting.  The correct answer is as a white man, I have no opinion.  I know I can't say it and that's where my opinion ends.  I mean, I don't, I can't be offended for someone else.  So I don't know.  Does it bother me?  Not really.  Yeah.  The only time that I get a little cringed out is if like a white person uses the N word,  like that to me, I'm like, ooh, you shouldn't do that.  But what if a white person says the C word?  You know, for some reason, that's less offensive to me.  I still think it's inappropriate.  I wouldn't say it.  And I certainly wouldn't advocate for it.  I don't know.  What about the, like, the W word?  What word is the W word?  Like a Mexican slur.  Oh.  I mean, they're all levels of offensiveness, right?  They're all offensive.  And then, but then it also is like, well, what's the context?  I don't know.  Is there a context that you could say that that?  It was sometimes like a stand-up comedian.  They're trying to be like offensive or funny.  And I don't know.  Like it's hard.  It's really difficult.  I don't think it's a black and white thing.  But then you could also be like, well,  you know, white people using the hard-ar word on stage  is a comedy like maybe we're trying to be funny.  And it's like, yeah, I get that.  I just am like, I would never do it,  but yeah, it's tough.  It's a tough one.  It's interesting for a while there.  I felt like white people were being held.  I guess this is a win for the whites.  When we were the whites, what is that?  What's the win for the whites?  That other brown people are being held accountable  for their language, like we have been.  Oh, I see.  Yeah, because if it's not OK for us to say it,  is it a why is it OK for other people to say it?  Yeah, because if Takashi 69 was on this show,  they'd be like, dude, this guy is saying the end  or whatever.  Yeah.  Can't amount of hair or whatever.  Right.  Which sucks because I like him as a rapper.  I don't know, but it's also a-  But then, in raps without saying that word.  Yeah, I know.  Eminem gets it.  He understands that the nuance of it.  It's so hard.  And here's a deal.  We're fucking old.  We said terrible shit growing up.  Yeah, totally.  We call each other the F word that you can't say anymore.  That this would be common parliance back in the 90s.  Yes.  And it wasn't ever people being homosexual.  Right.  I used to say things were-  But I get one word on a regular-  It would be that word that word people.  But I guess- But I guess that thing,  that whatever arbitrary thing is the G word.  We said it all the time.  I get why if you were, if you're gay,  that would be offensive because you're like,  well, but you're also not using it in a positive light.  Like calling your best friends that.  So I kind of get it.  Enough that I don't, I try not to use it, you know.  But you got to give grace to people that are older.  It's like, I don't know how old is she?  Tuck her in.  And then she probably should go down.  She's too young.  She should have known better her age.  You can't.  She can't blame grandpa for saying shitty racist shit.  Yeah.  My mom still says Oriental.  When she's describing people,  she and she has others.  Literally I cannot say it enough to her.  They call her up and ask her about this and see.  She's not calling people Oriental for the,  please for the love of God.  Please stop saying that word.  Why?  What's wrong with it?  She will not.  But she is 80.  So it's like, I don't know.  Now one last thing, Ariana Maddox has chimed in.  I guess it keeps growing this whole,  it's a growing outrage now, supposedly from the,  she lost like 200 and something.  200,000 followers.  She's not heard.  Which really sucks, man.  But anyway,  let's see.  What about blah, blah, blah, blah.  I'll tell you,  a liberal loves to eat their own.  We, yeah.  The Republicans never do this.  A conservative would never.  A conservative rally around each other.  Yes, exactly.  The more disgusting they are though.  Several conspiracy theorists,  we eat each other all day, every day.  Yeah.  In fact, I'm still getting shit from people  who didn't like my Ian Carroll stuff.  Really?  Oh, yeah, they hate it.  You're just a big old hater.  But yeah, I think I said that on the show.  I'm a big old hater.  Correct.  Oh, let's see.  Okay.  Someone was tagging  around a mannex, talk of shit, I guess.  And she pushed back writing.  They're like, why are you being so quiet about this?  And she wrote, not silent.  You don't know what you're talking about.  And it says the brief but pointed comment  was enough to get fans talking  and didn't go unnoticed  as pressure continues to mount on production  to address the situation.  My understanding is that they're having like production,  emergency meetings trying to figure out  what the fuck they're gonna do with it.  I think all this is happening  in Sierra has no clue what's happening.  It's gotta be right.  Cause you know what?  I don't think that they're telling her  and tell they figure out  how they're gonna move on it.  Do you imagine you just wake up thinking  everybody loves you and you're in this fun relationship  with Nick and you're doing your thing  and then they're gonna come wake you up in the middle  of the night like they did alyssa or Ulyssa  and you're just out of the fucking villa.  I think what they're gonna do is  and then I knew that being in the store.  Cause they have a America vote on an app.  I bet they're gonna vote.  We all okay, let's see.  Do you want her out or not?  It's up to you.  Oh, I think that's a smart way of doing it actually.  Absolutely.  Instead of addressing it at all,  just be like, okay, here's your chance.  If you guys hated this bad.  Get her off.  But they're saying it's like a double standard  because they kicked off you,  Lissa for using the N word,  the racial slur.  Yeah.  And now Sierra, they've got proof of her using  a different racial slur.  Yeah.  You know what's funny is I've had a lot  of very close Asian friends growing up.  I don't know if you know this.  No, I didn't.  Yeah, growing up back east,  we have, I don't know what their story was,  but they were Chinese guys.  Okay.  I was really close to them.  I don't know what.  There's something about their energy that made it up  with my energy.  Cause like they're very quiet and the one,  the Asian guys I hung out with,  they're very quiet and introspective,  super intelligent, very talented.  And we just got along great.  Cause I also very intelligent and talented.  Yeah.  But I just, I always,  even when Zach,  with a K came on the show,  I was like, I fucking like Zach.  I don't want to.  I mean, do.  Something about like Asian culture and energy.  They're like, I'm not like an anime fan or nothing like that.  Yeah.  There's something about Asian people that like,  I really,  I don't know what it is.  Like fetishize?  No, not at all.  Not at all.  Like Asian men.  I'll friend up with an Asian dude pretty easy.  Yeah.  I don't know what that is, but.  Yeah, some of my closest friends are Asian.  Huh.  I think they're from China.  I don't even remember.  I haven't talked to them since high school, so I don't know.  Anyway.  Like had an accent from like a Chinese accent.  like they were like, oh, they were.  They spoke English.  Yeah, but they definitely had an accent.  Oh, okay.  So I don't know if they were on some kind of, they lived here.  It wasn't like they were just here for a year.  They were here the whole time.  I don't know when they moved here.  I don't really know.  You're such a fucking man.  I know.  I'm just talking about video games.  I cannot.  I mean, how do you not ask the next fucking question?  It just wasn't in my like wheelhouse of things to ask.  I don't know.  It is bizarre.  Aren't you guys like that?  Why aren't you inquisitive?  We talk about things.  Not each other.  Alright.  Yeah.  And it's sad because the one guy, his name was Thong.  Like the underwear, like Thong.  Yeah.  And he changed his name after I go to Thong.  Thong.  Thong.  That sucks man trying to like  Probably you know my mom would learn Greek because she wanted to be American so much  Like with my grandfather would speak Greek to her he she would not answer him. Yeah, that sucks. I it sucks  Those are fun things. Yeah, it's not horrible. Yeah fucking horrible man. Anyways  All right, uh, that's all I got for love Island. You got anything else? No, and by the way we're recording this July 6th  It's now 6 p.m. Mountain Standard time so  Don't hold us anything against this or something changes. Okay. We're talking with these floods  All right, let's flood it you want you want the you want the controversy. This is about where the real controversial  Over first housekeeping tier two shoutouts for patreon you want to support the show you want to keep it alive  You want to hang out you want to hang out where the bangers bang in the patreon comment section?  That's a joke. I use I stole that from Sam Tripoli  I'm I gazing with Tina wire. Okay  You go add free unlock bonus content sometimes  Early access to works patreon.com slash breaking social norms if you go to your two you got a shout out once a month  We do our shoutouts  In fact, we let you vote if you still wanted these and you did overwhelmingly sell sell we're gonna give you what you deserve  In fact, I've got a  What do we how do I call it a super shoutout? I got a super shoutout for Josh?  Going above and beyond tier two. Thank you for your support Josh and then we've got a whole list of tier two folks  I feel like this list grows. It just seems like it's bigger and bigger every day  Josie's field in the comment section on the patreon by all means you got some things to say  I'm sure you do have to listen into my 45 minute apology tour and is using the CH  I and K Y word racist or not who can say it do it in the comment section of patreon  We're here in a safe place where we can openly lovingly discuss and debate  Okay lovely but  lovingly and sometimes not sometimes people get fired up and they fire off a message  Like I've seen I got a couple messages people that weren't very chill about anything and I talked to them about it  We were cool. We're chill now. Yeah, okay. My bad  Okay, let's say people forget we're humans. Yeah, like when you see me. I need you to see a dumber poor Joe Rogan  You wouldn't hold a dumber poor Joe Rogan to this standard  All right, you're not dumber than Joe Rogan. Don't we be fine for sure dumber than Joe Rogan. Why do you think he knows so much shit?  No, he's just because he's broey and he says things we don't like  Doesn't mean he's not one of the smartest human beings  Okay, we love Joe Rogan  Regardless regardless  We do not of his latest hallucinisci hallucinations  Amen, can fuck off. I'll snap out of it. I'll snap out of it. He'll come back to us. No  Good on the list. Go gap  Brian Brandon Teresa hunters back shadow hunter  Rock rock Richie del 82 Nada  Christopher can't  Denny and Cypress Andrew Lynn a  Vero Lara  Chris Giovanni  Glamke's and he's still holding it down there Tristan RSR is skinny fresh  Evan Damien Lorraine Shira  Zach  Hang on I gotta I told you so many I gotta move my browsers around  Jennifer Daniel Trisha Jamsie Cheryl for that scene in Taren. Thank you so much for your support  That's got bigger rank goodness. Yeah, it's really incredible very nice  So you want to join the join the list tier two nice get on it  But you can go sign up patreon.com slash bring social norms ad-free early access sometimes bonus content  Joe she's was still lamenting how she has to finish her book. I've finished it  I gotta I have to listen to it for the seventh time and and write notes. It's so hard to do that  It's so hard. I don't know if people appreciate it  Do not fucking get how hard that is I did a three-part book breakdown on my podcast as bonus content  I was like wait till they go out of this  They're gonna love it. Look, I'm flooding in. Nope.  So much work.  So much work.  But you know how the people of the love it love it.  So all right.  Ligs are in the show notes for that by the way.  Next and final discussion.  What happened in Texas? Well on July 6th.  Today at 2 p.m. I got the update on this.  In fact, let me refresh the news because it's a,  you know, it's a late breaking story.  So I'm gonna give you the most up to date numbers here.  Ooh, not good.  Okay.  All right. I'm gonna read you from Wikipedia from four hours ago.  I will update the death toll though.  So it's from July 4th to July 5th.  A large and catastrophic flash flood took place in and downstream from Texas Hill County.  No.  Texas Hill Country in the US state of Texas.  Who wrote this?  I thought.  Yeah, the US state of Texas.  We know where Texas is.  During the flood,  water levels along the Guadalupe River rose quickly and significantly  when five to 11 inches of rain fell in just a few hours.  As a result, at least 80 people died.  No.  With 37.  I heard it was like 24.  I know it just keeps going up.  Oh my God.  What a nightmare.  I mean, just for a minute, it's like the gravity of that's pretty awful.  That's horrendous.  And I think they're kids.  Like wasn't it a girl's camp?  Yeah.  It was a girl's like a Christian camp or something like that.  Yeah.  Oh, I just, you know, all condolences out, right?  Thoughts, prayers, all the works.  Flooding began on July 4th after large amounts of rain fell in central Texas.  Six flash flood emergencies, which included the cities of Curville  and Mason, where issued the same day Guadalupe River  surged and estimated 29 feet in the hunt area.  Or over 20 children were declared missing from a summer camp.  25 were killed on July 4th, but searching rescue operations.  A lot of that's outdated by now though.  It kind of keeps rising.  Kirk County judge Rob Kelly stated that no one knew this kind of flood was coming.  And noted that the county did not have any warning system in place for major flooding events.  Multiple witnesses to the flooding stated that no advanced warning of the floods was given out.  Many pointed to federal staffing and budget cuts to the national weather service and the NOAA,  which is what the National Oceanic, something, something, something.  It's the weather people, I think.  For negatively impacting the agency's ability to predict the flood as well as coordinating emergency warnings.  So in America, we take every tragedy and we have to have some political spins.  Yeah.  And unfortunately the conspiracy world is now part of this.  Oh my god, are you serious?  And the conspiracy world has now become another mainstream media source.  Okay.  Which nine times out of ten of lines with conservative media.  Yep.  So basically you've got Obama did Obama create this?  No, Bill Clinton.  Oh, no, are you serious?  Bill Clinton, the bogeyman, Bill Clinton.  The conspiracies you've got.  And this is all subjective to your point of view.  Liberals, I guess you would argue the liberal conspiracy would be a climate change mixed in with cuts to the government from  doge and Donald Trump reducing the size of government and cutting these national weather services and so on.  Yeah.  That's kind of that's it.  They were talking about this happening while the cuts were happening.  Oh, really?  Yes.  Then on the other side, you've got conservatives and conspiracy theorists sprinkled in there who say, no, there was actually extra staff working.  And by the way, that was harp that caused that flooding.  Oh, my god, I can't.  Okay.  Okay.  So do you want to start with the libs?  It's called libs.  Let's go live.  I'll take libs for 400.  But libs point to New York Times.  And I'm going to read you from the New York Times because I don't want to get involved with this.  Critical.  No, I'm sorry.  Crucial positions at the local offices of the national weather service were unfilled as severe rainfall inundated parts of central Texas.  I'm going to paraphrase.  Okay.  Because I'm not going to read this word for word will be your old day.  Propying some experts to question whether staffing shortages made it harder for the forecasting agency to coordinate with local emergency managers as the floodwaters rose.  Now quick red flag here.  Some experts.  Anytime you see that word experts, you got a critical thinking a little bit here.  I want to know who these experts are.  Yep.  And you're the news.  That's your job.  You tell me who the experts are.  Don't just say some experts dickheads like me online.  Yeah.  Who's the expert?  I went on Facebook and my fucking grandma said.  Yeah, exactly.  Well, I uncle worked at the national weather service and retired in 1982.  He knows.  Texas officials appeared to blame the weather service for issuing forecasts on Wednesday that underestimated how much rain was coming.  But former weather service officials said the forecast was good as could be expected given the enormous levels of rainfall and the unusual escalation.  Now I got more.  We're going to keep reading but I'm throwing in my two cents here.  Okay.  So I think it's official.  That's your, you know, law and order government crowd, right?  are apparently saying they want the government to have a role in their lives a little bit.  You know, from Texas, from Texas of all places.  And now they're like, well, the government, is it bad?  That's what I'm proposing here.  And now they're trying to blame the government for not being big enough.  My God.  The staffing shortage is suggested to separate problem.  The loss of experienced people who would typically have helped communicate with local authorities  in the hours after the warnings were issued.  The shortages are among the factors likely to be scrutinized.  Several questions have emerged by the preparedness of local communities, including  curse counties, apparent lack of a local flood warning system, the county where most  of the deaths occurred.  In an interview, Rob Kelly, the Kirk County judge and its most senior elected official, said  the county did not have a warning system because such systems are expensive and local residents  are resistant to new spending.  Mr. Kelly said, taxpayers won't pay for it.  Asked if people might reconsider and let a catastrophe, he said, I don't know.  And this is the crux of the argument, right?  This is the, you know, because to be fair, neither side is wrong in the sense that if you  want a service that protects lives, you're going to have to pay money for it.  Like that cost money.  So the question is, do you want money or do you want these systems that could keep you safe?  And I don't, you know, there's justifiable reasons for both.  Yeah, anyway, there's just, what are you talking about?  Because sometimes justifiable reason for not.  So because sometimes program, like do you remember how we were pouring an astronomical amount  of money into a missile defense shield?  I think it started with Ronald Reagan in the 80s with Star Wars that George W. Bush did the  same thing.  And the whole idea was we wanted these missiles that were so great that they could like,  could take down a nuclear missile that was headed for us.  Yeah.  And they were miserable failures and they cost a ton of money.  And it just wasn't possible.  We kept saying where we're going to do it.  And it was just a handout to these defense contractors.  Oh, okay.  I'm over simplifying this of course.  Okay.  I wasn't prepared to give a whole lecture on this.  Right.  But I mean, I'm just saying that government spending in general.  Right.  I'm just saying that.  I thought you meant in what I thought you were trying to say was in.  The crux of safety, like in the weather thing.  Yeah.  But you're not saying that specifically.  Yeah.  And I would want to know why money spent on government, whatever.  Well, for instance, if this flood warning system cost did Kirk County, let's say a billion  dollars.  I have no idea.  We have no clue.  Let's say it cost a billion dollars.  For the property taxes, instead of spending a thousand a year, now they got to spend 20,000  a year, they would say, well, I can't afford that.  I believe.  So I don't want it.  Okay.  I'd rather take the risk of maybe we get these floods and maybe people die.  And I don't know that that would be the wrong way of looking at it.  But it depends on how much it cost.  It depends on a lot of things.  Okay.  Because in all reality, it probably would cost a nickel per person to fund this flood system  and protect some damn people.  Yeah.  That's the priority reality.  The problem is, is that a nickel for them is too much.  Yes.  Because that's a very conservative thing.  Because the taxes are going up a fucking penny.  Yes.  Because the government is stupid and they can't do anything right.  Right.  But then you got all these guys crying like, where's the government?  Yeah, exactly.  This is what bugs me about conservatives is the idea that we all hate government.  It is a worse thing.  So therefore, elect me to go in here and work for government.  Yeah.  I don't understand what the fuck you're talking about.  If you hate it, why are the fuck are you there?  I want people that love it and that can see the benefits of it and that want to make it  the most efficient.  Yeah.  That, and that was the whole thing with doge.  I don't want to read it and then want to make it efficient because that hatred will blind  you.  Yes.  I agree.  Because I actually agree with the ideas of doge of like, dude, let's streamline some  of this government spending.  We're spending way too much.  I agree with that.  I agree.  But just like you said, this comes from people who loathe the government and think it's  public enemy number one and they literally have a reference.  And if they go in that filter, they have their acronym rate to retire all government employees  because they fucking hate everybody and they hate the government.  Right.  I don't want those people making these decisions.  No.  No.  They literally dickhead out of chainsaw on stage was like screaming about cutting off fucking  jobs and shins.  Like bro, maybe that's a little overzealous.  Yeah.  Exactly.  Like if it's so bad, Elon, get the fuck out then.  Yeah.  You're not an American.  Kick fucking rocks, bro.  And now he's going to start a third political party.  He says, we'll see how that goes.  Go wherever you want.  You have all the money.  Go where it's fucking great.  Leave us alone.  Leave.  Leave.  Please.  I think all these billionaires should kick the fuck out.  I know.  They're disgusting.  Okay.  Back to the New York Times.  The National Weather Service is San Angelo office.  Blah, blah, blah.  Was missing a senior hydrologist, staff forecaster and meteorologist in charge.  According to Tom Fehy, the legislative director for the National Weather Service employees  organization, the union that represents weather service workers.  The weather.  Another service is nearby San Antonio office, which covers other areas, also had significant  vacancies, including a warning coordination meteorologist and science officer.  And we're in a fucking hiring freeze.  Well, we're getting there.  Staff members in those positions are meant to work with local emergency managers to plan  for floods, including when and how to warn local residents and help them evacuate.  Literally the thing, right?  The office's warning coordination meteorologist left on April 30th after taking the  early retirement package the Trump administration used to reduce the number of federal  employees, according to a person with knowledge of his departure.  Some of the openings may predate the current Trump administration, but at both offices, the  vacancy rate is roughly double what it was when Trump returned to the White House in January,  according to Mr. Fehi, which to be critical here.  Tom Fehi is the director of the union, which the unions are very much trying to defend  workers and keep them from getting fired.  I'm not saying he's lying.  I'm just saying like if you want to look at biases, who's all involved here, like that  could be a bias.  We need to look at it, right?  To be fair.  Yes.  And that was kind of the narratives.  Then I went on Twitter and lives of TikTok, which I it's got to be Russian propaganda,  because it's like a nameless faceless fucking thing that has 10 bazillion followers.  They shared a screenshot from an Associated Press article.  And they were like, this is what the libs don't want you to know about the flood.  And long story short, I was able to find the article through the NBC Dallasportworth.com.  All right.  To sort of save a lot of explanation, the article is called National Weather Service  shares the timeline of alerts ahead of the catastrophic Texas flooding.  And it says that they shared a timeline of alerts after the New York Times report that I just  read to you guys question whether staffing shortages may have made it harder for forecasters  to coordinate responses.  The national, so they're saying that the national weather service themselves said that  on the morning of July 3rd, the national weather system in where?  What state are they?  The office in Austin, San Antonio.  Okay.  The Texas National Weather Service.  Okay.  They said that flash flood, they have a whole timeline here.  They say that the national weather center flood hazard outlook was issued Thursday, July  3rd for a flash flood potential to include curvil, Texas.  Then flood watch was issued by the Weather Service on Thursday in effect through Friday  morning.  Then the Weather Prediction Center issued three warnings basically on Thursday.  Then there was more sort of discussion about this, including the city of curvil where this  happened on the third.  Then a flash flood warning issued on Thursday for Bandera County.  Then one in the morning on Friday flash flood warnings with a considerable tag issued.  blah, blah, blah.  This goes on.  It goes through this whole thing.  It says, hey, we will warn him.  We were warning.  Yeah.  It says the national weather service said it was heartbroken by the tragic loss of life.  It remains committed to the mission blah, blah, blah.  U.S. Secretary of Homeland Security, Kristi Nome said Saturday it was difficult for forecasters  to predict just how much rain would fall.  He said the Trump administration will make it a priority to upgrade the National Weather Service  technology used to deliver warnings.  Which goes against everything they say they're doing to cut funding and stuff.  How are they going to do that when the fucking billionaires need their tax breaks?  We'll see.  Then it has the National Weather Service Meteorologist Jason Roneyon said that the National  Weather Service office for that area had extra staff on duty during the storms where  the office would typically have two forecasters on duty during clear weather.  They had up to five on staff.  Quote, there were extra people in here that night and that's typical in every weather  service office.  You staff up front event and bring people in on overtime and hold people over.  That's the part that is trending on the Twitter right wing sphere.  Because the left is saying, hey, you guys fired all the people.  That's why kids are dead.  Now the rights like, well, they had more than enough people.  So now what?  Okay.  Okay.  And then they talk about how there is no flood warning system.  We already talked about that.  So what's the truth?  About what?  Did they have enough staffing?  Were they giving out enough warnings?  Well, there's an investigation into if there was sufficient staffing or not.  Because you've got the union president, which to be fair, that's a bias.  Right?  Because the union is constantly fighting with cutting government positions and stuff.  But I mean, I don't know, you know, he's saying, no, they got rid of literally like the  guy who handles that thing.  He left April 30th.  And then you've got the National Weather Service who regardless of whether or not they  had enough people or got rid of the guy who was responsible as they're saying, we issued  all these warnings going back to Wednesday.  So it's still to be determined what if you could have prevented this, what it looks like  to prevent it.  Was there enough workers?  All that stuff.  Isn't it crazy?  This is okay.  This is hard for me.  If you ask two people, this is just the way it is in America now.  There are no such thing as facts anymore.  It's all politically biased everything, even down to the news organization of who, okay,  well who owns that news organization, that local news organization, because they're  pushing their fucking bias also.  Like everybody's allowed to just say just the parts that help support their arguments.  If fucking blows my mind, that we have let it dissolve into this.  What blows my mind as a conspiracy theorist is, anytime you have something like this happen,  every conspiracy guy on the planet is online, spouting their thing to support their bias.  And inevitably, they're so, they don't make any sense because they'll say, and I'm  guilty of this too.  So I'll lump it myself in there with it too, because sometimes I'd guilty of this also.  They'll defend their viewpoint by sharing a news article.  And then in the next breath, be like the lying fake mainstream media can't trust anything  they say, but in the next breath, I'm like, but except for this one, you can trust this one.  It says right here.  And you remember that video of all the news reading the same script?  Yes, exactly.  So who owns that local news, that local news place?  What was it?  ABC.  And DC.  And DC.  Because that you're, the news that you get locally at this point, now is going to have  a fucking political bias.  We've know this because of that viral video of what was it Rupert Murdoch who owned all  of those.  She's, I don't even remember.  Some billionaire owns all of our news and they sent out a mass thing where it was like,  you have to read this verbatim on the news.  And local KSL was a KSL or no K, K U TV.  Was on it.  Yeah.  Our boy over it.  And then in Utah, KSL is owned by the Mormon church.  So like anyone who lives here knows that there's a Mormon propaganda angle on that news.  Right or wrong.  I'm just saying it's like, it's like I always say with the news.  It's like, right or wrong.  Who's, you just, well, I mean, it's actually matter is we're here.  Every news has their bias.  You be a fucking idiot.  I mean, then you got what's the other option?  I'm just not going to pay attention.  Who is the fucking energy for this?  You can't just watch the news to stay up to date.  Now you have to watch the news, Google to find out who owns that fucking news organization  to see it and who they're attached to.  It's like buying food.  It's like buying food.  What are we doing here?  It's like buying food.  It's exhausting.  Yes.  You got to do so much work.  Anyway, the NBC Universal who owns that, which is ran by the president of Michael Kavanaugh,  who went to Yale, could have been scholar bones.  We don't know.  It's a private list.  We don't know if there's, I'm going to say he was gone bones because he worked for city  group, JP Morgan Chase, Comcast, co CEO and co president of the Carlisle group, which is  a huge, you know, a luminate confirmed Carlisle group.  They're, they're tied in with all the 911 conspiracies, military, industrial complex, private  equity, all the shit.  And now this guy is the one that owns the world.  This guy is now the president of the NBC Universal who owns that branch, right?  And also he's a member of the council foreign relations.  Let me come on.  This guy's for sure in the Illuminati.  Yeah.  So anything is on NBC, which probably includes low island.  Right?  Cause peacock.  I don't know.  That's NBC.  What?  Alominate confirmed.  All of them.  So anyway, the point being, we don't know.  It's exhausting.  And then you've got the conspiracies.  All right.  Let's hear what the conspiracies are.  Harped it.  Do you know what harp is?  I think the ones that made the clouds.  Yeah.  That's right.  One of the oldest conspiracy theories there, they pump energy into the ionosphere, open  Alaska.  We talked about this in 2023 with the Maccalfiers.  Well, here, when the hurricanes were hitting Florida, Biden sent it down for the  elections for the election so that they can it go and vote.  Yep.  So Biden rigged the storms so that he would lose the election.  I mean, come on, wake up.  Joe Biden who can't fucking walk without falling over is the mastermind puppet master of creating  storms.  Well, Jesse, Jesse the body venturo.  That was good.  He had a so called conspiracy theory.  That was actually pretty good.  I nailed on the first take.  That was good.  Remember that show?  Yeah, I loved it.  It was actually really good.  I was the governor, the Navy SEALs.  He had an episode about harp and a physicist was on their name Brooks Agnew who had a cloud  that he moved into chamber basically using these ideas that harp this antenna array  up in Alaska could move clouds and it can generate extremely low frequencies.  laughs. And David, I talked about this back in the day because our brains, the human thought  operates at extremely low frequencies. And now it's part of the Jesse Ventura show. Remember  he was saying something about it. I don't know. Putting a thought to his brain or something.  Do you remember this? No, I have, we saw this 15 years ago.  So I have no recollection of it. I mean, I'm right here. The voices in my head.  Anyway, so there's there's claims that it can do mind control. Move clouds, cause,  rain, cause storms. I mean, that doesn't necessarily, like I don't completely not believe  in that stuff. Because don't they have weapons that are energy weapons where they blossom.  Like they have videos of them blasting it into a protest where they're using these energy  weapons. Directed energy weapons. Right. And I saw something talking about how a country was using  these directed energy weapons at embassies. Uh huh. In Cuba, they got a bunch of Americans who  suffered from all these like brain injuries from them. Yeah. And then they did an  investigate the intelligence agencies. But like, no, that didn't happen.  Bullshit. Yeah. Why were the people working at the embassy? Why about that?  Yeah. All of them just suddenly had these crazy migraines and shit.  Right. Brain injuries for no fucking reason. They probably, what they probably did was like,  they were probably, yeah, the Chinese, the Cubans are doing this shit. And we're going to  fucking sneak in there and assassinate some motherfuckers. But we're going to, to avoid a global  conflict or it's going to be like, no, it's fine. Everything's cool. Yeah.  You know, yeah. But the, uh, the issue is the debunk is that the university of Alaska took  ownership of the harp in 2015. Hmm. Which who knows, maybe the, maybe the government is still  working it through there. And it's a smoke screen, you know, we don't know. Yeah, the government  can modify weather. We did it in Vietnam. Operation Popeye, we flooded the Ho Chi Minh trails.  We do it here in Utah. Yeah. Cloud seating. They do cloud seating in Utah on the mount range to make snow.  That's a for real. But real, these really, what am I that fucked today? I have snow machines.  That is the snow machines. No, it's not. They cause, they make clouds and then snows.  I thought it was like they were blowing snow on to something like they were making artificial snow,  not moving fucking clouds. Maybe they got both.  You're just saying words. I'm not. I'm telling you. It's, it's a truth. Really? I mean, look at  it. You're saying the snow machines that are used at the at the ski resorts are cloud seating  machines that it's actual snow. That's what I understood. I go with it. Yes, Utah does engage in  cloud seating to enhance snowfall and augment at snowpack. It utilizes both ground based and  aerial cloud seating methods, primarily during snowfall events when atmospheric conditions are  favorable. Utah's program is one of the most extensive in the nation with a goal of increasing  the state's water supply by boosting snowfall and key mountain ranges. Utah's cloud seating  program introduces substances like silver iodide into clouds, proving providing nuclei for ice  crystals to form. These ice crystals that grow into snowflakes, potentially increasing the amount  of snow that falls. I mean, they could just like let the fucking great salt lake fill up with water  again. That could if they wanted. I love how we're all freaking out about the fluoride in the water,  but they're putting silver iodide into our clouds. How do you how do you do that? Who knows? Okay.  Nerds. That's a good. But the, um, we have the conspiracy there. So they say harp can do all the  everything you can think of. Altar jet streams called storms, earthquakes, typhoons, hurricanes,  rain. So under that assumption, you'd say, oh, so Trump used harp to flood Texas.  Because that's what the conspiracy people are saying. Oh, they they're saying it's Trump. Nope.  Plot twist. It's Bill Clinton dummy. Trump would never. It's Bill Clinton. Of course it is.  It's like I need bodies. Yes. So Bill Clinton is using harp under the name of  university of Alaska to flood Texas for fucking once. I know. I don't know what the,  you know, the whole thing with the elections, like that made sense. That conspiracy,  you like, that would make sense. I would kind of get that like Biden wants.  That doesn't make sense to where he put it because they wrecked a liberal area of Florida.  But I would get it if there was a storm that wrecked a conservative part of Florida.  While Biden was president, that would make sense. I'd be like, oh, maybe that does make sense.  Because of course he's got a vested interest in making sure the conservatives are displaced  from the home during the election cycle. So that maybe he could steal Florida.  They didn't need that. He had Elon to steal fucking Florida. So that's all I got for harp and Texas. So  lots, lots, lots we'll find out here soon, right? We're not going to find anything out.  No, nobody cares. This will be out. They're going to blame Bill Clinton and then it's going to be off  the fucking news cycle. So I also have.  Nothing matters. We can just all die and nothing matters.  Unfortunately.  That's all I got for today.  That was a good one.  Okay.  Anything Tina, you got anything you want to bring up?  No.  We've been eye gazing and listening to  Daddy, talk, and found out.  A lot of things.  Listen to me apologize for being me.  Okay, sounds good.  Okay, all right, everybody.  You know where to go, you know what to do.  Like, turn the show on the page.  Go ahead and check out the website.  Go ahead and check out the website.  Okay.  Till next time.  We love you."