Speaker A: NETCredit is here to say yes to a personal loan or line of credit when other lenders say no, apply in minutes and get a decision as soon.

Speaker B: As the same day.

Speaker A: If approved, applications are typically funded the next business day or sooner. Loans offered by NetCredit or lending partner banks and serviced by NetCredit application subject to review and approval. Learn more at netcredit.com partner netcredit credit.

Speaker B: To the people McCrispy strips are now at McDonald's I hope you're ready for the most dippable chicken in McDonald's history. Dip it in all the sauces. Dip it in that hot sauce in your bag. Dip it in your McFlurry. Your dip is your business. McCrispy strips at McDonald's.

Speaker A: 1, 2, 3.

Speaker B: It's a hard Next Life.

Speaker A: It is a hard Knicks life A hard Nick's life oh, it's a hard Nick's life what up Knicks fans and welcome to It Is a Hard Knicks Life. I am Barry Dworkin, joined as always by the one and only Blanderson Hooper, to whom I say good day, sir.

Speaker C: Good day to you as well, Barry.

Speaker A: Knicks up 582 to 576. That is the current points total this series with the Knicks outscoring Indiana through the first five games by six points. And it is game six that is the only thing standing in front of New York and a game seven on Monday night. Just one win in one game. I want to talk about the Knicks defense. I want to talk about Jalen Brunson. I want to talk about Karl Anthony Towns. I want to talk about Mitchell Robinson, Fuck it. I want to talk about Ariel Hokporty. The Knicks defense to start game five and carried through most of that game was the best we have seen in the series. You know, Indiana Pacers, we know how they like to play. We know that they love to pass the ball around, that they like to confuse the defense. And by like the sixth pass they'll find somebody wide open or somebody will backdoor cut and get an easy layup and make the Knicks Look Foolish. Game 5 the Knicks got to every crevice, communicated very well on their switches, did not give Indiana a smidge of space to get those easy shots that they're accustomed to getting. Many times they got deep into the shot clock after just passing the ball around to no avail. And the Knicks defended with purpose and precision. And on the other end, Jalen Brunson out of the gate like a thoroughbred that was just given a bucket of meth. He made sure, the Knicks got out in front quick, and that combination of the early lead with the tenacious D caused Indiana to get tight. Tighter than Blandy's underpants at a Victoria's Secret fashion show. And Karl Anthony Towns.

Speaker C: This is going to some weird places.

Speaker A: Karl Anthony Towns. Indiana has nobody that can stop him. And when you're setting up a game plan, put yourself in Rick Carlisle's shoes. You know that Towns can take any of your guys to the basket at any time that he wants to. And then you look over there and. And, oh, wait, there's Jalen Brunson. And he can have his way. And we're going to have to throw two guys at him, having those two guys. And I know it's been a struggle defensively up until game five with them, but those two guys put you at such a disadvantage on the other side. Now, obviously not enough of a disadvantage because The Pacers are up 32 in the series, but it's two heavy hitters that the Knicks have that the Pacers really don't have an answer for. Which brings me to Mitchell Robinson. Mitchell Robinson. His minutes this postseason has been a revelation. And his defense is not just this thing that's like, oh, that's cute. You know, he's really trying out there. He's having a good defensive stop here and there. It's all the time. Now. He is a real defender that can even stay with the guards. He's making smart, heady defensive plays. There are some times when you think he's being too aggressive and he's going to get a foul call, but he seems to have found the perfect balance, and I've just been blown away by his play. Now, Blandy, I'm going to let you talk.

Speaker C: Oh, thank you.

Speaker A: I'm not going to ramble on and on and on like I have been. I'm just, you know, it was such a great game to watch. I know before the game, you said that you hoped it would be an easy win, and by easy, you know, you figured 5 to 10 points would be, like, easy compared to how it's been. But, like, even through game five, you know, I didn't feel comfortable anytime they flirted with 10 or 11 points because we've been down that road with this team. So the fact that they were able to keep it, you know, a couple of times it happened. Right. We've texted back and forth. The offense was looking stagnant and they were getting a little bit closer, but. But then they pulled ahead again. So for the most part, they were up those 15, 16 points most of the game. So I believe you must have been happy and, you know, as stressless as one can be in a Knicks Eastern Conference finals.

Speaker C: Yes, I was hoping for a relatively stress free game. We got that for the most part. It did get a little tight there at times. I mean, we got all the way up to 20. I think there was a point where they got it back down to like 10 or 11 and one of them, somebody on the pacers, launched a 3 and I was like, this is going in and it's going to be down to seven or eight and. And here we go again. And it missed out or rimmed out or missed, missed. They missed a shot. And yeah, I, I was relatively stress free during this game, which I don't know if I could really say that about any other game in these playoffs except for maybe game six against Boston.

Speaker A: Right.

Speaker C: I mean, we've discussed this. Like, nothing ever comes easy. Nothing has come easy this postseason. I mean, they've played 17 games. And think about how many of these games have been really, really tight until the very end. Pretty much all of them. Do they have more? Are these the only two. Are those the only two double digit wins they had? Game 6 against Boston and this one.

Speaker A: Yeah, well, that. This was their second biggest three.

Speaker C: So it's just this season. So the only double digit WINS Are this one and game six against Boston. Everything else has been under 10 points. I mean, we know that the point differential against Detroit was like nothing, right?

Speaker A: Yep, Yep. Yeah. Super close games. And then even, even, you know, this series, everything had been close up until this point. It didn't really swing, you know, in Indiana's favor either, you know, as regard to a big point differential.

Speaker C: Yeah, so I was just, I was very happy with the way the game went. I still thought, I still thought the ref sucked. I know every time I say that you, you would text back and be like, oh, they're calling it pretty even. I don't. To me, it seems like they're mauling Jalen Brunson constantly. Like, they're so physical and we don't seem to be getting away with the same kind of stuff.

Speaker A: Game five was certainly the most we've seen them let go, you know, throughout the game. They start blowing the whistle a little bit more towards the end. But yeah, for the, for the majority of that game, they, it was like their whistles didn't work. You know, whether it was Towns getting hacked or Brunson getting mauled, you know, or even the, you know, Pacers, like I said, they missed a few calls that way too. But again, I was okay with it because I didn't feel like it was obscene.

Speaker C: 1. I, I feel like it's been very, very one sided. Which is weird because you know, most people, you know, the idea of, you know, the conspiracy theory people are, are saying, you know, that the league wants the Knicks to win because the, the league certainly when it ratings wise, Indiana OKC is not going to do anything. But I thought we finally, we finally got some calls to go our, our way. It's not enough though still ultimately. But yeah, they listen, they, they played a good game. Landry Shammit was a revelation. Okay? You had Landry Shamit chance at, at Madison Square Garden. Landry Shammit chance, which was just crazy.

Speaker A: Yeah, well you saw that like when he made a defensive play, there was.

Speaker C: That one defensive, he ran up to.

Speaker A: The baseline, he was like yelling to the crowd. We haven't seen him like that, like saying, come on, come on. Getting all riled up. That was a Landry we had not seen.

Speaker C: No. Yeah, he's still ugly as sin, but still like, you know, listen, he knocked down a couple shots.

Speaker A: He's so ugly. He should be a Pacer, really.

Speaker C: He's, he's an ugly man. He's got a huge, forget about a forehead, forget about a five head. He's got about a ten head. But listen, he came through. Delon Wright played good minutes. I don't think I ever need to see Delon Wright shoot the ball ever again. But you know, defensively he knocked one down still. I don't think he needs to shoot the ball.

Speaker A: But look, the guy is a street named after him.

Speaker C: All right, so does, so let him shoot the ball.

Speaker A: And everybody, yeah, everybody's got a street name.

Speaker C: Listen, it was the, I think it was the best game start to finish that they've played other than game six against the Celtics.

Speaker A: No question, no question. And look how much of it was the Knicks defense. How much was it that, you know, every player not named Benedict Matheran, you know, couldn't shoot the ball and didn't have a good game in their own right. But again, I believe that it was the tightness that, you know, the Knicks pulling ahead early created. They got up to that big lead. I think that was huge. And again, just the defensive cohesion that they played with and you know, I believe they can bring that with them.

Speaker C: I do think that there's something to the idea of the Pacers knowing that they had some cushion.

Speaker A: Sure.

Speaker C: That, I mean that's like, you know, like, it's typical, the idea that, hey, I mean, listen, you, you, you would hope as like if you're Rick Carlisle that your guys would be like, you know, yes, we, we are up 3:1, and if we lose one, it's not the end of the world. But we should close them out as soon as possible, considering when you consider that OKC is already sitting at home just, just waiting. But you know, that that had to have crept somewhat into their mind. It's only, it's only human. It's only natural.

Speaker A: Yeah. And it's, it's a typical ebb and flow to most seven game series. You see it, you know, you see it all the time and you know it. I would have had a hard time believing that the Indiana Pacers could win four out of five games against the Knicks. And it really would have sent me into a negative, dark place in June, July, August and September. Thinking back that I thought we had a really good squad put together. I thought this team could go the distance and they're going to lose four out of five to the Pacers. So we got to a game six job is not done. It's still not enough.

Speaker C: One game at a time.

Speaker A: And. But look, can they carry this momentum? Look, these are every game this series. It's, you know, 48 hours later is.

Speaker C: Another game, if you want to look at it this way.

Speaker A: And so maybe this is a series, you can take some momentum with you, and hopefully the Knicks do that.

Speaker C: Well, speaking of momentum, I mean, if you look at it, they've now won two of the last three, right? They lost the first two, but they've now taken two of the last three, right.

Speaker A: And Devil's advocate would say, now how likely is it you're going to win, you know, two more in a row? But again, they don't have to worry about that right now.

Speaker C: Now they just have to worry about winning one game. That's it.

Speaker A: And a game seven, everything's out the way, right?

Speaker C: A game seven, you know, you never, you have no idea what's going to happen. You just had it. You just got to get to game seven. They've already won in Indiana. They're five and two on the road in the playoffs, you know, anyway. So it's not out completely out of the realm of possibility. You just got to hope that they come out with the same intensity that they did last night because, you know, you don't want to fall behind early in that place with those people screaming, right?

Speaker A: And I do believe they can come out with that same intensity. What I don't believe will happen is that it's going to be just like it was in Game five, because I don't expect Tyrese Halliburton to come out with the same performance in Game six that he did Game four. He has not been that player this postseason.

Speaker C: He. He took seven shots.

Speaker A: Yep.

Speaker C: I think Obi Toppin took more shots than he did.

Speaker A: Right. But. But not only that. I mean, he didn't rebound.

Speaker C: He didn't do anything.

Speaker A: He was coming off a crazy. He didn't do anything. He's coming off a triple double. Very, very atypical for Tyrese Halliburton, especially in this postseason. So we don't expect that from him. I don't know what to expect from Aaron Neesmith. I mean, the guy. I don't know what he finished with. 14 minutes, 15 minutes that he played.

Speaker C: 16, something like that.

Speaker A: So I don't know what's up there.

Speaker C: Clearly, he's not okay.

Speaker A: I suppose not. But, I mean, he looked like he was moving okay.

Speaker C: The shot was not there, though. You know, and if. And if. See, that's the thing. Like, if that ankle is bothering him, it doesn't just hurt them on the offensive end. It really hurts them on the defensive end, because as you saw last night, like, Ben Shepard, he. He cannot guard Jalen Brunson. He cannot. Like, when he was on Brunson, Brunson just took him every time. Halliburton, nobody really can.

Speaker A: I mean, can Aaron Neesmith really guard Jalen Brunson? Aaron east, he's done fine. Yes, but he wasn't, like.

Speaker C: He's been very vertical with him.

Speaker A: He didn't shut him down. I mean, look at the points Brunson is scoring this series, and he's had.

Speaker C: The majority of the time, nemhard. No, Halliburton, I mean, they try to get the switch where they get Halliburton on him all the time, because Brunson destroys him, and Ben Shepard could not. He can't keep up at all. So if Neesmith is limited, that helps us on the offensive end and the defensive end.

Speaker A: Yep. You know, everybody talks about, you know, the fact that they play 10, 11 guys. Indiana, you know, they played 10 guys in just the first quarter alone in game five, and everybody points to that. As you know, that's such an advantage for them. They keep their guys fresh. They can, you know, keep the tempo up for 48 minutes. But what about the disadvantage where. Because it's not even like the same formula Every game we see Rick Carlisle just switching up so many things, introducing new players.

Speaker C: Who's the guy who played last night?

Speaker A: Jerris Walker? Yeah, that's who was another one.

Speaker C: Yeah, Tony. Thomas Bryant played the first couple of games, wasn't effective. So then they went to Tony Bradley. Then Tony Bradley got hurt, so they went back to Thomas Bryant.

Speaker A: I mean, forget about. If you're a player that's not knowing when your number is going to be called, but if you're just Rick Carlisle knowing whose number to call and when, that's a much tougher spot to be in. When you have so many options at your disposal. Could be a disadvantage, I think. You know, at least Thibodeau knows at this point who he's rolling with. You know, obviously it's different this series than it was last series. No campaign. And now we got Delon Wright and Landry Shamut, which has been helpful, and it's been able to, you know, frankly, hold the Knicks defense together, get, you know, good rest for Brunson, for Towns and these guys. So, I mean, maybe that's part of it, too. The Knicks, you know, have latched onto something. I know Delon Wright and Landry Shammit. And again, like you said, you know, 15,000 people chanting his name, but, I.

Speaker C: Mean, who would have thought that, right?

Speaker A: And again, you would have thought he was five for six from three. He had, you know, one, technically one three, but, you know, his foot was on the line for another. So you could, you know, you could say geographically, he was like two for three from three. But, you know, just the intensity and the fact that he's. He's playing hard on defense, and that's what the Knicks need.

Speaker C: They got 14 minutes from him. They got 10 minutes from Dalon Wright. I mean, Delon Wright, 14 minutes could be a couple of weeks for Landry Shamet in the regular season, you know what I mean? And so he played 10 guys last night. 10?

Speaker A: Yeah.

Speaker C: I mean, so, you know, all these people are like, who? All season long, Tibbs can't. He can't change on the fly. He's too set in his ways. I think he's showing you right now that he realized that what he was trying to do was not working, that it wasn't going to work. And these guys have been playing good. I mean, they're. They're. You know, Brunson has. Brunson has been getting sustained rests on the bench, you know what I mean? Like, not just a couple of minutes here and there. It's been like a Decent amount of time for him to really get a good blow before he's got to come back. And like what, what more can you say now when you put those guys out there? I think at one point it was like Towns with like Wright and Shamet and who else was it? It's like Mitch, Mitch, induce. Yeah, it's like there's like, there's like barely any offense there other than Carl.

Speaker A: But, but that's all you need. I mean, you know, Brunson had, you know, we said the monster first quarter. He had 14 points, Towns had 12 points in the second quarter. So to have this two headed monster that you could go back and forth with and you have a guy like that on the floor, it's, you know, that's what we envisioned, that's what we thought would be the case. Now, you know, we're praising Brunson and Towns and Robinson and Shamet and even Delon Wright to a certain extent. What's going on with Josh Hart and why do we not feel like he's putting together a complete Josh Hart game like he would always do, especially come crunch time?

Speaker C: It's weird because he had 12, 10 and four in the game, but he was a minus one for the game. He had a much better game five than he did game four because game four was atrocious. Game four, he was one of the main reasons why they, they lost. I think he had, of his 12 and 10 though, his points in his boards. I think he had five and four in the fourth quarter. So maybe it didn't necessarily look so great, but he definitely had a better game in Game 5 than he did in Game 4. And he was tied with Cat for the leading score in the fourth quarter yesterday. So maybe to the, to the naked eye it didn't look so great.

Speaker A: Yeah, well, we're not talking about the turnovers. You know, there's the issue there. He had five turnovers in game four and then another three.

Speaker C: At times he's just trying to do too much, it looks like, you know.

Speaker A: Yeah, but way too much.

Speaker C: I mean, listen, he is the heart of the team. I'm not, I'm not worried. You know, he's won us way more games than he's lost us. And so, you know, it's, it's certainly frustrating the way he played in game four, but I mean, ultimately, you know, in a big spot. I trust him.

Speaker A: Same, same. I still do. I just, you know, I, I want to see like, you know, I want to see a flawless game from him, which it's not easy to put together, you know, and, and again with. Yeah, like, like you said, with this hard that he plays, he's gonna come along, you know, with some stuff that's not perfect. I get it, I get it. But I think it had to be addressed OG on and Obi, you know, he continues to be solid on defense for the most part, but. And I don't know if this is just because, you know, Brunson and Towns get so much usage on that side of the floor, but like, where's the OG that was scoring 30 points a game? I know Brunson was out through a big part of that stretch during the season. He was doing it, but we know the capability is there. But he never has seemed throughout this entire series. He's knocked down a couple of big threes here and there, but I feel like for the entirety of this series, not at one point did he get into a flow, did he get into.

Speaker C: A rhythm like where his shooting hasn't been good.

Speaker A: His shooting has not been good. And we saw throughout the regular season, a lot of times, oh, he's hot. They go into him and you know, you'll see like four out of six possessions go to OG and he converts. We have not seen that once this series and that worries me. I mean, listen, we don't know. We also don't know. Say that again.

Speaker C: He scored 16 points in each of the first three games. I mean, so it's not like, it's not like he's disappeared, you know what I mean?

Speaker A: Right, right.

Speaker C: You're right. It's certainly not what he was doing at the end of the season.

Speaker A: What was I going to say? I was just going to say something.

Speaker C: You don't know what?

Speaker A: Oh, I know what I was going to say. You said we don't know because we're talking about OG So it made me think of injuries. We don't know what injuries and to what extent the Knicks are playing with right now. Right. It was only after the Boston series ended that we found out about Jalen Brown, what he's playing through. This is an injury laden roster between, you know, Mitchell Robinson, OG Anunoby, and thank God they've been out there, you know, have not missed the game. But what are they playing with? You know, we don't know.

Speaker C: We won't know until the season is over if there's anything.

Speaker A: Right. And maybe that's playing into it, you know, Josh Hart, you know, for all we know, has three fucking injuries, you know, that he's playing through.

Speaker C: I mean, you know, his knee is not. Not good. Right. He's been playing through that.

Speaker A: Hart.

Speaker C: Yeah.

Speaker A: Yep. All season long.

Speaker C: Yeah.

Speaker A: How about. How about Stan Van Gundy? Did you catch Stan Van Gundy multiple times throughout game five? Making comments about how Carl Anthony Town's knee looks perfectly fine when he's on offense, but then he, like, limps when he's on defense.

Speaker C: I have not been happy with Stan Van Gundy.

Speaker A: I know you have.

Speaker C: At all. I mean, I haven't been happy with the coverage at all. I mean, I've made that very clear. But, like, I don't know what his deal is.

Speaker A: They are three very different personalities. Kevin Harland, svg, and Reggie Miller, that's for sure. I. I haven't hated it, which is kind of crazy, but I. I'm weird. I feel like I have. I. I feel like I have. I don't have the same view as a lot of the fan base has when it comes to stuff like that.

Speaker C: For whatever reason, I didn't think Reggie was that bad last game or last night. I actually thought he was pretty mesh.

Speaker A: First, his personality comes through. You know, love it or hate it, that's his personality, and it shines through. He doesn't. You know, he doesn't. He tells it like he sees it. And I do think he's fair. You know, I know Knicks fans hate it that he's calling it, but you can't say that he's not.

Speaker C: Well, you know, that I hate. There have been plenty of moments where I thought. Where, you know, he hasn't been, But. But I. I thought last game, like, I think he. He was. He's willing at times to, you know, called stupid fouls that they. That the refs call stupid fouls. And if the Pacers do something stupid, he's willing to call it stupid.

Speaker A: And, yeah, he's been.

Speaker C: I don't know if I. It was just. I felt better about the game last night, and so that's why I have a rosier picture of it. And so when it's close, intense, and we're losing, I don't have as much patience for him. I mean, it could easily be that, but I felt like I didn't really have any issues with any of the stuff he said in game five.

Speaker A: Right. Well, maybe that's because it was positive.

Speaker C: Well, that's like I said. Yeah.

Speaker A: And that's the entire fan base. I mean, Knicks fans hate Frank Isola because for the 15 to 20 years, however long he was covering the Knicks. And this is, you know, this, this isn't anything new. They hate him because he was always writing trash about the New York Knicks and he's always claimed to this day he was writing negative stuff about the Knicks because they were horrible. He was only writing what was going on. They stunk and that's what he had to write about. They stunk. And Knicks fans took it personal.

Speaker C: He's the beat writer, he's not the cheerleader. Like that's not what he's there to do.

Speaker A: Exactly. And we saw the same thing with James Edwards iii. He puts out a video for the Athletic Athletic posted on their timeline about how the Knicks are not going to win this series.

Speaker C: Right. The three reasons why. Here are the three reasons why, the.

Speaker A: Three reasons why it hasn't been done, you know, just the way the pace have been playing this series, yada, yada yada. And man, you start looking at some of the comments in there and yeah, it's the same type of shit. People don't like when their team gets criticized, even if they're playing poorly and they deserve it, you know. So yeah, I'm curious if that was what was going on with you and Reggie Miller. And that's why in game.

Speaker C: I mean it's definitely. You don't, I don't like saying with and when things are not going our way, you're. You're going to hear it the way you want to hear it. You know what I mean? You're, you're not. But last night I was watching that game through rose colored glasses so I came away from it with not a negative view of how he was calling the game.

Speaker A: Yeah. All right, we are going to take a quick break and then when we get back we will have your voicemails. We will have around the NBA with Blanderson, Hooper and. And then it's off to game six, man. That's it. So let's get to this. Commercial break. Netcredit is here to say yes because you're more than a credit score. Apply in minutes and get a decision as soon as the same day. Loans offered by Netcredit or lending partner banks and service by NetCredit. Application subject to review and approval. Learn more@netcredit.com partners. NetCredit Credit to the People McCrispy strips.

Speaker B: Are now at McDonald's. I hope you're ready for the most dippable chicken in McDonald's history. Dip it in all the sauces. Dip it in that hot sauce in your bag. Dip it in your McFlurry. Your dip is your business. McCrispy strips at McDonald's.

Speaker A: All right, Blanderson, we've got some voicemails now. I've got two from after the loss in game four. So I'm gonna give you the option. I don't have to play them if you don't want me to play that. I don't. I could skip them. I. What I will play from both of them is the very last thing that they said at the end. And again, these were not happy voicemails. But here was the end of hotapez.

Speaker D: Anyway, I continue to believe Nixon 7.

Speaker C: Okay.

Speaker A: And then I had a long depressed one from Brandon about game four. And here is his final comment.

Speaker D: Nicks and seven.

Speaker C: Okay.

Speaker A: All right, not that cheerful, but again, Knicks fans, believe. So I do have one from Brandon right before game five started.

Speaker D: All right, boys, listen, I know we're down right now, we're down 3 1. But fuck that. This is New York. We don't quit, we keep fighting. I don't give a fuck what happens. We're going to claw, we're going to crawl, we're going to do everything we can to stay in this game. I have a good feeling about Game 5 tonight. It ain't over until it's over. And you know what? That New York stand up. It's a hard Knicks life, but we gonna make it a hard Pacers life tonight. That.

Speaker A: Let's go. Nice call. And that aged very well.

Speaker C: And that energy is exactly the kind of energy that the Knicks had. Right. Right from the jump.

Speaker A: That's right.

Speaker D: Three, two. Told you. We don't quit. We keep pushing, keep clawing our way out. We don't quit. Knicks in seven. Let's go.

Speaker A: All right, I've got Ralph.

Speaker D: Well, the Knicks beat the Pacers 111 to 94 and now only trail three games to two. Going back to Indiana on Saturday. What a great game by Towns and Brunson and some others. Harto, he needs to watch those turnovers. He needs to shoot instead of passing as good as he is, he makes that those mistakes, turns the ball over too much. But anyway, we got a chance to tie it on Saturday.

Speaker A: All right, all right, all right.

Speaker D: Go next.

Speaker A: All right, all right, all right, all right, I got one more from after game five.

Speaker D: Yo, boys, it's Otpe calling after game five. That was very satisfying win. And I gotta say, you know, I feel like they're chipping away at making it for game one. Ever be excusable, but, you know, they're showing a lot of grit, showing a lot of heart. They're coming up. And if they could just keep the consistency and slow those fucking Pacers down. Slow them down. Grind it out. Those guys like to play fast, man. They don't want to play the grind out game, and that's our advantage. The defense was great tonight, and that's what I think allowed them to really get the upper hand. But anyway, super psyched for Saturday. Yeah, it. Saturday. Yeah, Saturday. Nixon 7. Coach payout.

Speaker C: I think them. I. I think the fact that they were picking up the Pacers, like, full court press, I think helped a lot. I know getting into the bonus early is not a good thing. When it's them getting into the bonus early and not. And not us. But at the same time, that also helps to slow them down. I know that they talk about that on the broadcast, like, every. Like every time that happens. Like, the Pacers thrive on just transition offense. And also, even after a Knicks score. Yeah, like, that's the thing. They fly down the court even after the Knicks score.

Speaker A: So anyway, it's like a five on.

Speaker C: Three or five on four is important. I just. The. The ups and downs of all this, Barry, are just.

Speaker A: I feel like we saw a couple of times, like, you're talking about how, like, they run after a made basket where, like, Brunson will go in for a layup. He falls on the ground, the camera's on Brunson, and by the time the cameraman changes camera angles to get, like, what's going on in the game, it's a shot of, like, McConnell making a layup or, you know, somebody at the other end, you know, getting an easy dunk, it's, like, so quick that they.

Speaker C: Get up the court, they fly up and down the court because, you know, and everybody that they have is capable of. Of playing at. At that pace.

Speaker A: Well, what'll be good is, like, next year if we face them in the Eastern Conference finals and we have Giannis, and it just takes him, like, three steps to get down the court to, you know, to get in front of them.

Speaker C: I'm just. I just don't know how much more of this I can take emotionally and psychologically.

Speaker A: How. How is the. The every other day working for you? Is it working in your favor or against it? Like, because. Well, first of all, longer time between the games, then you got to sit with it.

Speaker C: First of all, I've been exhausted. I'm just. I'm constantly exhausted. I've been exhausted.

Speaker A: Your bedtime is usually, what. What's like, your normal bedtime?

Speaker C: 10, 10, 15.

Speaker A: Yeah.

Speaker C: So, like, today is what, Friday Wednesday I came home and I took a two hour nap. Yesterday, I came home and I took a nap for an hour and a half. Oh, man, I've been just. It's, it's so tight because. And it's also not just because the games are late. It's just like after game four, emotionally, I was shot. I was like, I was shot. Like, I was genuinely, like, I was mopey at school and the kids are like, why do you seem so mopey? And you know. And then other kids are like, well, it's because the nukes lost. And it's like, yeah, I know it seems ridiculous, but like, you know, we've invested so much time and energy specifically.

Speaker A: Nobody listening to us right now thinks that that's ridiculous.

Speaker C: The last five or six years, specifically, like for us with the show and everything, it's just so much time and so much energy, so much mental energy has been spent on this. It's been 25 years. It literally could be another 25 years before it happens again because there's no guarantee of, of anything. Right?

Speaker A: Yep.

Speaker C: And it's like, it's just, it's, it's such, it's such a emotional ride. And yeah, the. Every other day it's, it's killing me because it's like we were up late last night watching. I'm going to be up later than usual tonight because we're taping night tomorrow. Saturday. Yeah. But then we're going to be up late Saturday night watching the game. There's just so much to it. And if they, if they win tomorrow night, like, you and I will probably do a show. If they win. If they, if they tie things up and, and send it to a game seven. I mean, how are you dealing with it?

Speaker A: I like it. I love that there's so much Knicks basketball. I mean, look, this is what, like 17, 18, 12. No, 15. Yeah. How many games have they played now?

Speaker C: 17.

Speaker A: This is five games. Yeah. 17 games they've played now. You know, that's like almost. Yeah, that's, that's like a fifth of a season that we've been watching here. But it's been great. I'm not taking it for granted. You know, third round now, I can't get enough of it. I don't want it to end, obviously, but I do like the every other day thing. Whether it's a win or a lose, I'm anxious to get to the next game. Whether it's the Knicks trying to come back to, you know, bring it to a game seven. The Faster the better, you know, whether it's getting over a loss, you know, the faster we can do that, the better. So I love not having to wait multiple days. I dig it. I really dig it.

Speaker C: Yeah, it's just been rough. It's just. It's. It's been rough on my. On my body and on my brain. I'm not gonna lie. I'm also just. Just. I guess because we're getting old. I don't know what it is, but.

Speaker A: It'S only an hour. It's really, like, only like an hour later.

Speaker C: I know. It makes a big. It makes a big difference because these are stressful like this. These. These games are not easy, Barry. It's super stressful. It's like you're sitting on the edge of your seat for two and a half, three hours.

Speaker A: It's so funny. And sometimes, like, I'll sit down in front of the tv. Like last night, very start of the game, I said, all right, I'm just gonna sit down, relax. I'm not even gonna get that into it. You can't help yourself. As soon as Brunson, like, hit his second or third shot in a row, like, to score the first six points for the Knicks, and then, like, the end one, I. Yeah, you can't help it. I'm screaming, and it's like 8:05 or whatever. The game had just started. So, yeah, you can't even try to control it.

Speaker C: I actually takes over.

Speaker A: You.

Speaker C: I actually thought last night about opening up a Lego and, like, working just on a Lego while I was sitting there watching it. Just so that way, like, I wouldn't get too crazy. And then I was like, there's no way I can do. Like, I can't. I wouldn't have been able to do it just so I didn't get so crazed, at least early on.

Speaker A: Well, are we talking basketball? Hey, you know, we're talking NBA.

Speaker C: So that means we have to talk.

Speaker A: To Blanderson, Hooper one day. I'm gonna get that right. We're talking NBA. I always say basketball.

Speaker C: I mean, he doesn't even remember who I am at this point, so what difference does it make if you can't remember what he says?

Speaker A: Let's go to the phones. Branderson in the car.

Speaker C: Start it off. There you go. See? All right, I only got two stories. I'm not gonna do a quick basketball bounces thing for you like I did last time. Neither one of these is positive, however. Neither one is positive. Former Seattle SuperSonics forward Shawn Kemp has pleaded guilty to second degree assault for shooting at two men in a vehicle in Tacoma, Washington in 2023. He was campus. He's 55 now, which is crazy to think about. Was initially charged with first degree assault, but prosecutors recently reduced that charge to second degree assault. He reached a plea agreement to avoid trial. The prosecuting attorney recommended a nine month jail sentence, a year of supervision by the Department of Corrections and for him to pay restitution. So a schedule has been sentenced. Has been there. A sentencing hearing. Hearing has been scheduled for August 22, so could be nine months in jail possibly for.

Speaker A: For Sean Kemp, the only authentic NBA jersey I've ever owned.

Speaker C: Yeah, that was a nice one. That was a nice one.

Speaker A: Yeah, it was really cool. I love this stitching. He was on that.

Speaker C: Listen, he was, he was incredible until he got fat. Then he got fat and you know, those were the Cleveland years and he just, he really, he really dropped off.

Speaker A: He looked like he ate. Zion Williamson.

Speaker C: Speaking of Zion Williamson.

Speaker A: Oh.

Speaker C: A woman has accused Zion Williamson of rape.

Speaker A: Oh, come on.

Speaker C: In addition to sexual, physical, emotional and financial abuse over the span of a multi year relationship. According to a lawsuit submitted to Los Angeles Superior Court on Thursday. The woman, identified as Jane Doe, accuses Williamson of a continuing pattern of abuse, controlling and threatening behavior over the course of a relationship that started during his freshman year at Duke and lasted from 2018 to 2023. A source told ESPN that she is seeking anywhere between 18 to $50 million for emotional distress.

Speaker A: Look, innocent until proven guilty. But this guy has no luck with women.

Speaker C: No, none from his attorney. We take these allegations with the utmost seriousness and we unequivocally deny them. The allegations contained in the complaint are categorically false and reckless. It appears to be an attempt to exploit a professional athlete driven by a financial motive rather than any legitimate.

Speaker A: Very possible. I mean, that those money grabs happen all the time. And again, he was already in the news, in the spotlight for a relationship he was having with either a sex worker or a dancer.

Speaker C: He's had his issues.

Speaker A: Yep. So yeah, he would be an easy target for that as well. But.

Speaker C: Right. And when you, and when you're, when you get into trouble like that, it makes it easier for other people then to. To prey on you. Not saying that this is what's happening.

Speaker A: Here, but yeah, it's easier for a lot of these athletes just, you know, give some hush money and, you know.

Speaker C: And it makes it more believable to the public if, you know, if stuff has happened in, in the past. So we'll see what happens with with that. He hasn't said anything so far. It's just been through his. His lawyers. I mean, other than that, obviously. Listen, OKC has defeated the. The. The Wolves, and they are just sitting back and they are waiting for the winner of this Knicks Acer series. So that's the way basketball bounces. That's it.

Speaker A: All right, well, that's gonna do it for the show. I got a really disturbing phone call the other day.

Speaker C: Oh, okay.

Speaker A: I was going to. Because we were. It happened at the store from a customer, and we do record our calls, so I do have audio of it. I haven't listened back to it yet just because I didn't want to, because I don't like thinking about it.

Speaker C: Uh. Oh.

Speaker A: Because I feel like I was threatened.

Speaker C: Really?

Speaker A: Yeah. Yeah. So this guy brought in an electric scooter to the shop to get the flat tire fixed. We don't. We hate doing fucking electric scooter tires because they're a fucking pain in the ass. They're really hard to do because they're so small. And it's like a really hard rubber that's used on the wheel.

Speaker C: Really hard.

Speaker A: And it takes a long time. Nobody wants to fucking do it. So we, you know, we charge extra to do it, and that's all we'll do. We won't do, like, electrical work on this stuff because, you know, nobody knows what parts are in these things, and it's too hard to fix. So that's all we'll do. So anyway, we do the flat tire on this guy's scooter. About a month ago, he calls and, you know, asked to speak to the manager. And I get on the phone, and I remembered who he was because I remembered his name. He has a unique name. And I said, yeah, I remember. He's like, you guys switched my motor, bro. Why'd you switch my motor and put a different motor on my scooter? And I'm like, we wouldn't have switched your motor. We did a flat tire. We don't even sell motors. Why would we switch a motor? He said, I don't tell me that I know what you did. I know you switched the motor on it. This thing's going a lot slower than it did before. It had a sticker. I know my motor on there, and you're gonna sit there and lie to me and tell me that you didn't do it? I said, look, I don't know who's been around your scooter the last few weeks. All I can tell you was that it Left with the same motor on that it came into my shop with. And he was convinced that I was lying to him. He's talking to me about how my mother raised me and how his mother raised him. He said how he knows who I am. He remembers. He remembers because he remembers the smirk on my face when he picked it up.

Speaker C: Really?

Speaker A: Yep. And he said that. How did he word it? He worded it like something like, you know, you'll get yours. Oh, you know, this, this stuff turns around and comes back to you. Is that right? And I know, and I know who you are. He said it was like a 10 minute conversation with him doing most of the talking. And all I could say was, you know, no, you know, and so, yeah, so hopefully I'm here to record.

Speaker C: So do you. Did you save that particular.

Speaker A: Not yet. I should, because I think it only saves it for a couple.

Speaker C: So you need to do that.

Speaker A: I'm going to download that and make sure. Like I told you, I make sure I tell people. This way if something does happen to me and the cops say, well, was he having an issue with anybody? At least you have this to go back to.

Speaker C: Yeah, you could just play.

Speaker A: He has. He has a show. So this was about three days ago. He hasn't come into the shop yet, you know, but I don't know what. Like he was saying, like he was gonna bring it in. Then he wants me to make good for. What the fuck am I. How fuck am I gonna make good for anyway?

Speaker C: Well, that's.

Speaker A: That's been a little tense.

Speaker C: Yeah, that. It sounds. That sounds. You know what you should have said to him?

Speaker A: Boy, that escalated quickly.

Speaker C: You should have said that.

Speaker A: Yeah, he was out of the gate.

Speaker C: Yeah. I mean, for his electric scooter. How old is this guy, you think?

Speaker A: I mean, he has kids because he said he swears on his children about, you know, that, you know, he knows that it was changed and that, you know, which motor came in with and left.

Speaker C: He's driving. He's an electric scooter. He's an adult.

Speaker A: Yeah, that's right.

Speaker C: He's an adult.

Speaker A: Yeah, that's right.

Speaker C: Helmet with that electric scooter, too.

Speaker A: No, I don't know if he does or not that I don't remember. I think he does anyway.

Speaker C: Okay.

Speaker A: Big game. I'm sure most of you listening to this on Saturday, if anybody lists.

Speaker C: We'll see.

Speaker A: Oh, because it's a weekend.

Speaker C: Yeah.

Speaker A: Yeah.

Speaker C: Like if you're mowing the lawn, you listen while you're mowing the lawn, you know.

Speaker A: Well, yeah, okay, that's true, actually. You're making.

Speaker C: Yeah, why not? That's what I do.

Speaker A: Gets done on Saturdays. That's true. That's true. So yeah, man, let's get it. Let's get it.

Speaker C: One game at a time.

Speaker A: 7 MSG. We need to. I don't think. Do you remember what movie was it? Oh, Armageddon, which I'm embarrassed to say is like one of my favorite movies of all time.

Speaker C: You should be embarrassed to say that.

Speaker A: It's like in my top. I love that fucking movie.

Speaker C: I love that Deep Impact.

Speaker A: No, no, fuck Deep Impact. No, Armageddon is wonderful. So anyway, there's a scene in Armageddon when Bruce Willis has to go back out onto that. That asteroid and he has to hand detonate the bomb because the remote detonator won't work. So he sacrifices his life and he only has like 30 seconds to a minute to do it. And the other astronaut is, like, nervous that it's not going to happen. And Ben Affleck says, this is what I'm going to say about Jalen Brunson. He doesn't know how to fail. Mic drop. He doesn't know how to fail. All right, That's Jalen Brunson, okay? Jalen Brunson does not know how to fail. And I don't. I think he's gonna will us to victory, whatever he has to do. Lay his body on the line.

Speaker C: You know, I. I'm still kind of dumbfounded by the fact that Omig Getting is one of your top five movies of all of all time.

Speaker A: Love it.

Speaker C: I mean, NASA scientists can't figure out what to do, but they're gonna get a bunch of guys who drill oil.

Speaker A: Oh, it's so good.

Speaker C: Send them into space.

Speaker A: Yes. That's brilliant.

Speaker C: They're gonna save the world. Not the NASA scientists, but a bunch of oil drillers.

Speaker A: That's right. Yeah, that's right. Love that movie.

Speaker C: I mean, I don't even.

Speaker A: 5. I don't even know what say to 5. 07, Knicks. 1-507-564-2571. That is the number. And look, I. I hope to speak to all of you so that we can talk about a game. 7. Nothing would make me happier. But until next time, it is a hard nips life. Let's fucking go.

Speaker E: You set the gold standard for your business. Your website should do the same. WIX puts you at the helm so you can enjoy the creative freedom of designing your site just the way you want. Want someone to bounce your ideas off, talk with AI to create a beautiful site together. Whatever your business, manage it from one place and tie it all together with a personalized domain name. Gear up for success with a brand that says you best. You can do it yourself on Wix.

Speaker B: McCrispy strips are now at McDonald's. I hope you're ready for the most dippable chicken in McDonald's history. Dip it in all the sauces. Dip it in that hot sauce in your bag. Dip it in your McFlurry. Your dip is your business. McCrispy strips at McDonald's.

