" Hey, for play listeners, you can find us every Tuesday and Thursday on Apple podcast Spotify or YouTube  Prime members can listen ad-free on Amazon music. We got a nice show for you today everybody  It's all brought to you by Chevy, but we got the whole gang back together myself Frankie and Trent were talking fourth of July  Fireworks were talking a video series. The haters of 25 K match. We got Maverick nearly on the show  We got a phenomenal voice mail Trent has met baby Frankie and baby Rory May  So we got just a nice show today and it's all brought to you by the great folks at Chevrolet in the equinox EV  Yeah, it's a great show today post fourth of July. We were all pretty busy over the weekend  We're I was driving Chevy's around when I was in New York  It's just it's a packed show and yeah, we got a guest we got stories. We got phone calls  We got everything we got a colonoscopy recap. It's a hell of a show  Yeah, an American weekend leading into a nice week of golf here  I'm gonna play some golf this week. I'm excited to drive some Chevy's when we're on the road also  We're going on the road next week, which I'm excited about let's go baby. No better time than the present  Yeah, very cool road trip coming up people are gonna believe that one and again  We'll be ripping around the western part of the United States of America in Chevy equinox EV offers  319 miles of EPA estimated electric range with front-wheel drive leave the drive into equinox EV  We shopped to the course energized equinox EV is also got a massive 17 inch diagonal center screen that largest of any EV in its class  When it comes to EVs equinox EV is the smartest choice you can make  I'm gonna buddy who struggles the best shot a lot his name's Frankie  They're really so the guys actually gave him a nickname of butter nice because  He looks nice to the queen  We're 100 now you gotta bring 90 we appreciate what you guys do for golf been really cool. Thank you. I'm making a call  We pretty  I was like hey Phil you only fucking 2999 and he grabs a hundred. So yeah, 190 thousand  These yesterday guys take a hundred and go fuckers  Sayin a hobby for play some of my bar school sports your back at his July 8  2025  Happy Fourth of July everyone. I gotta be honest. I didn't get to say that cuz I haven't been on a podcast forever  I have a podcast in a long time  But we had last week we were off we were off the second half of the week because of fourth of July  And then like the two weeks before that I feel like I was doing the bar school classics on the west coast  So I was as we were firing this bad boy up today. We got Xbox Frankie here  I just like I don't think I've podcast him forever  So I never got to say happy fourth of July but happy fourth of July everybody out there  We're not the most technically savvy  Group of guys here, so I mean I've got three microphones in my hand right now  None of them work all three of these that you're looking at right here on the screen on our YouTube page do not work a lot of equipment  Tuna money in these three right here  What the problem is is that the little  USB ports on these are so delicate they're like a dainty little flower. What did that what did?  What did Sir Nick Faldo call me when I didn't want to take the Scotch was it a delicate flower a delicate little  flower  So if you move these any  You guys were doing your little bit you guys were doing your magic dragons bit that whole time  Right, it's so fine too because ever since then like I didn't drink any bourbon or Scotch  Nothing and ever since then I now enjoy that stuff  I think it was probably our trip to Scotland  I really kicked it off and then our trip to Kentucky that really bone of hate at home  Was it even that's on a heaven that stuff was unreal unbelievable  But yeah, no, I really didn't want to drink that Scotch with them  I was like afraid of it and he called me a delicate little flower, but anyway long story short all the mics aren't working  So I took my Xbox one that I played PGA tour to get 25 with and it seems to be working  So happy Fourth of July to everyone hopefully everyone stayed safe and healthy and happy and we all had a great weekend  And I know I did a lot of fireworks a lot of hot dogs a lot of burnt patties on the grill and people aren't paying attention to them  It's real good. Yeah happy Fourth of July weekend or post Fourth of July weekend  I had a good weekend. I came and saw baby Frankie  Got to meet me for the first time which was it was great  You know, you know, he took a little bit for him to warm up to me  I think Frankie would admit that as well  Yeah, there was some crying and some frowny faces when when uncle Trent walks through the door  Yeah, but we eventually got there, you know, I'm not a reaction that uncle Trent used to get in for anybody  You know, I'll be and I'll be honest. I do pretty good with babies  Like I have got cousins and all that and like they're all when they were really small  They were all like oh we like uncle Trent. So I walked through the door with my head held high  I'm like, I'm gonna. This is gonna be easy like I'm just gonna hold this baby  He's gonna smile people are gonna be like you're great with kids  Immediately started crying as soon as I got him in my arms  So we eventually he started smiling and we had a good time, but it was rough at first  Yeah, no, you saw the emotions. I mean when he's very comfortable  It's and then you start like passing him around he starts to like get a little bit  Adaptated he's like why are you taking me away from where I was just comfortable?  Now you're handing me to this to this Trent, you know  I mean like why am I now in Trent's arms when I was just sleeping 10 seconds ago  So yeah, we definitely went through the highs and lows with them, but overall  I think it was a pretty good experience. I posted a picture of baby Frankie yesterday or two days ago and the amount of people that said it looked like  He looked like Trent was alarming  Listen to this picture and everyone says that's just Trent Ryan  Not you know, I listen to willing to take any test that you want if you win  Were you in frickin  Ireland  12 months ago, whatever  No, no, no, that baby is not mine and  Also those fourth of July weekend first of all I went to the esteemed restaurant Barellies out along island  Which was great. I saw Mr. Barellie. I saw everybody everybody was there everybody you get what you got with I got the chicken parm  It was fantastic  hanging in the rafters that chick.  But Frankie's parents were there.  His in-laws were there.  And Brendan Jones was there with Rory.  And I got to meet Rory too.  So I met every four play podcast baby this weekend.  And it was a real treat.  Hell of a time.  Hell of a time.  But yeah, I got to meet the babies this weekend.  Was the Rory May reception better  than Baby Frankie reception to a trip?  Oh yeah.  Yeah, it really was.  Yeah.  I think they got to get a little bit older  and they're like, all right,  I'm more comfortable maybe around people, strangers,  like Frankie was saying.  But yeah, the meeting with Rory went great.  She's a very cute baby.  They both are.  Very bouncy, very just lovable.  We were having the time of our lives with Baby Rory.  No, Brelie's was jumping on 4th of July weekend.  I mean, my dad got a five piece band  and it was supposed to be all outside on the patio  and it started to rain and thunderstorm.  So we had to bring the five piece band inside the restaurant.  I'm talking full band drums, bass guitar, two league guitarist,  a singer, keyboardist.  I'm talking like, I've made a bit of 70 spend  now that I start to do the math.  And we walked in with our babies.  Just hadn't even turned eight weeks old yet.  So we've been pretty like taking them out everywhere,  trying to get them acclimated with noises  and like it's almost like second baby.  So he's almost like the second baby  because we've got baby Jack, you know,  it's our God's son, but like we're always just doing stuff now.  So it's like we got to take Frankie with us.  We're taking a Brelie's bang.  We're hit with like Trumpets and Trump bones and bassists.  I love that my dad, I'm like, bro,  how loud is it in here?  People couldn't even have a conversation.  They weren't even able to talk.  If you were right across the table,  you couldn't even speak.  My dad's like, I don't know.  I think my dad said their jumping is what he said.  I'm like, is the restaurant?  He's like, what do you want me to do with the rain?  So I looked at treading.  I'm like, this is the Brelie's experience.  Like this is a 70 year old restaurant  where the air conditioning was like bumping as hard  as it could cause he had 300 people in there.  It was packed to the gills, wall of wall,  and you had a band just blaring.  That's live.  I'm like, holy shit.  Like this is crazy.  And finally, my dad went over and turned,  I mean, they just, they had one of the speakers on  as loud as it could be.  I'm like, they gotta turn it down.  We're not playing at the fucking Apollo tonight.  It was loud for sure.  And your dad, I could tell he was nervous about it  because as soon as I got there and I went over  and I said hello, he explained it all to me.  Like immediately.  Because like, well, the rain was raining outside.  There's also supposed to be, you know,  supposed to be outside and it's really loud.  But yeah, then they turned it down,  but they also played incredible music.  They were really, really good band  and they were playing the oldies  and everybody, you know, everyone that I could see  seemed to be having a good time.  But for Ellie's man, that place was buzzing.  Yeah, it was good.  It was a fun weekend.  My dad loves it when the people are all there  and he gets to see family and stuff.  And then the fireworks happened and it was good.  It was just, you know, like I said, 70 years.  It's fun that like for 74th of July,  as we get to go to Bareilles  and generations of people get to just go there,  have Italian food, listen to music and watch fireworks.  Pretty cool.  Well, that's what was cool.  I think I know, baby, our baby Frankie had been  in the restaurant, but was that the first time he'd been there?  Like when there were a bunch of people there  because he was a mini celebrity in that place.  First time, like seeing a lot of the regular customers,  we walked them around.  It was what you would expect,  Frank Burley the fourth first entrance to be at Bareilles,  like all the people and all the booths  as we walked our table in the back,  getting up, taking pictures of them.  You know, you got people that have been going there  for 50 years.  They're sitting in booth, you know,  we call it section one, booth 12.  Like sitting right there,  they've been sitting there every Saturday  for the last 50 years.  They see Frank Burley the fourth coming.  They know Frank Burley one, two, three,  and now they see four.  It's a whole thing.  So like you got to bring the baby to the bartender  who hadn't seen him yet, the waiter,  the hostess, everyone hadn't seen him yet.  So it was fun.  Was it like Suri Cruz?  That was like the most famous baby in history  for a while.  The town of Cruz and ladies.  Yeah.  That's lovely.  In New York, you can't,  New York, you guys don't fire off your own fireworks.  We do.  It's definitely not legal,  but I mean, it's a war zone out here.  Gotcha.  We walked him around our neighborhood  and we were looking for the fireworks,  like see where they were firing them off.  And we walked them outside.  And it was like right over our heads  and he jumped out of the fricking stroller.  It was like, I was like, we are in a war zone.  But it's not as, yeah,  it's definitely like the local police officer  on the block usually like we'll do it.  You know what I mean?  Like, yeah, you know that they know someone.  And that's why they're able to set them off.  It's funny, like being back home in Missouri  for fourth of July was in St. Louis  with all my family and friends.  It was great.  Played a bunch of golf and we did fireworks  multiple nights, but especially Friday night,  fourth of July.  And it truly is a war zone.  And you forget when you're not in that environment,  you know, cause I don't do every fourth of July there,  but be in there, be in in the neighborhood.  You gotta have your head on a swivel, man.  I mean, any given driveway within, you know,  whatever, 20 houses, there's people  that are sitting out there in lawn chairs,  firing at random, right?  It's like there's no real order to it.  And it's some people are sending out huge,  like finale type fireworks early.  Some people are waiting later.  They're like sparklers going off.  And it truly felt like a war's entire time.  You don't know where they're coming when they're coming.  And they malfunction a decent amount of time.  So I mean, people are like,  oh, heads up and like shooting fireworks sideways and shit.  Overall, awesome watching, like the kids,  you know, my brother and his kids,  a couple of our other friends had their kids out there.  Kids get so good for fireworks,  but also are rightfully so terrified of them.  So it's like they want to be out there near  when you're like light in the wick,  but then they sprint away as fast as possible.  And then when they go off, everybody's jumping and giddy.  So fourth of July really is an incredible time,  but fireworks are nuts, man.  I'm looking in like your whole feed now is covered.  Obviously with all the problems of the world  and all the horrible tragedies that are going on,  but especially that two day stretch,  it's just like this explosion at this fireworks center here,  this explosion at that fireworks center there.  You really want to say we're all just shooting off  like miniature missiles all around the country  for like two days straight.  And then we just never do it again,  the whole rest of the year.  So things inevitably go wrong.  So I like fireworks, but man.  and they are pretty fucking scary when they're like,  when they're going off.  I'm very pro firework.  We did the same thing.  We were lighting them off.  I don't think they are legal in New York,  but they're not coming over and being like,  hey, stop doing that.  But I will say, for me personally,  as soon as 11 p.m. hits and I'm getting into bed,  I'm like, I've got my hands and my hips  if I hear one at like 11.07.  I'm like, let's tone it down a little bit, boys and girls.  And then they'll be setting them off at midnight.  And then I'm really like, that's how I know I'm getting old,  because the fireworks, if they go off too late,  I start to get aggravated.  And that is something that was not the case when I was a youth,  because I was probably the one setting them off at 12, 30 at night.  But now, once that 11 p.m. strikes,  I'm ready to like stand on my front porch  and yell at somebody.  Oh yeah, I mean, they were going forever,  I'm on out and I felt like it was like 1 a.m. 2 a.m.  You still heard the booms.  It was crazy.  The night before, Saturday, what was it?  What was Friday?  Friday was 4th July.  Thursday night, they started to go.  and it's like, what are we doing?  We're not even there yet.  It's not even the weekend yet.  So actually, I went to my buddy's house  and we brought the baby, all the babies were there.  So we ended up leaving at like seven or eight o'clock.  And I saw Snapchat start to roll in at like 1 a.m.  They were setting them off in their front yard at 1 a.m.  And I looked at it with disgust.  I'm like, that, those neighbors got a fucking hate them right now.  1 o'clock on Saturday?  No way, man.  Come on, imagine.  Like, you've gotten past it.  It's past 11 on Saturday that Thursday Friday is there.  And now all of a sudden you got these guys out there  sending out freaking dynamite.  Come on.  No, you can't do that.  You can't.  It makes me look back on my youth because we would,  they weren't legal and I will, they weren't legal and I will.  But me and my buddy Mike would drive to Missouri.  Speaking of rigs and we would buy it on the border  and come back and we didn't even be 4th of July.  It would just be like a random Friday night at 2 a.m.  And we would just light a bunch of firecrackers.  And it was the most fun thing in the world.  But now as you get older.  You're like, you're like, you're doing your name.  Yeah, let not roaming candle.  And the whole thing.  And you're like, there had to be some humans  and certainly dogs who are like, what's happening?  What's going on?  So I do.  We bought, we went and bought our whole allotment  and Wednesday night right when I landed in St. Louis.  So then when we got home, you know, the whole way home,  kids are like, can we shoot them off?  We should off.  We're like, all right, we could we'll shoot off.  You could shoot off two fireworks each person, you know?  And that ends up being like eight fireworks each person.  So then Wednesday night, it wasn't late,  but it's still nine o'clock at nine or 10 o'clock at night  on a Wednesday.  And we're just fired off 25 fireworks for the reason.  You're just like, yeah, you can't help it, man.  People love the fireworks.  But they are fucking scary.  They are just scary in general.  You know, like I get, we had this one.  It was the King Arthur.  It was the big finale one.  And it was a 12 pack.  And it came with its own, you know, like a rocket launching pipe.  And two.  And then you put each one in individually.  It came with two different tubes.  So you could shoot two at the same time.  And when it launched, like the ground shook,  I was like, dude, then it would take three or four seconds.  And then boom, it's like a huge explosion.  You're like, this is fucking crazy.  We're still doing six for like 24 hours.  It's like it's a mortar shell.  It's just like crazy.  And then you wait for it to be.  Yeah, it's it's really fun though, you know,  shout out to America.  Greatest country in the world is fun.  It is fun.  All right, couple administrative things.  We got Maverick, Migny on this podcast.  Sneaky number 16 in the world in the official world golf rankings.  You know, incredible sort of, very unique backstory.  And every time they play the AT&T Pebble Beach Pro Am,  they always highlight the fact that that's where he's from.  I believe it's to add it's like a billionaire yet.  Really, really impressive player hit like an insane amateur  career, Stanford.  And then not as sharp, maybe coming out as you would like.  And then all sudden, starting to ramp up,  he's inside the top 12 in US Ryder Cup points as of right now.  We got his first win in the fall.  He flies himself.  He's got his pie with license.  He doesn't fly everywhere.  But he flies himself.  So we talked quite a bit about that.  He talked about his turnaround.  He was outside the top 100 in the world as of last fall.  And then his ramped up into the conversation for making  the Ryder Cup team.  And has had some very impressive, you know, finishes a win.  All that over the last year.  So Maverick, Migny only joins the show for the very first time.  And then this week's video we've got Jersey Jerry.  Jersey Jerry is back.  He's trying to break 100.  He's actually in his home state.  So this would be his first attempt in New Jersey.  Try to break 100.  I believe Frankie you were there out there with him.  Yeah.  So my first video back in a while feels like.  So it was nice to be back with Jersey Jerry.  In Jersey, he had great vibes.  And it's really hard, as we say, to promote breaking 100.  I'll just say that Jersey Jerry has gotten phenomenal.  Like his progress has been phenomenal to watch.  This guy just started playing golf two years ago.  Like swinging his first golf club just to like pick it up.  And what he does in this, in this episode is pretty shocking.  I would say.  So that's as much as I can go into.  I think it's a must watch.  Jersey Jerry trying to break 100.  I'll put that on there.  I just love being with him.  And I can't wait for this video to come out.  Yeah, I saw Jerry play for the first time in a while.  A week and a half ago at the Ryder Cup.  And he was massively improved.  I would say for the last time that I saw him out there playing.  He hits drives like 285.  He hits a 285 with a baby cut right down the middle.  And you look at him.  You're like, that's just got to be God given talent  that you're able to just pick that up and just do that.  Because that is not an easy accomplishment  when you just started playing the game of golf.  It's one thing I'm not able to do.  I know that.  I can't hit a 280 by.  You know, I can't.  No matter how hard I swing.  I can't hit a ton of fades.  Like bombs.  When you tell him you're free up on the left,  like, oh, you've got no, you've got no out of bounds in the left.  There's no trees.  Like just bomb it up the left side.  And he can just do that Trent kind of fade  where he knows he can let loose on one.  The ball goes forever.  It makes you laugh out loud. He hits it so hard. It is it is crazy. He anything he's been playing a lot  I think you see he posts a lot now that's getting nicer in Chicago  I think he's out there a decent amount so his game is definitely played with his indie  I was gonna say there. He's got the bug. He's got the bug definitely tell he'll say he'll call you  FaceTime and p.m. Yeah, Greg see this shot. How do I hit this shot?  I'm not sure you know and then he's got the new putting green in his backyard  So it's one thing to film the videos for content, but I do love he's like obsessed with golf  He had yeah, you say I saw him out there a family and friends  He's posting us Instagram stories. So I love the Jerry's like obsessed with the game  He's a guy, you know, you might not have pegged it as a Jerry is a guy that we could recruit over to the golf world  But he's obsessed with the game speaking to YouTube  I just want to give a shout out to our guy Riggs Barstool unbelievable  He's he's just put the YouTube channel on his goddamn back  I he's put out a bunch of videos bunch of haters haters has been rolling the $25,000 match  That's been out for a few days, but we're looking at  520,000  130,000  450,000  470,000  Bro unbelievable. It's it's been a real joy to watch and again  It's just you and some random guy and I remember when you know back when breaking a hundred was you know  Really rolling when we just started it and like it would get 250,000 views a week and we were like man  That and Riggs would always say like that's cool  There's like 250,000 people who are just watching. That's like a TV show essentially every week 250,000  Yeah, so in and bro, you've put out a video every week for six weeks and it gets at least  450,000 views. I just milli I just had to I just had to bring that up because it's an incredible run that you're on  No, I appreciate that. I very appreciative of the support  I would say as a guy that hasn't always gotten a ton of positive support the amount of  Messages even comments especially on the vinnie video  See in people at the airport. We always talk about the airport test and people just coming up left and right like they're loving it  And then you see it in the numbers definitely a little bit of  Help soften the blow of a guy sitting here. That's just $25,000 less  valuable as a human being  So we could kind of go through and talk about that one a little bit but overall  Yeah, no, it's been a great run a huge shout out to Jonesy to  Tim's to Jared to all the guys that come out film  We got our own little side group text and they've just been buzzing every time it comes out with like dude  It's on pace to kill it again. So in a day. It is like our job to kind of get views  And yeah, you never know how stuff's gonna turn out when you go out there  It's not like golf's not a thing that I'm naturally very good at as people clearly know  And so to go out there and put your game out there  You really have no idea when you show up  What's gonna happen? There's a lot of formats that we do that other groups do where you could kind of hide to be honest  50 on any given day like you're on there and like a scramble you're out there and even an alternate shot  You could kind of like get away with chopping it around and just put your game out there show up  We have no idea what the like credit of any honestly if any is like the best thing ever happened  I can't yeah people legit were so they wanted me to beat him so badly and he you know  It just kind of channels like the one thing that I really am is just I'm freakishly competitive  I love to compete and so I always think it just helps me like when you get me in those environments  I probably am more likely to play well because I just lock it. I want to beat people so badly and Vinny  I wanted to beat more than anyone in the world. I mean I had I had two different guys this weekend randomly  Walk by me and just go don't be a Vinny out there today no matter what  But no, I appreciate that and yeah, it's been a wild run the the  There's like four of the last five weeks  I think it's just putting out a video and be played against somebody at golf and see how it goes  So I do I appreciate that support like becoming sure to it. You say don't be a Vinny like  But Andy don't be a Vinny people walk around the saying that he shirted it  When they mess up not be cannot become a Vinny on the golf course so no, it's been incredible to watch like we we always talk about it  Like it's really hard to find  Original video series that like people will become invested in and this is definitely one regardless of like you know  What other people will say or whatever like about your game or what or about us as a group like people are invested in you beating  Interne trolls  Whatever they that's just a fact you know numbers never lie  Naya and and the fact that it's all built up to the 25k match and the way that that went down  It's like it's just it's a really good ride right now  Hopefully it continues like I hope that you keep doing them like because this is a people are legitimately invested in it  And it is the best things that were happening  We said that three years ago when we came up with the idea at that Taylor made  Shoot we were doing the straight  We still don't have tea forever remember that there were this out there like 8 a.m. We didn't film our bit till like five people  It was crazy and we're standing there  We're like trying to cope with ideas and we're like oh like you know  This is like we need to find something for rigs in the fact that like he doesn't get that moment in all the other videos  It's like me and Trent and breaking series and then we do the group videos and then like rigs is always the one that like they'll pinpoint  Like if he didn't play well, it's like that's the reason that a team lost like it was just getting it was like pigeonholed  Into like the negativity and it's like you need something and he's like what if I just came out and like I played all these fucking losers that  Like won't stop messaging me. We're like that's fucking unbelievable and to see it actually flourish and succeed is  Insanely insanely satisfying. It's so good. It's so nice. I agree. I agree  I very I appreciate that and yeah, I mean there was a stretch maybe a year or two years ago  I came around when I was maybe it was a year ago when you guys did the  You guys did the trip with Francis and Jerry where you guys went across the Midwest our V-Trip  Yeah, I was just getting a lot of messages that were like his rigs even on the channel anymore like what does he do?  He's like that on there where it's like at that stretch  I was just doing barso classics like we're all in sometimes routes sometimes  But if that stretch was like not playing well  Not in as many videos and it was like where am I going with this stuff?  And so to see it like he said like I think Kyle was texting us Kyle Tim's just being like the summer of rigs and just sending screenshots of the  V-Trip so yeah to see a lot of them invested in them. I had Garrett Clark who  We respect the shit out of that guy.  That guy is one of the best of what we do that there is.  And he texted me on the side last week.  It was just like, this is the only video series in our whole space that I'm glued to every  single shot winner lose.  Like I can't get enough of it.  So that meant a lot.  So yeah, I appreciate people watching it.  I have no intention of stopping.  If anything, like I'll say after the way the 25K match went down, I don't know how like  Rory McElroy or Mito Pereira, like go on with their lives after you just have like  such a heartbreak.  There hasn't been a night that I haven't like legitimately had a nightmare about the shots  and how like, and you know, I'll say like golf giveth and golf take it the way.  It was like, I'm in this time matrix too with the release.  Me and Jonesy were talking about this a lot, which is just the nature of what we do.  But it's like, we filmed those Hater matches one, two, three.  So it was like Philly, Kyle, then it was Andy, the oyster, Fama.  And then it was Vinny.  And it was like back to back to back at the end of April, we filmed those.  And then those just started coming out like three weeks ago or so.  And then in that time, like right after the second one came out, was the Thursday of  US Open Week when I lost $25,000.  So then over the next two days or two weeks, all the public stuff is like, wait, I  can beat that guy.  And all I'm thinking in my head is like, no, no, I just shot 90 with a quad triple  finish to lose $25,000 by his stroke.  And I've taken victory laps online because I just beat this other guy that came out.  So the time matrix part of it's been crazy, but I will just say that golf give it and  golf take it the way you fire 75 against Andy and everybody's like, all right, he could actually  do it.  Then you come out against Vinny, you even par from the tips one over through 12 holes,  beat him seven and six.  Everyone's like, God, this guy's buzzing.  And then you finish quad triple and shoot 90 to lose 25 grand by a stroke the next video.  It's just like, that's just golf.  It is.  It's got encapsulates the argument that we've been having for years with the handicap  police where they think if you're a four, you're going to go out there and you're going  to shoot 75, 76 every single round.  And that's just not how it works.  And that's not how golf works.  I know we don't have to get them the whole handicap thing, but like, that's just fucking  you'll put up a good number and a bad number.  And then it all evens out as you keep going.  More people are starting to come around to the fact that like the comments just don't  understand the system.  And we've been talking about that for like six years.  Like one guy that got a lot of uploads in the comments was like, no one understands also  that there's no metric to like playing a different course under pressure every single  day is essentially what Riggs is doing.  True.  He's showing up to seven different courses, playing seven different people.  And you're getting seven different scores.  Like if you were a course handicap nine in a certain place, like there's no saying that  like there's no metric that says like, all right, yeah, on your best day, you would  shoot like an 81.  now all of a sudden you're playing with five cameras for $25,000 and you're playing  positive Tm.  Oh, where it's like, all right, like what's what's the average score there now is it 86  and then like are you supposed to play that your average score every single time you're  on camera?  Like there is it's very, very difficult to do the fucking math.  It's just at the end of the day.  It's like people just want to see good golf.  And if you play bad golf, they're going to get on you.  If you play good golf, they're going to be like, that's what you're supposed to do.  They just don't understand what the system actually is.  And then you get some such fucking it's awesome stupid.  Like I hate talking about it.  So I fucking hate it.  I think it's, I think it's like really pointed out to the people that like if you're a member  of a club a lot where you play and member guests, remember members in the handicaps are very  prevalent.  Everybody talks about it.  Everybody's sitting in the grill and they kind of know this guy's this handicap.  This guy's that handicap.  Everybody does kind of agree that handicap system is a little ridiculous.  But there, I don't know that there's like a much better way to do it.  But it's like my average score for the year this year is an 80.9.  And I'm a four handicap index currently.  That's right.  I don't, and I had this conversation with Vinny where it's like, do you understand how crazy  this is from my vantage point that like, I've just been telling the truth the whole time.  And I don't, right.  And I said to him, I don't claim anything.  There's an application that claims what made a gap besides me.  I put in the numbers exactly what I shoot based on the parameters that they tell me to.  There's a ESC system, which is like if you make up net triple or whatnot, it goes in  as a double, which I just put all the scores in the app does it all itself.  It spits out a number.  So I agree that I think that it like everyone that knows in knows a lot of different people  that play golf that are certain handicap knows anybody who's like a four or five handicap could  shoot 75 or could shoot 90 on any given day back to back to back videos.  It was like 75 75 90.  And I great.  Just kind of whatever 80.  You know what I mean?  Like it's yeah.  And that's like what my score is.  So having said all of that, there's no, there's no excuse on planet Earth that I should  have lost that match.  No, that's a, that's a crumble.  That it from bag.  Yeah.  I don't like it was Phil Mickelson at wing foot.  It was just everything was in my control.  I couldn't hit an iron all day, but I was managing my way around.  I was still going to be able to shoot like an 82, radi three win by five shots.  There was two different instances on the back nine on 15.  I've got a pretty easy chip.  He leaves one of the bunker.  It's looking like I can make par.  He could make double.  We both make bogey on 16.  He hits one out of bounds.  I have a two shot lead.  Just hit one in play and it's over.  And I make an eight.  17.  It's like, dude, next thing I knew I'm standing on the 18.  And I'm like, wait, I'm doubters.  What happened here?  And then it's just, oh, and so I, me and Alister have talked about it a lot where I was  like, dude, there's so much that goes into conversations about people collapsing a golf.  And it's usually always focused around like the execution of it.  Like you look at that middle prayer swing at 18.  You're like, oh my God, or you look at somebody yippa putt.  I was like, nobody ever talks about like the mental and strategy stuff that just went  out the window.  It was like, what was I doing?  I just legitimately looked up and was like, dude, I didn't even think I didn't even know  that there was a creek there.  How do you not know?  We play over 25 grand.  I didn't know there was a hazard there at 17.  So how do you not know that?  Like you play over 25 grand?  And then next thing I knew it was just, it was just over.  And he was celebrating, dancing around the green with all of his buddies who were the  nicest people ever.  It was like.  It helped a lot that he was very good.  Do we had a beer afterwards?  He was like talking through me about how to get set up for streaming,  which I would like to do because he's a big streamer.  Like, great guy having set all that.  It's like, it's just unacceptable.  What happened?  And I can't tell you, there hasn't been,  I'm not going to say 60 seconds stretch,  but there hasn't been a 10 minute stretch of my life  in the last three and a half weeks  where I haven't legitimately had the most self-loathing.  Just like, ah!  I'm doing it all night.  I'm so like, I've talked to people that are,  and it's $25,000.  Like, that's a shit ton of money.  Shit ton of money.  It doesn't matter who you are.  Like, you lose, Dave loses 25 grand on a bed and he's like,  that fucking suck.  Yeah, shock.  Yeah, so it's like 25 grand to a stranger.  I handed it to you.  Right, that guy's walking to the airport with 50 grand.  It's like, listen, things are good.  We've been doing pretty good, but still $25,000  you have to go to $4,000 salary.  I mean, it's like a low income salary for a year for people.  A lot of money.  A decent car.  Yeah.  A decent car.  A new car.  No, I thought about that a lot.  It helps, like, you should see the way that I'm trying  to justify it with, like, oh, the videos are getting views,  views eventually lead back to ad dollars, which eventually  is going to, it's not 25 grand.  Oh, that's not 25 grand.  I know.  I know.  I'm just 25 grand.  So I can't tell you the remorse that I never  would be about it, because we're getting the ad dollars also.  You didn't even know it.  You didn't even know it.  No, I didn't.  Right, because it was just fully rigged this money.  Like, I didn't come from the four-play phone.  I didn't come.  We didn't chip in.  We didn't buy action on it.  It was just rigged's bar for money.  It was a, and it was in my, it was the right move for me.  It's like, dude, I had what I would tell the people.  I was like, dude, we did our homework.  He was legit, like a six or seven handicap.  I'm a four handicap.  So essentially I was getting like a minus 200 or minus 250  bet at even money to win 25 grand.  I was like, who wouldn't do that?  Of course you have to do that.  And then the only thing that fucked it up was me.  I just didn't get it done.  There was no, it was no bad luck.  The weather was perfect.  It was my kind of situation.  Like we were playing it from relatively short.  The golf course is very hard.  Anybody who plays it knows, but regardless, 90 is unacceptable.  So I can't do it for you.  And mad play of one, wouldn't you?  Yeah, we did it afterwards.  I think I would have won, which it doesn't matter.  It's also, dude, I went into it knowing like I had,  I had the ultimate opportunity to just put a bow on all of it  at the end of the summer where it's like,  I could go out at Posit tempo and I could shoot 75, 76,  even just break 80, win by a handful of shots, take home $25,000  and just be able to be like, we did stroke play.  We played for all the monies and I did it and I won.  It's over and I shot 90 and lost 25.  That just opened up.  But you know what I'm doing?  Another one that you know, it's just like we got to get back  on that fucking horse.  So now it's like me and Jonesy were talking.  It's like, are you just the 25 grand guy now?  Oh my God.  And in 12 months, am I going to be down 200 grand?  Like what are we doing here?  Is that the new?  It is.  It is like, you know, he's moving into Frankie's house  if we keep doing it.  You have like, it's got a little bit of a bank or right now  where it's like you could do like one or two more.  And if you lose those, it's a great.  A giver.  That it's like, we're doing,  I started to get to hand handling.  Because dude Kyle, your friend Kyle, he was like,  he was sitting there and he's like,  dude, when I was trying to,  which he was more calculated about it than I expected.  But not in like his game was his game.  He shot 89 and I fucking lost.  I suck.  But anyways, he was like, me and my buddies were trying  to come up with the number that I needed to include  in the tweet that you would accept.  And he's like, what number could I've gone to?  And I was trying to come up with that.  I was like, I really don't know.  Like if you would have said 50 grand,  oh, I don't know.  Is that like too much?  If you would have said 100 is that too much?  If you would have said 10, I would have,  so I don't know, but 25.  That's perfect.  That's perfect.  I'm gonna do another 25k match.  And it's like must win because then it's back to even.  I'm celebrating.  It's like it never happened.  And if I lose it, it's like, I'm a chase.  I mean, I'm chasing.  That's just a huge.  I know.  I know.  I know.  It hurts.  I sent Jonesy just the screenshot of my checking account,  minus $25,000.  And I know then the bank.  Because when you take it out, they're like,  it's, I don't grill you, but they're sort of like,  okay, what's this for?  And I was like telling them,  I was like, yeah, for work.  I've like filmed YouTube videos.  I'm actually like, we're doing a cash prize  for this video that we're filming.  And we're playing a $25,000 dollar golf match.  Like, oh, awesome.  Are you plays like, yeah, I'm in the video,  you know, whatever, good luck.  And then I just have it be back to the bank yet.  So they're like, oh, that's a lot of school.  You're like, you haven't seen them.  We haven't seen them.  And we hasn't deposited anything.  He's just, he just lost that money.  And saying, having said all that,  I still appreciate everybody watching.  I appreciate all the views, all the support.  And I'm not going anywhere.  I've been, I've been hungry.  I've been, God, it's frustrating.  I don't know how Rory sleeps at night after that, you know?  So, but I really don't like, I just don't.  It's, I can't tell you how grueling it is.  And how much you just think about every shot  and just have the word, I can't even watch the video.  I'm just like, oh.  Gough is hard, can be very, very hard.  As you hear us discuss in the show,  but protein can be very easy with one Hershey's double chocolate  made with 18 grams of protein, only one gram of sugar  to deliciously fuel your golf game again.  Only one Hershey's double chocolate is made with Hershey's  cocoa.  This stuff is unbelievable.  Frankie, you were hyping this up a couple of weeks ago.  Transcot him right there.  The OG right now, we're talking only one gram of sugar  with 18 grams of protein.  Come on.  Cocoa, I like the church dub version of cocoa.  You got a church up, baby.  Yeah, no, it's, it's real good stuff.  I've got boxes downstairs.  I've got the Reese's peanut butter lovers right here  at my desk for the podcast.  The one gram of sugar is a nice touch.  It's nice to see that they're throwing different things at you now. They go three grams. They go one gram  Keep in that 18 gram of sugar. I bring these on the golf course with people  They ranging from professional athletes to  Uncles and cousins and whoever comes out and plays with me. I give them a one bar  And they all can't believe how good it tastes no matter who you are  It's such a good  Diller upper on the golf course. It just gets you the way you need to be it just gives you that energy gets you to the the  Half way as it gets through the clubhouse you feel real good out there stock these up put them in the refrigerator  Little thing on your golf cart in that little cooler  Make sure they stay nice and cool and firm and just rip these things on the course  I'm telling you you want regret it  I'm telling you I was probably a function of me just reading left to right not knowing what was coming in the car being  Kekoa  So whatever you wanna call it cocoa cocoa  A point is by the new one Hershey's double chocolate protein bar on Amazon  Protein just got delicious. I trust simply save to protect my home and my family  It's about security that is proactive not just reactive most security systems only take action after someone breaks in guess  What that is too late simply saves new active guard outdoor protection help stop break-ins before they happen  aye-powered cameras plus live monitoring agents to text suspicious activity around your property.  So if someone's lurking agents talk to them in real time, turn on spotlights,  and can even call the police proactively deterring crime before it even starts no contracts,  no hidden fees, that is why we love simply safe.  I have you simply saved for three years now. I've ever long had the house three years, four years.  I love it and it's become just a way of life for me. I have the app, I get all the notifications,  I'm constantly recharging them and moving them around the house and getting different angles.  I've added to it so now I've got a whole, a whole simply safe system around the house and in the yard  and stuff. I love it. It's been nothing but perfect for us. We've never had issues. It alerts us  every time someone's on the property and it's great. I absolutely love it, man.  I'm saying for my house and pioneers for years now, every long that's been,  not there all the time as folks. No use a little rental property, so you need to make sure you can check  and know what's going on. We've got the app and then the code lock on the front door so we can  let people in whenever we need to. We've got cameras all over the place so we can see what's going on  outside and then of course the alarm system. We can set, reset, do whatever we need to do with the app  from afar. It's very nice. They got a 60 day money back here. A team monitoring plan started just  $1 a day. Visit simply safe.com slash for play and you can claim 50% off a new system with a professional  monitoring plan and get your first month free that's simply safe.com slash for play. There's no  safe, like simply safe.  It's, you know, it's a great idea and we've talked about a lot, but like that the LPGA thing where  people are starting to permeate into society and into golf culture where like that's when you know  people are just like, oh, that's such a good idea. We're going to do it as well. I don't know if  you have any update on that. I don't know if any conversations have happened, but people want to do it  and they want to do it in their own sphere. We're going to do it. Jonesy and I had a call with the  agency last week that represents a bunch of LPGA tour players. It's definitely a little different than  the Hater series. Like you can bring out a Vinnie to me and I can handle it. It makes the video better.  We don't want to bring out someone that's going to like make young women golfers like super uncomfortable.  So we don't want it to be like violently abrasive. Why don't you know to say violent even like  verbally abrasive? But we want someone that like is a scratch golfer who simply like is doubtful that  the women's game can hold up to the men and will be a respectful normal person, but like  thinks that they're going to win. Yeah. And then do that match and host it. We absolutely want to do  it. I think it could be huge. I you're right. It got a lot of the conversation going, which I  which I loved. So we're definitely going to do it. We're absolutely going to do it. I think it'll be  at such a good idea. You know, we've been around. We filmed a bunch with, you know, whatever, 10 or so  different LPGA players. And they really are unbelievably good. I myself don't know how far back you  can take them to where the advantage would start to slip. Right. Like I think if they play  6500 yards or whatever, they normally play in the LPGA tour. I think they're undoubtedly,  especially over a scratch golfer, just going to have a massive advantage. They're just better. They're  way better. I think if you start to go to 7,000 yards, I still know their way better. But is  that distance, right? Is there like a huge difference in the advantage where now it's like pretty  even? Like I just don't know what that number is. I think we're going to start out playing the  normal teas that like they play on the LPGA tour from that distance. See how it goes for a video  with two. And if the LPGA players dusting these guys, then get a get a girl that will move back and  be like, well, you play from 7200 yards against a scratch golfer. And they're like, fuck yeah, I'll do it.  We'll do it. And I think we're going to start pretty normal distance that they play and just see how  a scratch golfer holds up against an LPGA. Do you think I saw Charlie Holsey, she would play the  blues and let the scratch golfer play the whites. Like she would play behind them.  Oh, she would be so good. And it's a ball so far so far. Yep. Yeah. That that the young girl at the US  women's open was averaging almost 300 yards off the tee. She was like 290 something off the tee.  It's like Jesus Christ. No brainer. I've gotten a bunch of messages from some gremlins being like,  I would dust them like, I'll see everyone forward those two us because we are trying to find the right  opponent. Right. I mean, this one guy is not the guy, but like his little just don't make them cry.  But like, yeah, no, there's a lot of people that are very, yeah, it's going to be a hard spot to be  because you're essentially like signing up to get canceled. It's like, like you're out there being  like, I don't think the women's game is good enough to beat me. I'm just better. And like,  you're totally misogynistic line. You're totally misogynistic line. You're just like, yeah, I know  they're pro, but like she's a woman. I can obviously be there. It's what you're saying. There is no way to get around it.  claiming that they have no chance to be.  I do think it's been a conversation for a long time.  Like this, that's the reason the debate was sparked when Riggs was doing his thing because  it doesn't have to be like, like he's saying it doesn't have to be abrasive.  You can just, you can be like, it's almost like an experiment.  Like I want to see a guy who's a scratch how he would do against an LPGA tour play.  You don't have to be like in the way that we're all like assuming they would be.  It can just be like, it's golf and like what are the levels actually and what do they look  like in how good is this guy versus like I think it can be that way where it doesn't  have to be like the guy is going to be a fucking asshole.  And LPGA players actually deserve this chance to show just how good they are in reality.  They deserve the platform to be like because they are fucking good.  We do these videos man.  They are so good at the game of golf.  We watch Charlie Hole.  We watch Nelly Corden.  These are some of the best in the game.  They don't miss a shot.  They are on the pin every single time they're hitting absolute bombs.  Tiger Woods watched Nelly Corden and Bosey laugh out loud.  He's like this girl's unbelievable at the game of golf.  Like they are so good.  So that's what they deserve is the chance to show the world.  Yeah, it is an experiment.  It's like a control.  Like the control is everybody's, you know, everybody's best, like the best guy and everybody's  group.  Like they all say that they would dust the LPGA per hour.  Like you're setting now the bar of like shutting all those people up.  Not just the guy that they're playing.  It's like everyone.  Like I don't know.  This is actually how good we are.  You beat him three and four, whatever.  Four and two.  And it was over.  The next time, you know, people are together, they're playing golf and they have this debate.  Hopefully one guy has seen the video and he's like, no, that's right here.  We can watch it.  It's like always the debate about could the best college football team beat the worst  NFL team.  And they've never done it.  And I would fucking love to watch that game.  But like it would be a really interesting idea and an experiment.  This is the exact same thing for the golf world.  Yep.  And I couldn't agree more than I think it is such an awesome opportunity for any of the  LPGA players for exposure or getting coverage that they don't get.  Right?  Like this will be when this goes down, if it's done right and everything, this will get  more coverage than almost any tournament that they do or play throughout the year.  I mean, this is going to be talked about.  this will be remembered.  And so yeah, we had that conversation.  We're going to continue.  We're going to try to get this bad boy going soon because I think it's a great idea.  But it is.  It's just spin off from sort of how this whole series is gone.  And there's, there's, you know, if you look at like the day versus Jerry like grudge maps  that they did, like there is a, this is in golf.  This is an opportunity for people to just be like, fuck you.  I think I could beat you and go at it.  And so we're happy to be the people that do that.  So we're working on that.  Very happy to host that and hopefully we get that done pretty soon.  But yeah, it's been a hell of a run.  Three in one against, you know, my opponents this year just happened that the one loss was  the most costly, but that's okay.  We're going to keep going.  We'll see where it ends up.  But thanks everybody for watching.  All right.  Moving on, little John Deere classic, Trent's tournament.  You guys have been to this course multiple times now Trent.  You've done a couple different videos at TBC deer run.  What am I?  Andrew Martin back in St. Louis, Bogey Hills, Country Club member.  He played TBC deer run a couple of years ago.  And it's his favorite course.  I think he's ever played like as we're watching the coverage.  He went through his like, Oh, this whole, this whole is amazing.  And once again, think they were saying for the last five or six years, something like  that.  It's come down to it playoff.  So I know we give it a hard time and it doesn't always have the strongest field.  I had a hell of a field this year.  Max Homa being in the mix helped a lot in terms of big names.  Jason Day was there.  A lot of big names in the field.  And Max Homa had a great run.  He finished two strokes out of the playoff.  I was sitting in bed, you know, kind of recovering before the July weekend watching this  whole thing.  That 18th hole was phenomenal.  It's like right on that edge of like, if you had a really good T shot, you could have  a pretty good birdie look.  If you don't, you're going to struggle to make par.  And then Brian Campbell of all people who's got 161 mile an hour ball speed, which I love.  That is like way down towards the bottom.  Watch it like Max Homa was hitting like 183, 184 ball speed with his driver.  And this guy gets it done.  He was kind of cocky.  Like he finished 45 minutes before the other guys.  He was just sitting in the club.  I was chilling.  Like everybody goes to the range.  This is sitting in the club.  As came out striped one down the middle and then hit this sick little draw and one his  second turn of the year.  So great little tournament there at the John Deere this week.  It is a great tournament.  It's a great golf course.  The people there are great.  Like you mentioned, we've done a couple videos there.  My dad and I in beef were just there like a month ago.  We shot a breaking 85 out there.  And they're just the nicest people ever.  I know my mom got like the card from the tournament director and they went this weekend  through the tournament.  They got hooked up and had a great time.  So shout out to them.  Shout out to Peyton who's always been very good to us helping us get T times.  And yeah, it's a great tournament.  I will lie to you.  I was rooting for Max Homa to win it for a multitude of reasons.  I'll do respect to Brian Campbell.  That's a hell of a win.  I think it's a million a half paycheck.  like having Max Homa win the John Deere Classic would have been well, first of all, we  really like Max and we're always rooting for him.  But that's just you have to talk about it then because again, I'll do respect to Brian  Campbell, but that's not exactly moving the needle on the internet.  If Max Homa wins it, it becomes like this whole thing.  Then maybe he's got to keep going back there and he's going to talk about it.  So I was rooting heavily for Max and I think everybody was.  But yeah, it's a great tournament.  It's also gets kind of screwed now because it's fourth of July weekend where people  are clearly out and about doing other things, but it's a great golf tournament.  Great golf tournament.  Yeah, we love their time there.  It's a great golf course.  Not easy.  It's definitely not an easy track.  So I mean, the fact these guys play so well there when you get to play a course that PG  tour players play really does, you know, blows you away at some of the shots they're  able to hit, especially under pressure.  Max looked great all.  weekend weekend and then started to fall apart a couple of bogeys on the back. It's like,  God damn, Max. Like this was the one everyone was pulling for him. He had all these quotes. We have  like the we have the quotes of what he said about the just Twitter and the internet. I think this  is where people are not turning on Max. But you're seeing a lot more negativity toward him online  because he's kind of like not asking for it. But when you call out all golf fans on social media,  you're going to get like the psychopaths that kind of hit you and slam your heart. I really  don't know how to say it's like it's not hypocritical. But like he was the Twitter guy. So like now  that he's saying like Twitter is the worst place of all time and everyone just like tells you to  go kill yourself on it. I get what he's saying and I agree with him. But like he is the guy that did all  this, you know what I mean? Like he just like roast people's swings and it yeah, it's very like fun and light  hard and stuff. But like you're just of course people are going to go after you and and think that  you can take certain jabs and stuff. You know what I mean? Like it's kind of hard to be the one that's  like crying over the fact that you're getting a lot of like social media engagement when it's like  kind of your thing. I understand what you're saying. But he was never malicious. It was never. It was  always very playful. And I there is a certain percentage and it's we've seen everywhere on the  internet where people take it too far and the the line has always just been now where it's like well,  of course those people exist and they're going to be mean and they're going to tell you to kill  yourself on the internet where it's kind of like I don't know if we should openly accept that. You're  not going to get rid of it I guess. But like I understand where he's coming from where he was like yeah,  I was the Twitter guy. I got my big following there. But it was always he was roasting people  sarcastically and he was always engaging with fans. So then have this percentage of people who are  just being fucking really mean. I think he's fine to be like yeah, Twitter's like there's parts of it  that really, really suck. You don't think that him not winning for like 900 days has anything to do  with the fact that he's like mad about the perception toward him on the online. I think it's I think  it's certainly both. I there's no way it's 0% but I'm saying like listen the internet's not getting  any better. I think we would all agree with that in terms of like the bad parts of Twitter.  So I think we're getting to a point where we've all just accepted the line of like yeah,  there's parts of it that suck. When those parts really do suck and they're like yeah,  like yeah. So I don't like to blame Max. Like he's in a bad spot. Obviously like he has been  playing that well. So clearly the negative messages are going to hurt him more than when he was on  top of the world when in Riviera. So he's going to have more opinions about it. I just don't  like people being super malicious and people just sort of writing an office like oh, well, that's  the internet. Those people are still fucking assholes. Oh, totally. I guess my point's more like  those have always been there and like Max never really called that out. Maybe they're just coming  at him a little bit more because he's not playing well. He's definitely frustrated. It's a snowball  effective like performance impacting your perception of the thing that you actually enjoyed before.  Because obviously his performance is now bringing out people being meaner which it's like  it's going hand in hand which I feel bad for him in that sense. Like there no one should be doing  that. It's just like when you're winning tournaments and like if you want a major and he's on top  of the world someone being like fuck you like it just brushes up your shoulder. To me that's very  human. That's very human of Max. When things are good, I don't give a fuck what anybody says. And  when I'm doing bad, I this hurts more because there's like man, I wish I was playing better.  Yeah. Yeah. I agree with that. I think it is a it is an effect of he's probably getting a lot more  negative stuff and definitely getting a lot more negative stuff in general. And that stuff just  sucks when you don't have like positive things to fall back on or going on. Whereas when you're  winning you're on the Ryder Cup team. You're a stud in the president's cup and you scroll through  Twitter. It's great. A lot of it's positive. Some of the negatives that you see you're like  whatever. I'm winning tournaments and I'm at the I'm just I'll just roast this guy real quick. Fine.  When you're already frustrated pissed off and then you go on and see people being malicious and mean  yeah, it has a different effect on you for sure. And it's like I would say like it's not the same  thing. But I don't know two weeks ago when I beat Vinny I'm all over Twitter. It's great. Last week  when the video comes out where I lose 50 grand of shoot 90 I don't want to lose I don't want to look  yeah. Like fuck that. That's just human nature. Totally. Yeah. It's kind of human nature. So I get that.  I know what you're saying. Frankie and that like you're the Twitter guy and then just because you're  playing poorly. You can't look at you can't be like now it's the worst thing ever. But it wasn't  the worst thing ever before. It was like I understand that. But I think it's a lot more of like  it's human nature. And it sucks when things are not going well when you're incredibly frustrated.  The internet is a certain corner of it. A horrible place. And you're probably just more likely to  highlight and focus on how horrible the place it is when everything's going a little shittier for you.  And so I get that and I completely understand it. I imagine when he's winning again or whatnot  I wouldn't be surprised if we see him embracing social a little bit more. But I saw a post on  Instagram last night and stuff. Some like screenshots of people sending him messages and Venmo's  because they lost their parlay and whatnot. And I imagine he's got a little bit more of like a  fuck you attitude towards all of those people right now because things aren't going as well. And he's  frustrated and that's just fucking human nature. That's why we like Matt 100% fucking yeah. We love  Max. And I've always laughed at the fact that people pin him as the Twitter guy. So I actually hate  that like even the way that I'm trying to bring it up even paints him that way because a guy just  on Twitter in our generation. Like we all just are on Twitter and Instagram. He just happens to be a  professional golfer. Like he's just interacting the same way we do with everything. He watches a show,  he tweets about it. Like Max Homa is just a regular guy that happens to just be a really,  really good professional golfer. So him being like the Twitter guy. Like why is it like  like Kim, the Twitter guy or like all these other guys now. Like Kim Michael Kim. Why isn't  Michael Kim the Twitter guy? And you know what I mean? Like it's just people who use Twitter. So it's  just like he probably looked at that. He's like what the fuck? Like how does that why I'm the Twitter guy?  That part always makes me laugh, but no, I think it's just I would love to just see Max get the freaking monkey off his off his back  Yep, just be able to just play freely and not think about it and he's doing great and all their aspects of life  He's got great family great wife. He's got great fucking merchandise deals. You see him now  All these new brands. He's looking fantastic. He actually looks good too. Have you seen these pictures of looks great?  He does look good  He's got that like Hollywood glow to him right now. He's look he looks like a famous person like Max home is getting better looking  I always laugh at like as people get more successfully get better looking, but as this podcast has gotten more successful  I feel like I've gotten way worse looking. I don't know how  People curve that on like it's always an excuse like someone  That guy and like your friend will dig well that guy's like, you know guys killing it, you know  He's probably got like a nutritionist and all these things  I'm like, I don't know man. Like I'm we're doing all right and I look like shit  Or I'm getting worse and worse and worse. I got a colonoscopy the other day  I guess getting bad, you know, I mean like did you a max looks I did get a colonoscopy the day  How bad was the like the day before stuff was a horrible?  The prep is bad, but I don't want to shy people away from trying to do it. Yeah  like it makes you  Understand why people don't want to do it and that is a shame  Because I think the prep gets such bad coverage, you know, there's so many people being like oh  But the prep sucks and you like you you keep putting it off  And I do I really want to spend a whole day on the toilet and it's like dude. It's really not that bad  You pick a lot  That sucks a lot  Yeah, sure when I was in the thick of it  Did I say to like one of my friends? I'm like I understand why people don't get checked because of this like this fucking  Blows and this like we're in the year 2025. There needs to be this is a bad barrier to entry like when you're in the middle of it  You're sitting on the toilet and you're just like god  I don't want to be doing this anymore. I'm pissing out my ass  And then like towards the end you feel pretty good about it  You're like I'm about to like check in on my body in a way that I wouldn't be able to do unless I  Fist out my ass and it's like it's it's a little bit of that, you know  You get a little bit of motivation towards the end of the night  You're like let's just get this thing done and then when you go in  You know that you're about to get answers and it's good. So yeah, everything went well  I mean I got it in Doscopy and that colonoscopy. They did the bowl and just to get I want to know  Kind of similar to what you were doing with the the stuff you don't know that would be is like you just want to know where you're at  You don't want to be sitting on something and  Yeah, no, it was it was fine  I'm so waiting to hear back like results, but they didn't find anything particularly, you know, bad or anything in there  Which was good. I'm kind of interested in the I know the prep is pretty rough  But like what do you take like pills and you you drink is something and it just cleans the out that actually sounds kind of nice to me  Yeah, yeah  I mean your stomach bubbles for like 12 hours did it's a fucking wild feeling feels like your asshole is gonna pop out the bottom  You're just like whoa, you can't constantly go a whoa and you run to the bathroom and tippy toes  And then you just just all comes out of you. It's not a fun day  But yeah, I took 12 pills at like 4 p.m.  And you have to like drink water over an hour or I can take the pills and then at like 11 p.m  I took 12 pills and that was like you're in the scary hours because you're pooping and peeing  at like 3 a.m. Right like and and the thing is at 9 a.m  So there is no sleep there. That's where it's like you're sending up the texting and like I'm not doing this again  But you were good. I came over later that day and you were fine  Yeah, try to solve me the day of and yeah, dude getting knocked out is so fucking weird  The anesthesia man is like not to be believed how weird it is like the guy is talking to me  And he's like all right in looking me in the eyes being like we'll see you in a couple minutes  Have a good sleep and I'm looking at him like I ain't gonna fucking go to sleep right now  I'm wide awake. I got my ass out right now. I'm gonna will I'm gonna win. I'm I'm dude  I can't explain the weird feeling of  Knowing you're about to go to sleep and consciously thinking about that and saying like there's no way  I'm about to go to sleep and then you wake up and you're like what the fuck  I don't like it, but you do it up. You wake up with the prior thought  Do you know I'm saying oh that's interesting like I'm waking up with like I'm awake no way like you say like no way  It's crazy. I don't like it. I've had a couple procedures done where they put you under and it's  It's a feeling that I do not enjoy. I don't have yeah, I got under four or five times over my life  This time I was different  I kind of heard a ringing in my ear and everything got kind of hot and then I was out  It was weird what do I do like to make you come backwards from ten and then you're just I just stared me in the eyes  You know, yeah, bitch  I'm good. I'm a good boy. I tried to get it. Yeah, yeah, that's what they  Middle fingers out full. I remember you have the last time that I got put under they do  They tell you to count back from a hundred and you get to ninety nine and a half and you're  90  Yeah, I tried to make a couple jokes  He's like we're gonna do the colonoscopy first. I'm like oh, I hope you clean it before you put it in my mouth  And then he's like we use two scopes. I was like all right good thing  I didn't say spit on it  That's like a doctor doesn't have  That's a humor where they're like how are we gonna use two scopes on you?  I was like all right  I really was gonna say right before I was like when should you spit on it?  You know, I mean something fucking crazy, but we're gonna have  Yeah, yeah, no, this is not a joke or saving lives out here. So definitely everybody should get it done  Oh, it's it is that it is very essential. I probably got it done a little too early  But I don't know that there is too early anymore. I agree with that. I don't know if there is too early either just do it  Why not? Yeah, I mean now I know like I should be good for a couple years whatever it might be and  Yeah, we'll see  This summer, the sun's out and so are the fresh cuts at sport clips haircut.  It's a perfect place to cool off, watch some sports on TV while also getting a precision  haircut from Stio's who just get it.  They've been specially trained to cut men's hair.  Take your haircut to the next level when you ask for the MVP haircut experiences.  This is what I always get when you go when they're, they give you the nice warm towel,  to give you the shampoo with the massage.  They cut your hair.  You're watching the game on there.  It's just a phenomenal experience.  Yeah, I got to go there later today.  My hair is getting a little bit long, but on the road for the last week or so, the app is  really easy.  Down with the sport clips app and then you sign up and then you can just put yourself  in line.  It shows you how long the weight's going to be.  So you don't have to get there right away.  It'll say, you know, 27 minutes.  So you can time it out.  So as soon as you get there, boom, you're in a chair, we're cutting your hair.  They're giving you the MVP treatment.  I love sport clips.  Oh, they're all the time and they're the best.  They actually are the best.  Well, the sport clips I got myself, you can see I got an SL2 on the side.  That's the top.  Handsome.  There you go.  That's great.  Nice little haircut up there.  Sport clips always does, it does me right, man.  Going into a fourth July weekend.  Some are coming.  Get it done.  Jumping in the pool.  You don't want that weird hair like all over the place.  You want it to be nice and tight.  I thought real good.  Jumping in, jumping out.  Sport clips.  You get to watch the game.  They got all the aromas.  It's unbelievable.  And for this summer only, you can swap out the classic hot steam towel for a refreshing  shield towel.  It's an icy alternative.  That's the perfect way to defeat the heat.  Sport clips.  It's a game changer.  Let's do a little from the gallery.  You want to take some voicemails.  We could take some voicemails.  I got a couple of other things we can go through after at the end before if anybody else  got anything on their list.  But I would love to hammer home a couple voicemails.  646-68-5-4717 and voicemails from the gallery brought to you by truly unruly lemonade.  Combines a high-ounce fund of truly unruly.  If everyone's favorite, which is lemonade, 8% ABV, 100% delicious.  We'll be drinking these things when this podcast comes out in LA for the bar school classic  as it rolls on for supercharged lemonade flavors.  Pumping blue razz.  OG original lemonade.  Punched up pineapple and wild pink.  The official heart salter of four plate outs.  Let's level up your lemonade with truly unruly fine, truly unruly eliminated a store near  you or visit www.trulyheartsalter.com.  Again, 8% ABV, or 100% delicious.  You're going to enjoy the hell out of them.  So go check those out.  Let's hear a little voicemail there, Jones.  Can I do my first?  Can I do my own voicemail?  Did you guys see this, did you guys see this hypothetical that was going around on 4th  of July between Joey Chestnut and Usain Bolt?  Have you seen this?  Come across your desk?  It did, yeah.  Then this got me going.  And it got me going too late.  I had left the party and I'm in the car with that.  And I'm like, God, I wish I was arguing this with the boys right now.  I was laughing at myself.  The debate is if Usain Bolt and Joey Chestnut, both started at the start line of 100 yard  dash and they had to eat a hot dog and run 100 yards.  Who wins that race?  So wait, it's one hot dog, one hot dog and then you got a sprint.  who wins the race?  And I think Joey Chestnut might double him.  I think he gets to the fucking finish line and he starts running backwards.  Joey Chestnut, it's not even close.  Joey Chestnut, it's not even close.  Joey Chestnut, it's not even in less than a second.  You say in Bolt, if you're telling me he's going to do the ahh and show when it's gone,  it's over, bro.  That's just not getting down for a minute.  Right.  So the discussion becomes, so how fast did you say in Bolt run 100 meters?  It was like 9.4 seconds or something.  Right.  How long?  What's that?  I was saying yards.  Oh yeah, 100 meters.  So how long?  9.5, 8 seconds, Trent Denny.  Wow, it's pretty close actually.  And that's unbelievable.  He's just, and it takes like if you eat a hot dog, if you just eat regular hot dog  and bun and you're not Joey Chestnut, it takes a good amount of time.  So as long as Joey, Joey, Joey, Joey, Joey, Joey, Joey, Joey, Joey, Joey, Joey, Joey,  is going to eat that hot dog in the blink of an eye.  It's gone.  It's already gone.  Yeah, I agree.  I think it's Joey Chestnut's time to close because also don't get me wrong.  You're saying Bolt's going to crush Joey Chestnut in the run.  But even one of the slower runners, if he's just a normal human runner, he doesn't lose  by like an unbelievable amount in 100 meters.  It's only 100 meters.  Like he's still running in like it's, it would be like 15 seconds.  Right.  That's what I do.  So it's like we're talking about a five to six second difference in the hot dog.  It would take him forever to eat that hot dog.  Even right, even if, all right, so when you regularly to hot dog, obviously you're  pretty casual about it, you're not racing Joey Chestnut in 100 meters after you eat  it.  But if you try to eat a hot dog and a bun really fast, as a person who's not Joey Chestnut  again, I don't know how fast I could do it.  It would still take me like 45 seconds.  I think the gap in hot dog finishing is way larger than the gap in running, which is insane  to say about Joey Chestnut and you say in Bolt, I think it's that impressive how fast  he can eat.  I think it's more impressive how quickly he can eat hot dog than the fastest runner of  all time can run the 100 meter dash.  I agree with that.  You are right, those the gaps that you laid out, they are so different in Joey Chestnut's  favor that he would win.  The crazy thing too is, and it might not happen, but like we are living in a world where  this could, they should just do this.  They should do this.  Like I understand that you saying Bolt's not in his like prime prime anymore, but he's  still super fucking fast, I would imagine.  And Joey Chestnut clearly still the goat.  So like, let's run this up.  Let's do it.  He would eat that hot dog.  So fucking fast.  It would blow your mind watching Joey Chestnut.  He'd be 50 meters already and he'd still be finishing that hot dog you say in Bolt.  I think Joey Chestnut would do the 100 meter dash doing hands, like doing cartwheels and  he would win.  Correct.  just the same clothes, so my opinion, it's time to close.  Because then people are going to be like, oh, well, what if you say  does the same stuff as him where it's like, he eats the, the wiener and then dips it in the water.  It's like, these are all things that Joey Chestnut are so good at that. Even if you say  bolt like, does tries to do it, he's a thousand times faster. He'll be chestnut.  We're talking about something running that everyone could do and talk about hot dog eating  and speed levels. It's just a whole new skill set that nobody like he doesn't know how to do that.  And he just, I can run. You can run faster than I can, but like I've been running since I was  uh, 10 months old. Like I could just run. It's a shame I saw this at the end of fourth or  like, because there's so many, like I would have loved to get the boys going on this. And then also just  doing it ourselves, right? Like someone eating hot dog, seeing how long it takes and then running.  Yeah. Like we could have been doing this all weekend long. I was with them all weekend long from Thursday  Sunday to Sunday and I didn't bring it up once. It's a shame. Yeah. I would love to know the times,  like the range of times. Because you think Joey Chestnut's going to be max 17 seconds to do all that.  Yeah. So like what would I do? How would I do? I think I don't think I can eat hot dog that fast.  I don't think I bring a minute total when this whole thing. Yeah. I'd be close.  By the time I'm done swallowing it all, I think the fastest a normal person could do it would be  like 30 to 40 seconds. You shove the wiener all the way down. And now you've got this huge  clump of just bun and you're just dipping and you're like chewing and you're laughing. You can't  get your coughing up. You can't believe how much bread is there. And Joey Chestnut's gone. He is.  He's running backwards. You don't happen to have any leftover hot dogs and buns at your house, do you?  I probably have a hot dog bun downstairs, but I was thinking, I want to watch you. I want to watch you.  I want to see you try to do it. Never. That's okay. You can get one. We can get one.  Go and I don't know. No, no, no, it's okay. Because I'm just curious. The regular person eating  a hot dog like that. Like how long does it take? I have no idea how fast because you get a hot dog  prepared right now. You know, you let's go to the voicemails. I'll see if it's even possible.  Because we could just like, we could guesstimate the running. You know, it's probably going to take  you 15, 16 seconds or something. The hot dog is the important part for us. Is your hot dog  make a phone call? 10 seconds is a minute and a half. I have no idea how long it's going to take you to  break it. It was hopped on the phone. Like he was like closing a huge deal. He's like,  we'll see how we can get this hot dog going. Let's do another voicemail while he's here.  How far would it take to get a hot dog made here? Is that possible? I guess you could get a hot dog.  The old hot dog. Oh, we don't have hot dogs. Oh, all right. All right. All right. All right.  That's what we'll be doing. All right.  That's good. Imagine, imagine being in this life and you're married to Frankie Brellie.  And you just had you got an eight week old kid and you get a call. And the question is,  we got any hot dogs. How's that baby doing? What's going on down there? Monday 1225.  All right. Maybe the next show will do the hot dog. Yeah. I think that's right. All right. What are the  voicemails we got? Hey, how's it about? This is Ecla from Halle, he's a Hawaii huge fucking  fan of the program. Hey, I got one question for you. Have you guys ever had one dream where you're  like in a living room or some enclosed space? And you try to hit a golf ball out into the open.  and you have all these people watching. But whenever you try to swing, you don't get one enough room.  So you re-key the ball so it could different area. But every time you try to take a club back,  you don't get enough room. So you're just picking up the tee and re-kying going from place to place,  trying to find one place where you can just swing and smash the golf ball. But every time you just  don't have enough room. And this happens over and over until you wake up. I have this dream  every once in a while. I think a lot of people have the same kind dream. Wondering if you guys  ever had this and wonder, you know, what it all means. Anyways, hope you guys are tuning.  If you ever come into the back of the island, you know, we love you guys again. Aloha. Cheers!  I love that guy. I love that guy. I just finally even watched by the way. I spent two weeks there  after I graduated high school. My buddy's family is from there. It is the most beautiful place on  planet Earth. It's paradise. It's on the North Shore of Oahu. If you ever get a chance to go there,  anybody jump at it because it is a great place. It's amazing. It's amazing. At some point,  I want to go to that place and I want to see that man because it's an awesome call. Yes,  the answer is yes. I think we always have. We've all described different versions of a very  similar dream. We got to get a psychiatrist on this show and have them break down what they think  that might mean for each of us. Because mine, I've described that I'm like in the masters  and I somehow am on the first tee and I can just never tee off. Like something's always wrong.  It's like, like he just described. I either tee it up too close to the tea marker and then I'm in  front of the tea marker and then my foot's hitting the tea marker and then there's like a violent  storm comes through. So everybody's like, take cover and then like the group in front of us, we thought  that they were gone, but they're not. So like I have to pull off right when I just never get to  tee off ever. It's scary how similar all of ours are because it's got to be super common. I don't  know what that is. Maybe it's this. Maybe this thing is a frickin simulation and that's just like  hardwired into our brain of us like not completing something and we all share the same kind of  dreams. But no, I have two of them. I have three of them that I rotate through and it makes me  sick to my stomach of this guy even just describing how similar they are. Like I'm legitimately  at like a family party and someone wants to see me hit a drive and I somehow have a quote on my hand  and I'm like, all right. And then like I can't get it done. Like he's saying like you got like,  like I'm always hitting the back wall and you like move forward.  and now you're still hitting the wall and then you wake up or there's one where I'm a waiter  and I can't get the food to the table. No matter what, I just can't do it. I keep going there  and there are like where's the food? I'm like I don't know. The kitchen didn't have it. You just  can't get the food to the table. And then the third one which is way more common for me than the  golfing, which is bizarre, is I've been asked to play for the islanders. They've asked me to fill  and I walk in through the same doors of this huge arena back door and I'm in this locker room and  I can hear the islanders walking out into the ice and I can't get anything on. I'm complaining that  I don't know how to put the pads on and I'm nervous that they know that I can't get them on.  I've never once got on the ice and I'm telling you I've done this a thousand times.  I've never made it out of that room. I've like walked around with a bag over my shoulder doing this  is so vivid. Like I walk in with like a big hockey bag over my shoulder. I've never played hockey in my  life. I play roller hockey for like six months. I have this vivid dream of me being at the  Coliseum like ready to go out and I can't get out. I can't do it. I cannot get out on that ice.  Never once ate it on it. I definitely had dreams like that. It's got to get a professional.  Do with yeah. A professional dream reader, somebody like that because it's got to have something to do  because when you're putting the tee in the ground and you're putting the ball in the tee,  that's when you're your most nervous on a golf course. I feel like so it has to,  there has to be something in your brain that is replaying that moment for whatever reason  and I would love to get an answer from somebody who knows. So it would be great to either write in  or have them call into the show. I think that there's going to be thousands of people listening  this show that have had a nearly identical dream and I'm with you Frankie. The the similarities  with which he just described that is stunning. It was like I was asleep again going through it.  I have the same deal with hockey, but I kind of know where that comes from. It's just like wasted  talent and I just like what could have been kind of thing. And so I've had that's like my other  recurring dreamers and I'm always finally in the game scoring goals playing well, living out where  I always thought I could have potentially done and then I wake up and none of it's real and I'm  reaching being like, ah, how did that happen? The golf one is stunning. How similar that is to all of  us. So yeah, there's got to be something to that. Do you think they'll ever figure out how to have  us become conscious in our dreams? I saw something recently where there somebody came up with a  device to like video your dreams or like record them and I don't know how real that was.  Those were one of those things I saw on Instagram and I just kept scrolling. I didn't look into it.  But well, then there's also the people who do lucid dreaming where they know the fair in a dream.  And it's something they've practiced. I don't know what it is. That's crazy. Our boy owes the  mentalist. I saw him talking about this on a podcast. I was, it wasn't with Rogan. It was with some  other group that I was watching recently. And he was talking about how you can train yourself to do  this so that you know, you it's almost like with the top in inception to some degree where it's like  you could come up with ways to teach yourself to know with lucid dreams when you're in a dream.  I guess there's some like severe issue with that that can really lead down some like  dark tunnels. He was kind of talking about it. Like you start to think it starts to blend together.  He was saying it's like hypnotism basically. It's not it's not all that different than the  practice of like hypnosis, but you have to be open to it. Like he was like people that people that  are abrasive and don't think that they can be hypnotized can't be hypnotized. People that are like  open to it. Wow. You can hypnotize and it's similar with like lucid dreams in some way, but he was  talking about that. And that's why Jesus Christ because you always, we all test when you're in a dream  to your own knowledge of testing it. And it never, you know, you never think dreaming and then you wake up.  The weird that that's the weirdest thing about dreams that I really don't like is that when you're  in them, everything makes logical sense. And in none of it makes sense once you're out of it.  And that freaks me the fuck out because it's like how often does that happen in all the time to  everybody? So dreams are very, very interesting and it'd be great to have somebody on who like has  a little bit of insight into that. It's a really good call, man. That is a really good call.  That was a great call. Love that guy. All right. Last couple of things I've got real quick is just  we're about to enter the the links golf stretch. We got a couple of weeks coming up. Talk about it  a little bit. But we got Scottish open at the Renaissance Club, which is near North Barrick. It's near  Merefield. Pretty iconic part of Scotland. Just I believe just east, I think of Edinburgh. And then  we'll go straight from there. They'll buzz over to Port Rush. And we got the British Open. So next two  weeks, you're going to get Scottish open has a great field. Scotty Rory, Tommy Collins, Xander, JT,  he's loved a bunch of guys playing in Scottish open. And then like I said, head right over to Port  Rush. It'll be a home game for Rory, home game for Shane Lowry. They just put a video of him  returning to Port Rush. He obviously won there in 2019. So there's a cool video on YouTube of Shane  Lowry. If that wants to get you geared up, you're going to be hearing a lot of, you're going to  be seeing a lot of social clips, a lot of the guys that are playing in the Scottish Open. I'm sure  we'll go take like a little twilight spin at North Barrick because it's sort of this like iconic  old school course. There's like a wall that hit over there. It's on my top five bucket list courses.  I would love to play as North Barrick. And they have a good social account on their Instagram.  They always post all kinds of clips from whenever people stop by and play. So you'll be seeing a lot  of that stuff. So get ready for Scottish Irish golf. None of us ever played. Do you play any golf when  you're over there? Frankie and Ireland. I know. I know. I know. We played at, now we played at Ashford Castle.  We just did a nine hole thing. It's where Rory got married and a bunch of pro guppers.  There's photos of them all playing this little nine hole executive course right there on the water.  amazing. It was a lot of fun. My dad and I went out there and I got the play. They had  tell her to make clubs waiting for us at the first tee. It was like the best. It was the  best experience ever but didn't play any art like Troy or a golf. It was a little bit more  parkland. So number one spot when I tell people I haven't been that they can't believe  that we have it. It's to play golf in Ireland. So we got to do that. But it'll be focused  level over the next couple of weeks with Royal Port Rush and the Open Championship and the whole  deal. So folks get up here up for that. Otherwise, I got to all I had on my list, gentlemen.  Anybody got an answer? I think you know. I don't got much. Great. Well, we'll throw it to Maverick  Mealy to kind of round out the show and then once again we'll be back Thursday. We'll keep ripping  all the way through the Open Championship. So we got a couple big events. Enjoy the week. We'll see  you Thursday. Hit it hard. It hard. Pro golfers as they say drive for show and they put for  dough the easiest way for you to make some dough betting on this week's tournament at Draft King Sports  Book from the opening round through the championship Sunday Draft King Sports Book has you covered  with live betting player props and so much more. If you've never bet on golf before, it's  easier than you think. You just pick something quite simple like a golfer to win the tournament  and make your pick. Here's something special for first timers. By the way, new Draft King's customers  bet five dollars to get $150 in bonus bets instantly. You know, a couple big tournaments left here  with them going overseas. Then we've got the playoffs coming up so you can still get involved  with betting on golf. And again, it's easy with Draft Kings. I went to the Metzie Yankees game on  Saturday. Not a fan of either one of those teams just wanted to go to a ballgame and I bet on  Ben Rice to hit a home run. It did not end up happening. But it's just fun. You're like, you're on  the train going to the game and you're like, how can we make this a little bit more interesting. Boom.  You put in a propet like that. One guy to hit a home run. You can, you know, they got everybody on  there. So it's just, it's just fun, especially if you're watching something that you're not  necessarily a fan of either one of the teams or any of the golfers, but boom, you put a little  money on it in the Draft King Sports Book and it brings on a whole new meeting. Yeah. I mean, if you  look at the Open Championship, obviously a couple of weeks away, but you got Scotty Schuffler plus  450 as the leader right now. What's happening with that? What's coming with 2500? I'm about to  come on. I'm betting that. You got Brace and Chambo plus 1800, John Ron plus 1200, Rory McRoy and Scotty  the only guys at 450 and 700. So it's obviously a little early. They're all going to play the Scottish  this week. But I like comedy fleet with right now for doing early picks. Oh, yeah. Oh, yeah.  Had that taste. He has that anger. Right there. That drive. He's got that Rory McRoy drive. We  talking about chip balls, hitting balls into frickin into walls that have no yardages on him.  Maybe he's doing a little bit of that. And maybe Tommy Fleet would sick of it. Maybe he's just had  enough of it. He's taking the piss and he's right or rock. Oh, he says his back. Like he might just be  Tommy Fleet would might be just rolling now. Thanks. You download Draft King Sports Book app now  used to code for F.O.R.E. That is code for new customers. Get $150 in bonus bets instantly  when you bet just five bucks. Only on Draft King's the crown is yours. Gambling problem called  1800 gambler in New York called 877 8. Hope and wire text hoping why in 467-369 in Connecticut  help is available for a problem gambling called 888-879-7777 or visit ccpg.org. Please play  on behalf of Boothill Casino and Resorting Kansas 21 and over age and eligibility varies by jurisdiction  void an Ontario bonus bets expire seven days after issuance for additional terms and responsible  gaming resources cdkng.co slash audio. All right folks, we're joined by the 16th ranked player in  the world who's had a hell of a last year on the golf course Maverick McNeely first time on the show.  Thank you for taking the time. Yeah, thanks for having me. Last fall, I believe. So a little less than a  year ago, you know, you're kind of hovering outside the top 100. I believe you're kind of, you know,  getting together with your team and not really happy with where you're at. We and then and now,  you know, you got I think four top five since February one last fall. You got a lot of people  chattering about getting on that rider cup team. What's been kind of the change over the last  nine months or so? I don't know how to get stuff. I mean, yeah, a year ago, my best ever world ranking  was 57th and I was outside the top 100. Did a bunch of really good things. A lot of  credit to my swing coach Scott Hamilton. You know, basically going from underneath stuck under the  plane, hitting a lot of blocks and hooks to on top of it, hitting more cuts. I hired my brother  scout as my tatty, which has been a lot of fun. He's been awesome. We're having a ton of fun out there.  He's working really hard and doing great. And really, you know, my wife's been traveling with me  the last year and a half, which has made a big difference. You know, really different than  sitting alone in a hotel room and and having your best friend out there. And you know,  doing a lot of good things. It's it's like my best friend at my wedding said, you know, it took  nine years to become a quote overnight sensation. I wouldn't say that. But, you know, it's just a lot  lot of years of work have kind of started to pay off and like, I'm really happy with it.  Golf is such a kind of finite sport when it comes to the fine lines. And, you know, you can feel  like you're close and then get out there. And as anybody knows in competition in big moments,  stressful moments, whether, you know, that could be for anybody playing for a club championship or  playing in front of a group behind number. You guys playing at the highest stakes. A lot of it is  about comfort. Do you feel like you can attribute a lot of sort of just playing as good as you've  played professionally as sounds like again. Your wife's on the road. You got scoured out there. You  just feel more comfortable day in and day out. Totally. Yeah. I, you know, a couple of years ago, I would  be.  mentally and physically exhausted, leaving a road trip and I just couldn't wait to go home and see my family, see my friends,  then everybody, but now I kind of have that group on the road with me and  it's a huge difference.  You've been able to wind down faster because you play at a level up here and the faster you can wind down and actually start to relax.  You know it charges up your battery faster and you're burning at less.  That's huge, huge difference.  It was nothing like home and I'm home 15 to 17 weeks a year so you kind of have to make the road a little more comfortable that way.  So do you feel like with the name Mav that you were sort of obligated to get your pilot's license?  Yeah, I kind of doubt here that a lot.  The whole Where's Goose or Top Gun?  I hear that every day, but I've always loved airplanes, but I kind of forgot about it until I was paired with George McNeil in the 2022 3M open.  And he flew himself on tour for 20 years, probably one of the coolest guys that ever play on the PGA tour and I just started asking him questions about flying.  And after that round, I booked my first training flight at a local flight school in Vegas and now I've got my own little single engine piston series and fly a bunch of places to play some fun golf.  What's your limit?  How far can you go to really fly yourself to wherever you need to be?  The planes limited to a thousand nautical miles, but loaded up with people and bags.  You're kind of, you know, I try to limit to like two to three hours in the plane because there's no bathroom and at that point it gets to be a long ride.  But my real limitation is I just play a lot of tournaments and I don't get to fly a ton.  So when I was hurt for six months with the shoulder injury in 23, I did my instrument training and I was flying several days a week and was doing a bunch of solar flying then.  Because I just felt like I was sharp and I haven't flown in five weeks now and I would definitely not get up in the plane alone.  First one back cold turkey.  So hopefully this offseason all get to do a little bit more fun flying.  What was it already flew himself a lot didn't he?  He did.  He had a lot bigger and faster planes than I'm flying right now.  But yeah, it was pretty cool.  He usually had a co-play at fly with him, which I think it's great.  It makes it a fun experience, not a stressful experience if you need to take a quick break or a rest or just have another set eyes up there.  It's great.  But for me it's my escape.  It's what I don't want to think about call for anything else.  I just get up in a airplane and you have to be focused on what you're doing.  It's got to be pretty stressful man.  I can't even because you know we look we're not exactly like you guys.  We take a hundred flights a year each one of us jumping around film and going to events hosting events whatever it is.  And you do think a lot when you're taking an Uber to another international airport to check bags and wait another time.  You know, even if everything goes smoothly, it's still another couple hours added to each day.  Just the logistics of having to go through the commercial and all that.  So I've thought about I've seen some friends you know over the years you just kind of accumulate friends on Instagram or whatever that I see.  They're starting to I'm like, holy shit.  This person's like going through flight training and now this person's flying like six months later.  Whatever. I'm like, oh my god.  But I just feel like that would be too much stress on me to be like I'm in control of an airplane.  I kind of do it where I'm not stressful.  You know, they say there's old pilots and there's bold pilots but there's no old bold pilots.  So really just fly within your limitations.  You know, I know if I haven't been flying much lately, I'm just going to take a safety pilot with me and make it a training experience.  You know, have them throw like a fake emergency scenario in there just for training or something like that.  But for me right now it's like how do I turn a four to 10 hour drive into a one to two hour flight.  That's like my sweet spot.  I'm not really using it to get tournament to tournament.  Just based on the speed and the size and the limitations of the plane and also just fatigue.  Like yeah, I don't want to get out of the final group on Sunday and then have to do a weather briefing, a preflight plan, a flight through weather.  and all of that that's pretty mentally taxing.  And, you know, I'd rather leave that up for the professionals at this point.  But maybe, you know, after golf, be able to level up a little bit and fly a bunch and do some fun stuff with my family's kind of the dream.  So just building hours and experience till then.  Yeah, it's very similar.  I got a buddy Dustin who's one of the only people I know who's got a similar plane.  And we did like a golf trip one time.  I think the San Francisco area in the next day.  It was like foggy, not ideal weather.  We had a couple of drinks a night before and he was like, this happens occasionally.  It sucks.  But he's like, I gotta get back to, you know, Southern California or something.  He's like, I'm flying commercial.  And then next weekend, I'm just gonna have to fly back get my plane and do it when there's good weather.  Absolutely.  I mean, that's the way to do it.  Make it fun.  Don't make it stressful.  And, you know, I'm sure you saw like the view from the front seat is so cool.  It's so fun to be involved in there.  And it's like the most fun video game of all time.  So I'm really, really fortunate to be able to do that.  I'm really fortunate that I got set up with a great flight school with really good instructors.  And to fly really good safe planes.  Like the serious plane that I fly, the entire airplane has a parachute.  So when you're flying a single engine piston plane, it's really important to have that kind of backup  that if you have an engine failure and there's nowhere you can safely put the plane down.  You just pull the handle and the whole plane goes down safely.  So me flying with my wife and my family, that's that kind of safety and backup options really important to me.  Very cool.  It's very cool that you do that.  Like I said, I don't know that I could handle it.  So I'm impressed that anybody that can.  I know you had spoken quite a bit about, you know, last fall when your big goals was to get into the masters.  I believe you said, you know, watchin' Scotty Sheffler's victory and you're kind of upset that you weren't there.  You didn't have a tea time.  Now, you know, you've played the masters at three major championships this year.  I would say, comparatively, we've done pretty damn well in trending in the right direction.  What was that first master's experience like?  It was like training.  from the firehose to be to be honest.  It's amazing how much local knowledge there is around that golf course versus any other.  Everything from, you know, the first time I played it was like, where you were, the course  brings your eye is not where you want to hit the ball.  And a lot of the times you're playing the ball to an area that looks bad, but actually  plays okay, the lies around the green were very different than I expected.  I expected super firm tight turf.  And what we actually got was slightly into the grain a little bit kind of ball sitting  down lies where you kind of didn't have that high spinny auction.  You kind of had to play a back in the stance bumper into a hill and then even, you know,  I think of the first time I went for the green on 13.  I missed it left to that front right hole location and you know, putting it through that  into the green.  Rye grass is so slow.  Like I never could hit a pot hard enough through the fair fairway, but I was worried if I chipped  it and flew it onto the green.  You're just going to run straight into the creek.  So a shot that I want to learn for next year is just that bump and run seven wood that  kind of gets there with a little more energy through that grass.  So a little thing like that.  Well, I feel like he hits that shot a lot.  He loves that one.  Yeah.  The best best guy I've ever seen of that shot is Charlie Hoffman, like I was deadly with  the five wood around the greens.  I like that.  That's awesome.  I feel like that whole week anytime we talk, you know, they have that they love to harp  on the fact that, you know, there hasn't been a first time winner in forever that it's  extremely difficult when you're out there.  How much of that you think has to do with just even all the hoopla of the fact that you're  at the Super Bowl of golf.  Totally.  And in the first master is you want to experience everything.  You play the part three contest.  I did that with my wife and I was like one of the most fun days ever in golf for me.  You want to go play a bunch of practice rounds.  You want to go to the merch tent.  You want to kind of explore everything there is to explore around Augusta.  And that is it was really fun.  I was really excited to get four tournament rounds in out there and see how the golf course  actually played on Saturday Sunday.  See some of those pins and hit some of those shots.  How different do you think the course felt kind of Saturday Sunday?  The energy was one thing.  I mean, every every of the masters is awesome.  Saturday Sunday and being out on that back nine hearing the roars and the groans when,  you know, different scores were posted around the golf course is one of the coolest things  ever seeing how some of the greens firmed up and others didn't.  And some were, you know, faster and some some pups were kind of slow was pretty eye opening.  Like that 17th green was one of the fastest greens I think I'd ever put it.  I don't know if it's because it's up top and dry or, you know, a little firmer.  But if you go back and watch some of the covers this year, there are a lot of three pups  on that 17th green.  6 7 feet by 12th green historically a little slower.  The 15th green was rock hard.  That thing was so firm.  It was one of the new greens this year, which, you know, I mean, that area shrinks up so  much when you're in a slightly into the green downhill lie with a lob wedge trying to land  in this little tabletop.  So just things like that that I put in my book to take next year are great.  And, you know, there's so many angles.  Like every par five, there's no bunker in the layup area.  And there's a, you know, minimum hundred yard wide area that you can lay up in.  So, you know, it's one of the few golf courses on tour where you're actually shading one  side or the other and like how you play the right pin on number two versus the left pin  number two.  You're aiming, you know, 80 yards different spot in some, some scenarios.  So it's really interesting golf course.  Yeah.  That is, it's funny to hear.  It's always interesting to hear people talk about playing that course, being there  in the tournament time.  And I know, you know, I had read a few things and times that you had talked about, you  said you were watching some old YouTube footage even to try to like get that knowledge.  And then when you're there, I mean, it feels like it was still quite different from maybe  what you perceived even doing that kind of research.  Totally.  Like another interesting one is the back left pin on 16.  So the first thing Scott did is he put some balls in that bunker and just we picked  up to a spot on the slope that I just hit the bunker shot to and usually short side of  bunker shot pin three off the edge.  It's odd of a bogey, but there it's almost you're trying to make it because you just  put it up in the back slope and it comes back.  So kind of convincing myself of those counterintuitive spots, you know, hitting shots, like  like one of the most fun shots I hit was the foreign on Sunday back right pin on two.  I hit it to four feet and missed the four footer, but it was still really cool to hit  that four and see a curl in there.  That was another thing that was hard is how far outside the hole you have to start some  of those shortcuts.  Like it was just really uncomfortable for me and something I want to practice before I go  back next year.  But like when you're hitting a three footer and you're starting it two balls out left,  it does not feel right.  God, I can't even imagine especially in that environment.  You're probably you know, hyped up and earlier and you've been and those misses.  I mean, you know, you miss a green with an iron or whatever.  It's one thing, but you miss a short one.  you know, in your head, you're like, that was harder than a lot of 10 footers, you know,  mentally you're just like, how are we going to get over that?  I do want to get into, you know, we're about to enter a link skull phase of the year,  you know, we've got Scott is shopping.  It's going to go, we're going from talking about, you know, to Augusta and, you know,  hitting over water to rock cart greens and trying to stop it on the, you know, now we're  going to be for the next few weeks after this week.  It's going to be, it's Scott is shopping.  But you have to, how do you try to gear up for kind of the links golf, a change man?  No, he's played the open championship for what's kind of your, your mindset going in  and getting ready for this couple of weeks.  The links office fund, the way you control distance and direction is so different because  the wind is so much stronger and heavier.  Um, yeah, in the States, you're controlling distance with speed and sometimes with shape,  but over there, you can have so much wind off the right that you're like, I can make  a six-iron.  or a seven iron work depending on how I flake that ball in there.  Even with the same type of swing,  it's really the lag putting Olympics  because every area around the green plus 10 yards  is a putt and you're putting up it over something  and putting with wind, you know,  a little wire stance, probably a little more hit  in the stroke than normal slower greens.  It changed your mindset with fairwood bunkers.  Yeah, those are almost water hazards  as opposed to just normal,  like sometimes you do normal tour event,  you'd rather be in the bunker than the rough  because you can actually put spin on it,  but kind of plotting your way around there.  It's more three errands,  but really you don't hit the ball as low  in my experience at least as you might think.  You see those really cool stingers,  but the thing is the fairwoods are so firm.  If you hit one with a 30 foot apex  and it runs 150 yards,  now there's 150 yards worth of bunkers that are in play.  So it's really about kind of controlling the shape  to make sure the ball's feeding down the right corridor  and you can eliminate as many of those hazards as possible  as it is just like hitting it out of the wind.  You mentioned sort of the lag potting  and it's, you know, you got to hit it a little more.  Have you experimented at all?  Sometimes we've seen guys put lead tape on there,  putt are you experimented with any kind of tweaks like that?  I have experimented way too much with the pudding.  I had the same putt for about seven years  and I kept, you know, I changed putt  for six, five or six times in the last year,  kind of trying to find a feel after changing golf balls,  change it with softer golf balls,  trying to find a feel.  I just went back to that old putter.  There's nothing like the old trusty.  So I'm very, very, you know,  or going forward going to be very loyal  when it comes to that feel.  Because you just build up that feel  and that touch with the same look and the same shape  and the way it swings and everything.  The hit is a little bit more reactionary.  So when it's slower greens,  you know, kind of a long flowy stroke doesn't work as well  when you're getting buffeted too by the wind.  And sometimes you have to react to a wind gust, you know,  if you feel a strong gust off the left  and you're hitting a six footer,  you have to pull it just a little bit  to try and keep it on mine  because that wind gust can blow it a full ball.  So there's definitely a little bit more reactivity  in the putting over there than there was in the States.  Kind of like, you know, right now we talked about  going into the masters in Augusta, Washington.  You do any of that type of research prep going in  or do you kind of, you and scout you  and your brother kind of chop it up over dinner yet  or you kind of just relax and for a week or two.  Scaz just told me to hit a few more three irons this week  and seven was because about 158 paxes in his game over there.  But no, no, we'll see when we get there.  I think the Scottish is gonna be a great precursor  to the open one to get on the time zone.  I'm in Pacific time.  So it's gonna be an eight hour time change  and just prepare for maybe having that 650 AMT time  on Thursday.  I'll do that.  I'll hit a bunch of short game shots.  I'll pay a lot of attention to how the numbers are going.  But really, you know, I played, I think nine out of 13 weeks  and this is my second of two weeks off  and then playing six out of seven to finish the year.  So I'm staying sharp.  I'm playing, you know, most playing 18 holes  just about every day.  But this is, as the hat says, I'm out of office this week.  I'm hanging out with the family and trying to recharge  before a pretty big push here at the end.  So, you know, speaking of pretty big push here at the end  in Riviera, you and JT had a nice little back and forth.  He was commenting on essentially high.  I think you would have beat him nine and eight  after being one down through one hole.  You had a great response just saying, you know,  having a team like that in New York.  This fall wouldn't be the worst thing in the world.  Your, I believe, is it 11th?  Maybe in points right now.  There's a lot of chatter.  There always is people are kind of starting to ramp up there.  Their thoughts, their takes on who should be on the writer,  cup team, you know, have you done any lobbying?  Have you heard much from Keegan?  Because I imagine in the last five, six, eight years  or whatever it's been feels like with all the international teams.  There's a lot more kind of pre-writer cup week,  camaraderie.  There's more like dinners now, even six months out.  And there's getting fitted for clothing  and you kind of talk about people looking into that.  What does that mean?  So what's kind of your relationship  been with Keegan with sort of where you think  you might be at with the writer cup team?  Keegan's an awesome job making this something  that's in the forefront of all of our minds  starting in February.  I mean, this has been on everyone's radar that early.  And I think you can see how many guys are starting  to play well and make a big push here at the end.  Some of them everyone wants to do.  He's made it a point for kind of the more experienced guys  or kind of the locks on the team to reach out  and spend a bunch of time with guys who haven't been  on the team before and have a chance to make it.  I think you're seeing a bunch of guys  playing really good right now, which is exciting  for the US team, a bunch of different skill sets.  The dinner that's trueest this year was really cool.  Keegan kind of talked about what the writer cup means  to him and what it means to New York and everybody.  And it'd be great to make the team,  but it'd be even better to win a lot of points there.  So the goal isn't to just make the team.  The goal is to put up a bunch of points.  So that's ultimate goal.  Let's dial in that putting.  Let's make a lot of good 10 to 15 footers  because that's really what swings the momentum over there.  Drive it really good because that's what Beth Bage demands  and let's go in that school and that thing.  I love that. I love that attitude.  Yeah, it's true.  You don't want to just get on the team.  You want to win some points for that team.  We need it. We need it.  We need it. It feels like that's going to be wild, man.  That whole setting up there is going to be as intense as it gets.  This is one, we've been doing this show for eight plus years now  and I feel like six years.  ago, we started talking about Circle in the calendar being like, man, that, that right  here coming and that page is going to be crazy.  Oh, yeah.  I mean, you know, the New York fans will be pretty special playing front of side note.  I think it's crazy that the tour doesn't play more in the Northeast with the sports fans  and everything that we've got going up there.  But it's going to be a really cool special advance.  Cool that it's a local public golf course.  And, you know, I'm so excited that the team is looking really good.  I'd love to be paired with any of them.  If I get the opportunity and from the right guy comes September, I'm going to do everything  I can to win a bunch of points.  Yeah, it's a great point.  I agree with that about the Northeast and New England.  You know, I lived in Boston for 10 years or so.  And when they used to have the event up there, it was always, you know, go to for everyone.  It was like that time of the year where, you know, up there is pretty much, but, you know, red  socks baseball was the only thing going on, like hockey and started basketball and started.  It was kind of in the in the late part of summer.  I know the travelers championship gets about as much of that, you know, attention as anything  can get up there now and the fans are awesome.  All the players always talk about it.  But I do think going forward, you know, I know they they condensed the playoff schedule  and that kind of got rid of one of the stops that used to go up to the area all the time.  But I have to guess in the next three, five years, they're going to really try to reverse  that because I couldn't agree with you more.  It's like some of the most passionate, awesome fans that we got sports wise in the whole  country are up there and the torch is very, very rarely goes up there.  Totally.  And they love golf and the golf courses up in that part of the country are unbelievable.  Awesome.  So I'm sure that there's a huge opportunity there and I'm really hopeful we get to go  play some more golf up there soon.  And even that mystery at Liberty National was so cool.  And we got to play that golf tournament and TPC Boston's a little bit out of the way,  but still same thing.  Super fun.  So I think I think there's some good stuff coming there.  All right, Mav, well, I know it's out of the office, like you said.  So you're kind of relaxing a little bit and then gearing up for this final stretch.  So to take some time, chat with us about golf and everything.  It's great insight.  You've had just a hell of a year.  So congratulations and all the great play.  And yeah, man, hopefully we'll see you on that on that writer cup team at Beth page.  That's the play.  I'm doing everything I can.  So thank you.  Appreciate it.  All right, Mav."