" P.S. Tuesday in a little different form today on the DNBR Broncos podcast live from the  Toyota Lounge driven by your local front range Toyota stores. We are live from the DNBR  bar and we are the DNBR Broncos podcast Ryan Coney's break to my left Henry Chism to my right.  We got Deanna and you here behind the camera Zach Stevens rocking and rolling with you today.  Fellas, how are we doing on a dreary day in Denver?  Yeah, whether or not I deal had an early morning golf lesson today.  Oh, wow. Outside? Yeah, a little indoor outdoor situation.  Oh, like top golf indoor outdoor? No, it's like they have a little house that you go into  and you get some camera video stuff and you work on and you go back out to the rain.  Wow. Well, I know with that, the nothing's slowing you down the rest of the day.  Yeah, it wasn't ideal for that and then but I will say like wearing shorts every day.  You got to be real conscience of how much skin you're showing on camera.  Yeah, I like today. Just not. I think about it.  That is the worst part of wearing shorts because sometimes you look up and you're like, yeah,  not even great. That's a lot of inner thigh. It is beautiful. It's really white. It is. It's all so  white. Yeah, I did a story in college on Montana's Women's Golf Team and their offseason practices  because it's all snowy obviously. So they hit out of this big shed onto a driving range.  But then they have to go by hand and pick every ball up out of the snow.  What is it saying? Isn't that awful? Yes, like I don't even like  like when you go to like a chipping area at a practice place and then you have to like go get all the balls that you  checked. Yeah, it's awful and that's just scooping them off of grass.  Yeah, but you just walk around up there and they're like, oh, yeah. So what you do is you see these little holes  because they all like sink down into it. So what you're looking for is a big thing.  They're like, you know, you hear a little movement under the snow in the dark. My day also started  with so Lexi had to go to work early today and I was still asleep. But she came to say bye and she had  like her big water bottle. It's one of those with a straw on it and she like bent over on top of me above  me, I should say and poured water all over me while it was just like still asleep. It's a good way to wake up.  Not only is it rainy, but I just got water dumped on me. So it started with it. Did she like have it in a purse?  It's like in a backpack and so it's just like tint and just. Yeah. That was some of that before.  You sure that wasn't intentional, but did you do anything wrong last night? I don't think that she would  have supported on the airport intentionally. No, which hopefully is just fine, but we're going to leave  that thing alone for a bit. But it happens apparently you're not supposed to do that. Really. Yeah.  Huh. But yeah. I guess now I think I saw one guy on Reddit say don't actually do that and I've heard  from hundreds of people that that's what you do. Yeah. So maybe I really should be trusting those guys.  It's it's worked for me before. Yeah. Has it saved the phone? Yeah. Wow. Yeah. The phone's never quite the  same though. Because that's rice dust everywhere. I think it's more because like the, you know,  the motherboard or whatever they call it got a little fried. So according to Google AI,  which I don't trust putting a wet phone and rice is a popular myth, but it doesn't actually help  dry the phone. While rice can absorb some moisture, it can also introduce dust and starch into the  phone potentially causing more damage. Wow. Well, so we still don't know. One thing I will say  works every time. You ever have cookies. You know how like cookies over time they get dry. Yeah.  You just put a slice of bread in wherever you're keeping the cookies. They don't get dry. And then  really? Yep. Got one more for you. Okay. If your dishwasher doesn't like do a good job of  drying the dishes after they wash them, which mine is terrible. Nice. No. You take a little towel  but the towel in there and they just like close it with the towel in there,  towel absorbs all the moisture. Wow. Interesting. Brilliant. Yep. You got all the tray. Because I hate  when you're unloading the dishwasher and like the cup upside down, I'm like still has some water.  Yeah. Yeah. I just put it in the cabinet or whatever. And if you get to what it gets wet.  Yeah. But that was on the ground. Yeah. Yeah. It's not great. Our dishwasher also just struggles.  Or whenever I take a glass out, it has like this white film on it, which might just be like from  the hard water. But I always worry that it's actually like left over dishwasher detergent.  And so then I don't want to drink out of it. Yeah. That's probably just the water. Probably, right?  I don't know. People in the chapter of plastic here are there. Yeah. That's true. Yeah. I don't know  about that. So Henry, you brought up women's golf. Let's talk about the soccer for a quick second.  Peyton Manning, a part of the ownership group of the Denver Women Soccer team that starts.  Is that sort of this year? Or is it next year? 2026, 25? 2026. It's just an ounce this morning  that the sheriff is not part of this group. Let's go. It's just another thing that like solidifies Peyton  as a Colorado guy. Yep. That's my number one takeaway from it. He's literally laying down roots here,  investing in things here. And I think at this point, that's completely just sucked locked in.  He's never going back, but every little thing still feels good. Yeah. No, it is good. I think  I don't know. It's just good for them to get the exposure. It's like even the NWSL account has the video of Peyton  and Eli do in their thing. But if Peyton makes a joke on the internet, it's going to blow up. Like  people just eat that up more than anything. And so bring him into Denver's NWSL team. Like it definitely  raises the profile. You know what I just thought of? What if Peyton is the leader of the team to  buy the Rockies? Talk about like the savior that he would be. I've thought about that too. Yeah.  I wonder how much might Todd Hilton has? Could they team up? No, they need someone else. Yeah.  But they could be the figureheads. They could. I mean, it could be the Manning family. Eli, Peyton.  Yep. Archie. Maybe Arch joins, too. Yeah. Peyton and Peyton and Peyton. That would be cool.  Anyone, literally anyone. Yeah. Yeah. Yeah. Yeah. Anyone. But definitely if it's  taken, that would be so cool. I don't know. What? They won yesterday. Well, just like I said, you called it.  You never beat the Rockies nine times. No, you don't. And they're proven that four times.  Yep. And now today, Chase Dolendor's back. Oh, yeah. They're playing like 440,  again, against the Marlins, against some pictures, been terrible. Have they won two and a row this year?  Once. Yes. Oh, Mike. But they could tie their longest streak. It's not happening. I think I really like  the record 10 and 50. It is nice to look this. Yeah. Enjoy for the next four hours. No, 10 and 51  doesn't do it for me. 11 and 51 doesn't do it for me. Really probably can't be anything good again  until 15 and 55 would feel nice. Ooh. Or like, what would they, they're on it? They'd have to go five and five  for their next 10 games, which is not up. Yeah, probably not. Whether they're on pace four right now.  25 wins. I think it's 27 now. 27. Okay. Wow. Depressing. Well, it's also 27 Yankees. Most losses  ever is 134 and that was in like 1876 or whatever. All right. Um, so 162 minus 27.  So they are on pace. 135 losses. That would be the record by one. Well, that's 21 by one. Oh gosh. All right. They  need to lose. I mean, there's 150 year history. I know, but I want to blow the record away. That's tough to do.  What a depressing thing. I'm under the end of it. You want to be so bad that you said record and then  get 10th overall pick. Yeah, which is just terrible. I agree with you on all of that. But let's jump into  something a little more. Actually, a lot more happy to talk about. That's a defensive player of the year  Pat Sir Tan held his annual Gallo last night. And I don't even know if you can call it annual Gallo because he  does this multiple times a year. Um, but he has a foundation, the PS or the Pat Sir Tan, the second  foundation and he had a really cool event last night. Well, actually, here about the event and  understand where Pat's foundation is right now later in the show. But we got to talk to him for the first time  since he won defensive player of the year back in February at the Super Bowl. We saw Pat last night.  We have the interview and the Pat was asked so many different things. But let's just hear what's it been like  an off season where you're the defensive player of the year because remember when Vaughn was the Super Bowl  50 MVP, he had the off season. That was I mean, once in a lifetime for anyone in the NFL. He was doing  dance with the stars. He was every late show. It's everything. I mean, he was flying on private jets left  and right. And he was documenting it. So we got to follow Vaughn's journey. Pat a little more subdued. We  obviously saw the mural that was unveiled last week. We'll hear Pat's thoughts on that. But what's  it been like being the defensive player of the year? Defend or whatever? Yeah, it's been a busy off season.  You know, after that, you know, received that award. But this is something that I'm thankful for,  someone that I worked for. So at the end of the day, you know, coming with that comes with a lot of  expectations as well going into the season. But you know, it's just like when I go out there and  I'm like, hey man, I know. The rest were steady. So man, I know Pat wasn't at OTAs last week.  But he's the last guy that I'd be worried about like being ready for the season. Yeah. And having too crazy  of an off season where he doesn't show up in shape or something like that. That's the least that I would be  concerned about with any guy. I recently, I hear him talk. I just think to myself, I can't believe we got two  champ bailis. Having one champ baili was one hell of a blessing. We somehow got two. It's like having  John Owen then having paid money. Yeah. It is like being a Broncos fan is just so sick. And we somehow got  two champ bailis. And every time he talks, I'm just like, wow, we did it again. Yeah. Yeah. And champ should have  been defensive player of the year in O5 when what he had nine intersections or something like that. And  I think 10 intersections. Yeah. One or two for pick sixes. So he should have been defensive player  of the year. What's crazy is at 25 years old. Pat already has something that champ doesn't. Yeah. And that  is that defensive player of the year. It's it's absolutely crazy. And the way he talks, I feel like I'm talking  to a guy that's been the league for 15 years. It's just master that's as cool as the other side of the pill.  And it's like, no, he's 25 years old. The 25 and he's already had this foundation for three years. He's  already been a pro bowler for three years. He's already been a first team all pro. He's already been  defensive player of the year. It's just it's crazy. I feel like every time that that I think about,  yeah, Pat's career. I have to take step back and be like, no, he still has so much of his career left,  so much of his story is still unwritten right now, which is just mind blowing. And champs of first  bout Hall of Famer. Yep. Yep. Which doesn't. And the Broncos don't get that. Yeah, big time.  insane. Yeah. No, it really is crazy. I mean, champ head like the best season of corner back has  ever had and Pat, if you, it's crazy when you look at like champ got targeted like 77 times in that season  when he had 10 picks. Pat was targeted 55 times last year with one more game played. And so somehow  despite the fact that champ was doing what he was doing, they were still throwing him more than they  threw at Pat's or tan. People are so scared. Teams used to be more stubborn about that stuff.  All right, it didn't used to be as it is like, obviously it is now like, oh, they're not throwing at the  number one corner. I remember guys getting chances, they, you know, Darrell or Eva. So they, I felt like they all had  so many more chances. Now, if the ball goes, Pat's way won't like one time. I'm like, oh, whoa,  this quarterbacks crazy. Yeah. And all the catches he gives up. It's just because they're playing off  coverage. Yeah. It'll just be like, oh, yep, just gave him three yards and ran up and made the tackle.  Like they, you can have that. That was allowed. I mean, it's literally what he did to Jamar chase last year.  The, I think Jamar was targeted seven times against Pat had three catches for 21 yards. It's like,  you'll take that any day. And then, of course, when Jamar wasn't on in the same game when he wasn't on  Pat's or tan, he had like 80 yards. So he finished with over 100 yards in the game, but not when going up against  Pat, there's also one more stat that has not been talked about enough with how good Pat  certains year was last year. And I want to tell you about that after I give a shout out to our friends  over at UC health. They've got their healthy swings, charity home, run Derby. This Thursday,  about 52 hours from now. June 5th. You can tell top of your head. 52. Yeah, because I know it's around  the afternoon. So I just sat forward to 48. All right. So thank you. Thank you. Thank you.  But they're holding their seventh annual UC health healthy swings charity event. Broncos players like  court and sat in Alex, England. Marvin Mims are stepping up to the plate at Corse Field to raise money.  UC health has donated over $900,000 to local charities over six iterations of this supporting  Colorado's with food insecurity, cancer screenings, and veterans, mental health, certain challenges.  And this year's beneficiary is the freedom service dogs, which provides service dogs to individuals  with limited mobility, young adults with autism, veterans, and first responders to help with  disabilities like PTSD, traumatic brain injuries, and more really cool event. So many Broncos are going  to be out there. We're going to be out there. We're going to be out there too. So make sure you're  just tuning in to this show. If you can't make it down there, you can get tickets by going to rockies.com slash  healthy swings. And you can check out all the cool things you see help is doing by going to UC Health.org  for more info. UC Health live extraordinary. Also shout out to Volo. I think Volo doesn't need to  be advertising anymore because everybody does Volo. Like literally everybody. No, don't listen Volo,  but everybody I talked to already does Volo. Like we were there was a weird triple birthday party that  I went to on Saturday. Everybody there was like, oh, yeah, I was playing kickball last night or like,  oh, playing soft. Like, everybody is playing Volo. Yeah. By the way, have you seen Volo Beach?  No, they put in a series of beach volleyball courts off of South Broadway and it is sick.  Oh, I actually had it for last night and I just was popping. I was like, this is amazing. Yeah,  sounds awesome. Volo has taken over. But I guess like Apple still advertises and everybody has an iPhone.  Yeah. Like there's no need or like McDonald's has advertisements, but everybody already knows.  I don't know. I guess that's just how you maintain. Tell you take it to the next level. I guess.  Hello, I'm Apple. Yeah. No, I think I think that's the only comparison to Apple.  Yeah, do it. I don't know if that's allowed, but do it. Everybody plays Volo. They've got every sport,  soccer volleyball, pickleball, all that sort of stuff, drinking games. And if you want to sign up as a free  agent, small group or full team, an all ability levels and backgrounds are welcome to join.  News code DMVR 10 for $10 off any Volo Denver League. Shout out to everyone that's tune in on  the or in the Toyota chat. Hit us with the thumbs up. If you're there, I see a comment from President  who says that was a short PS2 interview. We have nine more clips to play you. We've just been daily  dying. So don't worry. There's a lot more from that coming your way. And before we hit the next clip,  guys, just know what you're talking about. How good Pat Santan is. One of the things that I think is  really gone under the rug with Pat is he had 400 sessions last year. It tied a career high. He  had four as a rookie as well. Another throwing his way even less so that four is even more impressive.  But he had a league high 134 yards after an interception interception return yards. 134.  I feel 100 of those was on one. Yeah, but still. I mean that that's pretty impressive. But I feel like  he's in by the way. Oh, it was the play of the season. Like it bonyx made some incredible throws  which were key and stuff. Without that pat six, pick six. Pat. Yeah, pick six. The Broncos don't make the  playoffs. They might not even have a winning bracket like that. They were going to lose to the raiders right  there. And then I think back to Jonathan Taylor dropping the ball before he got in the end zone. That was  the other one that really could have changed their trajectory. If he would have held onto that,  I can't remember what the score is. Would that put him up three scores, I think? It was ugly at  that time. It was really ugly. So I think Jonathan Taylor. Yeah. That's the other one. Other turning point.  But I feel like people don't give Pat credit enough for being a game changer. They think of him as like  an absolute lockdown corner back. No one's going to throw his way. Both of those things are true. But  the other thing that's true was he is becoming that game changer. And that play, while that was a  100 of the 134 yards, that play was so important. You can't just discount that. So he needs to be  talked about as this game changing corner back as well. I feel like sauce still gets like that credit.  Oh, yes, also get people who also make plays. Not like Pat. Pat's making the big plays and  shutting guys down. Speaking of, I saw PFF put out their corner back rankings today. And they  ranked the reigning defensive player of the year as the second best corner in the NFL.  Yes, did we first? No, sauce garden. No, sauce was. Everybody hates sauce now, though. Yeah. Okay.  PFF is doing engagement farming now with Broncos because did you see what they did yesterday with, uh,  I think it was defensive lineman, uh, or interior defensive. Yeah, they didn't have Zach Allen on the list, right?  And the top 10, I mean, like, you've got to be kidding me. I think it's just one guy making those. Like,  I don't think it's like PFF is like, I think they have one guy making the list because like,  even by PFF, so sauce is rookie year 87.9 grade next year, 88.6 grade last year,  70.2. Like, he was legitimately bad last year. So I think I can't remember who it is. I think there's  one guy who's making all these. And the, some casual, some casual takes, I would say,  casual. Somebody who has not been paying much attention. Uh, bad. Yeah. Yes. You're right about Pat to  hand being a game changer. And I think it would be interesting to like talk to a keyboard or  Chris or any of the legends about this champion. I think the older and more savvy you get,  you can sense when your team really needs something and take a little more risk, take a little,  you know, maybe bait the quarterback into throwing your way to try and create something, you know,  because you can feel like, uh, a turnover here would really change his game. We're now 17. We've got  nothing going. Like, let me see if I can take a little risk here and and get us something that  changes this game. And I think Pat will get even better and better at that. This he goes on.  Totally. I completely agree. And especially when he is surrounded by even better corner backs and  Broncos are trying to make that happen with Jaday Barron. We'll get to that in a second. But let's just  continue with where he is this off season. We saw the mural that was unveiled in downtown Denver last  week. It just absolutely incredible. I think I heard it's 3000 square feet of mural for Pat  Sir Tan and he went down there. Got to see it right when it was unveiled and here was Pat's thoughts on it.  Yeah, it was pretty surreal. It was a surprise. When I got there, the mural was huge. A lot of creation,  a lot of detail behind it. You know, the inspiration was crazy. And I was glad I got to see the visuals,  and everything that was behind the scenes. You know, I met the artists and everybody that was  in tune with the dedicated craft. So I did that. So it's a pretty real meal for sure.  Have you guys seen it in person? No. I have and it's legit. But I haven't seen all of the athletes  murals because shout out to Denver in Colorado. It's seen there's been so many murals of Yokech of  Jamal. Really of the nuggets around town actually really close to us two here at DNVR. And I talked  to Argy because he's seen him all. And he's also an artist. And he said, yeah, not every mural is done well.  Especially in person. You can really tell they're done well or not. And he said, they did this one right.  It looks great in person. Just as it does in the pictures. Yeah, I mean, the picture is that it looks  really crisp, really crisp. And I think they recently retouched the nuggets one down the street.  And that one looks great too. But I just the art of creating something like this has to be so  difficult at that scale. And this I can't wait to go see that one in person because it looks beautiful on pictures.  Only beef with it is that it's like a sponsored mural. Like they have like the ad up in the corner.  And you're like, well, that's not that it kind of takes away from the spirit of murals of like we're painting on the  wall. It's like on the side of it. Like there's there's something. It's like natural and say what the other  is the artist probably got paid for his room. Also true. And it's like it's awesome. And it's great.  It's it's definitely like his or her work. Oh, I don't know. Corporateee feeling big. If it didn't have that  I would like it a lot more. It's still great mural. It no bad murals out there. It was  the most exposure that ad. I'm not going to give them the credit for it. But it's the most exposure  they've ever gotten. It was really good. Whatever money they spent was the most money that the best money they've  ever spent. And then whenever you're not looking to be our partner. Yeah. And there's competing partners. Yeah.  The opposite of what you're you're saying. I didn't even notice that there is an ad. Really. Yeah.  Every time I see it, I see the ad and I just feel frustrated. I noticed it because again,  I was like fantastic business decision to make actually. And let's hear one more thing from Pat on just  well actually many more things. But how his game can get better being the defense player that you're  reflecting on this. And he actually pointed to one specific thing, which I found interesting here. How can  Pat's game get even better. I still feel like I can always get better in my game.  You know, just even my leadership role. Being able to impact players around me as much as I can.  You know, it's just honing in on the little integrate things. I can work on the  the little details. I know that could definitely determine my game. Yeah. I'm sure there's little  details that everyone can work on in their life. But like, come on Pat, you're the best defense  player in the game. You just maintain where you're at. And you're all good. But he pointed to leadership  and making those around him even better. And to be fair, guys, he's 25 years old last season was his  what fourth season in the NFL. He was a captain last year. But you can't really expect like true leadership  outside of maybe Bonyx. You can't really expect true leadership from a guy who's older than him. Exactly.  Yeah, from a guy that's 21, 22. But now he actually isn't a place where we can point to him be like,  you are not only the leader of this defense. You should be the leader. And we can put more on you now.  Yeah. And I will say like, not everyone is wired to be a raw, you know, pregame speech type of leader.  And I definitely don't think Pat is. But I do think that his work ethic is something that everyone  can learn from. And he probably could do a better job. And I don't know whether he does this or not,  but of like encouraging his teammates to work as hard as he does. Especially when it comes to film  study and things of that nature like he can make the team better by just showing his teammates what he did  to become the defensive player of the year. Like, you don't just waltz your way into that. It's a lot of  day to day grind that I think everyone could benefit from seeing and understanding better.  Yeah. I think on the field, the one thing I still want to see is a touchdown free season. I think that would  be something sick to be able to put on the resume is going entire year without giving up a touchdown.  Some pretty short champ never did it. At least PFF only goes back to 2006. He had like three  one touchdown season with the Broncos and Pat only gave up two last year. But in no touchdown season,  I think that would be that's that's like the next thing I want to see. That's incredibly  difficult. Go to the number one. Why do you say totally? 17 weeks, but he's capable. I was going to say  just along these same lines like I talked about the same thing with Travis Hunter to Colorado. Like his  legacy will be this is what it took to win the high has been trophy. You know, you know, if you're not  working as hard as he did, what are you doing? What are you trying to be? And I think the same thing is true  of Pat, like, you just saw what it takes to win the defensive player of the year award. If you're on  this team and you're not working that hard, is that you don't want to be great? Like, you know what I mean?  Like, that's legacy. Well, how about this standard now that Jaday Beren's walking into Pat  certain is the only first round pick on the Broncos defense before they drafted Jaday. How crazy is it?  Broncos have the third best scoring defense in the NFL elite and so many areas including, I mean,  the best pass rush and Pat was their only first round pick on defense. Now, Jaday steps and not just  the second first round pick on the defense, but at that corner back spot, there's no one better for him  to learn from. And we heard it from a keep talking to Benny and the keep said he has the cheat code.  Jaday has the cheat code because he has Pat certain follow him being a zero. Have his number text him  annoy the hell out of him because you're not actually going to annoy him. Pat's going to respect  that and understand it. And maybe this is when we really see Pat's leadership come out is how he  takes Jaday under his wing. But Jaday has to be willing to do that because Pat can only, you know,  lead him to water. You can't force him to drink it now. Everything we've heard about Jaday is he is  going to be that type of guy. But this might be the best example of what a leader Pat can be. And yeah,  there is a lot of pressure on your Jaday. Everyone thought the Broncos are going off and it's in the  first round. Instead, they went with defense because they thought you were that good. Now,  it's no one's expecting to become Pastor Tan. But you'd better be darn good and you have the defense  player that you had to learn from. Yeah. That's what kills me, but I'm not being a practice last week.  It's just like just go, like get these reps and like talk to those guys. Like these are the  lows. Like, but do we know? I guess he's in town now. So hopefully he's there this week. He was in  town last week as well for the mural unveiling. That's true. Just to be fair. That is true.  And I made some calls this morning and wasn't able to find out if he was there today or not. Because  Broncos are back. It doesn't need to stop there. Broncos were back at OTAs today. They have OTA  practice today tomorrow. And Thursday, media is out there Thursday. So we'll be coming to you on  Thursday. Let you know if he's out there. And what else is going on at OTA? So stay tuned for that.  And stay tuned for Pat. Talking about Jaday. We got the first reaction from Pat about the Broncos  drafting Jaday. What he brings out there is some good insight there. Plus Drake Greenlaw,  Talino who funga what those guys add here. And before we get to that, I want to give a shout out to our  friends over at Mando. We're Henry was saying like everyone's doing Volvo. Everyone sweats. So you  have to have Mando especially in Volvo. And Volvo is actually a place where you kind of meet people.  Maybe it's little meet in friends, meet in there. There's definitely a lot of matters. And you want to make sure  you smell good. Or else that's like the initial turn off. And Mando's got you covered from head to toe.  If you don't plan on taking a shower every 12 hours, which pretty much no one does. And you need Mando,  because they're going to help you with that extended period where you're not taking a shower. And we're not just talking  pits. We're talking parts. We're talking front of those. We're talking belly buttons. But cracks everywhere.  Feet anywhere you want. Mando has got you covered in Mando. Has got you covered on so many different  fronts because if you're like, well, I don't know where to start with Mando. They've got the Mando  starter pack, which is perfect for new customers. It comes with solid stick deodorant cream,  tube deodorant, two free products. If you choice like mini body wash and deodorant wipes and free shipping.  And then they're going to give you a $5 off that by using the code DNVR over at shopmando.com.  All of that together, it equates to over 40% off your starter pack over at Mando. Go to shopmando.com. That's  S-H-O-P-M-A-N-D-O.com. And use the code DNVR. Please support our show until in the Wii sentia by  using that code DNVR smell fresher. Stay drier and boost your confidence from head to toe with Mando.  Probably the hardest thing to overcome in a first impression would be smelling bad. Yeah. But  it would also be hard if someone found out that you had a bad bank. Wow. That was so bad judgment.  And that wouldn't happen at first bank. You come in smelling good and flexing that you bank with first bank.  You're off to a great start. You really are. Whether you're at home or on the road or somewhere  in between first bank banks, banking easy convenient and secure, their mobile banking app allows you  to check balances, pay friends and manage your money any time, anywhere. And best part, you can open a new  first bank checking account today and you could earn $300. So if you're ready for better banking  in the chance to earn a little extra head to efirstbank.com slash bonus, that's efirstbank.com slash  bonus to open your account. Bank, how you want when you want with first banks or restrictions  and requirements apply. Remember FD, I see. And again, shout out to everyone that's too  in and with us. Hit us with the thumbs up. We really appreciate everyone. Especially the people that are  in the chat like Joe like Wolfgang who says he's finally able to make it in here. Jose, we got Gen X.  So many OGs rocking and roll with us. We got Cody Chepa in here as well. So shout out to everyone.  And shout out to Pat Sartan who talked about the new additions to this team. Let's hear Pat talking  about the additions of Drey Greenlaw and Talinoa, Hufanga. This is great additions to our team and towards  us success obviously with Drey and Hufanga. You know, the guys will get after it. I mean, they've been  as Super Bowers before. They know how to win at high level. So, you know, adding those guys  to the team. You know, it just look shock on the horizon. So I'm looking forward to it. I'm stepping  on the field with him. And those guys are going to just bring a different mentality than Pat. And it's  great to have that balance on the field because Pat says cool is the other side of the pillow. And then  Drey Greenlaw, he plays with this hair on fire. And shout out actually to Talinoa Hufanga,  a brand new teammate of Pat's was at his event last night. Really cool. It's a brownie point.  Nice move. Yeah. Excuse me. Let's hear from Pat talking about Jaday Baron.  We just, thank you. We just talked about Jaday. And here's what Pat has seen of Jaday already.  How do you feel about Jaday Baron and what he brings at the corner for the team?  You know, he's, he brings a lot of versatility towards the defense. He's smart, savvy. He  made plays. It's a big addition towards the team. Because I know he will make plays hard to. And  he's catching up fast. So, you know, it was a great addition towards the team.  Great addition towards the team. But the thing that really stood out to me there was he's catching  fast. Rookiees are always behind the eight ball. And sometimes it does take a year or two or three  for them to really get going. I mean Nick Benito, he didn't break out till his third season. And he was  as talented as could be. But it just takes guys some different times to catch up. And with Jaday  passes, he's already catching up. That's music to my ears. You say he's Baron on them. Wow. Baron down.  Okay. Yeah. Yeah. I'd say so. Good. No, it's definitely good to hear.  Just want to see him fit in. I don't have a lot to have. I'm just, it's crazy to think about  where the secondary could go with all the pieces click. And I'm just like so excited to  see like a preseason game. I don't know if they're actually going to play him or what, but like  they would play the rookie, but I mean all of them together. Just the first time we get to see that,  I feel like it's a quarterback's nightmare. Congratulations, Cam Ward. You get to play them in your first  game. Yeah. Congratulations, Will Levus. You get to start the first game so that Cam Ward doesn't get killed.  That's an oven time. People think that's a crazy take. No, that is definitely the right take in my opinion.  One last good meme from Will Levus trying to throw up. And then a mayonnaise commercial right after he  throws like a pick six to patch her to enter something because he's, he's the big one into mayonnaise, right?  Yes, his mayonnaise and his coffee. Yeah, that. You think he actually does all that stuff or just knew that he could  get attention for saying that. Oh, no, maybe he got like a dukes mayo deal. I think he did. Yeah, there's a commercial  made with the mayonnaise company. That's why maybe we should try that. No, I'll let you do it. Like just say you're really into  something. Yeah. Oh, okay. Exactly. It's like I really think that you put peanuts in  cola. That's a big thing. That is a thing. Yeah. No, what would be, no, it isn't coffee. Yeah, I put peanuts in my  coffee. The planters reach out. Yeah. I want a shoe for the star. That one goes no more bigger. I like peanuts.  Peanut's in like a glass Coca-Cola bottles like a big Southern. Yeah. Can see you could say.  You got it. I don't know about that. I always just put a bunch of icing. I'm too old to be drinking like actual  coke just to sweet. Yeah. And so I just put, let's sit in the ice for a bit and water down. But I guess maybe  the peanut is just so good to use that. I don't think you're just watered. The diet, the diet tastes is just so bad.  Like I just can't get old enough. Yeah, you'll. Once you once you're washed, it'll start tasting  good. Really? Yeah. I don't know what that is in there. But it just tastes terrible. Like once you hit 30.  I prefer Diet Coke and Gatorade Zero to the their counterparts. I'm going to tell the Gatorade Zero. Oh,  yeah, 10 years ago I was like, what is wrong with these? Yeah. I agree. I used to think Gatorade Zero was  awful, but now it's, I drink. So go to. I go through phase of the world, drink like three a day. Yeah.  Wow. They think it's really good. And it's zero.  Jose says, be honey on white rice. Is there any such honey besides be honey?  Like definitely has a lot of the same way. They're probably like artificial honey. That's true.  That's true. But not from any other. Anything else like honey? No. No.  By the way, that sounds good to me. Honey on just about anything sounds good to me. Yeah. I agree with that. I agree.  Don't know how we got here. You said barren down. And I think it just all went downhill.  We'll love it from that. We'll love this. Yes, Cam Ward. Oh, the secondary being so good.  When you were talking, something that went through my mind is this secondary is the strength of the  entire team in my opinion. What's crazy is the past rest was the best past rush in the NFL last season.  And it wasn't even close. They blew number two out of the water. And so then it makes me question  myself, like, was this secondary actually the strength of the team or is it the past rush? And I'm  I'm pretty confident saying, no, it still is the secondary. But with that past rush being so good,  it just makes me so excited about what this defense truly is and can be if the past rush is best in the NFL.  And I truly think the secondary is even better than the past rush. Yeah. And I think, you know,  past rush success is a real chicken and egg scenario. Is it because of the coverage or is the coverage  looking better because of the past rush? Yeah. It is forcing quarterbacks to make air and throws.  In this case, especially considering pass or tan is the best player on the team. I think it is  the coverage that is eating the past rush. But it doesn't matter. You just need to make sure you have one  so that the other can happen. And this secondary just got better. Yeah. So the past rush should have  better opportunities, more opportunities. Quarterbacks holding the ball even longer. Goodness.  And yeah, it makes you think that maybe you should pay Nick Benito now. Yeah, seriously. Yeah,  I think of it because they blit so much. I think I say coverage is better because I think if if you're  saying like, yeah, like they're they're rushing with foreign getting home. But when you're rushing with six  is often as they are on third downs and just playing man coverage behind, I feel like you only do that if you  really trust the coverage. When you know who's going to help with the past rush to is not only the  coverage being coverage, but the coverage blitz thing. And that's going to be a specialty of Jaday as well.  And so can is Pat Sertan counting on Jaday helping his stats by just adding to the secondary. Here's  what Pat said to that. I mean, we'll see. I mean, you know, at the end of the day, you know, he can  control what you didn't control, but I bet it involves me, you know, getting more attempts at the  long and more players. You know, can't be too mad at it. There's no way week one. Well,  it's well, love us. Maybe he does test stats or 10. But there's no way that Jaday's initial impact on the  team, like helps Pat so much because seems like we don't want to throw it a Jaday side. We're going to throw  to Pat's side. No, but imagine if he gets that good, where teams really are saying, like,  it doesn't matter if we throw to Pat's side or Jaday's, it stinks either way. So let's just occasionally  throw to Pat's side a little more. Yeah, then they throw to Riley. But that would be just so cool. If he gets  to that level, that's what we know he's truly made it. Absolutely. That's a long ways away. Yes. Yes.  And just to what your point, I'll never forget watching like a thing, it was like an Instagram  live and it was Drew Lock and Baker Mayfield. Yes, it was. And they were talking about how they're  rookie years. Their coaches would just like point out players and just be like, find them pre-snap.  Don't even think about it. Don't even think of it. It was like Darwin James. I think was the one for Drew  Lock. And then who was the guy that was on the jets? Good safety, then traded to my  atoms. Yeah, I think it was. Yeah. So I think it was Jamal Adams for Baker and they were just like,  both of them said like, yeah, our offensive coordinator was just like, okay, get to the line, find him,  look to the other side. And then both of them were like, nope, we're going to test them. Yeah. No, I  see about that yesterday. I think Drew did say like, yeah, one time I was like, this one's definitely  there and then he almost picked it up. Like, okay, okay. Yeah. I'll see about this yesterday,  but kind of the opposite. Because I was thinking like against the Titans, you just run the football,  like, don't put in the air. Don't take any rest. You should be able to be too easy. Titans, though, like,  their strength is in the trenches. Starting corner back is supposed to be Jarvis Brownlee, Jr.  who I have never heard of and was a fit thrown pick last year. So I was kind of thinking, well, maybe you  just throw the ball his way on top of that. The other starting corner back is LaGeria Sneed who  was like, well, yes, but was like shooting at the people from the car or it was either hammer  as manager regardless. He was in the car this off season. Yeah, like December for some reason,  this one didn't get as big a news as you would have thought. Yeah. Um, did not come to the top of my head.  And it's also seems like it's a civil case. And I'm not sure. Very confusing point is he could be suspended  week one. And if that's the case, then you're looking at, you know, maybe a lot of Marcus Harris or  a money or a worry, a or Kevin Winston Jr. I really think you might just go empty and just let Beau  shred them. Yeah, you're going to throw a Jarvis every time. I wrote this hype enough, the running game all  off. So you just start. But like they play a three, four, they're three or Sebastian Joseph Day to Vandres,  Sweat and Jeffrey Simmons. And then their outside linebackers, Arden key and Dreymont Jones, who, like,  again, like Dreymont, as a pass rush or maybe doesn't scare you too much, you put him as an outside  linebacker. That's a good run defender. Yeah. So I kind of, I'm sorry to lean the other way. The  Dreymont Jones revenge game week one have we been phrasing this game wrong the whole time. Cody Barton too.  Oh, oh. The X is on defense come back to town. Yeah. Broncos 27 zero. Yeah. Yeah. Yeah. Wow.  Okay. 63 21 combined score the first two weeks. Okay. Yeah. Okay. Let's continue to hear from Pat now.  Will he play in the Olympics? Let's hear from him after I give a shout out to our friends.  This is, if you give a shout out to yourself and a friend, are you giving a shout out to a friendship?  A friendship? We're going to give a shout out to a great friendship right now. Very soon.  And it's a true fan travel because we are going to London. I believe all of the specifics are now  finalized for this trip. And guys, it's going to be an incredible one. The first time we went out there,  it was incredible. Amazing. Probably the best week that I've ever had on this job. Maybe,  best weeks of the life, even potentially. Now we're just fine tuning it and perfecting that week.  Yes, exactly. Yeah. Good call. To fine tuning it and perfecting it with true fan travel.  And if you want to join us, it's a once in a lifetime trip. It includes a five night  state of luxury hotel. Private tours, pub meetups and exclusive pepper alley tickets to the game at  Tottenham's hot spur stadium. And so much more. And if you want to get in on this travel,  go to truefantravel.com travel across the pond with true die hearts and experience London. The  DNVR way don't miss out on this ultimate fan experience. And you can book it true fan travel.com is  going to be amazing. We should get some testimonials from people who are there last time because I felt like  one, everyone that was there had a great time. And we were friends with them by the end of it. That was  like one of my favorite parts is like, we actually knew these people because we saw them like,  you know, five days in a row or whatever. And so you get past the small talk. I'm just like,  I love the show. Which I love doing that. It's way cooler when it's like, so how's your family?  Right. We're going to have those conversations with those people. This upcoming trip,  you can also go to ddndvr.com slash events or scan the QR code on the screen. Also shout out to Empire.  If you're looking for new floors Sunday, we had a big cleaning day. Floor has got clean.  By the way, look at this personal growth for Henry. I invited him golfing on Sunday. He said, no,  can't let Lexi clean the house all by herself. I'm not going to lie that if he did. She did better.  There were like a bunch. There was like seven factors that went to that decision. And if anyone of them  weren't there, I would have been golfing. Like if I was, if I'd golfed in the past month, I'd be like,  okay, maybe. If I wasn't about to book like four different trips. If it wasn't rent. Like it was just  all these factors. Point is, our floors look brand new. And there's nothing like a new floor.  Which I honestly just realized. If you want to check out the floors, you can actually use their little  thing and see all the different floors look like in your house. Pretty cool. Yeah. Which, you know,  I'm kind of tempted now to go back to my house and just see what all the different floors would be.  Because I don't, I don't, I've never really had like a strong floor preference. I've been a little bit  anti-carpet just because I feel like it kind of gets gross. But that might just be the way that I take care of  carpet and not so much. But Empire floors. Once you see these crispy wood floors. It's hard to go.  Empire floors are the best floors. It looks like now. It does. It's under the rug right now. But yeah,  over there, it looks good. Schedule free and home estimate today because some things are just  better at home. DMVR listeners come see a $350 discount when using the promo code DMVR. Yes,  you heard right a $350 discount with code DMVR restrictions apply as Empire today slash DMVR for full details.  Oh, and really quick. One more thing about the true fan travel on our trip. We've got Benny joining us.  Oh, yeah. So it is going to be so cool coming out with us and Benny. And Pat is also going to be out there.  And the Olympics in three years from now. Does he want to play in it? No, here's what he said.  And see if it goes along with what Ryan just said. Yeah, you can embrace it. But at the end of the day,  it's definitely high interest because the Olympics is once in a lifetime opportunity. So I don't know.  Okay, Pat, you're not that old. He's going to be 28 years old. That should be like his peak.  So if he has high interest in playing in the Olympics, shouldn't he be on the team? No. No.  Oh, just too risky. No, broncos spikes. Oh, that's how every fan said to like looking through the  responses of the tweet. It's like, oh, nobody wants Pat playing the Olympics. And again, I get it because  it's suck if you got hurt at the same time. They're like, he's been just fine in the flag football games at the  Pro Bowl. Yeah. If anything, I would imagine a Olympics less strenuous than the Pro Bowl. I'll put it this way.  If it happens, I'll be really happy for him. And then I'll be really nervous watching the games.  Yeah. I also maybe within the next three years or whatever, I'll get more excited. As of now,  I'm not super excited to watch flag football in the Olympics. Oh, I'm definitely not. No. No.  Well, how do you feel about Yokech when Serbia's playing?  Very awesome. But he also never. Yeah. Exactly.  Pat has like wear and tear stuff. Yeah. That's only how to concussion. I know. I know. But football just  did play footballs. He moves explosively. Like you're cutting and like, you know, that's I agree. I agree.  Like when you're just whatever his hopes and dreams are, he gets to live. Pat would play offense to  if he did it. He said that last year. I think you'd have to. Yeah. I think you get like 10 players on a team.  And it's five or five. Yeah. Yeah. So I guess you don't have to. And it's going to be like,  Pat, Sir, Tan, Justin, Jefferson, Jamard, Chase. I still think we should roll out just our current  football team. Well, that's what the quarterback of that flag football team. It makes it a lot easier for me to  just focus in on the other stuff. Well, see, I would want, I would make it me more likely to pay attention  just because it's more competitive. Yeah. And just like, hey, like, these guys made a bold claim.  Like, they better go get us a gold medal. That's throwing motion. So disgusting. It's like, it's  comical. You think it's fake. Yeah. As Angel says, man, Olympic gold medal has an ice ring to it.  Pat's or tan defense player the year. Maybe he's gotten MVP by then. He's an Olympic gold medal.  Come on. I know. That's so cool. Yeah. But I just isn't the  Pat wants to do it. It 28 years old Pat, your body's going to be feeling fine. But also it will be  right before training camp. Literally, it's like two weeks before training camp.  I understand that the people that are wary of that. Okay. Let's hear that that other clip of the  Pat's expectations for the defense. Now, third best scoring defense last year, they just added  two dogs in pre-agency and they added another one with their first round pick. How, how are the  expectations for this defense now? Yeah. You can embrace it. But at the end of the day, we've been on  the position we was in last year. A lot of people counting this out. We don't still have that feeling  feels like. So, you know, we don't, we don't try to go with the highs. We don't go with the lows.  We just try to stay in the middle of things. You know, and whatever's our destiny is our destiny at  the end of the day. So, yeah, you can embrace it. Is anyone counting the Broncos defense out this year?  I'm truly asking, like, outside are there national people that, I mean, I guess we saw PFF is leaving  Zach Allen out of the top 10 defensive linemen. We saw the PS2.  For a second. Second best. I like the back. That's who did it. Okay. Okay. Just over by  knows. Yeah, that's that's tough right there. But, but is there a national consensus or not consensus?  But are there national people out there that don't think this Broncos defenses elite? There's probably  someone somewhere. Yeah. We're going to have to find them and just make that be a chip on our  show. Yeah. Sometimes it's okay. Just say, you know what? Nobody hates us, but we can still go play  good football. Should I count out the Broncos defense as like a reverse psychology, like give them  something to say like, even our own local media. Lord. Okay. There were ideas. I'd be willing to do that  for for the team to practice just what would that sound like? Look, I know they have all the best players  and this is really great coaching and they were really good last year, but there's just something.  I don't know. I just I don't have a good feeling about it. Are we close? I mean, play that. It does kind of sound like  out there. I would do it. Yeah, really is. VJs got one foot out the door. Yeah. He's looking for a  head coaching opportunity. Yeah. He's blown a Jack Del Rio. Did they have any turnover on the defensive  stuff? A little bit. They brought in this guy. They brought in a podcaster to be, oh there you go. That's a good  one. What are they? That's a good one. That is really good. What is the Lakers coach?  Oh, JJ Retic. JJ Retic. Yeah. Didn't work for them. No, it didn't. Wow. Wow. You're on to something now.  So like, this is Champail. He's in OTAs today.  Well, if he's playing outside corner, might be a spot open. Damn it.  The impats defense, like he's done nothing wrong ever. And so it's one of those things where if it's like  Stefan Diggs isn't going to those practices. Here's like, oh, this guy's a POS get him out of here.  When it's pat, it's just like, okay, it's just it's an annoyance, not like a big red flag. It's just  it's maybe the least needed position at OTAs is an outside corner where they are truly on an  island. And as much as I want to see pat on the outside with Riley on the other side with Jaday  inside, like, you said it. You can't wait for preseason. I totally agree with that. But like,  it's not like there's chemistry that needs to be built really. I mean, that's probably the least  dependent position on the entire field. So it really is okay. I just think like your best player should be  again, we'll talk about the leadership stuff. Like best player should be at these practices.  That could be part of my take. Yeah. They don't have the reps. They lost three reps. Yeah.  Three days of reps. Yeah. I don't like that. I don't like where we're going right now. We'll see if  patch there on Thursday. And then it's just the one off. If not, it will be interesting to see where  things are last night. We didn't get an answer from Pat to be fair. It wasn't asked if he's going to be  there this week. I guess we got some soft local media and yeah, just unbelievable. Let's get to a  couple of super chats really quick. You got something first. I did have something first, but now it's  escaping my mind. Oh, a quick question for you guys. How do you feel about the  utter lack of content that comes out of Broncos, OTAs? Because now I'm paying attention to Browns  and Jags OTAs, which yeah, really wouldn't wish that upon anyone. But it's kind of interesting.  And they are just pumping out content. I mean, especially the Jags, I feel like they've had a hundred  OTAs and I feel like the Broncos have had one. Yep. And I noticed some Broncos fans  pretty bummed about it. I'm curious how you guys feel about it. I totally understand why every fan is  bummed. And honestly, that is intentional from Sean Payton. Oh, yeah. He wants to just  not to bum the fans out. But it's very much correlation with cutting everything down.  When a new free agent signs with the Broncos, we don't hear from them until OTAs start. That's like  two or three months that go by and then when OTAs come around, nothing comes out of it outside of a  couple of pictures. Sean's not doing it to spite the fans or the media. I think he's doing it to  instill in the team that we're just here to work. Yeah. There's no videos, there's no glamour,  there's no nothing's coming out of this. You're here to get a job done. And I'm not going to  glorify this. You are here to work. And I think that's what he's trying to do. And that's what he said  in his opening press conference. He warned everyone when he was hired. He said, we're not going to be  doing as much on social media now, but just know we're working. And especially it was a direct contrast  to what happened the year before when Nathaniel Hackett. And it wasn't just Hackett, but the Broncos,  social team and video team, they started doing like behind the Broncos behind the scenes of the Broncos.  It was great. And so it was like the most open that the Broncos have been going to the complete  opposite of the most close they've ever been. And hey, if it turns into wins, no one cares. And so far,  Sean has been right, but it is a bummer for fans because they don't get to meet these guys. They don't  get to see what's going on on the field. So I totally understand that. But if it leads to wins,  everyone's final fit. I do think that there's a line, though, where it's like, I get you want to minimize  the distractions. But when you're trying so hard to avoid the distractions, that itself can be  come a distraction. And so when everybody else is talking about like, oh, is this happening? Is that,  you know? And I don't know what they've crossed that line yet. But I don't know. The absolute  concerted effort to make sure everything is so clamped down. That and itself maybe could take a little  bit more energy than just like having one press conference would. Yeah, I think I don't know. I'm  of two minds about it. I'm obviously less impacted by it from a media standpoint now than I  would have been years ago. But I'm still impacted from the fan side where it just doesn't even feel  like the Broncos or doing anything. And I don't know. I think that there is a world where you can just  like post the play of the day. But I think to do that, you have to have cameras out there. And I honestly  think that John would rather there be no one other than the football team out on the field during practice.  100%. 100%. And even if they don't feed the fan base in the off season, they're not going anywhere.  Like if it'd be nice if they had the clips or it'd be nice if we'd go on here and say like, oh,  this rookie just cooked this guy three times and now he's like, this is an awesome story that's going on  or like, oh, this second year practice squad guy is actually like fitting in playing against whoever else.  But we just don't get any of those storylines. We get like no Broncos fan is saying like,  I'm just not interested. Like I'm not going to buy tickets. I'm not going to watch during the season because  I don't get this now. Right now, though, the Broncos do have an opportunity to capitalize even more.  But it's not like they're missing out on things because the fans aren't going anywhere. But there's no  apps. There's no nuggets where the past many years, those teams have been going past OTAs.  And there's, I mean, we're focusing on Rocky's losing games right now. So they would have an opportunity to  capitalize and just only even more there. They already do a great job of that. But  Sure thing, it just doesn't care about that. No, no, no, man, you know who else doesn't is the owners.  Because there would be a chance that owners would be like, no, we're going to make this marketing money.  We're going to make this money off social media. And the Broncos owners say whatever is right for winning.  Sean, we trust you. We'll go with that. So that's uniquely Broncos. Yeah.  Tommy. And the in the in the super chat says, can't forget. Pat's peanut punch on T Higgins.  Absolutely Tommy. That was just textbook. That's a coach's dream of how he made that tackle and then  punched the ball out in that game. It was huge. And then Evan says, any scenario where we should  go get Nick Chub. If you really don't like what you're seeing from the young running backs or the injuries  scenario, which we don't like to talk about, but other than that, like you've got, you've got five guys competing  for one spot. You got Harvey's going to get one of them. I don't think you need to muddy that. Nick Chub was  really bad last year. I think no, he was just hurt the year before that. He wasn't bad the year before  that. Aging running back seems like a bad investment. You can just give those touches to guys who  seem to have more upside. Yeah. And I agree. The Broncos aren't going to sign a veteran running back  until training camp at if they do. No reason to sign them with one week of OTA's left. JK Dobbs is still  out there. There's a weird situation with JK Dobbs though where you'd have to give up a draft pick to the  chargers now if you sign him. So very interesting situation. And I want to hear from Pat one more time.  We're going to do that in overtime. Go to ddnvr.com slash overtime for the rest of this show. And the  reason that I want to hear from Pat one more time is he talked about his foundation and what he's doing.  And it is so cool for any player to be so, so involved in the community, but especially a guy who's  25 years old who's going on his third year of having his own foundation. Let me see found it  when he was 22 years old. And so I just want to I just want everyone who wants to hear about what Pat's  doing in the foundation have the opportunity to because it is so cool and he realizes he gets it. He says  this community embraced me a lot when I came to ddnvr. So I'm embracing them and making sure that I  give back and he knows that he only has 10 or 15 years to make an impact as a football player. But he  knows his impact can go way beyond that with his impact in the community. So we'll end the show on PS2 talking  about his foundation. Then we'll see you tomorrow on the ddnvr Broncos podcast at 11 a.m. Pat. Take us out.  I got my foundation event which is fashion. It pertures. But the spotlight is with the cars,  the whole venue and everything. Being motive here but the whole spotlight is to shine on  the youth and everything that ties in with my foundation. So it's just to add the cars and the fashion  to it to make it even better as you are. Yeah, we're the one that you prove yourself on the field.  You feel like it's just important to keep that community in the community and it'll even impact  you're endeavoring. Yeah, I mean I always try to stay consistent with my future. I'm just going  to make sure I keep on doing bigger and bigger things. I'm about foundation and I can say it's  going to keep on getting better and better. Yeah, last year you did this event. You did it up in order  to keep that teammates grab all the others. I'll go with it to find a venue down here that says you need.  I know this is really right close to the house for real. But yeah, I think it's pretty unique to  find different venues around that, you know, compliments your foundation and what I'm looking for.  I think that's pretty cool. This is a such a nice venue as well too. I'd never noticed but being able  to be here around this atmosphere is pretty dope. You've got a lot of teammates here supporting you.  How much of that support mean to see those guys out here? The support is, you know, it's real. I mean,  you're talking about guys who take the time out there, take the time out there, day to day with  anything. Because we all busy out the field, you know, we've got stuff going on. But for them to  come out and show support towards a great cause. I mean, it means a lot. But those who don't know,  maybe you could tell us about the history of your foundation, kind of your mission statement,  what you hope to do when all that comes to them. Yeah, my whole mission is to, you know, get kids,  their right resources, you know, get them the right tools to succeed at the next level for the future  endeavors. You know, just providing with the right resources compared to the supported peers.  At the end of the day, it's all about just giving back and shining the spotlight on the U.F.  in this community. Well, this is just a couple of years into your foundation. How happy are you with  where it is that you're event in the fall? You've raised about a quarter million dollars if memory serves.  And just to see where it's gone in the first couple of years of schools, you've been in love and now  it's expanding to help teachers as well. Yeah. I'm starting to teach us one. I'm talking about that later.  But, you know, it's just all about, you know, just giving back to the community in a meaningful way. I mean,  there's something that I envision. Just keep on having bigger and bigger events with my foundation.  I mean, I guess I've got a great support system with me. The great team with me, the helps as well. So  a lot of work goes on behind the scenes. That doesn't, you know, get notices much, but  you know, for whatever thankful to be in this position to give back in a meaningful way.  That's what we want to continue to expand. What's saying, like, you come to Denver,  like, there's an expectation of giving back. So, like, you know, what does it kind of mean to  it as a company and see an organization where this is part of the state to be part of it? Yeah,  yeah, I just want to give back on a right way, because Denver showed me love right away from the job.  You know, as a rookie, I know what to expect. You know, obviously there's a lot of expectations on me,  but they've ever shown me a lot of love. And my point of it is just to give back to the community  that show love effort. So, this is my way."