Speaker A: And now a next level moment from ATT Business. Say you've sent out a gigantic shipment of pillows and they need to be there in time for International Sleep day. You've got AT and T5G so you're fully confident, but the vendor isn't responding. And International Sleep Day is tomorrow. Luckily, AT&T 5G lets you deal with any issues with ease. So the pillows will get delivered and everyone can sleep soundly, especially you. AT&T 5G requires a compatible plan and device. Coverage not available everywhere. Learn more@att.com 5G Network.

Speaker B: You've got the football jersey, you've got the passion, but you're chasing it with, well, whatever tequila some celeb was pushing. Come on, don't be a gringo. Gran Centenario Tequila has been crafted for centuries in the highlands of Jalisco, Mexico. That means real heritage, real expertise, real tequila. No gringo stuff. Just a product of centuries of expertise. Mexico's number one. So next time you raise a glass, make it Gran Centenario, the tequila Mexico drinks. Don't be a gringo drink. Grand Centenario Grand Centenario tequila. 40% alcohol by volume. Proximal proximal spirits.com the San Francisco 49ers.

Speaker C: They'Re poised to make a move. Trying to bolster their pass rush. Should the Arizona Cardinals, their fan base, be concerned. In the cards, they have a key offensive player that's extremely underrated. We'll tell you who that is in a huge show announcement. It's going to hit us today. We'll tell you what that is coming up right now. PHX Cardinals, foreign up from PHX studios downtown Phoenix. Hanging out with you. Not Studio K today, but of course we wrap Circle K all the time. Their free membership program. Love it. Save on gas. Download it for yourself right now. What are you doing? If you're not hit that like button. Subscribe to PH and Exports. Bo Brock hanging out with you. We got Damon Dog behind the Mac in the producer's chair hanging out with us as well. Man, oh, man. What should we do? How should we address this right now? It's. It's Friday, that's for sure. What's going on? Aaron Van Buren. I see you. Good. Tony. Alberto E. Benjamin. Biscuits and the Bear. We got David. Yeah, of course. You guys didn't get your usual. Live from your guy Johnny. Venerable. Why is that? Should we. Should we let the cat out of the bag or should we just let this one marinate for a while?

Speaker D: I say we just let this one marinate For a while. I, I do wonder if anyone caught the, the play of not being in Studio K today solely so Bo didn't have to hit the live the same way that Johnny Venerable may, you know, hit the live on a daily basis. It, it was, it was really a more of a strategy play than anything.

Speaker C: Big time, big time strategy there. Was it a, you know, strategy because we just fired Johnny Venerable this morning or was it, you know, maybe he's dealing with some issues and we're wishing him a speedy recovery. I don't know what it would be, but regardless, they kept me at a harm's way from having to really strain these vocal cords dropping alive to start things up. What's up, JoJo? What's up, K2 Gage CBK Big Red 6. Sean. I see the entire squad, Espo, wondering where Johnny is. Well, Espo, did you give him his walking papers this morning? How did he take the news? We'll have to get into that. Maybe he can drop some, some hints, some Easter eggs in the chat. We appreciate everybody joining us today. Of course, it's the final day. You can get a heavily discounted membership. Die hard membership here. Go ph next.com cash in on that while you can. We extended it one more day. The 48 hour sale was not just 48 hours. We said we need to get more people a part of this community and we're thankful for everybody that already is there. There was lots of speculation actually earlier today in the about what the big announcement is and we'll just kind of continue to keep people in pens and needles until later in the show when we're going to get into that. But until then, we're going to get into The San Francisco 49ers poised to add to their pass rush. Of course, The San Francisco 49ers, they're that team. They're that team that everybody didn't seem to care were so bad last year in the seller of the NFC west, they got a hall pass and everybody's just like, hey, they're going to be on the rebound. They're the darling rebound team because of a cupcake schedule and people just assuming that San Francisco 49ers with their star power should get back on track just by default. That's not the case. The NFL's hard. The NFL sometimes when production falls off a cliff, you can't necessarily. It's not easy to just get back on track. Like big time players don't just refined it and next thing you know they're back, you know, making scoring touchdowns if you're Christian McCaffrey being a vocal point in the offense, going from barely playing last year to being a bell cow again. So Ryan H. Stoney, Mike and the boys jacked up Johnny's Prius. You turned my precious Prius into a nightmare. Is that what Johnny's saying right now to Dirty Mike and the boys? It's possible. It's possible. Keep speculating, man. I love it. I love it. Yeah. Landon wonders JV finishing a steak. If you look, if that was the case, you wouldn't have seen Johnny for like two straight years. If Johnny was. Was quarantined from the show because he didn't finish his steak food coma. Yeah, we wouldn't have seen the. The. The. The man. So, yeah, it's. It's. It's not steak related, is it? Mocha gate is he finally. Did the league finally come down and punish him because he didn't take our. Our oath seriously this off season? That's possible. I like that. Actually, Johnny should have to pay some sort of penance for putting chocolate syrup in his body when he was supposed to be abstaining from Sugar Fishbowl Flash Sweaty Bo Bo and the dogs. I like that. Jess said it's Johnny show. He couldn't even show up. I agree. Where is he doesn't even want to get on here and talk some ball. That's. That's kind of. That's kind of lame. A JV pulling a Reddick. Yep. He fallen right in the footsteps of his precious Hassan Reddick, who couldn't even show up to voluntary OTAs after getting the bag from the Tampa Bay Buccaneers. Really? Really. You guys continue to crush it in the chat. We appreciate that. We've got some super chats we'll get to as well. Hope our guy Shaft is doing well as well. He dropped, you know, some sad news that he lost his dog Coco yesterday. We hope you guys are doing better today. You know, it's. It's time there with. With things like that. Dogs, man, it's tough. It's. It's. It's one of those things. It's. It's tough to deal with. Tough. Jess saying Bo's the leader of the pack now. That's right. Just. I'm the captain now and I'm going to carry the torch here. Continue to carry torch for Johnny and bag on the San Francisco 49ers when they get themselves in the headlines and everybody's starting to connect the dots and.

Speaker D: Johnny's honor, some would say, yes, that's right.

Speaker C: We will. Pay homage to our guy, Johnny Venerable on this Friday show. The Niners are tied to getting Bryce Huff, who was a popular name in the 2024 off season because he had a popular the previous season during a contract year. And everybody's saying, well, he's, he's going to connect, reconnect with his former head coach and Robert Sala who was able to kind of figure out, crack the Bryce Huff code and get him to be a productive NFL player. You know, high pressure rate. I think he was the tops in the league. He had double digit sacks at the right time to where he could cash in in Philadelphia. And Howie Roseman, who's usually very, very solid general manager. The worst move of his off season last year was signing Bryce off, signed him to a big time deal and now it looks like Philly is trying to offload that contract. They restructured it and they are very close to sending him to the Bay Area, to the San Francisco 49ers. And people want to say Robert Solidus, Bryce Huff, you know, he should get back on track. But in my opinion, Damon, if you can't do it in Philly with that stout defensive line, really you're going to be able to go and kind of figure it out in San Francisco where they really, they're really young in the interior of that defensive line and you're going to have to enter a rotation.

Speaker D: Yeah, I think Bryce Huff is a, is a decent player for what he is. And what he is is a pass rushing specialist in like the truest sense of the word. The guy is a complete liability basically against the run and that's how teams play him. So I think that's why he didn't play that many snaps in Philly, comparatively to a guy like Josh Sweat. And I know we'll get into that comparison a little later here, but yeah, mostly like his highest success as a NFL football player was with the jets probably in 20, 23. Had an elite pass rush Grade, had an abysmal run, defending Grade, but the jets did a really good job of only getting him on the field during these passing situations. But it does, you know, mitigate his value to an extent. Right. Where like you can't play him on first down essentially. And that, you know, he's a player that is very specialist role fitted.

Speaker C: Yeah.

Speaker D: And because of that I, I think that mitigates his value. He's decent for what he is, but he's not really, in my opinion, you know, the type of needle mover that the Niners are going to need given the influx and outflux of players that they have this off season. He's more of like a put a team over the top type of piece. That's why I liked him in Philadelphia. But he honestly just didn't really work out there. So that's what makes that part of it even more interesting.

Speaker C: He wasn't a full time defender. Even with the jets. Like the numbers, they look like starter numbers and I think that's what was so intriguing. And like the analytics would tell you, like, this is somebody that can come in and you, you can pin his ears back and he can get after the passer. But to your point, this is a guy that's coming out of the bullpen and he's got one pitch, he's got the fastball, he's throwing heat and he's getting after opposing quarterbacks. And that's great because that's a big part of this as far as being a pass rush rusher to be a sack artist. But it didn't show up, I mean, outside of that season in 2023 for Bryce Off, I mean the guy's college Shemar Stewart, as far as his numbers, like, this is a guy that's putting up two and a half, two and a half, three and a half sacks. And sandwiched in between is what, you know, a lot of us would say is a bit of a fluke. It was a kind of a fluky year. I, I think he benefited obviously from Quinn and Williams playing in the interior of that jets defensive line and them having some nice pieces there and he was able to just gobble up all the sacks and parlay that into a big deal. But this is guy, this is a guy that's lacked consistency his entire career. And we're going to say, hey, Robert Sala has got the, the magic touch to this and he's going to get him back on track. Is, is his numbers in his career tell a completely different story. I mean, outside of the 10 sacks he had in 20, 23, you know, he had, you know, about 10 combined before that. Like that, that really is like, that's wrote, that's Jesse Lucada numbers. So if you're going to say, is this move going to strike fear in the hearts of the NFC west team? Fans of NFC west teams, not by any stretch. I mean, if anything, and I think I saw it in the chat, people are saying this is a guy that's going to stand in the way of Mikel Williams getting in the rotation as 11th overall pick out of Georgia.

Speaker D: Yeah, yeah, I Mean for sure. Like that's certainly going to be the, you know, Nick Bosa has one of those spots locked down, right. So you figure he's going to be on the field for probably 70% ish percent of the snaps, right? You know, a little bit more than, you know, your regular starter. And then you have Mikel Williams who I think here's where Michael Williams, maybe where it helps the fit a little bit is that Michael Williams is, you know, he's a big body defensive end. He's about two 260 pounds, right. And six foot five. Like I think he, he can project as somewhat of a, of a high level run defender if he can figure that game, part of his game out early. We know we didn't see that at Georgia a lot last season because of that injury. Right. They used him as that Bryce Huff kind of pass specialist. So I think there's somewhat of a mystery about how good Michael Williams truly is at defending the run. Right. But if he does that at an effective level, I think the fit works. But if he doesn't, man. Are the Niners looking at, you know, a, a, a rough run defense? I think right now, just given, you know, what their base 4:3 depth chart is looking like, like Fred Warner, I mean that's, that obviously strikes a little fear into you. Other than that, you know, we already talked about Nick Bosa. Like those are the two players and after that it's bunch of Jags. Bunch of Jags.

Speaker C: It's a lot of unproven guys. Like you can say, hey, I like what Alfred Collins is the kid that they drafted out of Texas and CJ west, the kid that they drafted out of Indiana. And the interior the defensive line could project to be. But it's a bit foolish to think, hey, these guys are going to come in right away and fill the need that they have. That's, that's huge. It's glaring in the middle of that defensive line. It's, it's going to, there's going to be after, there's going to have to be a lot of heavy lifting from Nick Bosa next year. You know, can he stay healthy enough during the marathon. That is an NFL season in order to do that and carry this Niners defense that I, I don't think people are, are paying enough or close enough attention to that struggled so mightily last season. I see somebody checking in from Austin. What's going on? How you doing? Thanks for checking out the show. Make sure you subscribe to PHX Sports. You know, I don't I don't think anybody is, is thinking that this, this Bryce Huff move is, is going to really move the needle either way for the San Francisco 49ers.

Speaker D: I'll tell you what, I think that I feel like the Niners like are banking from a defensive standpoint very much on Bob Sala. Like it's, it's pretty much all on him. I think they, they somewhat are expecting him to be like a, a miracle worker of senses because the, the talent that they've brought in this off season is not nearly good enough for I think that contending team that they want to be, are trying to be especially with, you know, the age on offense in particular, like lots of, lots of older players on that offense. But yeah, I think that they're just expecting Robert Sala to come back in and do what he did his first tenure and I just don't think they have the horses for it this time around.

Speaker C: To be honest, the personnel isn't even close to what he really had in New York before he was blown out of there and kind of the scapegoat for that disaster class for, for the Jets. I mean, he was dealing. Think about the secondary. I mean DJ Reader was, was playing at high level sauce G. I know he, he's kind of fallen off a bit, but is still, you know, a decent cornerback. And then up front they've got, they've got a lot of talent there. As far as Gang Green goes, when you look at what San Francisco's featuring in the beyond, Fred Warner, as you mentioned Damon and Nick Bosa, the secondary Mustafa is really the lone guy that is maybe kind of a known commodity where you got some guys, first, second year guys that they're, they're going to need to, to be ahead of schedule and that's, that's going to be tougher when they're not as stout up front. As far as the NFC west arms race, I mean the Cardinals have done a lot of their heavy lifting already. Like the first day of free agency, they're in tampering. They get Bryce Huff's teammate from the Eagles last year and Josh Sweat. You start to look at kind of the, the stats here. Josh Sweat versus Bryce Huffman, both similar age. Sweat, just a little bit older, 28 to 27 years old. You look at the snaps, I mean Sweat was just a guy that has been consistent leon the field during his NFL career. Even though there's been questions about his knee. You know, that was a question when we were kind of looking at him through free Agency was, you know, could, could, does he have a degenerative knee. But this is something that he's been able to debunk his entire career. You look the pressures, 255 pressures to 1, 54, 43 sacks in his career and then 20 sacks from Bryce Huff as far as, you know, their career sacks go and 10 of those in one lone season. The rest, you know, the other seasons combined and forced fumbles 7 to 2. So as far as where the Arizona Cardinals, what they invested in, you look at kind of the deals from one offseason to the next. I think the Arizona Cardinals are betting on more of a proven commodity in Josh Sweat. And also just like the overall work that they've done on their defensive front seven compared to what San Francisco has not done. They did use day two, day three picks on that defensive front seven. But like is that going to match up with Sweat, Sweaty J, our guy, or is it going to man up, match up with Claes Campbell, 16th overall pick, Walter Nolan, you know, they added Mikel Williams, but outside of that it's, it's really like I, I don't think there's any debate here. I think the Arizona Cardinals have, have really kind of narrowed the gap that was once there between them and the Niners as far as their defenses go.

Speaker D: Yeah, certainly the Cardinals I think have kind of snatched the Niners chain when it comes to having a good defense in the NFC west, if I'm being completely honest. I mean I, those stats are telling just in the way that Josh Sweat is, is constantly on the field and very, I think, steady, solid, maybe not the highest ceiling, but a very high floor type of player. And while you know, you look at the pressure rate percentage like based off of snaps, a lot of that I think has to go into how many pass rush snaps they're playing versus one another. So that's going to skew that percentage a lot. But yeah, Josh Sweat is, you know, it's like I said earlier, like he's a, he's a one dimensional player. He does what he does at a decent level, but he makes playing him difficult. Whereas a guy like Josh Sweat, you know what you're getting. You know, he can play on any situation. And I think that that's what's appealing about a Josh Sweat is that he's, you feel like you're, you're pretty solidly getting a 10 sack guy who can defend the run. And you know, there's not really a problem with that when you have 40 million in cap space. Still in your pocket, like overpaying a little bit for a guy who's maybe a little bit more closer to a, an average football player than a great one. You know, I think when you're playing with what the Cardinals had to play with last season, like that's night and day difference. And Josh Sweat is a good signing for that exact reason.

Speaker C: Yeah, I mean, well rounded pass rusher, well rounded, especially in the sense of what Nick Rollis, Jonathan Gannon want from that position at the outside linebacker spot where like you might see a higher pass rush grade from Huff, but that's about it. Nothing else stacks up close to Sweat. But Sweat still has decent upside. Like, the big thing for me here is you have Sweat exit to the Cardinals on a free agent deal. You have a guy in the interior in Milton Williams who also got a big, huge free agent deal, key pieces from that super bowl winning defensive front seven. And the Eagles were more than willing to just say, hey, Niners, you want to take on this contract? Like, we'll restructure this, we'll make it look more appealing to you. But they didn't envision a role for Bryce off in this lineup going forward. And it's not that great. Like, I'm looking at their outside linebackers and I'm seeing Nolan Smith, that's fine. Right. But outside of that, there's just not much to it. They're going to have to really lean on some youth here in Philly in order to kind of get any kind of rush going on. I mean, and they're just like, yeah, okay, Bracelet, we'll just, we'll, we feel like we can find some sort of, you know, similar production than Huff.

Speaker D: Yeah, to your point, like that's, that's the fact that they're, the Eagles are. Look at Bryce Huff and say, that's a player we could do without. I think that that's very telling because, you know, he didn't have a good season for them last year. And what better team is set up for success as like a pass rusher, a specialist pass rusher than the Philadelphia Eagles, who have run stoppers up and down their defensive line, you know, really good linebackers as well. Like, I, I feel like the Eagles are like the perfect situation for a Bryce Huff caliber of, of one dimensional kind of pass rush specialists, and it just didn't work out. So I think that, that alone tells me everything I need to know.

Speaker C: The Niners, they're, they're tortured in their own right like this, this has been a team that, that's window has been open consistently for, for the better part of a decade. And they have. I mean, they've got some super bowl appearances to show for it. They've got some NFC west championship or NFC championships to show for it. But it, it brings a smile to my face and I think for Cardinals fans that they don't have any ring to show for it. It really is like you were able to kind of. I, I feel pretty confident in saying, like, you were able to weather that storm as a Cardinals fan and knowing how sometimes insufferable Niners fans can be that they, they don't have. They weren't able to ever get that. That other Lombardi that they were almost felt so confident they were going to get. Really. They fumbled it. Like they've fumbled this thing. Obviously they've had leads in the super bowl and been right there and just couldn't get it done. And it just, it just brings. Fills me with, with so much joy to think about that.

Speaker D: I would say that, you know, this year is very make or break. Like, this has got to be the last year. I mean, you look at that offense, Trent Williams, George Kittle. Yeah, Brandon IU, coming off that knee injury, Christian McCaffrey and his Achilles issues. Like, I just can't see that. That being the nucleus of a team moving forward in the NFL, given how fast, you know, players careers are in this league. I don't know. I, I think that they have an interesting receiving core. More interesting than people give them credit for. Yeah, I know. Obviously, like, I'm a big Ricky Piersol guy. We've talked about that. I think Juan J. Jennings is a good player. Sure. You know, and, and almost had a thousand yards last year. If it wasn't for him and Sean Murphy bunting, getting into a, you know, a UFC fight on the field.

Speaker C: But.

Speaker D: And then Brandon IU coming back. I don't think he'll be as bad as he was to start last season. Like, I think that they have an interesting offense, but it's not good enough to make up for this. This defense that I think is going to be bottom of the. Of the league. Bottom 10 for sure.

Speaker C: A lot. A lot of work to do. A lot of heavy lifting to be done by. By their defensive coordinator, which has been a revolving door since Solo left to take a head coaching position with the Jets. Just unfortunate to him. He went into which is, you know, an evergreen bad situation in, in New York. And he comes back and they've, they've got, you know, he's, he's a good coach, I can't deny that. But you know, given what he has as far as personnel, they still have a long way to go and they continue to look at the offensive side of the football is a place that they, they, they've used before this past draft a lot of assets like Piercel who tweaked a hamstring and he's going to be out until training camp. And you've got the, you know, highly public issues with Christian McCaffrey who's, we say we see video from him in OTAs and it's great he's participating in OTAs. That's a great sign for him. But does he look like the Christian McCaffrey that should be an MVP? Was an MVP candidate a season removed? Yeah, I, I don't think anybody's seen that guy for, for a long time. I was looking at his speeds like he hit like 16 miles per hour, 17 miles per hour a couple times last year. Wasn't hitting that top end speed like he was the previous year and they said that that was like on the lower end of the spectrum as far as what, what he was running at with the ball in his hands in 2023 and he, he did it on several occasions like he's, he's, he's back more, you know, half a step, maybe even a full step as far as the Niners vocal point of their offenses keeping it going here on PH&X cardinals. Love the super chats. Love that the chat is crushing it right now. Over about 250 people watching live here on YouTube. Make sure to hit like on this video. Also we got coming up extremely underrated key player on the Cardinals offense. We'll tell you who that is. Also that big news. We still haven't dropped it yet. We're going to get to that still here on ph next Cards. Got to tell you guys, take the guesswork out of buying your tickets. We got a Diamondbacks game going on right downtown. We got the Nats in town, the Natnols in town. Washington versus Arizona. Can the Snakes get back on track or do you want to go check out the Merc? I think the Merc are welcoming the links. Is it an undefeated links team and a one loss Merc team. You get tickets right now for a good price. Game time. It's always a great price. It's the best deal you're going to be able to find. Take the guesswork out of buying tickets with game time. Download the Game Time app today, create an account and use the code ph next you're going to save even more money. 20 bucks off your first purchase terms apply again. Create that account redeem code phnx for 20 bucks off. Whether you're going to see your favorite band play, whether one of your funnier comedians are in town or you want to go see maybe the snakes or you're an out of town baseball fan, you can check them out with Game Time. It's the best way to do it. Download the Game Time app today. Last minute tickets Lowest price guaranteed. It's impossible to live here in the valley of the sun without quality sunglasses. You could slum it for a little bit, but it's always going to catch up with you. Why not get yourself some quality premium polarized sunglasses from our friends over at Shady Rays. Shady Rays has been helping you get the right frame of mind with their premium polarized shades that aren't going to break the bank. The cool thing about these is they are a price point that is well below premium. You're not going to be paying a hundred bucks and they're not going to get dinged up and they're just going to be out that money with a broken pair of sunglasses. No. You got Shady Rays, an impending sunglasses company offering world class production rated five stars by over 300,000 people. Their sunglasses durable. The frames crystal clear optics making the perfect choice for all those outdoor adventures. And remember I mentioned like getting dinged up, losing your sunglasses. Well you can replace them very easily. The shades go missing. Unexpected hit. Don't sweat it. They have an insane protection in all their eyewear. Every pair is backed by their loss or broken replacement program. Check them out right now. PHX cardinals viewers listeners they get to save big. Shadyrays.com save 35 off polarized sunglasses with the code PHX. Over 300000 people have rated shady race five stars. Use the code PH next today and save 35 right now. Shadyrays.com keeping it going here on a Friday football Friday edition of PHX Cardinals and it's ranking season right? I mean it's that the OTAs continue. Of course we've got the Cardinals wrapping up phase two. They've got it was it was the three practice schedule this week. Three more practices next week and then three more after that before the team goes on hiatus before training camp will be out there to cover OTAs that's going to be open to the media on Tuesday. We'll hear from Jonathan Gannon, get some updates as far as how everybody looked this week. Mostly any of the stuff that's coming out of OTAS after, what was it Wednesday when I was out there, has been from the team and the team site and their media that cover the team. They're the only one that have access to that. But we'll be back out there Tuesday, get you more sights and sounds. Maybe Walter Nolan would be participating with his position group this time around. He was kind of working around, working out on the sidelines on Wednesday. We'll see if they get him in the mix. We'll see if they get him under contract. But as we were talking about yesterday, like is the Shemar Stewart contract hold up in Cincinnati pick directly behind Walter Nolan. You know a big kind of sticking point to make sure Shemar Stewart doesn't get a sweeter deal than the player picked ahead of him. So it's representation, doing the right thing, making sure that deal gets ironed out and then get Walter Nolan under contract, Cardinals Nolan. It's all, it seems like it's all in good faith. No one looked like he was chomping at the bit. Wanted to be out there earlier this week. Probably pained him not to be able to. And then Will Johnson's out there too waiting for him to get signed as well. So a couple storylines to keep up with there. But other the getting into the rankings, you know we've seen the quarterback rankings. We see some Disrespectful Marvin Harrison Jr Rankings People Real low on Marv and that's fine. They can continue to Overlook the Cardinals second year receiver. I think he was 40th on one wide receiver ranking. They had the likes of like Cooper cup ahead of him. Who else egregiously was on that? Damon, you know what I'm talking about. The one that Marv liked on social media.

Speaker D: Yeah, I did see that. Let me see if I can if I can find it. I mean Cooper cup in it in and of itself is absolutely egregious. That that does not make any sense whatsoever based off of last season.

Speaker C: I mean the guy was basically out there running cardio for the Rams and then the Rams were like yeah, you know we're going to move on. But MHJ finished actually pretty strong with his performance against the rams, had nearly 100 yards and then the next week followed up with about a 60 yard performance and a touchdown to wrap up his rookie campaign. That was look admittedly uneven but to to be sleeping on him and taking a 30 plus year old wide receiver was it Adam Thielen ahead of him as well?

Speaker D: I'm struggling to find this list. I think.

Speaker C: I think Adam from the Internet. Yeah, I mean Adam Thielen with the Carolina Panthers. There is just some really bad submissions people ahead of Marvin Harrison Jr. 41.

Speaker D: Remember where this list was?

Speaker C: I don't, I don't know. There's so many fantasy football sites now. But Marv saw it and he hit it with the like. Like okay, sure, you guys can sleep on me if you want. Just let's Keeping receipts. He was keeping receipts. We'll see if Paris Johnson Jr. Is keeping receipts. As far as where he's ranked among his peers, Pro Football Focus put it out today Damon Chat that he's the 14th ranked tackle in the NFL. After playing right tackles rookie season, Johnson moved to left tackle in 2024 and was able to bring his play to a new level until an injury into this year. The Ohio State product improved upon a 60.1 PFF overall grade to an 80.8 mark in 2024 and ranked 12th at his position after giving up pressures on 6.4% of his past plays in 2023. He gave up a poultry 4.9% last season. Look, Paris Johnson Jr looked great at left tackle last season and it was his first year playing that at the NFL level. He's an ascending player and I do think like 14th isn't 40th like we're talking with Marv among his peers. But when I look at this list and it's Pro Football Focus pff.com I think it's pretty, it's criminally low when you take in consideration some of the tackles that they have and having Marvin Harris or head of Paris Johnson Jr. Like you've got Charles Cross, Colton Miller, Garrett Bowles, just three guys directly ahead of of Paris Johnson Jr. And I, I don't think that there's a case to be made where those guys are better than him. Like Cross and Miller both didn't have good 2024 seasons as Paris just based on like general tackle statistics as far as sacks surrendered and penalties, Paris Johnson Jr. Was better than those and you see the pressure right there. Like I, I can get with Cross who is a similar age. I think he's 24 where Paris is 2324. But you miss me with Miller there and then you've got and the thing about Cross too, like the Seahawks offensive line outside of him was terrible. So maybe he was, he was doing pretty well considering the rest of his offensive linemen stink. But when you look at like Garrett Bowles, he was one of the most penalized tackles in the league. Like he had 16 penalties last season. I don't know how moving the wrong direction can put you as a French top 10 tackle in this league, gave up two sacks, sure, two less than Paris, but Paris Johnson Jr. Like, had 10 to 12 less penalties than Garrett Bowles. There's no world does that make you a better tackle if you're getting that, that much laundry thrown at you and then one of these guys in the top 10, Damon. And you can speak to this as much as probably better than I can. Former Dolphins and Texans tackle, now commander's left tackle Laramie Tunsil. He led the league with 19 penalties. He was penalized 19 times and they've got him eighth. So I think that Paris Johnson Jr. Already, in my opinion, and I think in this podcast, in this chat's opinion, the consensus is he's, he's already fringe to top 10 tackle in this league.

Speaker D: That includes right tackles as well.

Speaker C: It does. So like Lane Johnson's in there and you'll see some guys that play on the other side, but generally like, they'll hold the left tackle unless you got a lefty quarterback ahead of that.

Speaker D: Yeah, I think to an extent Paris Johnson is a victim of being an Arizona Cardinal where like, he's been so steady and that's what you want out of your left tackle is a guy who's quiet, right. Who's not loud on the screen. It's the same thing with a cornerback in a similar way where it's like if you're, if a cornerback is always in the middle of a play, chances are he's kind of getting eaten alive. If a left tackle is always on your, your replay time after time, it's probably because he's getting beat consistently. And I think Paris Johnson has been quiet because he's been steady, consistent, you know, done his job. And, and you know, I, I, I really think that he is solidly one of the better, you know, left tackle building blocks for sure in this league. Laramie Tunsil I think is a really good player and an incredible pass protector, but always been penalty prone. A lot of false starts with Larry Me, Tunsil. I think that's a big part of Paris's game. That's, that's a good selling point is, is how, you know, how he limits that penalty exposure. But all in all, I really do think that, like, the Cardinals experience this a lot because of just the size of the fan base. I think in particular is, is, you know, the national publications don't look at their players, I think in the same light that they Might like if they played in Philly or some example like that. I think Paris Johnson is, is for sure maybe probably a little bit better than that, but definitely somebody that, you know, is consistent as they come and, you know, thrilled to have him on the roster.

Speaker C: The durability. And I, I know they put in there like the little cliff note that he missed the end of last season. And we've talked to him this offseason. He says he's way past that physically. He's already back in a great spot. Like before that, that injury. Like he hadn't missed a single snap in his NFL career. Not, not one his rookie year. And then he only missed some snaps when the Arizona Cardinals would get up, you know, with, with large leads and they pulled their entire starting offense, played in 14 games last year. And you know, he's, he's going to be 24 in July, so he's younger than Charles Cross. And you got this guy and you just look at the numbers and how he was able to make that jump from year one to year two. He goes from 60 grade to an over 80 grade. He's just, it's. He's undeniably an ascending player. Like he, he's only going to go one direction. Like the one knock on Paris really his rookie season was they thought he needed to be way stronger and he's gotten stronger. He's already really athletic for his position. You look at him, he, he doesn't look like your typical big, you know, oversized tackle. He, he looks like an athlete, a borderline, you know, defensive end type player who's playing the tackle position. So, man, I, I just think they got this wrong and, and right. He's probably a victim of playing here in the desert right now where they weren't a relevant team during his rookie year. Obviously it was the first year of a rebuild and then last year where, you know, I think they obviously opened some eyes, but they played one primetime game and it was on an app. And then the other one was a Saturday night game where I just don't think people got enough eyes on, on Paris Johnson Jr. And they're saying, we know Colton Miller, he's been in the league this long. Charles Cross has been in the league a little bit longer. He was a first round pick before Paris Johnson Jr. For Seattle. And they give them kind of the edge there. CBK saying PJJ is one franchise piece they actually have on the O line at the moment. Sure, absolutely. I mean, it's the biggest investment they've made. It's it was, it was kind of the, the franchise changing moment when not only did they trade down, but traded back up to take Paris Johnson Jr. As the top tackle on that draft. It, it was a, it was a franchise altering movement and it is, it is the guy. I think, you know, there is confidence that Isaiah Adams will be a guy like that. But look, you're talking about a first round pick, the six overall selection versus a third round pick and Isaiah Adams.

Speaker D: I do think it's an interesting take though, or point to make considering that we feel so good about the Cardinals offensive line. I think as a, as a collective fan base despite only having that one franchise guy. I think it just speaks to the level of coaching that is on this team. I know people obviously, you know, Drew Petzing gets a lot of attack on here, but one of the things that I think he's one of the best in the NFL at is, is offensive line protection and keeping his quarterback upright. And you've seen Kyler Murray stay healthy for the first time under Drew Petzing. So I, I, I think it just goes to show that this offensive coaching staff knows what they, they're doing when it comes to o linemen, which is not an easy thing to find in the NFL. Like, that's the debilitating factor, I think for a lot of NFL teams is they draft o lineman high and they're never good because they can't develop them. And I feel like the Cardinals are set up very well for, you know, even though they only have that one piece right now. If you can draft probably a right tackle in the first round next year, I think that that's where most of us are, you know, in, in May 3rd, May 30th of 2025, right. For the 2026 draft. Like, I think that you're in a really good spot with this coaching stuff.

Speaker C: And there were a lot of people that were clamoring for him to take a tackle to book in with Paris going forward. And that's, that's fine team building. The unfortunate part about this draft was there wasn't enough tackles. Especially when you're sitting there picking where the Cardinals were. I mean, it was, it was, that was a position group that was picked clean before. You know, otherwise you're looking at Josh Simmons who was coming off with the patellar tendon tear, and I don't think that's a route that they wanted to go. I mean, you had the Saints taking the kid out of Texas early on, and it was just, it was just real slim pickings. By then and they loved what they saw from Walter Nolan the third. Anyway. So the Cardinals. Yeah. What tackles are available at 32? Well, Josh Simmons was available there this past draft. That's the caliber of prospect that you'll get once, you know, heavy becomes the crown by winning football games. And you know, I think Monty's shown the ability to find talent no matter where he's drafting. But this is an organization that wants to invest in the trenches now. The, the roster was in such a place that they had to really look and go into different areas. But like once they get this thing and the foundation is laid, like I, I think Monty, Austin Ford absolutely is going to be one of those general managers that invests a lot of his hopefully 20, 20 to 30 overall pick selections in offensive tackles, offensive linemen and, and he'll still lean into not the other premium positions but tackle, I think seems to be a spot that he wants to address. Want to give some time, of course to the big announcement. Also, Pro Football Focus didn't stop its rankings there. We'll get into that. That's all coming up here on Ph and X Cardinals. Man, oh man. Circle K, of course, is always coming to the rescue, especially when temperatures start to heat up. Got to get into the America's Thirst shop. Get yourself a Polar Pop, cool down, maybe get yourself a froster, get yourself some of the delicious treats that they have there. My, I love the powdered donuts. They got their own version of those. They're legit. Tough to go wrong there. And of course, while you're in there loading up on snacks, you're filling up your tank with some really, really just price slash gas. Especially if you're using the Inner Circle. It's a free membership program. If you don't know about it, what's going on? I mean, become a member of the Inner Circle today you'll start earning rewards like 5 or 25 cents off per gallon and your first 5 Phillips. Then it's 3 cents per gallon after that. My wife and I, we just filled up for with 50 cents off per gallon the other day. It was unbelievable. The perks are endless. Where their friends over at Circle K in the Inner Circle join today. Get the member exclusive deals and discounts right now. Like you get that medium iced coffee. Man, that's unbelievable. Join the Inner Circle for free by downloading the Circle K app today. Terms and conditions apply at participating locations. Visit circle k.com for all the details. Also, what's premium is the lid that's on the head of my Co host here today, Damon Dog. He's got the PHX Phoenix Branded Bill's hat. Look at that. Branded Bill's elevating our brand. It also can elevate maybe your co ed softball team, maybe your kids little league team, maybe your company. Check out Brandon Bill's premium headwear and apparel. And you could save 10 right now by just being a listener, viewer of the show. Using the code BB phnx. Whether you like snapbacks, truckers, fitted beanies or tees, Brandon Bills has you covered with performance and style, looking for some gear to make your brand stand apart from the crowd. It's Brandon Bills. You go around, you go anywhere, you go check out a game. You go, you'll see a branded Bills lid all over. It's just peppered in now here in the Valley, it's peppered in across the United States. It's international, but it's right here, of course, a company in Mesa, Arizona. We're proud of that. Take a lot of pride in that. Head to branditbills.com use that code bb phx for 10% off your first order.

Speaker D: This hat is. It's the most comfortable hat I've ever owned. Yeah, all the branded Bills hats are.

Speaker C: It's a great one. I mean the, the rope hats. Big fan of those. The cool thing about branded Bills is, like, I've got this. What is this? Like a, is this a 5950 hat? You got the 49s, right? You got all the. Sometimes like you, you like certain hats and they just don't fit, right? Brandon Bills has the fit and the style that you're looking for. Like I went through it like the truckers, the snapbacks, like all of them. Branded Bills has every style that you're looking for. The dad hats, whatever it may be. And then they can put your logo right there. They got the campus collection. It's unbelievable. I was looking at this. Pff. Snuck this in on a Friday. Their roster rankings. Damon, we don't have a graphic. I just want to kind of scroll through it, give people kind of an idea. As you mentioned, May 30th is big time news. The 2025 NFL roster rankings. Strengths, weaknesses, X factors for every starting lineup. And we'll just go with the Cardinals. I will say, as far as the number one roster, it's the Eagles. Number two is the Ravens. The Lions are number three. Chiefs are four. Bills are five, Rams are six. So you have to go all the way down the 6 to find an NFC west team. Texans are 7. Vikings are 8.

Speaker D: Vikings feels a little low there to me, roster wise.

Speaker C: I agree with that. I think that the Vikings have one of the best rosters overall. Biggest question for them is quarterback play. But yeah, roster wise, I mean, they've done a great job in building that thing. Broncos somehow get up to number nine. This is probably, I mean, the rise for the Broncos, they had to have been like 30th, 31st, 32nd at this time last year. I mean, it was one of the worst rosters in the league and a credit to them for going as far as they did. But I don't think they have the ninth best.

Speaker D: I mean, they clearly have some really, really good players. Right. Like you Pats are Tan is depoy, you know, best corner in the NFL, probably. Who's their, their defensive end? Nick.

Speaker C: Zach Allen.

Speaker D: Zach Allen for sure. But.

Speaker C: Oh, Nick Bonito.

Speaker D: Nick Bonito had a really, really good season last year. Like, they have some, I think they have some top level talent. Obviously you look at a young quarterback who had a good year as a rookie, but yeah, I don't think that they're anywhere close to a top 10. I would put them like at like 20. Probably just, just off the top of my head.

Speaker C: Yeah, I, I think, yeah, just inside the top 20. And we'll get to that, that tier, right? Tampa's 10th. You've got.

Speaker D: I like their roster a lot.

Speaker C: Yeah, it's, it's been solid. I mean, it's gotten into the playoffs couple years in a row. Baker Mayfield's really taking advantage. That Washington, what a turnaround. They're 11. They've got the Chargers 12. That's pretty high for me as far as that roster. I think they make pretty good with what they have. Packers are 13. I would probably put the Packers a little higher. Niners at 14. I think that's a little high. Cowboys at 15. Yikes. Falcons 16. Still waiting for the Cardinals here. Bears at 17. Bengals at 18. Even though they have no talent outside of Trey Hendrickson on the defensive side of the football.

Speaker D: I think the Bears are pretty talented, to be honest with you. As much as we make fun of them and you know, they, they take a tight end with their 10th pick when they have a second round tight end on their roster. Like, I, I think that they do have a lot of pieces that I'm interested in. It's just that they're the Bears. I don't know if they'll be able to do it.

Speaker C: I'm looking right now. I mean, I'm looking at the defense and I don't know. They're kind of running it back on defense. They added Grady Jarrett and they added the guy from the Colts. Was it day. Oh, ding. You bow. Crush. Crush that, by the way. But they're kind of running it back. The same defense that the Cardinals just pulverized last year.

Speaker D: Yeah, no, yeah. I mean, I, I, I think Matt Eber flu is getting him out is a big. No more flu is a big factor. Yeah, Montez Sweat's a really good player. You know, they have okay linebackers, TJ Edmonds and, and you know, Tremaine Edmonds or I think Tremaine Edwards are good players. I mean, I, they're not anything crazy on defense, but I like the talent on offense. I will say that.

Speaker C: Caleb, Sean Johnson for now, DeAndre Swift, D.J. moore, Luther Burden the Third Dunes a commit. Of course they added Loveland. Braxton Jones is their left tackle. Joe Tuney Dahlman is their new center. They spent a lot of money on Jonah Jackson. They traded for Darnell Wright. Yeah, it's, it's interesting. We'll, we'll see, we'll see how it holds up. You got one more team before the Arizona Cardinals. The Cincinnati Bengals, as I mentioned, just devoid of any, any talent on the defensive side. The offense doing all the heavy lifting here with Burrow and Chase Brown, Jamar, Chase T. Higgins.

Speaker D: I mean, they still don't have a good old line either.

Speaker C: Yeah, I mean, you got Orlando Brown Jr. And that. Yeah. And Amarius Mims was not good. His rookie series season out of Georgia. You're right. Yeah. I mean, I guess I should say that the playmaking crew with Joe Burrow. Yeah, that's doing all the lifting. So then you got the cardinals at 19th and they break things down. They've got their biggest strength, the rushing offense. I don't think anybody will disagree with that. The biggest weakness last year was pass rush. I think they did a good job in bolstering that. And then they get into some X factors here. The x factor for 2025 according to Pro Football Focus, is Chris Ramos still trying to figure out what the big announcement is saying if Johnny leaves, we riot. All right, well, we'll see, we'll see. We'll hold you to that. The X factor is Michael Wilson. They say that Marvin Harrison Jr. Could soon be a star. Trey McBride, one of the best tight ends in the NFL. The Cardinals need more dynamic receiving weapon, though, and Wilson is the player they're counting on. And then they get into their number numbers here. And then the rookie to Watch, according to them is Will Johnson and then they've got some projected starting lineups. You're not going to see anything kind of different from what we've been telling you. Like offensively, it's Kyler, it's James Connor, it's Marvin, it's Michael Wilson, it's Dortch McBride and then the offensive line of Paris, Evan Brown, Yelda Froholdt, Isaiah Adams, Jonah Williams. Where your defense, you've got that defensive front. They've got D Rob Calais, Xavin Sweat, Mack Wilson, they've got Akeem Davis, Gaither starting to start and then Will Johnson, Max Melton, Garrett Williams, Buddha Baker, Jalen Thompson. So pretty. Pretty on par with what we've been saying. I don't know if it's behind the Bengals. They've got them behind the Bengals.

Speaker D: One spot behind the Bengals and just.

Speaker C: Ahead of the Colts.

Speaker D: Yeah, I don't love the class the Cardinals are in here with, I'll be honest. I mean, I think that a lot of what I'm seeing here, based off of the things that, you know, the rankings that are at play here, it seems like they're valuing top end talent to me. Yeah, a little bit more than they probably should when looking at a complete roster breakdown. And maybe the Cardinals don't have the. A bunch of the A list NFL stars on their team, but I think they're very solid up and down their roster at almost every single position. Right. And we feel pretty comfortable with. With the holes that have been filled this off season. So I think that they should probably be more in that. That low teen to maybe like 12 range is probably where I'd probably put the Cardinals. There are definitely a few teams like the Cowboys. I'll get out of here with the Cowboys have a better roster than the Cardinals from top to bottom. Is this is like you'd have to be like a Mattish be a situation of like thinking the Cowboys. You know, I could see Jerry Jones thinking that 31 NFL rosters would trade their. Their roster for the Cowboys roster, but that's just not true. They have like two good players. Yeah, I think the ranking is a little bit underrated, to be honest with you, but is what it is. We're used to it.

Speaker C: When you see them stack up and they've got of course their own grades on them, like their own PFF grades, it still doesn't make sense to me. It seems pretty low. The, the good thing about the Cardinals is, is they're a team that is ascending. They are trending the right direction. And a lot of these teams that have older players that they're going to rely upon and more likely fall at the wayside. Arizona Cardinals should be able to, to make a pretty large leap. Like when you look at the commanders at 11, like I think that needs to be the Cardinals here in 2020, like 2026, when these rankings come out. Like they need to be a team that's either firmly in the top 10 or just knocking on the door because otherwise, like the talent that you're, you're expecting to make a jump this year just had either kind of a ho hum year or, or kind of fell off. So that that's the latest out there with Pro Football Focus. As I said.

Speaker D: Where are the Seahawks on that list? I was interested.

Speaker C: Great question.

Speaker D: So I think that they're a little, I'll be honest, like I'm not high on the Seahawks this year. I think their roster is pretty think I don't believe in Sam Darnold, but good running back room, you know, good high end wide receiver, one Charles Cross at left tackle, who you mentioned earlier, a really good defensive roster in my opinion.

Speaker C: So they are down. I mean you've got teams like the Colts and the Steelers ahead of them and then they're at 22nd.

Speaker D: Yeah, I don't, I don't know if I agree with that one.

Speaker C: Yeah, tough list. Look, it's going to be a lot of this stuff between now and the start of the regular season, so you're gonna have to just kind of weather that storm a bit. Weather one more break from us here and then we'll get into the big announcement here on PHX Cardinals. I'm Bo. It's Damon. Thanks for hanging out with us. Love what's going on with our friends over at All Pro Shade Concepts. Of course they're going to give you the extend your outdoor living space with custom fit awning. Hundreds of designs and colors to choose from to match any home. I was actually hanging out at my buddy's house. He just redone his entire outdoor space prepping for summer. Right. And added a retractable awning. It looked unbelievable. It was the finishing touches to the pretty big project that he had taken upon himself. And I was like, did you get those from all Pro Shade Concepts? He says, yeah, how'd you know? I was like, they're one of our sponsors. We love them. They do great work. They did great work for a guy, Espo, because they take care of basically everything, all the heavy lifting, including working with your hoa for approvals. Roll down patio shades to block the sun to keep patios 20 degrees cooler and you're gonna need that this time of year. Check them out right now. Most trusted local shade company voted number one ranking Arizona for patio shades and of course BBB A rated with a thousand five star reviews on Google in business for 20 years in the Valley. Check them out Licensed, bonded insured. Call 623-204-1476 or visit allprochadeconcepts.com now and schedule your free estimate with all pro shade concepts. They do great work. Make sure to check them out for yourself here in the valley in the sun. And also got to tell you about our friends over at Pure Edibles. Love pure edibles. Over 130 dispensaries statewide carry Pure Edibles. They are full fledged candy company offering gummies, kicks that are just like Starbursts and chews that are soft candies like caramel and of course hard candies. Pure effects clearly listed on each 10 so you know exactly what effects to expect from your gummies that you got from Pure Edibles. They're not covered in sugar like all their competitors. They were created up in Flagstaff at the Noble Herb Dispensary. But they call Phoenix home now because they are churning out for all those 130 dispensaries statewide. They're designed to be ripped bit in half making them easily shareable and easily dial in your exact dose. Go find yourself some pure edible products from the one of the 130 dispensaries statewide here in Arizona. You guys are killing it in the chat. Make sure to like this video. Make sure to take advantage of our Die Hard discount. It's up there for a few more hours. Get in for the low price of 36 bucks. If you were Die Hard already you saw all the speculation about our big announcement in today's exclusive member Discord. Did any of them get it right? I think some people have seen have said some things in the chat trying to figure out what the deal is. Damon, are we ready for this?

Speaker D: Yeah, I think so. I mean there are a couple guesses. You know real quick here there is that start of the summer intro offer. $36. Just one extra dollar bow from that T shirt value and you get to become a Die Hard. Get access to the Discord discounts and all our events free written work that is has a paywall on it. It's unbelievable offer. Scan that QR code to the left there. But yeah, we had a couple people that you Know, were pretty on the money. I like, I like this one from my guy Tim here. He says that PH next gets partnered with someone like Omaha Productions. That would be pretty fire.

Speaker C: I think they're, they're that Mia kind of is part of Omaha Productions, isn't she?

Speaker D: Yeah, I think so.

Speaker C: Yeah.

Speaker D: I think that, Yeah, I think that, I think did become a part of that with her like somehow in conjunction with espn, which is pretty cool.

Speaker C: Yeah.

Speaker D: But yeah, there's, there's a, there's definitely a few people that were kind of on the money here. So. Yeah, I guess without further ado, we should get into it.

Speaker C: Yeah. We have fired Johnny Venerable. We caught him stealing. He's no longer a member of the company. No, I'm kidding.

Speaker D: Sorry. The Johnny show is over. We had a good run. PHX Cardinals was, you know, unfortunately this happened right before the Cardinals were about to get good.

Speaker C: Yeah.

Speaker D: Which you hate to see for a guy like Johnny who just eats, sleeps and, and breathes Cardinals big problem.

Speaker C: It's a big problem. He can't stop stealing stuff. He comes in here and there's like, there's boxes of Brandon Bill's hats that, that go missing. So he's, he's out. He's out. And now we're, we're gonna, we're gonna do like an American Idol style. Just search for their next co host, the Ph&X Cardinals. But yeah, they steal candy. No. No more snacks for Johnny. That's right. But, but it is, it's very, it's bittersweet for us to make this announcement. It comes with, with a heavy heart and we'll finally get serious. I will say though it. It, Johnny wanted to be here today, but he, he, he's under the weather. He's hopefully on the men and we're wishing him a speedy recovery. But without further ado, it's, it's unfortunate, but it's also fortunate because the man is on the rise. Damon Dog is leaving PHX Cardinals. This is his last show and it's been an absolute privilege honor to work alongside with him. He's my road dog and we're wishing him all the best. The great news is, Damon, you're staying with phx. Your star continues to get brighter. You're going to be joining the crew. You actually. You tell us where you're going from here.

Speaker D: Yeah. So basically I'll still be doing all my same regular stuff with PH or with AZ Wildcats podcast over there, but I will be Moving to the PH&XD back show full time after this week. And yeah, you'll be getting a new producer on PH next Cardinals. I will be leaving it in good hands. And I'm sure, you know, he'll. I'm sure, make a name for himself very early on with all of you fine people. But, yeah, it's. It's like you say, it's. It's bittersweet. You know, I think it's. You know, I never. For just, you know, for a look into my life, like, I've never really thought of myself as a producer for full time. That was never my goal. But this show in particular did so much for me in my career in terms of, you know, putting me on the map, even just being here every day with Johnny, Bo, everybody here in the chat. I mean, this is. This has been a family that we've created, a community that I'm extremely proud.

Speaker C: To be a part of.

Speaker D: I mean, I think when. When I kind of took over here, took the reins from Emma, we felt that there was definitely a ceiling that PH Next Cardinals could get to that we hadn't gotten to yet. And I feel very proud of the work that we've put in here in terms of getting that. Jonathan Gannon interviews, Kyler Murray interviews, like, Trey McBride multiple times. All of the top dogs. Right. And it's been an unbelievable ride, you know, from hold the Line to, you know, now a team that looks like it could make a playoff game. Like this is. This has been a lot of fun. I'll never forget this. This time period in my life, and definitely super grateful to this show, this chat and. And mostly you and Johnny for, you know, setting me up for success and also always supporting me. And, yeah, it's gonna be hard, but. Because I love this show and love being a part of it, but I'll still be around and I'll still try to go to all the events and, you know, I'm still here at PHNX Sports, so, yeah, it's. It's definitely gonna be tough, and I'm getting a little bit emotional talking about it, but definitely, I think a step that was needed at some point in my career. But I'll always love this show and be happy to, you know, see what the. The things that you and Johnny are gonna accomplish, because I know it's only going to keep going up and. Yeah, it's special. Truly a special community that we have here.

Speaker C: Yeah.

Speaker D: And hold the Line forever. I.

Speaker C: And I think the. The hold the Line movement, man. I mean, that. That's. That's all Damon Doc, and he's going to be forever part of PH and X Cardinals lore and a big part of, you know, the growth of this show like the HTL man. Like that. You go anywhere where you. It's State Farm Stadium or we're hanging out at the draft party. People shout hold the Line. And it was, it was started by sweet baby Damon dog, little infant Damon dog who just cutting his teeth.

Speaker D: I think that true, that truly was sweet, innocent newborn baby game dog. When I came up with hold the Line, pretty much the. I mean, still the biggest thing that I've. That I've done probably in my media career, but definitely like the first big thing for sure where it's just like I, I couldn't. I'd go on like Cardinals Instagram posts and see people in the comments that have had zero interaction with me, just saying like htl, right? And I just be like, what. What the hell is happening right now?

Speaker C: But yeah, I don't think there's ever been anything like really in the fan base like that. So you should be proud to have been the, the leader of the hold the Line movement. And because of that, we will, we will retire your hold the Line jersey on the PH next Cardinals show.

Speaker D: What's funny about what Chris said right now is that we thought about going in this direction. Bo and I talked about show. We were like, should we just tell everybody that I'm leaving to go move in with Ruby Rose and I'm now her film producer. I'm her content producer now. And yeah, we were just gonna start our lives together.

Speaker C: Yeah.

Speaker D: Yeah.

Speaker C: Partner, friend. Maybe more. I don't know that. I don't think anybody can. Can deny the chemistry that you guys had at the Kyler Murray foundation celebrity softball game. That, that unbelievable picture that we took.

Speaker D: We got one positive, one guy who's pumped about the move. We got Sean in here. He loves it. Big Ph next box fan Sean.

Speaker C: Yeah. Thank you, Sean. Yeah, it's. It's gonna be epic. I think it's, it's a good move all the. All around. Obviously the day to day. That's especially on this show. We're gonna miss Damon, his voice, all the creative work he does on the back end. But yeah, I think it is going to elevate, you know, the other brands that, that Damon's already synonymous with with D backs, you know, get to do more there and hopefully they'll turn things around and get to start something. A movement there with, with that community. And then you know, obviously your, your, your baby, the AZ Wildcat show your true Passion. Talking about your cats.

Speaker D: Truly.

Speaker C: Yeah. Telling people to bear down each and every day. Spreading the gospel of Tommy Lloyd and, you know, the. I don't know Brent Brennan. But you'll be holding Brent Brennan accountable. Tvac. Right. Noah Fafida.

Speaker D: Lots of guys. Lots of guys. But yeah, it was. I. I do want to say that, like, the. I was telling Derek the other day, I saw him in the office and I just. I was hard to even, like, make eye contact with him because of how bad the Diamondbacks have been playing.

Speaker C: Yeah.

Speaker D: Like, to me, he almost represents the. The organization, if you will. And when I took over.

Speaker C: Make him wear that shame.

Speaker D: Yeah. When I took over D backs in the first place, we were kind of an irrelevant team, similar to the Cardinals right now. I'd argue or not right now, but when I took over the podcast and then we went to the World Series first year I went off the podcast in lieu of Kevin. We were in a playoff spot. We then choked said playoff spot. Now we're playing a rough start to start this season with Kevin at the helm. I do think that a little silver lining for, you know, maybe some phnx Cardinals fans that root for the Diamondbacks like they need. They need that Damon Dog motion in. In that clubhouse because things are not going well. Yeah, things are really not going. I feel like I did what I could for the Cardinals.

Speaker C: Yeah.

Speaker D: We're now on the up and up. We. We drafted Marv. I made damn sure of that.

Speaker C: Yeah.

Speaker D: And then now, you know, gotta go fix the Diamondbacks organization and you know, sorry to the Suns fans out there. I just. I don't have enough in me.

Speaker C: Yeah. You were the hero that, that we needed at one point. Now you're the hero that the Diamondbacks what they need.

Speaker D: I'm getting kicked off according to Hunter Zona for my opinions on Scatter Boo. Johnny is kicking me off. That's a good one.

Speaker C: If, if, if you were gonna get kicked off at any point, it was during how, how aggressively you held the line. Johnny would come after you.

Speaker D: Oh, yeah.

Speaker C: And. And say a lot of. A lot of disrespectful things I will.

Speaker D: Say, you know, hopefully. And we have something in the works here that won't. You won't be missing out on that I should be able to. You know, I think we're gonna find a space here for me to pop on. And Johnny, Bo and I'd all scream at each other and yell at each other about stuff that we get way too competitive about in the. In the future so that it's not the last of Damon Dog and I'll definitely be out at the events and, and you know, wanting to hang out with everybody. So, so yeah, not, not, not like a, not a funeral, but definitely, you know, a bittersweet moment as, as we've said.

Speaker C: What is Noah talking about shunking in the, in the comments? We can't even get there.

Speaker D: That's not something we can talk about live on, on air.

Speaker C: Okay, good, good. Let's get to some super chats here. Let's, let's continue to get that.

Speaker D: You know, we had a few super chats really early on that for some reason they kind of got lost in the fold here with our, our technology. So I want to, I want to give respect to those guys at the front here. Okay. And I'll just read those off. They were the first ones we had. Potato Bread999 said. I like our receiver room, but do y' all think the Cardinals will add another piece before the season like Keenan Allen, or do y' all have someone else in mind?

Speaker C: I don't think that they're going to add a guy like Keenan Allen to the receiver core. It is possible, like they could add somebody that be similar to, to Zay Jones or I, I just don't think that Keenan Allen would be a fit his age, his skill set. It just seems like it would be. It wouldn't fit with the Arizona Cardinals want to do offensively. Everybody was talking about if they were going to do anything, they were going to get somebody with some upside as far as some speed. And that's like, that's not Keenan Allen. I know he can play the slot, but schematically I don't think he fits at all.

Speaker D: Yeah, I'm with you there. Richard comes in 499. Friend of the program Richard said. Is JV quitting the show? The chat keeps ragging on him. Or are we going to have a big new guest on the show during the season like Larry Legend?

Speaker C: Oh man.

Speaker D: Well, unfortunately, I can't say that that was the big news, but it was the speculation was fun while it lasted.

Speaker C: I think that there's a really good chance that throughout the the regular season we'll probably have a big guess we won't have any of that, but we don't break any of that news until closer to the season.

Speaker D: Next super chat here comes from Trenton 4:99 just says do you guys think the Cards make another big trade before the season starts?

Speaker C: I don't think so. I think they're pretty content with where their roster is and they've got a lot of tough decisions to make between now and then. Now, like does Trey Hendrickson, like does that storyline, do they continue to keep tabs on that? Absolutely. I mean, I think Mani Osfor always maintains he's looking to improve this roster any way he can. But as far as what the asking price is from the Bengals and who's really available, who's not available, it, it doesn't seem like they're, they're like actively seeking out any big time deals between now and the start of the season.

Speaker D: Aaron Van Buren $5 why was still cut? Thought he was decent, especially down the stretch. Appreciate the daily dose of off season coverage. Shout out to all the out of state Cards fans.

Speaker C: Thanks avb. That's a, that's a good question. Yeah, Ben still, he's a guy that's been here since 2023 and he's, he's been on the active roster, he's been on the practice squad and they know what Ben still is and I think there is what he is. And then you know what the influx at his position group this offseason and I think they, the kid that they signed from Tulane as an undrafted rookie free agent, they just wanted to maybe see if there was some upside there and give Ben Stilley also an opportunity to catch on with another team before the start of training camp. So I think there's a lot of respect for Ben Stilley and how he approached the game and, and how he prepared and his process and the roles he filled that the Cardinals needed to. But unfortunately just with the influx of talent just be kind of came the odd man out.

Speaker D: So someone in the chat said all dogs go to heaven. And then someone said that that hit very hard which just making me laugh back here. But Midwest Mike, not a super chat, just wanted to shout him out. Said he just became a Die Hard member with our new sale going on.

Speaker C: Hell yeah.

Speaker D: So Midwest Mike, feel free to hit us up on Twitter. We'll throw you a follow. We always follow the people that you know do Die Hard, get Die Hard memberships and send it to us. So yeah, totally unbelievable.

Speaker C: Midwest Mike, welcome. We'll see in the exclusive member discord. Let's keep it going here we got is this Sara Martinez. 10 bucks. Thank you. And really active in the chat. What do we want to read here?

Speaker D: She said Redbirds fans are the best in the league. I believe that was what she was trying to get across here.

Speaker C: Let's go. We like that. Appreciate the super chat. Welcome Anytime. Welcome to the community, Richard 199 just have to say. Oh, okay. Forks up to Damon Dog. That's not cool. He's doing Forks down. How about our guy Tyler Bird Gang travel club keeping you up to date with all the deals going on. Shout out to PH next listeners. The Moscoro Group.

Speaker D: Yeah. Mascoro Group setting up a group of eight for Dallas. I believe that's a. A family. We offer large group discounts, 8 or more for either New Orleans or Dallas. Really cool stuff.

Speaker C: Hell yeah. So Moscow group is PH next listers. That's fantastic. Eight of them going to Dallas. Cashing in on the great discounts that Tyler and Burgan Travel are setting up. And nobody does it better. We're so excited to be partnered up with them this season. Our official travel partner here for Ph&X cardinals going to be going to the season opener to the Saints. Join us for that. And then it's got the other trip to Dallas. Monday Night Football. You want to be a part of that? Tyler and crew, they're going to set you up for that. Very well. Got great incentives like deals right now. Plus you know, the swag bags. Calais Campbell helmet. Can't get much better than that than Bird Gang travel. About Ryan Carley.

Speaker D: Yeah. Again, not a super chat. I just wanted to say he says we're going to miss those fire Damon Dog graphics. You got another thing in store for you, brother. I hope you're ready for the show.

Speaker C: We got something coming down the pipe with the Damon dog successor. Jonathan Castro199fly Damon fly. We hope to see you as a guest. Yep. No doubt about it. He will make some, some, some guest appearances on this show going forward. Doors always open.

Speaker D: Yeah, I, I look very forward to it. Rejoining my, my family here on the phone.

Speaker C: I like to is always changes up his name. Today he's Tony Dog. In honor of the Damon Dog. Are we ever putting Fitz into the ring of honor? What are we waiting for? I think they're waiting for Larry Fitzgerald to be enshrined into the NFL Pro Football hall of Fame. First. I think he's going to be. He's going to get the call I think next February. And then he'll be enshrined in the summer of 2026. And I'm sure the following season will be just a Fitz love fest.

Speaker D: Tony, I appreciate the name change, brother. Means a lot.

Speaker C: ZT Torres, one of our diehards. Good luck dog. You'll be missed on the pod And.

Speaker D: I will miss all of You. It is, as I keep saying it is incredible community we have built here at PHX Cardinals. And I really do feel that the, you know, the. The floor is the. Is the moon man.

Speaker C: Like, this is.

Speaker D: This is a. A podcast that, like, it just doesn't stop. And it's because Johnny and Bo are just. They're such grinders and they love it so much. And you see that in the content and it's infectious too. So I just, you know, it's gonna. This podcast is gonna continue to just do insane things. I know it for sure.

Speaker C: Thank you, my man. Another super chat by Noah. Would you like to read this?

Speaker D: Okay, Here we go. Noah, $5 for Damon to read. Shunk shunk wawa wee wee, poo poo, pee pee, Dolla dollar bills, y' all. Hashtag Noah to goat.

Speaker C: That's great. Up. And he's gonna make an appearance. Not the last you'll see of Noah. Classy. Nasty. PH and X let Damon Dog off the leash. He must be in heat. Kind of gross.

Speaker D: Did you just. I miss it. Misgender me, bro.

Speaker C: We got the Alberto. The roof is the ceiling. To quote mj, Michael Jordan tired than that. Yeah. We got Fishbowl Flash. Breaking news. PH and X Cardinals is trading former first rounder Damon Dog to the PH and X D backs in return for Joe Blow and Mocha Frappe for jv. That's not. That's a lopsided deal with us in the D backs. We would never get bested by Derek like that.

Speaker D: Yeah, I mean, Derek, certainly. I. Listen, we're in a fantasy football league with Derek. That's the kind of offers that you would come to expect from. From Derek Montia. And then, you know, like last season, I remember, for example, if you think I'm just BSing you, I wanted Tank Dell off his roster. When Tank Dell was the third wide receiver was before the injuries to Stefan Diggs into Nico Collins. And I was offering cheap trades because he's the wide receiver three for a team that wasn't passing the ball too well. And. And Derek's like, in my face, like, screaming at me that the offers aren't good enough. And I'm like, how much do you expect for Tank? You want, like a starting running back for wide receiver 3. Classic Derek Montia stuff. I'm sure he offered that, but yeah, it was turned down. Renegotiated.

Speaker C: Airbud 6, Damon Dog Chronicles.

Speaker D: We've got more like Airbud, like 17.

Speaker C: Probably 101 Damon dogs. And then I think Tony Dog was just Saying well said to Noah's super chat. I think he just thought that was incredibly well put. Profound. His super chat for you. You're going away. I'll say this and I don't want to say hopefully take it as a compliment. I see. Especially professionally, I see a lot of myself in you. I like Damon Dog. Started behind the scenes, the producing, but my passion was to get in front of the mic and Damon is. He's done a lot younger than I am and I'm excited to see what he's going to become. I'm going to miss us being road dogs. Getting out there. Late night Taco Bell spots. What was our. The was. What was the one spot Indy that we hit up at like 12:15 in the morning?

Speaker D: I think that was a Sonic run potentially. We did Sonic and talk TB back to. Back in Indy. The.

Speaker C: The.

Speaker D: The wonderful culinary history.

Speaker C: Was it Grill out?

Speaker D: Yeah, yeah, that was. That was the one in. In. In Mobile in Alabama and yeah, that place is pretty solid. Or cookout.

Speaker C: Cookout.

Speaker D: Yeah.

Speaker C: Cookout was fantastic. A lot of memories on the road with Damon. We're gonna try to see if we can swindle him and finagle him into some of our road trips coming up.

Speaker D: This might be in Johnny Suitcase.

Speaker C: Yeah. Maybe Denver, maybe Indy. I mean, we can't do the combine without Damon Dog. I mean that just doesn't seem right. He's got to be there for our dinner to make sure that Johnny cleans his plate. But it's been, it's been a privilege, man. It's been so fun. Can't wait to see what you're gonna do with those other shows. To the moon with them and can't wait to show you guys. See what's in store for this show beyond Damon Dog. You've already gotten a little taste, but we'll unveil Reveal all that come Monday and. And get. Hopefully get a close to 100 health Johnny Venerable by then.

Speaker D: Yeah, certainly. And I know Johnny, it's. I'm gonna give him crap for it forever, but I know this is crushing him to not be here today, so.

Speaker A: Or.

Speaker C: Or he's a coward and he just. He just kind of, you know, first he was going to be in studio, then he's not in studio and now he's not on the show.

Speaker D: Yeah, he did slowly kind of trickle that news down to me.

Speaker C: Just kind of slipping out of this. You know, every. Every time we talk to him, it's it.

Speaker D: He just kept giving me a little piece of information more and more and more that like it was just to kind of let me off the, the leash slowly, I think.

Speaker C: But zt, I think nailed it. JV just couldn't handle it emotionally, you know. That's exactly right. He's just a mess right now. He's probably sobbing at home and just trying to pick up the pieces.

Speaker D: Yeah, that's, that's classic Johnny. He, you know, he's a tough guy, y' all. He's big, big tough truck guy and you know, he doesn't want to see have people see him cry. I get it.

Speaker C: He views himself as a bit of a father figure to you and he didn't want, he, you know, dad didn't want to let you see him cry. So that's, that's just, he plays that role all the way till the end. But everybody, us included, wishing the best. Damon Dog, thank you so much for all the great work you did. One last time. Hold the line. HTL for Damon Dog. Subscribe to PHX Sports here on YouTube. Take advantage of our Diehard deal at go PH&X like this video. And don't just follow PHX. Underscore Cardinals on Twitter and Instagram and Bobrock and Johnny Varenbol. Follow Damon Dog so you know what he's up to the rest of the way during his journey here. Making great work for PHX Sports. Have a great weekend. We're going to talk to you Monday. 4:30 right here. PHX cards.

Speaker A: And now a next level moment from AT&T business. Say you've sent out a gigantic shipment of pillows and they need to be there in time for International Sleep day. You've got AT and T5G so you're fully confident, but the vendor isn't responding. And International Sleep Day is tomorrow. Luckily, AT&T 5G lets you deal with any issues with ease. So the pillows will get delivered and everyone can sleep soundly, especially you. AT&T 5G requires a compatible plan and device. Coverage not available everywhere. Learn more@att.com 5G Network.

Speaker B: You've got the football jersey, you've got the passion, but you're chasing it with, well, whatever tequila some celeb was pushing. Come on, don't be a gringo. Gran Centenario tequila has been crafted for centuries in the highlands of Jalisco, Mexico. That means real heritage, real expertise, real tequila. No gringo self, just a product of centuries of expertise. Mexico's number one. So next time you raise a glass, make it Gran Centenario. The tequila Mexico drinks. Don't be a gringo drink, Gran Centenario gran Centenario Tequila 40% alcohol by volume Proximoproximospirits.com.

