" The long-awaited rebrand is finally here and it is delicious.  All the details, now the magic make it worth it today on Lock-Dawn Magic.  You are Lock-Dawn Magic.  You're daily Orlando Magic Podcast, part of the Lock-Dawn Podcast Network.  You're teamed every day.  And you are indeed locked on Magic today.  It is June 3rd.  It will be June 4th, 2025.  My name is Philip Rossorneich.  I am the senior writer over at OrlandoMagicDaily.com.  It goes by me on Twitter at Philip, our underscore OMD.  And on Blue Sky, at Philip R. R.  On today's episode of Lock-Dawn Magic New Logo,  who discs your Orlando Magic's long-awaited rebrand has finally happened.  What the magic got right, what the magic.  Good and tweaked still, maybe a little bit.  Now the magic hit this rebrand out of the park.  But ultimately, it's success depends on what happens on the floor.  We're gonna get to all that coming up here.  In just a moment first, we want to thank you again for making Lock-Dawn Magic part of your day every day.  No matter when you listen to us, whether it's first in the morning, whether it's right,  we upload.  We truly appreciate you making Lock-Dawn Magic part of your day.  Everybody, we truly appreciate all of our every dayers, our every day listeners.  You guys rock, keep spreading the word.  We're still going strongness off season as we try to get to 5,000 subscribers on YouTube before the start of the next season.  The Lock-Dawn podcast network, your team every day.  If you are listening on the audio, appreciate you.  Love our audio listeners.  You guys rock.  Doesn't mean a lot of visual aids in this episode.  This is a visual episode.  If you probably were confused by the intro, I am holding a cookie from the event this morning,  from Tuesday morning as the Orlando Magic have officially unveiled their new logo, their new jerseys,  their new look, their new branding.  After four years, according to Alex Martin's of research development and thinking and tinkering,  the Orlando Magic have unveiled to the world their new look.  And before we dive into each individual piece of this look and begin breaking it down,  I want to say this, they did a great job.  There are things to debate.  There are things to look at.  I think generally when this stuff happens, people are like, just don't be bad and this is not bad.  You can dislike parts of pieces of this thing.  This is not bad.  The Magic did a great job on this.  When I first got a look at all the new branding on Monday, they sent it to me early,  so I could pre-write some stuff before they officially announced it.  My first thought was the logo is a home run.  Hit it out of the park.  I told Magic PR.  I told Shelley Wilkes, the executive vice president in marketing and social responsibility for the Orlando Magic,  that I really think they did a good job.  I hope my voice carries some weight as a fan from my youth and now as a reporter covering the team.  I really think they did a good job on this.  Throughout this process, as Alex Martin said it and put it,  the Magic tried to listen to fans.  They knew it was time for a rebound.  The Orlando Magic had the same logo since moving into the key center,  in 2010, they've worn the same jersey since the 2009 season.  It was time to update the look.  Frankly, and we're going to get to this point here in a minute,  the old jerseys as much success as the Magic had in 2009 and 2010 and through 2012,  they'd kind of become synonymous with losing with the darkest period in the franchise's history.  Now with Paolo Ben Caro, now with Franz Wagner,  and obviously this process started in 2021, if not sooner.  The development of this jersey, of this look, at least according to Alex Martin's,  really kicked into high gear in 2021.  And so obviously they didn't know the timing of all this,  that it would come with the Magic on the upswing.  But very, very clearly, they wanted to tap into this nostalgic power.  They listened to fans, and I would agree with this.  I've had fans tell me this a million times.  Just go back to the original War Mark and logos.  Just go back to all the original stuff.  That was the best. It was perfect. Why did you ever leave it?  Well, some of it is that, yeah, sensibilities change a little bit.  Go back and look at some of those jerseys from the early 90s, mid 90s, late 80s.  They're pretty gaudy.  They are definitely of their time.  and look, as iconic as the magic original logo is, it is very much a product of the 90s.  It is very much a kind of cartoonish, loud, bold statement. And brands should have all, they  shouldn't change. The magic very much had to signal a new era after losing Shaquille O'Neal and  kind of develop itself a little bit and all that stuff. But, but ultimately Orlando came back to  its history. They came back to their past. They came back to why fans still have such a deep  connection to this franchise, even if they aren't magic fans. Those pinstripe jerseys of the  early 90s, mid 90s, throughout the 90s, the whole 90s. In fact, those pinstripe jerseys  are some of the best NBA fashion there is. There is a strong statement to say, we all should never  have left that. The font was perfect and we'll get to what the New Jersey's look like here in a minute.  The magic very much heard from fans and their focus groups and their social media surveys  heard from fans. We love the throwback stuff. We love the original jersey. We love the original  word mark. When the magic changed their logo in 2010, I described it as the franchise maturing.  They kept the pinstripe jerseys. They saw the pinstripe. They still had that call back, but it was  trying to be futuristic. By dumping the star as the A, to me, that was always the most egregious  thing that they did. It wasn't that it wasn't bad, but it made the logo lose some character.  In my opinion, it made the branding and it made the look for this team just feel very  corporate and buttoned up. That's not necessarily a bad thing. Like I said, the magic  changed their logo for the 21st anniversary season. The franchise was old enough to drink.  It felt like I'm trying to be mature type deal. And very clearly, as you'll see as we dive into  the branding a little bit and I showed here on the YouTube, YouTube. So if you're listening on  the audio, go check out the YouTube page, subscribe to YouTube page. We're going to do some  audio. We're going to do some visual stuff here. I'll try and describe things for those who  prefer to listen on audio, but all this is on the YouTube page. All this will be on the YouTube  page as well. Just go to lock dot magic. The magic very much heard from fans and listen to fans  and say, give us the old stuff back. And frankly, the re-emergence, the re-emphasis, the  the bringing back to your lando magic theme song, the celebration that was the 35th anniversary  season last year, which was wrapped in nostalgia. Whether it was the jerseys, which were  Magic did not go back to the pinstripe jersey for the first time. Clearly, we'll see why they  didn't do that here. They went back to the trace of a great stars, error jerseys. We'll probably  see that for the 40th anniversary season. We'll probably see the white version of that jersey  for the 40th anniversary season here in five years. Since you'll see why in a second, if you haven't  seen the jerseys already, the magic clearly heard loud and clear. There is a deep connection,  a deep cultural connection to the jerseys, to the look of this franchise's history.  And that very much seemed to inform everything the magic put out and presented to the public as  their new look as their new brand on Tuesday. Now, I want this to be the big takeaway of this episode.  I am a fan of this new look. There are things we will argue about. There are things that I don't like  that I think could have been tweaked and improved and should have been fixed and spotted and all that  stuff. But overall, I like this. If the magic can't go back to their original jerseys and their  original look and all that stuff, which, and we will say they cannot. This is a forward thinking. This  is a modern update to what we associate as the magic look. And again, we can argue and disagree  about some things here and there. And that's fine. I would grade this as an A minus, it is like seven  or eight out of 10, if not a nine out of 10. There are things to tweak and be like, okay, I don't  know quite about this. But all things considered, magic fans have to be really happy and really  excited about the way the team is going to look. Because now they got the fresh duds, they got  the fresh fit. Now they can go out and make things happen on the court. So what does this all look  like? If you're watching on YouTube, I'm about to show you.  If you're listening, I will try and describe it to you.  We'll get to that coming up here in just a moment.  But first, today's episode of Lock-Dawn Magic  Smudge Bear Friends over at BetterHelp.  Let's talk about something that doesn't get talked about enough.  And that's men's mental health.  There is this pressure to always keep it together,  to perform, provide, and never show weakness.  But the truth is real strength comes  from opening up and taking care of your mental well-being.  Every year, six million men in the US experienced suppression  and many go undiagnosed.  But talking to someone, a friend, a loved one, or therapist  can make a huge difference.  Therapy isn't just for moments of crisis,  although it's good to have that person there  and that relationship established when you are facing one.  It's great for learning how to set boundaries,  building healthy coping tools,  and being the best version of yourself.  With more than 35,000 licensed professionals,  BetterHelp makes it easy to find a therapist  who understands you.  You can connect from anywhere, so it's  your purpose at any time, and fit sessions  into your schedule with just a click.  As the largest online therapy provider in the world,  BetterHelp can provide access to mental health professionals  with a diverse variety of expertise.  Talk it out with BetterHelp.  Our listeners get 10% off their first month  at BetterHelp.com slash lockdown MBA.  That's BetterHelp.  H-E-L-P dot com slash.  Lockdown MBA.  MUSIC  So we talked about it for 10 minutes.  Almost 12 minutes now on the show.  Let's show them.  Let's show off the goods.  Let's show off what this whole thing looks like.  Here it is.  Their line of magic's new logo in its beautiful glory.  Now, there are a lot of people who  are kind of annoyed by this trend to go to circular logos.  I have long suspected as teams of trended toward circular logos  or like the sort of crest type logos  that it is a preview for the eventual ads on jerseys.  It's coming.  You can like it.  You can hate it.  It's coming.  All things considered, we could argue about the font.  And I think most people, as I've looked at the responses  to the magic's new look, the font comes up a lot.  A lot of people are not super thrilled  with the font that the magic are using and how that looks.  But all things considered, this is pretty much what  you would expect from the magic logo.  Ryan Devos, he's on the board for the magic.  Of the family, he has as involved as anyone  on the day-to-day of the magic operations.  Ryan Devos talked to us a little bit about the logo design.  He said, look, if you're not going to represent magic  as a hat, a rabbit coming out of a hat,  you really don't have a way to represent the magic.  I think that's always been one of the problems  of the quote unquote, magic logo.  It kind of has to be what it was originally,  where you have a basketball with trailing stars.  You have the star as the A. You touch up  what your word mark, what your logo looks like.  And so that evolved into what we had before, which  is very stayed very corporate, again, all that stuff.  There's very clear that bringing back the basketball  with the trailing stars, the old-school type of logo  was part of the priority in this.  This is to bring back something that  looked more like the regular logo.  That looked more like the original logo.  And honestly, I can't complain.  It's someone who adores the original logo.  Again, I don't know if I have anything behind me  that has it on there.  You actually know, not really.  As someone who enjoys the original logo, and again,  I think that is the peak as much as I  love the kind of the streaking ball logo magic  if he's essentially since 2000, as their secondary logo,  this is as good as you could get.  And look, I'll go ahead and go full screen here again.  On my cookie here, secondary logo,  like to me, that's the magic logo.  To me, that's what the magic secondary logo should be.  So in this sense, I really think the magic did it.  They're like, I saw this logo, and I was immediately like,  A plus, you hit this thing out of the ball.  Now, logo is a logo. It's going to be its center court. I'll actually put up the court  here in a minute. Court looks amazing. It looks better in person than it does in the mock  up that I'm showing you on the YouTube here. The black really pops, makes the blue pop  on the court. Again, you can see the word, the word marking on the sidelines as well  or on the baseline as well. The stars are back. That is a big, big thing in this. The  magic did a really, really good job. Now, let's go to the jerseys. Let's turn to the  jerseys now. The jerseys, I think, are a really good progression and evolution of the original  pinstripe jerseys. The bold pinstripe, they're back. Like this is not a half measure pinstripe.  These are pinstripe jerseys. They look like the magic jerseys. They look like the jerseys that  we remember from the 90s, but obviously the fonts a little bit different will get to the  statement edition jersey here in a minute. But I saw these and I was like, the icon edition  that white jersey by far my favorite. That is, that is what a magic jersey should look  like. You can even see here on the pants. They got the magic logo in the middle. They got  the blue and black like the original. They actually, you can't see it in the photo that  I have that the magic sent us, but they have the stars on the side of the pants, not as  low as it was in the original, but you could tell like this is a very clearly inspired by the  original, original pinstripe jerseys, but given a little bit of a twist, you know, given a little  bit of an update. Now, I will agree with you on this. And I've seen people evolve on this  as the days gone on. And again, I think for the most part, magic fans have been really positive  about this, about this rebrand. And, and, you know, I was talking to some people after I saw  it originally on Monday, um, after I saw it originally on Monday, I was like, people were worried  about it when it became clear that this was happening today. And I said like guys, like you're  going to be happy. Like there are things that you'll probably agree or disagree with. But for the  most part, you're going to be very, very happy with how this looks. And again, like the white  jerseys to me are exactly what I want to see. Again, you can hate or love the font. And I think  the grade that you give this jersey is going to depend on how you feel about the font.  The magic could not go back to their original font. That is, you know, protected, you protected,  you know, classic logo now. NBA rules will not allow them to do that. Could this be a little  different? Sure. I don't know what the other options were. But I really, really like the white  jerseys to me are perfect. And honestly, I would have loved to have seen magic on the road,  on the road blues. Now, I like these blue jerseys. Do not get me wrong. Um, this is a great idea.  This is a great template. I actually don't even hate the number marking. Um, what this photo with  fronds of the magic sent me does not show is that Orlando is kind of small. It's kind of squished  up. And, and the magic kind of did this with the, you know, the next kind of did the same thing  where they kind of went back to a classic jersey, but they had New York across the, the chest,  like straight across the chest, not tilted, not curved, not curled, um, not arched, whatever it is,  I don't know what the exact term is. Um, and New York just looked kind of small and scrumched.  Orlando looks the same way on these blue jerseys. Um, again, I love having to star back as the A,  I think that that that distinguishing characteristic, that distinguishing mark is just so iconic to me.  When they got rid of that in the 2010 logo, I was like, I get the idea. I think that's a mistake  because you've taken away all character from the logo. It literally just says Orlando magic. It  doesn't say anything else. It doesn't mean anything else. Um, it's got no distinction to it. Um,  the blue jerseys are fine. Um, and again, like the, the idea, like I love the ideas and the concept  behind these jerseys. And that it is the original pinstripe jerseys evolved, like updated, modernized a  little bit. And again, how far you go with this goes with the font. The one that I figured would  have everybody talking though was the statement edition jersey. Now these are the third jerseys. These  are the, uh, I don't know what, what's the, I think blue was the statement edition last year,  but these are your third jerseys. And I was personally told that they will be around for three years,  that they'll be updated again in three years. These take inspiration from what I think is one of  the best pieces of magic fashion. And that is the original road, um, road warm up jersey. Now,  those looked exactly like this pinstrips on the bottom magic going across the chest, um, and  diagonally like that. And then blue on the top and blue on the left sleeve, I believe on one,  one or both the sleeves. I don't remember. I have to go back and go back and look at my,  look at mine. Um, that's where the inspiration of this comes from. So again, you're,  you're playing with nostalgia. And honestly, I, I would say this, I think these have grown on me  a little bit. Um, I did see them in person. They are all black.  the back so that blue doesn't carry over to the back. There is their speaking ball on the back  either, which is a little disappointing as well, which is the best part of those jerseys. But  overall, like, these are really nice. And they've grown on me a little bit. Yeah, could they  have pinstripe the top with the blue. That's not how it was on the original warm-up jersey.  For an alternate third jersey, these are fine. Are these with the match? Probably going to wear  an opening night. Probably not an opening night because they want to showcase the other parts of  the jerseys. But the other other new jerseys. But again, I've always been of the belief that when  you have big corporations, when you have big industries, I'm always for them taking risks and doing  something different and not playing it safe. I will give the magic credit. This is not playing it  safe. This is trying something. This is seeing if it works. This is doing a callback. Not apologizing  for it. And so I will applaud the effort even if it doesn't work out. Honestly, I think it's  decently executed. Again, I think all of these ideas are good ideas that for the most part are  executed well. Are they executed perfectly? No, not all the time. But I think these will grow on  us. And I think, again, I'm a big fan of what the magic did here. I think the magic really,  really did a good job showcasing these ideas. They had a clear purpose with what they wanted to do  with this with this look and with this logo. And they went out and they hit most of the marks that  I think fans want to see. Did they hit every mark? Probably not. Again, I think people are arguing,  the biggest thing people are arguing are the fonts. And that's about it. And if all you're arguing  about is fonts. And everything else people are generally pretty happy with. I think you've done a  pretty good job here. Ultimately, though, ultimately, our feelings about these jerseys aren't going to  have anything to do with these design preferences or anything else. It's going to be about how we  associate these jerseys with the team. The magic of always used their look and their brand to define  their era. It's on Palo and France and this Orlando magic team now to define what these jerseys are.  The new era ahead of the Orlando magic coming up here in just a month.  But first, today's episode of a lockdown magic is brought to my friends over at open phone. If  you're running a business, you know that every missed call is money left on the table. Think about  the last time you had an urgent need, maybe for plumber or service provider. If the first person  in answer, did you wait? Probably not. You moved on. That's why you need open phone. Open phone  is another one business phone system built to streamline and scale your customer communications  all from an app on your phone or computer. Open phone lets you manage business calls and text  from a single app. The shared inbox feature is a game changer your team can jump into any conversation  instantly without missing a beat. And their AI agent handles after hours calls answers common  questions and captors leads to you never miss a customer. Open phone is offering our listeners  20% off your first six months at open phone dot com slash lock on an NBA that's open phone,  O P E N P H O N E dot com slash lock on NBA. And if you have existing numbers with another service,  open phone will port them over at no extra charge. Open phone no missed calls no missed customers.  When you watch an Orlando Magic game, past or present, you always know what you're seeing.  You don't need to see the players on the floor, the numbers on the jerseys. You just have to look  at the jersey themselves. Would the pinstripe of that original Orlando Magic team be so beloved,  be so nostalgic, be be be something the magic want to revive in some way. If not, for Shaquille,  Neil and Penny hardaway and the sensation they became. Would we even think twice about the stars  jerseys? If not for tracing a grade. Frankly, nobody remembers the jerseys in Magic war between  T Mac and white or what white war, what T Mac war in his last year and what white war his first,  what three seasons in league, because a they were bland and boring and terrible, but b because  Magic didn't do anything. Why did people grow kind of tired of the Magic's old jersey set?  Because while the Magic went to the finals in them in their first year wearing them,  they began to become synonymous with losing.  with a decade lost in the wilderness.  I can't tell you how many times we would report  all the magical wearing white tonight,  and I'd have a stream of fans tell me  I don't like the white jerseys.  We always lose in the white jerseys.  It's not just that maybe the jerseys  weren't beloved or distinctive to begin with,  it's they become associated with losing.  The magic leader rebrand  as much because, yeah, things had gotten stayed  like the magic worn the same jersey set since 2000,  not since the 2009 season.  17 years in the same jersey.  It was time to upgrade an update.  Magic, you know,  you obviously experiment with some stuff with the city  edition now that now on the Nike deal,  but it was time to update and upgrade.  It was time.  But it was time to because this is a new era of magic basketball.  This is an era that needs its own visual language,  its own distinction,  its own way for fans to always know  this is the time that I'm watching.  This is the group that I'm watching.  This is the excellence I expect.  And what now becomes so exciting for the real endomagic  is they have a chance to define this era.  Anybody sitting on the fence about what these jerseys are  or whether they like or dislike these jerseys,  and this logo, to be honest,  it's gonna come down to one thing.  What the magic do in them.  How the magic perform in them,  the iconic moments that become extra to our brain  while they are wearing these jerseys.  It's gonna come down to,  is this the jersey the magic wear  when they lift the Larry O'Brien trophy  at the first time.  Is this the jersey the magic wear the next time they go  in the finals the next time they want to play off series.  For however long the Palo Ben Carro and Franz Wagner are in Orlando.  These are the jerseys that are going to define their era,  define this era of magic basketball.  Look, it is a bit of luck  that the magic are changing their look and changing their brand  on the precipice of a new era.  Of an era that has fans excited and motivated about this team again.  That has fans engaged about this team.  I see everyone watching and listening to my pause.  Like it is higher than it was two years ago.  People are excited and interested about this team again.  And look, they started this process in 2021.  I was told the jerseys were done and approved at the beginning  of the season, not in time to make it for this season.  But the magic very much have timed this  at a really important and fortuitous moment.  Because we expect to busy off season.  After two straight playoff appearances,  we expect the magic to take steps to make a leap to the next level.  We expect that Paolo Ben Carro and Franz Wagner are two max players.  The first time the magic gave it two max players since Dwight and Richard Lewis.  That they could be all stars at the same time.  The first time the magic would have two all stars  and the same team since 2009.  When Jimmy Nelson and Richard Lewis also made it  in addition to Dwight Howard.  We understand that this is the magic's best chance to win a title  in almost two decades now.  Scary that we're coming up on the 20 year anniversary of that team.  We understand what is possible with this group.  And ultimately all the accoutrements,  all that other stuff, it doesn't matter.  As much as everyone complains about the Cleveland Cavaliers  wearing those black sleeve jerseys during game 7 of the NBA finals that year.  That's the iconic moment.  I bet I could ask cows fans  and they would say they love those jerseys.  Ultimately, ultimately success is what defines the era.  Success is what defines how we view  and how we look back at these moments in franchise history.  And these jerseys are certainly a callback  to a successful time,  to one of the most successful times in franchise history.  They are certainly trying to dig up that nostalgia.  But they're different enough that they can carve their own place.  And if the magic start to take the league by storm,  if the magic are able to win a championship,  you know, and do more beyond that,  then these will be the jerseys that define the franchise.  And all those people on the fence will probably buy theirs and love them too.  At the end of the day, this is all window dressing.  And that's good.  Window dressing is good.  It entices people in.  It's new merch.  I'll probably get my merch at some point too.  But ultimately, what is going to make these jerseys a success or failure, an all-time  great or an idea that didn't quite hit the mark.  Is a, how they look on the floor and action.  But b, what the magic do in them.  Orlando as an organization has always changed their look to define a new era.  It was Shaq.  Obviously in the initial years, they did it after Shaq left with Penny and T-Mac.  They did it after T-Mac left with white.  And now they're doing it with Paolo in France.  And ultimately, the staying power of this jersey, the staying power,  is going to be how long this era of magic basketball lasts.  And what the magic are able to do with it.  I want to thank you all again for listening to today's episode of Lacton Magic.  You can always find me on Twitter, at Philip, our underscore OMD.  And on Blue Sky, at Philip, our, you can subscribe to the podcast.  On Apple podcast, you can tune in to him on Google.  It's all for me.  So you download the podcast to your podcast, enable us the advice.  You can find us on YouTube as well.  Just search for Lacton Magic and goals.  You get to get to 5,000 subscribers before the start of next season.  We've just crossed 4,000 a few weeks ago.  I truly appreciate that.  Keep telling your friends.  If you're an audio only listener, this is again a great episode to look at,  to be visual.  I'll show my cookie one more time.  So I'm going to eat it after the show end.  Definitely subscribe on YouTube if you have not done so already.  For the latest on the Lacton Magic, be sure to check out Orlando Magic Daily.  I'll come where I wrote plenty about the new logo and what it all means.  You can find that at O, Magic Daily, or to Lacton Magic Daily.  I'll come and follow us on Twitter there at O, Magic Daily.  And for even more Orlando Magic content where I'll be getting back to player  evaluations tomorrow, you can check out my Patreon page, your line of magic  hub at patreon.com slash Orlando Magic Hub.  As always, thank you for your support.  Now that you're done making Lacton Magic your first listen of the day,  go and make your second listen of the day.  The Lacton NBA Big Boy Show, NBA Draft expert Raphael Barlow reacts  to every workout interview and rumor leading up to the NBA Draft.  Find Lacton NBA Big Boy on YouTube or wherever you listen to podcasts.  That's good to do for me today though.  I want to thank you again for listening to today's episode of Lacton Magic  on tomorrow's episode of Lacton Magic.  It's your Orlando Magic preview of the NBA Finals.  What the magic should be and need to be watching in the NBA Finals and what they  can learn from the Indiana Pacers and Oklahoma City Thunder.  Plus I'll make my prediction.  I'll go on record for it.  We'll talk about that tomorrow on Lacton Magic.  But until then, for Orlando Magic Daily Lacton Magic is still  brought tonight and we'll still get next time for another episode of Lacton Magic."