" Alrighty, hello everyone and welcome to what it is.  The 8th of July 2025.  Happy Tuesday to you.  I'm Derek Hunter.  This is the Derek Hunter podcast.  Appreciate you listening, downloading, sharing, telling a friend, all that good stuff.  It is a lot of stuff to go on to.  Appreciate everybody goes to patreon.com.  I'm sure Derek Hunter podcast too.  Supports the show and all of that good stuff.  A little bit congested just in the throat.  But anyway, we'll get through it together.  We've got to talk about the start of the end of the conspiracy or what?  What really happened in the Epstein files?  Story in Axios says it all.  Exclusive DOJ FBI include Epstein had no client list died by suicide.  There are a lot of people out there who are not believing this.  I believe that he killed himself.  But I believe that there's no way in the world that there aren't more people involved in his perversions.  But I can't prove it.  That would be my stance.  I believe the guy like that living his life, living life, he was not just the sexual perversions,  but the millions of dollars, the freedom, the liberty to go anywhere, the ability to go from that to spending the rest of your life in prison,  23 hours of the insolitary confinement.  That is not a way anybody would want to live.  A lot of people do, but nobody would want to live that way.  And I think he would be less likely than most somebody filthy rich idea of living in a box.  It's just not appealing to them.  And so I could see how somebody would kill themselves.  I just don't see how he could have done what he is alleged to have done.  And what we know he did alone or with just Gailaine, Gailaine, whatever the hell her name is,  however you pronounce it, Maxwell.  I also look at it as if there was this client list that Gailaine would be selling it, would be using it, would be putting it out there.  Because she could get her ass out of prison if there were hundreds of rich, powerful people out there.  She could trade them, their names for her freedom.  And she would do it in a heartbeat.  We're not telling her how horrible people.  It's not that it's honorable.  She would never do it in the first place.  They would sell each other out in a heartbeat.  She would be out.  She would be singing a tune, like a burden of tree, but she's not.  Which makes me think that maybe that there is nothing else in there.  She doesn't have any bargaining chips.  She's going to spend the rest of her life forever long.  In prison.  And if she had this information and was somehow holding it for out the best deal or whatever,  then if Epstein killed him, it was murdered, the same people could kill her.  They could kill her.  It can't be hanging herself in a bed to shoot and whatever,  but there are ways to shiver their ways to have her, quote, fall down and fly to stairs, fall in the shower, whatever it is.  They could get, if they get to Epstein, they could get to her.  They haven't.  Which makes me think that maybe this is a lot of sizzle and not very much stake.  The problem is we've had so many people out there saying all these things that there's this.  I'm going to use the term conspiracy theory, but I don't mean it in a negative sort of tin foil hat kind of way.  Conspiracy is just a criminal enterprise involving two or more people.  So there are conspiracies all around us.  People commit crimes together all the time.  But it's just the appropriate word appropriate term.  The conspiracy idea that this is somehow part of a massive cover-up doesn't really hold water.  But the people who are now sitting there telling us, and this is the problem that people are policy,  is if you hire people who made a lot of money and got a lot of attention for themselves,  claiming that this was murdered, had to be murdered, there's no way blah, blah, blah, blah, there's a list of names, there's a list.  If you hire those people to be in charge of this stuff, then people are not going to believe them when they come out and say,  sorry about that, we were wrong.  Because they don't really come out and say they're really sorry about it, they were wrong.  They're saying this is what I'm seeing, this is what the evidence says.  They're not eating the steaming pile of crow that they have to eat.  They should be forced to eat for lying.  Well, lying, that's pretty harsh.  Well, they didn't know.  They did not know.  And they insisted they did.  They spoke like they did.  They did it for money.  They did it for attention.  Make no mistake about it.  That's the only reason to speak in definitive terms about things you don't have any idea of.  Without couching it as opinion, I believe this.  No way, I know this.  There's no way this didn't happen.  There's no way this didn't happen.  There's no way this didn't happen.  It is you recognize that sitting there and giving a nuanced answer, it could be, but I'm not really sure,  is not going to get you the audience to click the bookings, the whatever, to that going absolutely.  It was murdered.  Absolutely.  There are more people in there.  We're going to get to the bottom and find these people.  I'm going to be the one.  You make yourself the hero of the story.  Then when it turns out there is no.  hero in the story. You have to be the goat. You have to be the goat. I'm not saying this  because I revel in people's misery or whatever I have my problems with some of these people  as you know because I've found them to be personally dishonest but that's beside the point.  This is people getting out over their skis. This is people talking big. Like I said, you  you could make a lot of money appealing to a small segment of the population if you appeal  to them strongly enough and that they come and follow you no matter what. No matter what,  you could make a lot of money and they're not going to fall for, oh, well, I guess that  was wrong. They would actually, if you just be honest with people, but for some reason, it's  just not in them. They'd be the better way to go. But do I believe that they don't have any evidence  time? Anybody else, I just, if they're, I want to play you PAM Bondy from about two months  ago. Remember when they brought all those ridiculous so-called influencers to the White  House and they gave them those white binders. Like, who here's the Epstein files? Here's  the Epstein. And there was nothing in there that wasn't publicly known. And these clowns  were out waving them, going, look at us. We're so special. You got a binder with a eight  and a half by 11 sheet of paper slid into the front of the binder that anybody could do  that says that you're getting this special first tranche of these documents. And notice  that there isn't a second tranche. There's nothing else coming out. Just as department says  they're done with this, which again, will only feed the conspiracy theories. These people  need to have an eaten piles of crap press conference where they answer questions from the  people they lied to. But they won't do it because they don't, they don't have to. They  should. But they don't want to. They've got their brands to protect. But anyway, part of the  problem with this is listen to what PAM Bondy said not that long ago. DOJ may be releasing  the list of Jeffrey Epstein's clients. Well, that really happened. It's sitting on my desk right  now to review. That's been a directive by President Trump. I'm reviewing that. I'm reviewing JFK  files and they'll K files. That's all in the process of being reviewed because that was done at  the directive of the president from all of these agencies. So, so have you seen anything there? You said,  oh, my gosh, not yet. Not yet. And it's sitting on your list of the client list. Well, now they're  kind of just trying to say no, no, she meant Jimmy the client list. She meant the file, the whole thing.  And there was no client list in there. Again, imprecise language, reckless speaking and preaching  to the choir is why you get sloppiness like this. You get sloppiness like this. And honestly,  as far as the guys at the FBI, they haven't said anything particularly stupid,  when since they've been in the jobs, whereas PAM Bondy has made a lot of mistakes in the  general. And honestly, she should probably be invited to leave. I get it. She's not going to be,  but she should be. Not just because of this, but because of all the other pre- and kill Marabra go  Garcia back to the United States to charge him with human trafficking in a case you're probably  going to lose because it's old and cold. And you had to cut a deal with an illegal alien  to get the case is wildly stupid. You fight a smart case by in the courts by keeping it and keeping  him out of the country. You got to try them and have essentially you got to try anything. But instead,  this piece of garbage is going to end up back in this country. And it's all because of PAM Bondy's  bad lawyering in addition to this stuff. And so I wouldn't be heartbroken to see her go.  You should not staff an administration based on a cable news network or a cable network.  No matter which cable network it is. So as all the people out there getting ready and getting  upset, getting angry, there's a lot of people who will never trust these people. There are other  people who will just go, this has been co-opted. There's a whole bunch of people who will still  let it slide. I'll never understand them. They didn't deliberately lie to you in that they told you  something they knew to be untrue. They lied to you in that they told you something was true.  They were in no position to know whether or not it was true. There's not a much of a difference  between the two, but there is a difference. Now to Democrats, I want to talk to you about the  health care welfare issue. And this dovetail is in with violence. First I want to play for you  representative Jeff Andrew, Democrat or Republican of New Jersey, talking in Fox Business, I believe  this yesterday morning, about Democrats need to stop lying about Medicaid and what happened in the  big beautiful bill. We have to be on the off-census Republicans. I mean you keep hearing the Democrats  banging away. Nobody is cutting Medicaid to anybody that has qualified. The Democrats voted  to have the largest tax increase in American history by not continuing the job. It's going to  cut some tax act. The Democrats voted against wage earners that gets hit. The Democrats voted  against seniors that get so security. The Democrats voted against those across the board who are  working middle class America. We have voted to help them. And when it comes to Medicaid,  the work requirements are not owners. They're not terrible. Yeah, I saw Madeline Dean on there.  Yes, some people are working already. They're going to have a low-pro-  all. They're already working. Things you're going to continue as normal. And everybody else,  if you don't want to even work the 20 hours a week, you can volunteer. And if you don't  want to volunteer, then there are other ways you can go about it as well to make sure that  you fulfill as requirements like you actually run, not only volunteering in your community,  by other methods that you can fulfill those work requirements, like being online, taking  high school courses or college courses. There's no reason for anybody who's on Medicaid,  who's doing the right thing and deserves it to be hurt. And they won't be. And they  want to cut it out because they're scaring people. They're scaring people because the  alternative would be to offer people an alternative, to offer something specific, to be whatever,  to not lie. Democrats lying is like you breathing. And so they're not going to stop.  And the end result is what happens in this video, this woman, this clip, this woman is a Tiktoker.  I don't understand the mentality of everything must be posted online, but she posts this  online. She's very upset. She's cutting out all of her friends and family who voted for Trump.  And she can't find a job. You can see why she can't find a job. And she says even if she did,  it won't make her happy, which is really the problem. She's looking for happiness externally.  I don't know if she actually has any mental problems or if she's just been indulged to the point  that she feels this way. But neither option is good. And if she has a genuine mental illness issue,  she will be unimacted by the changes to Medicaid, which only impact able-bodied people who refuse  to work or volunteer. That's it. That's it. If she has a disability, she is not able-bodied.  And besides the work requirement, she seems to think it means you get a job and you get health  insurance through that job. But no, you keep the healthcare welfare. If you get a part-time job,  you just have to get off your lazy ass and do something. Something she is either incapable or  unwilling to do. You can decide for yourself, which it is. But here's her little manifesto.  I don't understand why I have empathy for others and other people don't. And yet,  people are calling me crazy for showing any sliver of emotion. My healthcare is being taken away  and me being angry at people who voted for this is being seen like I'm crazy.  I'm cutting you off. You're out of my f***ing life. I'm cutting you out of my life. All of you.  Family, friends, you're gone at this point. I have nothing to live for because my health insurance,  what I need, help for my mental health. All of that is gone. Like, oh yeah, and you can tell me,  go get a job, go get a job. I've been trying for six f***ing months now. And all of these f***ing  idiot Republicans tell me, as go get a job, go get a job. Even if I get a job, it will not  ensure that I have health care because they never give you full time. What else do I want to do?  It won't make me f***ing happy. I won't be able to afford anything still. So tell me again to get  a f***ing job. Get a job. Get a job. You get a crap job. We've all worked crap jobs. And that  crap job leads to another crap job. But it's slightly less crap. Then you get another job and at  least eventually you do something with your life where you either realize that I'm going to  have crap jobs to one degree or another or I'm going to have to do something dramatic like go to  college or get a trade or whatever and improve your lot in life. Sitting around, bitch and  wind and demoning that somebody else needs to improve your lot in life is never going to improve  your lot in life. And honestly, you don't deserve to have your lot in life improved if that's  how you want it done. But you notice it's not going to make me happy. So I'm going to do this is  Democrats. Her life is more than likely not going to change at all. And that means for the better  too, which is what Democrats do is they suck you in and they leave you sitting there suffering,  languishing. They don't give a damn. That's the problem for the Democratic-Mids why they're so unhappy  they're told that Democrats are looking out for them in their lives suck. So yeah, her life is  more than likely not going to change at all. And yet she is convinced that she is now screwed to  the point that she is disavowing her family, her friends, everything because she is going to go  without health care. She doesn't have to. If she's not disabled, it would be a choice because all  she'd have to do is volunteer 20 hours a week, literally anywhere. And she won't do it because of the  sense of entitlement that Democrats have instilled in her. And she'll still vote for them because  she's mad at Republicans, not the Democrats who made her dependent on government. All right,  let's do. I love that this is the feel-good story of the day. This is a news report out of San Francisco,  illegal aliens self-deporting. Now they try to make it as sympathetic as possible. Maybe it's just  because I'm heartless. I don't know, but it doesn't work on me. From dishwasher to kitchen manager,  Victor says he's enjoyed every step of his journey. So honestly, I love to work. He was only 16  when he arrived in San Francisco in 2007 in search of opportunities. But after all these years,  he's still undocumented. And now he says it's time to go back to Yucatan Mexico on his own terms.  And not in handcuffs, as he's recently seen happen to others on the news.  The way they are being detained, it's unfair because they've been treated like animals.  We only come to this country to work.  We don't come to look for problems.  For the last five years, Victor has worked alongside the makeup lip brothers at their popular  Masra restaurants.  They started the business without much experience and credit Victor for the successful  launch of their Redwood CD location.  As Khli says, this is, though, two employees.  I mean, these people, like, even calling them a police, feels off.  They're literally my coworkers.  Like, I see these people more that see my family and they come in putting countless hours  so much to love and to the food.  When they found out Victor was leaving his bosses wanting to make sure he knew how much  they appreciate him.  Victor's been essential to the restaurant, to the development, feeling the menu, the staff.  A lot of people he brought in.  He's always been a leader.  He's always been a leader.  Well, that's hope he's leading a revolution of illegal aliens going back home.  What's amazing is these guys are committing, admitting to committing a felony by hiring,  I think it's a felony.  It's a crime in any event, hiring an illegal alien, employing him for years and years and  years.  God knows how they paid him.  Seems like all sorts of investigations could and should be launched into this restaurant.  But the main point is this guy's going home because he doesn't want to be dragged out  of the country.  In handcuffs.  Good.  Good.  Go.  If you want to come back, try to come back legally.  You deport yourself, you can come back legally.  What I find amazing is this guy's been here a long time.  He barely spoke any English, the English he did speak in the piece was subtitled and then  he had him speaking Spanish because why?  He couldn't be very serious about wanting to be an American if you don't bother to  learn the language can you?  You want to listen a whole lot of sympathy for me if that's the case.  But I just I find that a little bit heartwarming that the self deportation thing is working.  Now we go to Tom Hohman.  Democrats are very upset that the ice raids and everything are happening in sanctuary.  He says, well, Tom Hohman has a very really sudden kind of answer to that.  So that's where the illegal aliens are.  That's where they're protected.  Of course they're going to go there.  I just I love everything about this guy.  I love this answer.  So I'm on Donnie the likely next mayor of the York City's promise not to cooperate with  you or with ice or the people at patients in any kind.  Do you have a plan?  Is there a plan to work around that?  How are you going to handle them?  Well, like I'm at, we're going to be in here.  So he was in a drop set of three skills.  We're going to double down on the triple down the sanctuary since why?  not because there's a loose in their group state because we know that's where the problems.  We know they're releasing public safety threats and that's just security threats to this  week.  It's every day because they don't honor anything.  We know that.  We don't have that plan like employer.  We're every sheriff mistakes working.  So what we're going to send our asset.  We want to send them where the problem is.  Sanctuary city.  So what I said before, we'll flood these only sanctuary cities.  Flood the zone of sanctuary cities.  Flood them, baby.  Flood them.  I love how this guy's like, look, this is the job.  This is the job.  I'm plowing straight through.  I don't care.  I'm plowing straight through.  I don't care.  I'm going in.  Come heller high water.  That is freaking awesome.  That is an American hero.  Lastly I want to play a couple of two clips.  This is the Iranian, particularly in an interview with the Iranian president.  I know I'm being rushed today, but I have stuff to do.  it's a full show.  It's just a fast show.  Tucker did an interview with the Iranian president.  Now I, I, I would just point out that the Iranian president is in a  is an irrelevant position and has no power whatsoever is a figurehead.  The Supreme Leader of the Ayatollah runs Iran.  They have a government on paper to give the false impression that they are a republic  or a democracy or whatever they want to call themselves.  These is Iranian Islamic Republic.  They are not.  They are a dictatorship ruled by a man who is not this guy.  He is the public PR face, usually a lying fraud.  And that's what this guy does.  The Tucker had this guy on is fine.  The Tucker didn't bother to answer asking any tough questions is less fine.  But we'll get to that in a second.  Here's the first clip.  Again, and again, we don't want to rules.  We don't want to develop a nuclear weapon.  And this, this, this, this, this false image, this wrong mentality created in the minds  of the US decision makers and officials.  It is because of the devilish machinations that instigated by Netanyahu and his  righty regime and his policies based on war and anger.  And the US president should know that another war will only spread more instability in the  Middle East.  And it is not going to be in the interest or in favor of the US president or the US government  to moving that or towards that direction.  They, they instead need to choose peace and tranquility, which is something that I am, my  government and my country are after.  And I also, as I said, I believe that the US president is, is powerful enough to put Israel  to, to, to, to, to, to, to, to, to, to, to, to, to, to, to, to, to, to, to, to, to, to,  their place to contain them and replace the war mind,  green bloodshed and conflicts with peace and tranquility.  Mr. President, thank you for taking the time to explain  your perspective.  Appreciate it.  Man, what's up, Jeff?  Thank you very much for providing me with an opportunity  to tell you about what is going on in my mind  and in my heart.  And I hope that peace and tranquility will prevail,  not just for the people of the United States,  for the US officials, but for the whole world,  and especially the people of my region.  And thank you again.  We don't want war.  We don't want this.  We want peace.  So we want the nuclear energy.  Then why did you enrich to 60% when you need like 3.5%  to get electricity?  The question wasn't asked.  No tough questions were really asked.  They asked them at one point.  Did you try to kill Donald Trump?  And no, of course.  And there you go.  There's your answer.  Here is Tucker's explanation as to why he didn't really  ask tough questions.  First one, it was done by remote through a translator.  That's always awkward.  For another, I don't speak Persian.  And there are all kinds of questions  that I didn't ask the President of Iran,  particularly questions to which I knew I could get an honest answer.  Why interview somebody if you knew you wouldn't get an honest  answer?  Why would you then subject your audience to answers  from a person you believe know whatever  is not going to give you an honest answer some of the time?  Did you only get honest answers?  None of it makes any sense.  I didn't ask any tough questions because I knew  we wouldn't get honest answers.  Then why do you think you got honest answers on this?  The easy questions.  And is it better to ask easy questions  where there's no real point to asking the question?  Feel like anybody could have answered these questions  the same way?  Or which is better.  The lie exposed the lie.  Call out the lie.  I think is the better way to go.  But that's not what was done.  It's a shame, really.  Anyway, that is enough for today.  It's 20 minutes or so.  Have yourself an awesome Tuesday.  Bailey was asking me, when's the next holiday?  When's the next holiday?  Just now I don't think there's another holiday to look it up.  But I don't think there's another holiday to Labor Day.  We need to really come up with some kind of holiday  between July 4th and Labor Day.  August needs a holiday.  I nominate my father's birthday.  But I'll take anything.  I know, let's get VE Day or VJ Day, whatever.  Something VE Day is not.  VE Day was much earlier.  VJ Day is in August.  Anyway, that's enough for today.  I'll think aloud tomorrow.  Have a great one.  Thanks for listening."