" What's up everyone and welcome back to the program.  In this episode we're picking up where we left off with the Sarah Rivers lawsuit filed against  Diddy.  Defending Bad Boy Entertainment Holdings Incorporated  Defending Bad Boy Entertainment Holdings Incorporated is a domestic business corporation  licensed to do business in New York and Incorporated and headquartered in New York, New York.  Defending Bad Boy Entertainment Holdings Incorporated is a domestic business corporation  licensed to do business in New York since 92.  Upon Information and Belief, Defending Bad Boy Entertainment Holdings Incorporated is a successor  in interest to Defending Bad Boy Entertainment, Bad Boy Records, and Bad Boy Entertainment Incorporated  as alleged herein.  Defending BBE has been named in several lawsuits with Defending Diddy.  Defending Harv Pierre  Defending Harv Pierre upon Information and Belief resides within and is domiciled in the state  of New Jersey.  At all times relevant herein, Defending Harv was the president of Bad Boy Entertainment  and Bad Boy Records in New York and met the definition of an employer of plaintiff under all  relevant statutes.  According to Defending's LinkedIn profile, Defending has not worked for Defending's Diddy  BBE or any other enterprise founded by Defending Combs since 2017.  Defending Tracy Wapples  Defending Tracy Wapples Defending Tracy Upon Information and Belief resides and is domiciled  within the state of New Jersey.  At all times relevant herein, Defending Tracy was either the vice president of marketing  at Bad Boy Entertainment and Bad Boy Records in New York or General Manager at Bad Boy Entertainment  and Bad Boy Records in New York.  Defending Allison Stanley  Defending Allison Stanley Upon Information and Belief resides and is domiciled within  the state of New York.  At all times relevant herein, Defending Allison was either the boot camp instructor or  Bad Boy Entertainment and Bad Boy Records in New York, Product Manager at Bad Boy Entertainment  and Bad Boy Records in New York, or Marketing Director and Artist Manager at Bad Boy Entertainment  and Bad Boy Records in New York.  Defending Chris  Defending Chris Sainsbury Defending Chris Sainsbury Upon Information and Belief resides  and is domiciled within the state of New York.  At all times relevant herein, Defending Chris was the physical trainer at Bad Boy Entertainment  and Bad Boy Records in New York in charge of artist development and corporate wellness.  Defending Divine Stevens Defending Divine Stevens Defending Divine Upon Information and Belief  Defending Life resides and is domiciled within the state of Georgia.  At all times relevant herein, Defending Divine has the official dance choreographer at  Bad Boy Entertainment and Bad Boy Records in New York.  Defending Norma Augen Blick  Defending Norma Augen Blick Defending Norma Upon Information and Belief resides and is  domiciled within the state of New York.  At all times relevant herein, Defending Norma was the executive assistant to Defending  Diddy at Bad Boy Entertainment and Bad Boy Records in New York.  Defending Fonsworth Bentley Defending Fonsworth Upon Information and Belief resides  and is domiciled within the state of Georgia.  At all times relevant herein, Defending Fonsworth was the chief assistant and conciculary  to Defending Diddy at Bad Boy Entertainment.  And Bad Boy Records in New York and tour manager for plaintiff and her group at Bad Boy  Entertainment and Bad Boy Records in New York.  Defending Tony Dufat Defending Tony Dufat Upon Information and Belief resides  and is domiciled in the state of New York.  At all times relevant herein, Defending Dufat was a music and record producer at Bad Boy Entertainment  and Bad Boy Records in New York.  Defended Dufat got his start in music from Defending Combs.  Defending Mickey Carter Defending Mickey Carter Upon Information and Belief resides  in his domiciled within the state of New York, not all relevant times herein, Defending  Mickey, was representing himself as lawyer.  Defending Mickey appeared on MTB2 as a lawyer on behalf of plaintiff and her group.  Defending Mickey was an agent sent by Bad Boy Entertainment and Bad Boy Records in New York.  Defending Mickey is currently an executive vice president for Defending Viacom Upon Information  and Belief Defending Mickey after a diligent search does not appear to be an attorney  of record in any jurisdiction, especially in the state of New York.  Upon Information and Belief Defending Mickey after a diligent search does not appear to  have graduated from law school, especially not the one indicated on his LinkedIn profile.  Upon Information and Belief Defending Mickey after a diligent search does  not appear to have served in the military. Unlike indicated, on his LinkedIn profile  in various posts by Defending Paramount, veteran social media page, Defending Mickey as  noticeably absent work history during the period Defending was pretending on national television,  he was plaintiff in her group's lawyer. Defending D-DOT, Mad Rapper  Defending D-DOT upon information and belief resides and is domiciled within the state of  New York. At all times, relevant herein, Defending D-DOT was an A&R, an executive  of Bad Boy Entertainment, and Bad Boy Records in New York. Defending Jason Wiley  Defending Jason Wiley, Defending Jason upon information and belief resides and is domiciled within  the state of New York. At all times, relevant herein, Defending Jason was the director  of marketing at Bad Boy Entertainment and Bad Boy Records in New York, and tour manager  for plaintiff in her group at Bad Boy Entertainment and Bad Boy Records in New York.  Defending Bad Boy Entertainment LLC Defending Bad Boy Entertainment LLC  is a music media and entertainment company founded by Defending John Combs, which includes  the record label Defending Bad Boy Records LLC Defending Bad Boy Entertainment LLC is a  Delaware Limited Liability Company and successor an interest RPI. At all relevant times,  herein, Bad Boy Entertainment LLC met the definition of an employer of Miss Richard under  all relevant statutes. Defending Phil Robinson Defending Phil Robinson upon information  and belief resides and is domiciled within the state of New York. At all times, relevant  herein, Defending Phil was a music executive at Bad Boy Entertainment and Bad Boy Records  in New York and served as manager to Defending Diddy and plaintiff and her group at Bad Boy  Entertainment and Bad Boy Records in New York. Defending John Perez Defending John Perez  Defending John upon information and belief resides and is domiciled within the state of New  York. At all times, relevant herein, Defending John was director of promotion at Bad Boy Entertainment  and Bad Boy Records in New York. Defending Diddy's house recording studio. Upon information  and belief, Defending's Daddy House recording studio is a New York Corporation and a music  recording studio owned by Defending Bad Boy Records in New York. At all relevant times,  herein, plaintiff was an employer to work in said studio. Defending Bad Boy Productions  Defending Bad Boy production holdings incorporated is a New York Corporation. Upon information  and belief, Defending Bad Boy production holdings is a successor and interest to other  Bad Boy defendants as alleged herein. Defending Combs Enterprise  Combs Enterprise LLC or New York Limited Liability Companies which upon information and  belief or successor and interest companies to defend it, the Sean Combs Music Incorporated.  Defending Universal Music Group Defending Universal Music Group and VUMG is a Dutch American  multinational music corporation that also includes Defending UMG distribution. UMG's  corporate headquarters are located in Hilversum, Netherlands and its operational headquarters  are located in Santa Monica, California. At all relevant times, herein, UMG and subsidiaries  financially benefited from, condoned and enabled Defending Combs misconduct and defined  under all relevant statutes. Defending Janice Combs Defending Janice Combs Defending Janice  Upon information and belief, resides and is domiciled within the state of Florida. At all  times, relevant herein, Defending Janice was an integral part of the business dealings at  her son, Defending Ditties at Bad Boy Entertainment and Bad Boy Records in New York. Defending  Janice Combs Publishing Defending Janice Combs Publishing Incorporated is a music publishing  administrator and a New York Corporation who at all relevant times held or holds the publishing  copyrights of plaintiff pursuant to her employment with other defendants herein under  all relevant statutes. The Defending Janice Combs Publishing Holdings Defending Janice  Combs Publishing Holdings Incorporated Defending JCHP is a music publishing administrator,  a New York Corporation and a successor and interest to Janice Combs Publishing Incorporated.  Who at all relevant times held or holds the publishing copyrights to plaintiffs pursuant  to her employment with other defendants herein under all relevant statutes. Defending  Janice Combs Defending Janice Combs Defending Janice Combs Defending Janice Combs  In 1998, Combs founded Janice Combs, which has retail sales of over 450 million and is  the New York Corporation. As CEO and president of the company, Defending Combs, was represented  Sean John when he injured plaintiff, defendant Paramount Global.  Defending Paramount Global, defendant Paramount, is an American multinational mass media and  entertainment conglomerate-y corporation controlled by national amusements.  Paramount's corporate headquarters are located in New York, at all relevant times here  in, Paramount and subsidiaries like defendant MTV, financially benefited from, condoned and  enabled from, condoned and enabled defendant, as defined under, all relevant statutes.  Defending Viacom.  Defending Viacom was an American media corporation focused on film and television, Viacom's  corporate headquarters are located in New York.  At all relevant times here in, Viacom and its subsidiaries financially benefited from, condoned  and enabled defendant com's misconduct as defined under all relevant statutes, Viacom  was defined under all relevant statutes, defendant MTV is owned by defendant  Paramount Global.  Defending MTV is an American media corporation, MTV's corporate headquarters are located  in New York.  At all relevant times here in MTV and its subsidiaries financially benefited from, condoned  and enabled defendant com's misconduct as defined under all relevant statutes, defendant  and MTV is owned by defendant Paramount Global.  Alright we're gonna wrap up right here and in the next episode we're gonna pick up with  defendant Jackie French.  All the information including my contact information that goes with this episode can be found  in the description box."