" I've stressed on the buzzcast how culturally relevant the Savannah bananas have become.  Here's more proof, selling out back-to-back nights at Fenway Park to a rockest crowd over  the past weekend and on Monday, the hardcore sports talk radio shows on Boston's most popular  station, 98.5.  From Zolak and Bertrand to Feldger and Maz talked about how fun the bananas were and  how their style and the pace of game should be at lesson to all sports, especially baseball.  Interesting conversation on a hardcore sports radio talk show, not sure we would have  seen that just a few years ago.  And this is your morning buzzcast for Tuesday, July 8th, Good Morning.  I'm Abe Madcore, another major move on a college campus.  Just about a week after Bubba Cunningham announced his transition plan at the University of  North Carolina, another long-time athletic director is set to retire, University of Oklahoma's  athletic director Joe Castiglione said on Monday he will retire during the coming school  year.  He has got such a history and an amazing executive tree.  He has been a mainstay in Norman, Oklahoma since 1998.  His retirement would bring an end to the longest tenured run for a current AD in college  sports.  You name it, Joe Castiglione has been a part of it, a great fundraiser.  He's hired tremendous talent.  There are disciples of Joe Castiglione throughout college sports.  He also led Oklahoma's move from the big 12 to the SEC.  He's overseen 26 national championships.  The softball program is one of the best in the country.  And of course he brought back or rejuvenated sooner football.  Castiglione will stay on as athletic director emeritus after the hiring of his successor.  This will allow him to work on special projects at the University.  He'll stay in Norman.  We're seeing this emeritus title being used more frequently.  You don't want to lose the institutional knowledge that these people will have.  So Oklahoma's president has named Randall Stevenson.  Yes, the former AT&T CEO who was leaned in to sports.  He'll lead the search for Castiglione's replacement.  And of course, Joe Castiglione will continue to serve as the AD into this coming year  while the search is being conducted.  But again, another major change on campus among the ever changing dynamic in college sports.  The Kansas City Chiefs are growing their event business.  So why is this important?  Well, it's important because teams look to generate more and more revenue and increase  their footprint.  And the Chiefs are a strong organization and they see a business opportunity in hosting  more events at ArrowVed.  Here's an example.  They will take the Cincinnati Nebraska college football game next month, August.  It'll be played Arrowhead Stadium and it will now be called the battle sports Kansas City  Classic and the Chiefs hope to make this an annual event.  So the game is on August 28th.  And the hosting rights were acquired by the Chiefs last year.  And this will be the first game to carry this name under a new title sponsor, Battle  Sports.  It's an Nebraska based company.  It's a football equipment and athletic apparel brand.  They'll be the title sponsor.  Their goal is to reach youth football families.  So they're putting their name on this game.  And they think it'll be a great way to activate the brand.  So right now there are no future games scheduled under this new brand, but believe me,  the Chiefs are actively working on future years.  They see a real opportunity to draw more big time college football games because of the  growing revenue demands on campuses for athletic programs.  And they believe Arrowhead Stadium is the perfect place centrally located attractive  to schools in the big 12.  The SEC, the big 10.  It's a fantastic facility with lots of tailgating opportunities.  And it's a revenue driver for the Chiefs.  They really want to host one or two prominent football games a year.  And this year's game, the August 28th game will be on ESPN on the opening Thursday of the  college season, meaning very little competition and a real spotlight on the battle sports  Kansas City Classic on a inaugural football game Cincinnati, Nebraska at Arrowhead.  You will see other teams look at this model and look to follow it.  Let's shift to some baseball as of today.  The Tampa Bay Rays would be in the American League wild card game.  But here's what you want to keep an eye on.  Where would the team play if they somehow continue to advance in the playoffs?  The general feeling is that the Rays could play, could play a wild card potentially a  divisional series at Steinbrunerfield where they're currently playing in Tampa.  But remember, Steinbrunerfield it seats just over 10,000 fans.  So if if the Rays advance to an AL championship or Geez, the World Series, where would  they play?  It's an issue that the leaders at baseball's league office are working on every day.  And if you were a race fan, how would you feel about?  losing your home field edge and accessibility. If those games, AL Championship or  potentially World Series were moved out of Steinbruner Field. Interesting  opportunity, a story certainly to watch in baseball. Shifting to fantasy sports,  Matthew Berry, he has long been credited with establishing real business around  fantasy sports and of course he started fantasy life the media company a few  years ago and he left ESPN to go out on his own and now he has announced  seven million dollars in new investment and he'll use that seven million  dollars of course for operations but he'll also launch a new product called  fantasy HQ that will be sponsored by Mike's hard lemonade. Why is this  interesting? Well look at the investors in Matthew Berry. The funding round was  led by LRMR Ventures that of course is the family office of LeBron James  and Maverick Carter but other investors David Blitzer Jeff Shell Larry  Fitzgerald Jerry Cardnell John Legend and former YouTube CEO Chad Hurley they  have all put money behind Matthew Berry and Matthew Berry believes he has a group  of investors that are strategic and are helpful to what he is trying to build  remember Matthew Berry was ESPN's fantasy expert until he went out on his own  in 2022 his initial round of funding was two million dollars and now he has  raised seven million dollars in new investment for new product development  that will introduce to the marketplace Matthew Berry continues to be a leader  in the fantasy sports space worth keeping your eye on. You know we've seen the  strategy of networks paying what they need to pay to keep their best on air  talent other talent may not be such a priority and it's clear at ESPN and in  Bristol they want to keep the subject matter experts in the fold probably the  less emphasis on generalist and here's an example Dan or lossy sources reported  earlier this week that he is close to remaining at ESPN on a long-term contract  extension and the sources I've talked to shared with me that this deal is  quite quite lucrative or lossy's current deal was set to expire before this  upcoming NFL season we know how much ESPN stresses and prioritizes its  relationship with the NFL and Dan or lossy is an authority on the NFL but he is  also very versatile he can do game analysis for NFL games and college games  he'll continue to be on get up and first take in addition to his full-time  role on NFL live where he really shows his chops around the NFL he joined ESPN  in 2018 I did not see his rise to prominence happening so quickly what he's been  able to do at ESPN quite impressive and now he'll remain at ESPN on a new long-term  contract extension yet to be announced but coming shortly I want to touch  on a couple of things in case you missed it first check out former Raptors  president Masai you juries goodbye video tribute to Toronto and Canada it was  released on Monday and it comes just about a week after his dismissal from the  Raptors where he has been such a prominent figure it's nearly six minutes long  but the video is worth a click it shows his journey in Canada and especially the  city of Toronto connecting with various players staffers fans dignitaries  like I said definitely worth a watch on sports business journal dot com and  finally we'll keep our eye on the Allen and company annual mobile retreat in  Sun Valley this week there's always buzz about the latest trends and investment  media entertainment you'll see the lights of Bob Iger and Jimmy  Pataro Casey Wasserman the biggest sports commissioners all talking with tech  and industry heavyweights in Sun Valley all week it's always a fun exercise to  see who's there and what they're talking about so we'll keep our eye on that and  in this week's sbj on stage a fun interview with the Jones siblings yes  Charlotte Jerry junior and Stephen Jones sat down with me for a rare candid  conversation about leading with their dad and mom the world's most valuable  sports franchise the Dallas Cowboys this was recorded at sbj's access drive  event last September and the siblings dive into brand strategy family fun fan  engagement and how they're shaping the Cowboys legacy for the future it is a  fun fun listen so check that out on sbj's on stage and that is your morning  buzzcast for Tuesday July 8th I made mad core thanks for listening stay  healthy be good to each other I'll speak to you tomorrow"