Speaker A: Sam.

Speaker B: To all units, proceed to your post assignment.

Speaker A: All units, proceed to your post assignment. Study's on fire. It's.

Speaker C: So there's a lot of decision making and sort of geopolitics that comes into play where countries decide who they trade with. But the reality is the world is big and trade is complicated, and just because you, you tariff or try to extract more taxes on, on goods that you're importing into the United States does not mean all of a sudden that country doesn't have additional choices, their bids elsewhere instead to make up for some of that difference. So there's so, so the point is there's so many little pieces of trade that are happening all of the time that you cannot equalize trade. We, we are too integrated as a world. Too many parts, too many pieces of everything or many things that we use and do and need are assembled around the world. And you can change bits of that process and you can make choices about who you want to trade with as a country on the margin, but you can't just as a president, even of the United States, completely alter the complexion of trade because you would have to alter how literally everything operates and where companies, which are mostly multinational, that do assemble most of the things that we use and do and how they operate.

Speaker D: Yeah, baby. It's episode 267 of Ask the Inspector on May 30, 2025. Jeff Norman and Scott Ritter with you for the loquacious version. And that's a sneak peek at the current episode of Trump Watch. Economist Nomi Prince was very, very compelling. Struck a beautiful, beautiful balance between sharing expertise, but also making it accessible for the average person. So you can see the entire episode for subscribers on substack or locals. Top of the evening to you, Scott. What's up?

Speaker A: Oh, just the end of a. Another very busy week. So. No, but Nomi was awesome. Or Dr. Prince. She. First of all, let me just say that this Trump Watch project, if I can say so myself, we're literally hitting out of the park every week. I mean, our guests are outstanding, the topics are great and, and even the host manages to bumble his way through in a somewhat competent fashion. But the.

Speaker D: If only you had a good producer.

Speaker A: The producer makes it all look good. I mean, that's what, that's what saves the host because, you know, but look, know this was never supposed to be Trump was, was never supposed to be about the genius of Scott Ritter. It was to be about the genius of our guests and the maybe my ability to extract genius from them. But you know, we've just done a great job every week in, in taking these issues that pertain to, you know, President Trump, his policies, his administration, and putting them in a perspective that only adds value. I mean, the, the bottom line is if you're a citizen who cares about this country, it doesn't matter where you stand on President Trump. It's about the issues. And you will learn. I mean, we've run the gamut. You know, we've. We've given President Trump very strong passing grades on some issues. We've given them, you know, mediocre grades on others, and we flat ass failed him on, on, on some. I'm not giving away this episode, but the point is, you know, this isn't about being pro Trump or anti Trump. This is about a critical examination of the issues, drawing upon the expertise of, of people who, you know, have the background to, you know, to provide credible witness to these, to these topics. So I'm very proud of what we've accomplished here. I think we've done. You know, you can't, you can lead a horse to water, but you can't make them drink. I mean, we, we've created one hell of a, you know, pool of fresh, cool, delicious, pure water. And I would just encourage more people to go drink from that, from that pool because it's, it's the elixir of life, baby. Good stuff.

Speaker D: You could write a menu with these adjectives. Mouth watering, sucking.

Speaker A: I'm working on it. Yeah. I wanted to keep it with water because that's neutral, but I didn't want to get into, you know, drizzled with a lemon and.

Speaker D: Olive oil.

Speaker A: Yeah, olive oil. Why olive oil? I don't know. Are you anti Semitic? Ah, damn it.

Speaker D: I don't want to mention his name because I, I don't know if you confirmed him, but do we have our guest for next week? The one you mentioned? I guess. No. Okay. I won't mention his name.

Speaker A: Well, no, but do we have them?

Speaker D: No, I, I was talking about the one that you were going to ask.

Speaker A: Well, we interviewed them already, didn't we?

Speaker D: Oh, right. That is next week's episode. You know what I was thinking of re. Of recording. Okay.

Speaker A: There's another guy that we were. That we. That we're having on that. That. Yeah.

Speaker D: To record.

Speaker A: Okay.

Speaker D: No, no. Okay, so forget it. That's what I was thinking. Recording, not next week's episode. Of course we can say it's Ted Postal.

Speaker A: Why not Red Postal and the Golden Dome. An exciting topical issue. And I, I will Tell you that news was made, you know, Ted Postle, you know, delivered the goods, got a hand to this guy. He's an MIT professor, which means, you know, he's sort of like in the upper strata of academia in America. And he took the time to produce graphics and charts and video to explain aspects of a very complex problem. And this is, this is the kind of briefing that, you know, you would hope people would be getting in the Pentagon, in the White House. And yet you got it on Trump Watch. And, you know, just another one that I'm very proud of. I think we, we treated this topic with respect, with a definite, you know, Doric perspective. We, we, we talked about past, we talked about, you know, the present, we talked about the future. And again, I don't want to predict, but, you know, we, we grade Donald Trump on these issues. So Ted Postel is an MIT professor, and I think he's a tough grader. So let's see what happened.

Speaker D: All right, so we don't have to worry about who the next guest after that is yet. That's what I was thinking of. I don't know what's wrong with me.

Speaker A: Well, I mean, if we got him, we can say I have no problem in.

Speaker D: No, the one I'm working on, we don't have at this point. And it sounds like the one you were thinking about, you haven't asked yet.

Speaker A: So.

Speaker D: Okay, that's all there is to say.

Speaker A: Sorry, we have several in the works. We're working on several interviews, so don't worry. Trump Watch.

Speaker D: I was feeling, I was feeling under pressure, but we're not under pressure.

Speaker A: We already have, we already got one in the can. I mean, we cleared hot next week. We could just casually go about recording whomever shows up on the hopper.

Speaker D: All right, let's get to the questions from our building.

Speaker A: I mean, I've got Sam down the street to talk about, you know, small town sanitation if we ever need to that, you know, do that. So, you know, just remember, as long.

Speaker D: As he's an actual expert in sanitary.

Speaker A: Small town sanitation, does it matter? Is anybody truly an expert in spot? We can fake it maybe if we have to. But that's the thing about Trump Watch. We never fake it. It's big names, big topics and big discussions.

Speaker D: Apologies to Sam. You're not going to be booked.

Speaker A: Sorry, Sam, you don't make the cut.

Speaker D: All right, let's get to the questions from our beloved audience. These were submitted in advance at the website. And later in the show, Ryan Milton will be with us to share Some of the live chat questions that come in during tonight's show and the first question is from Odysseus in Brussels. I read reports that German long range missiles will be produced in Ukraine. Is there any truth in this or is it just posturing? And what would be Russia's reaction if and when they're used to strike deep into Russia? What would NATO do if Russia decides to respond by striking NATO countries? Are we heading towards nuclear World War iii?

Speaker A: Well, first of all, the reports that German long range missiles will be produced in Ukraine. My understanding is that Germany and Ukraine have come together to form a, a joint venture. It'll be a Ukrainian factory that makes use of German technology and German expertise to produce a unique missile. You put unique in quotations but a, it's a Ukrainian missile built using German technology and know how and it'll be produced in Ukraine. Now this is seems to be, you know, a method by which Germany seeks to remove all responsibility for its actions and place them on the shoulders of Ukraine. Because you know Germany Chancellor Mertz, when he was just candidate Mertz had been promising that he was going to deliver the Taurus missile, which is a German air launch cruise missile with a range around 550km, deliver it to, to Ukraine and, and let them use it against a variety of targets. It was interesting that before, after the election that Mertz won, but before Mertz became Chancellor, the Minister of Defense, Boris Pistorius, who was Minister of Defense under the Schultz government and because Merch didn't win an overwhelming majority of the votes, they have to make a coalition government and Pistorius, his party is part of the coalition and it's believed that Pastorius, I believe he has stayed on as the Minister of Defense but he in speaking about Mertz's statement regarding the Taurus, he said no, we simply will not be sending the Taurus missile to Ukraine. He said there are reasons why we won't do this and these reasons are secret and we will brief the Chancellor when he becomes the Chancellor. But I can guarantee you that the reasons that we're not doing it now are the same reasons why we won't do it in the future. Now he didn't say what those reasons are, but you examine statements and posturing etc. The reasons are that Russia has sent a communication to Germany saying that if Taurus missiles are used to strike critical Russian infrastructure that Germany will be held responsible and that Russia will strike targets in Germany. Shortly after that Russia used the Ereshnik missile to strike a factory in Dnipro and That was the signal to the Germans of that's what's going to happen to your Dusseldorf facility. That is where Rheinmetall produces Taurus missiles and other objects. So the, you know, there's not Taurus missiles going there. A lot of speculation that Russia, that Ukraine has already received 150 Taurus missiles covertly. No, Taurus missile will not be sent to, to Ukraine. Instead, they will produce the missile or seek to produce the missile. Now, you know, what will Russia's response be? I believe Russia will seek to destroy this missile production capacity before it reaches fruition. Ukraine's a big country, however, and if Ukraine were to produce a missile that has German technology and that missile struck critical Russian infrastructure, I believe Russia will strike Germany. And I believe that NATO would not do a damn thing. There'll be a lot of posturing, a lot of speaking, but this is a unilateral action taken by Germany without concurrence of NATO. This is not a NATO action. This is Germany acting in a unilateral fashion. This is similar to Turkey, a NATO member going into Syria, getting hit by the Russians and screaming, oh, we need protection of NATO. NATO saying no, it's not a NATO mission. And I, I just don't see the United States willing to sacrifice Boston, Baltimore, Washington, D.C. on behalf of Dusseldorf. This is a decision that the Germans are making unilaterally. It's a decision that runs counter to the policy direction of the Trump administration. I don't. Trump administration has been approached or given its approval for this, this deal, which is destabilizing the extreme. But that's what I think was happening. I mean, of course, I could be wrong. And if Russia strikes Germany, NATO would seek to, could seek to implement, you know, Article 5 and next of the NATO charter, collective self defense. And the next thing you know, NATO and Russia are in war. And then we have a general exchange of nuclear weapons and we all die. That's what's at stake here. We're not talking about a casual game. This is life and death, serious stuff. And one has to ask yourself, how did Germany get into being in the position of dictating the future of the United States to the American people? This is what the American President should be drawing a line on and making a phone call to Mertz saying, if you continue down this path, we will deem you to be an existential threat to the United States. And you don't have to worry about Russia bombing the Dusseldorf factory will bomb it and American troops will, you know, occupy Berlin. We'll beat the Russians too. At this time, the next tanks that will be up on the plinth outside of the German parliament, it'd be M1 Abrams tanks. Germany is the enemy of the world right now. The way Germany is behaving is irresponsible in the extreme. And how this came to be, I just want to remind people, 80 years ago, Germany was Nazi Germany. They were defeated. But somehow we allowed Nazi Germany to reconstitute itself in 1949. I mean, we're talking literally four years after the defeat of Nazi Germany. We said, okay, go ahead and make yourself West Germany. And then in 1955, 10 years after the defeat of Nazi Germany, we said, hell, rearm yourselves now. We were supposed to control this, contain this. The mission of NATO was to keep the Russians out, keep the Americans in and keep the Germans down. But somehow we lost focus on that. We allowed Germany to reunify. Big mistake. Big mistake. Everybody's sitting there shouting yay democracy. Germany wasn't ready for reunification. What's the proof today Germany can't behave responsibly. You unified Germany, make it big and suddenly think they're tough again. They forgot the lessons of the the past. And now Germany's talking about being the strongest economy in Europe and therefore they must have the largest, most capable military in Europe. No, they shouldn't. They can't be trusted with this. What's the evidence? They can't be trusted. The fact that they're talking about building missiles in Ukraine to fire against Russia, not the thing we want anybody to be doing, let alone the Germans. And remember, the Ukraine that they're supporting is heavily influenced by the, you know, followers of Stepan Bandera, you know, the ally of Nazi Germany. Guys, you couldn't make this stuff up. I mean, we are literally talking about the modern day manifestation of Nazi Germany alive while living in Ukraine. And Germany's making common cause with them. We didn't keep Germany down. Germany's built back up to become a threat worthy of global intervention. We're not going to do it, but we should. We should tell the Germans straight up, if you behave in this manner, you are the threat. You don't have to wait for the Russians. We'll deliver the knockout blow. And anybody thinks that Germany can resist us. Yes, again, where's the German people? They know their history. They should know their history. I mean, people of my generation, I'm 63 years old, I can tell you, in 1979, ABC had done a series called the Holocaust and they aired it in Germany five Successive nights. And it was a shock. So we're talking high school students because I was a high school senior in 1979. They didn't know their own history because their parents, who were the Nazis, by the way, just keep that in mind. Their parents didn't tell them about it, pretended it didn't happen. And people my age, high school students, were calling in because they'd show this on TV and then they had to have a panel of experts. And the phone's ringing with kids calling in going, what the hell are you doing? What do you mean we killed the Jews? What are you talking about? My parents couldn't have done that. Oh yeah, you should talk to your parents. They did do it. They were there. They were the ones who, you know, allowed this to happen. And an entire generation, 50% of Germany, like batshit ape. 50. That's this generation, my generation. What'd you do about it, guys? What'd you do about all that shock and outrage you had in 1979? It's now 2025. Where is it today as Germany turns into that which your parents were doing? And what are you doing about it, Mr. And Mrs. Shock and Outrage? What have you done to educate the follow on generations? Apparently not a goddamn thing. Not a goddamn thing. So I don't want to hear anything about good Germans and Germans trying to do this. They are sitting back and doing Jack. Especially in the west, in the east at least, they're coming together with an alternative political platform, conveniently called Alternative for Deutschland. But ironically, the Nazis in West Germany are calling Alternative for Doyland. The Nazis, and they're trying to make them illegal, unlawful. Guys, it's time to start speaking about the breaking up of Germany. Take a look at the last electoral map and see how Germany is fundamentally divided between east and West. Germany can't be trusted to be unified because the second it gets unified, they get it in their head that maybe they're powerful and they can once again, you know, march on the East. No, they can't. They can't be allowed to. But that's what's happening today.

Speaker D: Well, that level of denial is mind blowing. I mean, we all know about, you know, what happened, but I don't know if many people know about the denial. Would you say that would be analogous to Americans denying that we had slavery? And I don't mean to compare slavery to genocide so much as I just mean to compare the level of denial.

Speaker A: Yeah, except, you know, that would be Americans in, you know, 1920 denying slavery whilst people who were slaves Were still alive, say. Nah, it wasn't any slavery. No, it's made up. Well, I was a slave. No, don't. Yeah, I mean, that's what happened.

Speaker D: Yeah, right.

Speaker A: Because it's.

Speaker D: Because it happened later. Yeah. Yeah.

Speaker A: And. And. But it'd be the same thing. Americans denying. Yeah. Slavery. I mean, no, there wasn't slavery. That was hype.

Speaker D: It's hard to imagine that anybody.

Speaker A: Blacks. The blacks just like hanging out in the south, you know. Yeah. It's that kind of ignorance. But worse, having the generate, having them exposed and suddenly being, you know, having, you know, what was Huxley's. He wrote a book that became a big series about slaves. Gosh. Atlas. Huxley wrote a book called.

Speaker D: Come on, Ryan, what's taking you so long?

Speaker A: Kunta Quinta was the. Yeah, Ryan's got to earn his money. I mean, I can look it up. But Roots, Roots, Roots. There's the show Roots.

Speaker D: That's like win the prize.

Speaker A: That's like roots, you know, coming on and people going, what? There was slavery. Oh, my God. Okay, so now. Now you've been woken up, but now what is it now? Gosh, 30 years later, your kids and your grandchildren are going, yeah, there's no slavery. Like, wait a minute. How did that happen? Or worse. This is the bet. This is the kicker. It's not denying slavery. Oh, no, I think slavery is a good thing. I think we should reinstitutionalize slavery because that's what Germany's doing, I think. I think combining militarism with industrialism and nationalism is a good thing. I think building a big. The biggest army in Europe's a good thing. It's a good thing for the Germans to do this. Oh, hell, why don't we put a brigade in Lithuania? There's a good idea. I mean, just on and on. Every decision made by Germany right now is a bad idea. One that lends itself to a re. Expression of the Third Reich, which apparently Germany wants to become the Fourth Reich. So, yeah, this is the equivalent of people being exposed to roots and having their children or grandchildren suddenly wake up. One more going, you know what? Slavery. That's a good thing. I think we should go back to slavery. No, it's not a good thing. And we shouldn't go back to it. And anybody who espouses that should be denigrated in the extreme, which is why I'm promoting the active denigration of the German nation and the German people. And I really do think it's high time that we can catch. Damn right. Scratch A German, you get a Nazi. I mean, I could tell stories about that all day long. And again, don't tell me. I had some people try and say, well, that's just anecdotal, Scott. Anecdotal. Well, I don't know. At what point in time does the accumulation of anecdotal evidence become real? I mean, do I need. How many times do I need my gardener after watching Holocaust to say the Jews, the Jews just don't know how to let it alone? The Jews are the trouble. She was saying this in 1979. She was a young girl in her 20s during the Nazi period. And I have a funny feeling that the Jews weren't her best friends during Nazi times. How many basements do I have to go in of German housing to find that there's a secret hidden Nazi memorabilia? Places they glorify their. Their militaristic past, the past they're not allowed to acknowledge above ground out in the streets, but a past that exists in their basement. I saw that. How many times do I have to walk by Germans who are trying to sell Nazi memorabilia because they believe that's glory? And look at the, look what's happening today, even in my telegram chat. And I would imagine. I don't know, I don't read the comments anymore, but there are people who are saying, you have to re. Exam. They're, they're, you know, they're redoing history. Germany was right. Germany was on the right side. The Germans were the correct part. No, they weren't. They were the freaking Nazis. And, well, don't blame them. Blame the Rockefellers. No, I blame Adolf Hitler. He wrote Mein Kampf, you know. Yes, we have American capitalists who make money off of anything. But no, I blame Germany. They built the concentration camps. They built the gas chambers. Scott. There were no gas chambers in Auschwitz. Maybe, maybe not, but there were gas chambers and there were concentration camps and Jews were killed. Well, was it 6 million? I don't know, but it was a lot. I mean, you don't try to deny the Holocaust. You're not going to win that argument. And don't deny that, you know, the Germans were seeking to be the master race. I mean, their plan for Russia went beyond just simply killing 27 million. They wanted to drive Russia to the Ural mountains and take everything west of the Euro mountains. And that was Lebensraum, good old Laban's round baby, where Germans can go and stretch their muscles and have living room and everything east of the Earls was slave labor. And that's what the Germans want. They had a guy that was, you know, tasked to do this. They were planning to do this. Mass murder, mass incarceration, mass slavery. This was an evil regime. And evil regimes don't just happen by themselves. They happen because of people who allow themselves to be manipulated so that this evil regime could exist. Look at the photographs of Nurburgr. You know, there's one famous photograph where you have a whole bunch of people with their I'm not gonna do it because idiots screen grab it and then they use it and say, Scott Ritter did the. The Nazi salute. But there's a whole bunch of people doing the Nazi salute and there's one guy doing this. Okay, so there it is, ladies and gentlemen, the one good German. But everybody else is out there just slavishly doing what they do. The Germans today, I think they secretly want a return to the. The prestige they enjoyed at the height of Nazi power. Why else would they be doing this? Germany should be ashamed of their past, literally ashamed of their past. And they should be doing everything possible to ensure it never happened again. But hell, we. We haven't killed the last veteran of World War II yet. Through old age, they're still out there. And the Germans are off goose stepping towards the Fourth Reich. It's crazy.

Speaker D: Yeah, you never know who's going to make a Nazi salute. All right, next. Oh, by the way, Scott, I. You might be. Although we know that in the bigger picture it's not a happy situation. But in the smaller picture, thanks to Ryan, we are. You are connecting with your ex audience tonight because we came up with that workaround. We're streaming to the US Tour Duty X page and Ryan shared it on your page.

Speaker A: So there you go.

Speaker D: Hi, everybody on X. Hi, X.

Speaker A: It's apparently my account, but not crazy. I mean, they keep you excellent. No, Scott, you. You have control over your. Your. Our records show that you have control over your account. No, I don't. Can't get in. And all you have to do is hit that little toggle. I mean, it's a two second job. Two factor verification off. Now I own my account. They can't make that happen. They keep sending me the same damn email asking me to log in and we'll see that you logged in and then we'll know it's you and then we'll. We'll do it. Well, I've been waiting. And you know, X is truly incompetent. Truly incompetent.

Speaker D: Patty in the People's Republic of Cork, before Trump went to The Gulf. He was talking about a major announcement. The most amazing, bestest announcement ever. Did I miss something?

Speaker A: I don't know. I thought that that was supposed to be a free trade agreement with the United Kingdom. It turned out not to be a free trade agreement with the United Kingdom, but I'm just gonna set it up this way. Donald Trump won the election in 2020. In November 2024, I voted for him, and I think I've explained why I voted for him. Trying to stop a nuclear war, convinced that Kamala Harris would get us into a nuclear war war. And Trump said and did things early on that convinced me that he was serious about following through with that. Anybody who's been following knows that it doesn't take much from Donald Trump to set me off. Because every once in a while, he just becomes the dumbest piece of on the face of the earth, really. A stupid, stupid man. Now people can say it's an act. That's a hell of an act then, because I buy into it. He is just ignorant. He, he, he's a, he's a pompous, he is narcissistic. I mean, it's just ridiculous, all the bad. But I gave him the benefit of the doubt. I spun everything in a way that was to the benefit of Donald Trump. It's a revolution, baby. And they're supposed to be chaotic, you know, okay, but you had 100 days, Donnie, and what have you done? Jack. Jack has a follow through on anything. Everything he touches dies. He hasn't succeeded at anything. Deportation is just a cluster. His immigration policy is a disaster. He has ICE people in the streets right now in Albany and everything, pissing everybody off because you look like Jack booted thugs, because you behave like jackbooted thugs. This is the United States of America. We don't pull that for any propaganda purposes. But that's all it is, is propaganda purposes that destroy the lives of people. Tariffs. It's a joke. Watch Nomi Prince. Watch the discussion. It's. It's just. I bought into it. I mean, I'm one of these dumb Americans that listen to Donald Trump saying, I'll tariff everybody and we'll raise our income such that there won't be income tax. We can end the individual income tax. And I went, that'd be cool. I, I like not paying taxes. That'd be nice. But then you talk to no man. You end up immediately feeling like a stupid shit. Because she goes, scott, the. The percentage of money of our revenues raised by, you know, tariffs. What is this, you know, 12%. Even if we doubled all the tariffs, you know, you're talking 24%, but you're not going to be able to collect all that. But the amount of, you know, the percentage of our income that comes in from income taxes, 60 to 70%. There's no way tariffs are ever going to match that. Tariffs will never replace it. It was a lie from the beginning. Everything this man says is a lie. Golden dome. I don't want to give it away, but it can't work, and we know it can't work, and we know we can't afford it. It's a con game. Everything this man does is a con game. And I'm sick of it. I'm sick of it. It makes it difficult to do Trump watch, because I'm supposed to be this apolitical, unbiased person and I give it my best. I give it my best. I give him the benefit of the doubt on everything, and I let the experts expose the fallacies of his thinking. But, you know, it's tough, man, because this guy is, he's just a pompous dick and he, he, you know, case in point. It's gonna be the biggest, the biggest, bestest in the world. I mean, what is he, a freaking three year old talking to his fellow kinder, you know, grade school kid? It's gonna be the biggest and the bestest. It's gonna be the most awesomest thing in the world. It's going to be so amazing, it's gonna blow your mind. And it turns out to be nothing. Nothing squat. And then the bullying, the threats. I'm gonna, I'm gonna do things that, you know, make Vladimir Putin poop his little poopy pants. You know, Vladimir Putin will just look in the mirror Donald Trump and say, oh, my God, Donald Trump's angry at me and I'm gonna have to do something because I'm Donald Trump. Don hint. Putin doesn't give a about you, man. No one cares about you. You're an irrelevant, fat, bombastic piece of shit. And the only reason why anybody pays attention is because you have nuclear weapons. That's it. That's it. You haven't come up with good policy. The only guy that comes up with good policy right now, apparently, is Steve Witkoff, who I'm developing a greater appreciation for, is out there doing miracles or trying to do miracles, you know, but it's impossible to do anything in this administration because it's a schizophrenic administration. Jekyll and Hyde, you have people that claim they support The President, but they don't. On Russia. Find me one Russian expert. Find me one name, one. Keith Kellogg, ain't it? By the way, he's not a Russian expert. Marco Rubio could barely spell Russia. He hates Russia. You know, Scott Besson doesn't know a freaking thing about Russia, and yet he believes he can strangle the Russian economy by targeting oil. Hey, Scott, India just bought more oil last month than any ever before, and you're going to put 500 tariffs on that? What do you think the Indians are going to do? Prohint, they'll say you, that's what they're going to do. China, you think they're going to fold because you've tried to strangle their lifeline with. No. As Naomi said, it's a complicated world out there and you start tariffing things, you'll find that people will find alternatives to you. And that's the, that's the reality. Trump doesn't know what he's talking about. That's okay. Most presidents don't. But they then surround themselves with experts. There isn't a single Russian expert out there advising the President, United States. And as a result, we have this chaotic policy. We have Steve Witkoff who is fully capable of. I mean, I'm a Russian expert. You don't have to put Andre Martinez name up there. But Trump's not going to consult with me. I'll tell you who did. RFK Jr called me up several times a week, called up other people, called up Douglas McGregor as well to talk to people who have genuine knowledge and insight. And it worked. We were able to get him to come around on, on nuclear weapons and on Ukraine policy. That's what happens when you talk to informed people. But, you know, is the, is the White House, you know, he listens to Keith Kellogg, he listens to Marco Ruby, he listens to Scott Bessant. As a result, he has horrible policy that's unaffected and the Russians don't care. I mean, they'd like to have better relations. They're pushing for better dialogue. But the Russia is not going to compromise at all on any of their core values, on any of their core issues when it comes to Ukraine. And it's time that somebody tell the President this so he doesn't run around and make a fool out of himself. You know, how, how, how lunatic is it for the President, United States to sit there and say, Vladimir Putin's gone crazy, he's sending things and he's killing people. Killing people, women and children. Oh, my God, it's horrible. He's gone crazy, and I'm going to kick his ass because of it. Mr. President, what about the drones that tried to kill Vladimir Putin? Well, I didn't. I didn't know about that. You're the President of the United States, and you're saying you didn't know about a Ukrainian effort to kill the President of Russia? Pro hint. Donnie, baby, if they killed the President of Russia, you'd be dead. Because Russia's nuclear doctrine is such that if the President of Russia is attacked, Russia assumes that it's a decapitation attack, seeking to target their ability to implement their strategic nuclear deterrence, and therefore they will automatically launch everything, just like we do if somebody tries to kill you. You know that too, Mr. President. So you're the top of the pyramid. People don't get to kill you. Americans do. We can shoot at you in Butler, Pennsylvania. We can try to take you out on a golf course. But if a foreign power tries to kill you, especially a nuclear power, we get to assume that's the beginning of a larger campaign. So we get to take them out with nuclear weapons. Do Americans realize how close we came to dying? I mean, it's just so nonchalant. Oh, yeah, the. The Ukrainians flooded the zone and cursed with drones trying to kill Vladimir Putin, got some American. Cool. Wow, I wish they had succeeded. No, you don't, because you'd be dead, you stupid piece of. You know, but we don't understand. And how did the Ukrainians get the intelligence? You know, if it looks like a duck, walks like a duck, quacks, it's a duck. So if you're flying American intelligence and reconnaissance assets around, collecting data in the city, Ukraine's, don't you surprise when they use it to target the President of Russia. And our president didn't know anything about it. Guys, this is an incompetence. This is just sheer stupidity. Why doesn't he know something about it? Who's responsible for briefing him? Tulsi Gabbard? I don't know. I mean, she's the one who prepared, you know, is responsible for preparing the briefs. But how does the briefing get to him? Is he getting the briefing? These are. These are questions we deserve answers to because this is scary stuff. This man is so detached from reality, it's not even funny. Anyways, I've gone on enough about Donald Trump.

Speaker D: Okay, the next question is from Mia in Madrid. Hey, another question about Trump. Sorry, Scott, I didn't know that. But what exactly is stopping trunk Trump from simply turning his back on Ukraine his ego.

Speaker A: I mean, the, the proper solution right now is tell Ukraine we're done. Why? Why is that the proper solution? Because we're responsible for this, this conflict. You know, we're the ones that instituted the Maidan Revolution. Prior to that, we're the ones that instituted the Orange Revolution in 2004, 2005, that brought Ukrainian nationalists into power. That began a cycle of seeking to suppress the Russian speaking, ethnic Russian population of Ukraine. That was done on purpose because the CIA has had a relationship with these banders since 1948. And the Banderas have insinuated themselves into the United States. The Ukrainian Congress here in the United States, the Ukrainians and Diasporas, is controlled by the Ukrainian, the organization, Ukrainian nationalist Bandera Faction. They seized control in the 1980s. Everything that's done from Ukraine policy is run through the Banderas who are in power here in the United States. Victoria, Nuland and company, all Banderas. So we've been working hand in glove with these people from the very beginning for the sole purpose of using Ukraine as a proxy, a tool to weaken Russia, weaken the Soviet Union, weaken Russia, then bring down Russia. We started this war. This is Donald Trump's war. He can say that Joe Biden's were all he wants, but that's just Donald Trump's demand. That sent the, you know, brags. I sent offensive weapons while they were Javelins and stuff, Stingers. But you sent lethal weapons. Lethal weapons. That's on you, Donnie baby. On you. You're also the guy that enabled the Ukrainian, the United States of America to train the Ukrainian military to get them up to NATO standards so that in 2022, they had a force of 60 to 80, 000 NATO trained US trained troops ready to militarily take over the Donbas. That was their mission. They would have done it if Russia hadn't preempted it. That was Donnie. Donnie also, I think, was the President when the CIA constructed 20 bases inside Ukraine to carry out covert actions targeting Russia. Why would you do that, Donnie? Because you're Russia's friend. No, you're the enemy. You're the problem. And now you think you're the solution. Well, how does the problem become the solution? Well, you have to fundamentally change your behavior. Marco Rubio at least had the, the integrity. And to honestly say that what's happening in Ukraine is a proxy war between the United States and Russia, Ukraine is the tool, is the proxy on behalf of America. Well, if the United States is at war with Russia, then in order for the United States to be an Arbiter of peace. United States has to back away from the policies that it was undertaking when it was at war with Russia, because you can't be at war with Russia and be promoting yourself as this wonderful, neutral, you know, purveyor of peace. Trump needs to walk away from Ukraine. He needs to call up Zelensky and say, you're finished. We're not sending another penny. We're not giving you any support. And, you know, we are going to actively conspire against you until you run out of office. And, you know, maybe they'll take you and hang you, maybe you'll run, but you're not coming to Miami. We're not going to let you come to Miami. We're finished with you unless you do what we tell you to do, which is to cease the stupidity and find a path towards me. We could tell the same thing to Europe, but we don't, because this is Donald Trump's war. And Donald Trump doesn't want to have to admit that he was wrong about everything. And that's why he won't walk away. He's trying to bully people. He's trying to bluster people, trying to intimidate Russia. Donnie. It doesn't work, man. Doesn't work. But that's why he doesn't walk away, because it's his war. And to walk away from is to acknowledge that he failed. And Donald Trump is incapable of admitting that he failed.

Speaker D: All right, let's check in with Stefan in your favorite country, Germany. Unlike Yemen, Iraq, or Syria, which gained independence through armed struggle, countries like Qatar, Bahrain, and the UAE were formally granted independence after years of British control or oversight. Could this be why the former group has often faced Western opposition and sanctions, while the latter appears aligned with or even subservient to Western interests?

Speaker A: Yes. I mean, what more do you want me to say?

Speaker D: This guy said it. All right.

Speaker A: Yeah. You answered your own question.

Speaker D: Thank you, Stefan. Let's move on. Then Eldor in Bulgaria, in light of the hack that happened to you and your encounter with big tech's dystopian practices, would you invite an Internet privacy expert as a guest? For example, Rob Braxman or Naomi Brockwell?

Speaker A: I don't know who either of those are, and me neither.

Speaker D: What about just. If we. If you answer the question generically, meaning.

Speaker A: What is Internet privacy expert, what do you. What do you mean by that?

Speaker D: Yeah, like, what's the difference?

Speaker A: Are they going to simply. Are they going to tell me that I was foolish to trust a. An email that looked like it came from X, that I was foolish to, you know, trust a phone number, that when you Google it or call it back, it's, it's X foolish to trust login procedures that precisely mimic the verification procedures that X used, for instance, for the monetization process. I mean, yeah, in retrospect, Look, Siri, that's Mrs. Ritter the entire time, said, hang the phone up, you fucking idiot. It's a scam. Don't do it. It's a scam. And I'm like, I don't want to lose access to my ex account. I mean, I've lost access to everything, you know, YouTube and all this. I'm like, no, I don't want to lose access to X. I'm gonna do this. Hang it up, you know. But she was right, I was wrong. But it was a sophisticated spoof and, you know, so what I need to bring an expert on to tell me, you know, how foolish I was? I don't need that. I know now. So if I bring on a guest, it's got to be more than simply telling me that I was foolish enough to be spoofed in a sophisticated scam. There has to be a reason to talk about it. You know, the role of Internet privacy in, in America. And it's an important, it's an important topic, but I don't know if it's one that, you know, other than exposing, you know, my personal faults, I don't know what we gain from it. So I'm not saying no, but I, I, I'd have to be careful that.

Speaker D: There'S a good purpose for it.

Speaker A: Yeah.

Speaker D: All right, next question is from John in Toronto. What do you think of Carney's announcement of sending Canadian troops to Canada to Ukraine? Oh, did I? Yeah, to Ukraine. Sorry.

Speaker A: I don't know how many troops you got there, Carney. I'm not worried about it. I don't think Russia is worried about it. Canada should be worried about it because if they actually send troops to Ukraine, they'll die. You know, this is just stupid politicians doing posturing. I don't understand it. I don't understand the death wish that they have, the disrespect they show to their troops. This isn't Canada in World War II. You know, Canadian divisions fought with, with the Americans and the British and played a significant role in this conflict. But they had a, they had a substantive military force at that time. Canada is a freaking joke right now. So you're going to send Canadian troops, but who's going to logistically sustain them? And what happens when they start suffering casualties as they will? Where are the replacements coming from? What's your rotation policy? You send the troops now and six months later you got to rotate them. Do you have troops trained up to go in and do you have another group of troops training up to go in? You know, because in order to do a rotation like this, you really need three times the number you claim you need. I don't think Carney's thought this through. I think he's just a typical war mongering, Russophobic leader who is, you know, playing to a political base, but at the end of the day won't be able to follow through on his actions, on his words.

Speaker D: Somerville. John, top of the evening to you. John, how are you?

Speaker A: Yes, gentlemen, good evening. Good evening, Jeff. Good evening, Scott. And good evening to your international audience. Scott, tonight, the question I have is actually from the boss here and she would like to know if we have this agreed 60 day ceasefire between Israel and Hamas, will that allow Israel to get some free time and organize their attack against Tyrann or Iran in general? Thank you very much. And I'll take my question off air. Everybody stay safe.

Speaker D: All right, good idea, John. We will.

Speaker A: I mean, Israel is fully capable of chewing gum and walking, meaning that their planners don't need to take time and, and focus on Iran. They've already been focusing on Iran for 20 plus years. They've been following Iran closely. They have target lists and all that. They don't need a ceasefire in Gaza to focus on Iran. The ceasefire in Gaza is separate. It's a reflection of the reality that Israel's policies are failing, that Israel is growing increasingly isolated around the world, that there isn't a military solution, and that Netanyahu is in a increasingly difficult situation because of the, the hostages and he needs to be seen as doing something to get the hostages home. So this is put forward as a mechanism for him to begin getting hostages home and, you know, provide a 60 day window, hopefully that will, you know, stop the killing of Palestinian civilians and maybe get some humanitarian good in there and to, you know, to provide life saving support to people who are starving to death right now and the ongoing genocide carried out by Israel against the Palestinian people. But this has nothing to do with Iran or, you know, buying time. So Israel can plan. Israel has the, has the plan in place. Whether the plan will succeed, I don't think it will. I don't think Israel is actually going to bomb Iran. I think that that's an effort by Israel to undermine America's negotiating ongoing negotiations with Iran. But I, whatever Israel ends up doing with Iran, it's not linked to, to the decision to, to, you know, if, if this ceasefire goes through. There's, right now, I don't know if Hamas has accepted it or not. There's some talk about Hamas rejecting it or Hamas considering to review it, but hopefully it will go in because I'm tired of turning on tv. I used to say I'm tired of reading Twitter in the morning, but I can't read it anymore. So tired of, you know, going to telegram, I guess, and seeing videos of dead, of dead Palestinian children. That's a daily occurrence because of Israel's genocidal policies. And I think it would be a mirror. It's a wonderful thing if for 60 days these people didn't have to worry about being bombed every night by the Israeli Air Force.

Speaker D: Next question is from Babin. I believe that's pronounced in India. Given that NATO istar planes are C135 and P8 continuously monitor the Black Sea close to Russia as well as in the Baltics, which helps targeting missile and drone attacks on Russia. Why don't The Russians deploy SU30 SMS to jam or interfere the radars from a distance? Would that constitute an act of war? And if yes, isn't NATO aircraft targeting Russia already an act of war?

Speaker A: If you're flying in international space and you're collecting intelligence passively, that's not an act of war, that's just standard operating procedure. We've been doing it against the Russians, against the Chinese for decades and they do it against us. You know, if that intelligence is then turned over to the Ukrainians so that they can weaponize it, then you become an active participant in the conflict. So far we have strong circumstantial evidence backed up by reporting by organizations like the New York Times, etc, that strongly suggest that that is indeed the case, that the west is taking intelligence it gathers and packaging it in a manner which is conducive to Ukrainian planning of offensive operations against Russia. Why doesn't Russia do X, Y and Z? Only the Russians can answer that question. You know, escalation management is an important thing. If you start sending your, your, your planes up to jam aircraft operating in international airspace, you're the aggressor, not those, not those aircraft. And I, I think Russia is very careful not to be seen as the aggressor if the planes get too close. You know, Russia can institute, you know, self defense measures to include jamming, but I think just to send SU30 SMS out to, to jam the, the, you know, the electronics of aircraft operating in international airspaces. Well, it's not an act of war, it's an act of aggression and doesn't work. You know, the Russians understand what's, what's, what's going on. It's life. There's satellites that's collecting data. These aircraft are collecting data. You know, it's up to Russia to, you know, develop, you know, a counter reconnaissance strategy and enact on it. But intelligence collection is, this is part of modern reality.

Speaker D: All right, let's give people one more sneak peek at the latest episode of Trump Watch with guest Nomi Prince. Here's a highlight from this week's episode.

Speaker A: It's smoke and mirrors. Then if you're running on a platform that says, I'm going to eliminate the personal income tax by increasing the revenue stream from, from tariffs, as you said, you know, you could double the tariffs and you get from 2.6 to 5.2% if you can collect it all, that doesn't even put a dent in the 60 to 70% of the, the income. So it's, it's sort of deceptive salesmanship, isn't it?

Speaker C: Well, I mean, the numbers don't match on, on any way, shape or form. And this is something that, that I've been saying that, you know, that are in the own Treasury Department's figures. You, you, you can't, you cannot make up for, you know, getting rid of personal income tax by, by, by tariffing other nations.

Speaker D: There you have it, Scott, you're a good interviewer. You listen well, you ask the right questions, you keep it moving.

Speaker A: But I forgot the data. See here it was accurate data, 2.6 to 5.2. I think when you were talking to me earlier, I was like, and you know, I'm like, make up a number. I don't know it. We'll call it 12%.

Speaker D: You got the gist of it, though.

Speaker A: I got the gist of it, but I didn't get the numbers right. But thank goodness for, for Trump Watch because, and, and for Nomi, because I did write down, I, I took notes as she spoke. And, but, you know, no, it's amazing. And the interesting thing that is, is that this data is publicly available. That's something I talked to her about. I mean, it's one thing to sit there and say, well, I didn't know and how could I know? You know, don't blame me. The politician said something and I believed him. But she's like, just Google it, man. The Treasury Treasury Department has all the data out there right now. It's not secret. So there's no excuse, there's no excuse for people like me to accept at face value anything Donald Trump says about the economy because the, the data is the, and she went down. I mean, you know, the magic tariff chart that he did, you know, it, it made no sense. It was nonsensical. It was, I mean, you're tariffing penguins, for God's sake. You know, it's, it wasn't a good, I was, I have to be honest, I was prepared in the lead up to this tariff show to give Trump a higher score, you know, because, you know, one of my things is it doesn't matter, especially in the first phase of the interview where we talk about, you know, promise and implementation. I mean, you know, so I promised to do this and on my first day I signed executive orders and I ordered this to be done. In my book, you get an A because you said, I promise to do this and then you actually did it. The next part is, is it working? Is it achieving what you wanted? That's a different score. But the concept of saying you're going to do something and do it okay. But as Naomi said, it opens up a thing. If what you're promising to do can't be done and you know, it can't be done, it's impossible for it to happen. I'm going to replace income tax with tariffs. There isn't a world that exists where that is possible. And yet he's making that promise. I think at that point in time, we have to accuse him of, you know, false advertising. You know, it's a snake oil salesman here. And if you're lying from the start, you don't, you don't get to pass. You fail because you're lying to the American people. It's not a matter of policy and you believe it and it didn't happen. So you knew right up front that what you're saying is just a straight up lie, but you said it anyways. And I, I, I again, I thank for know me for, for, you know, helping bring clarity to this issue.

Speaker D: You, yeah, and we should tell folks she has a substack and it's called prin sites P R I N S I G H T s so you can search that and find it.

Speaker A: And she's written seven books and the latest one is an Amazon bestseller. And people should continue the best selling features of this book by buying it.

Speaker D: Well said, Sir Greg. In the United Kingdom, a diplomatic delegation from the European Union, along with representatives from Arab and Asian nations, came under Israeli fire during a visit to the Gen refugee camp in the occupied West Bank. What might be the true motive behind this disruption? And could Israel be concealing something in the surrounding area?

Speaker A: Okay, the true motive is that Israel doesn't want anybody sticking their nose and, and things that Israel doesn't want people sticking their nose in. And that's, that's as simple as that. Israel's not going to facilitate. We are not talking about a rational government or not. We're not talking about rational policy. We're talking about a nation that's committing genocide, ongoing genocide against the Palestinians, mass murder, and a nation that is now expressing itself in biblical terms, a Greater Israel. What does Greater Israel mean? What is all this? You know, it means that, you know, Israel is a criminal enterprise. Israel has turned its back on any, you know, vestige of legitimacy. You know, the United nations in 1948 voted to create the state of Israel. There were borders accepted. The people, you know, we have the 1948 borders, but Israel had no intention of allowing the 1948 borders to stand. That's why they began instituting the Nakba in 1947, even before that. But I think people recognize the complexity of the birth of Israel and are willing to say, okay, the 1967, 1967 borders could be the borders that. But Israel won't accept that either. Israel wants Greater Israel and we see them acting on this. You know, it's interesting when you, when you look at what Israel's doing today and the behavior they have, it's criminal behavior. But you're not allowed to, to call it out because to criticize Israel now is anti Semitic. And I, I want people to think about this for a second. What is anti Semitism? What is it? What does it, what does it mean? To be anti Semitic means that you are saying that Jews are different than we are. And actually what you're saying is that Jews are inferior to we are. That's the whole thing about anti Semitism is to say that Jews are separate from us and lesser than us. Anti Semitism is to segregate the Jews into, as a, as a group that then can be attacked, denigrated, etc. What are the, what are the Israelis and the Zionists doing when they institute the concept of Greater Israel based upon biblical references of the chosen people? They're saying the Jews are different from the rest of us. And when they say Amalek and they talk about Talmudic scriptures, they're saying that Jews are The superior race, and everybody's is lesser. It's reverse anti Semitism. It's basically. It's the same concept of separating Jews from everybody else, but instead of Jews being lesser, Jews are now greater. I mean it. Once you begin the. Once you buy into the process that Jews are different from the rest of us, it's anti Semitic, and it doesn't. It doesn't end well. Jews are equal. They're human beings just like we are. They practice a religion. The fact that they practice their religion doesn't make them better or worse than anybody else. And they don't enjoy a special status because they are Jews. That's just the reality. But if you embrace policies and say, no, no, no, they are God's chosen, and they are, you know, because they're God's chosen, they're better than the Arabs who are lesser subhuman animals. Amalek, you're promoting anti Semitism because you're promoting. Once you allow Jews to be separated, then it becomes a judgment call of whether they're better or worse. So I think it's important that we. That we not allow policies to be implemented that create a separation between Jews and the rest of the world, that we treat Jewish people as human beings, equal to all other human beings. And that can't be considered anti Semitic because basically you're saying that it doesn't matter if they're Semitic or non Semitic. They're. We're all equal. But Greater Israel is actually anti Semitic because it creates that separation. And like I said, once you agree that there is separation, then it's just a judgment call of whether they're better or worse.

Speaker D: Would it be anti Semitic to point out that some, I stress, some of my relatives, I think, qualify as God's most annoying people?

Speaker A: Well, I don't know, man, because there's a lot of relatives that are in the running for that title. But, you know, hey, you know, you're allowed to express it and, and then we'll. We'll find out if it can stand the test of history. All right.

Speaker D: If you're not otherwise engaged on Thanksgiving, you can join the Norman clan and weigh, weigh in with your opinion past the cranberry sauce.

Speaker A: God. What kind, though? Is it cranberry with the actual cranberries in it, or is it the. The jellied cranberry in the can that. And when it comes out of the can, do you leave it as the jelly thing and just slice it, or do you mush it up and make it look. I mean, come on, man.

Speaker D: I don't know, I'm, I, my role at these gatherings is to eat. I'm not.

Speaker A: Well, there you go.

Speaker D: All right, we have one more question and then we'll take, we'll turn it over to, to Ryan with some live chat questions. Haley Dallas from Florida as opposed to Haley Florida from Dallas. This is a multiple choice question from Haley. We keep the money going so we can keep the war going. That's choice one or two, are they keeping the war going so they can keep the money coming? Or three? All the above. And they is the Yukis. I guess that's derogatory for Ukrainians. I haven't heard that one before.

Speaker A: All right, so we keep the money flowing to Ukraine to keep, so we can keep the war going. They keep the war going so that they can keep the money coming to them. For all of the above, I'd say it's a blend of the two. I, I'd say that it's, you know, money is power and, and, you know, we, I, I think there's truth into both, both points of view.

Speaker D: All right, glad we settled that. Let's bring in the very bald Ryan Milton with some live chat questions.

Speaker A: Me.

Speaker B: Hey, here I am. That was me meowing.

Speaker A: Was it?

Speaker B: No, it was not. Actually. There's two things since you were talking about Nomi Prince. Apparently, yesterday, the US Court of International Trade, which is in New York City and part of the federal court system, has ruled that the Trump tariffs violate the constitution. He's got 10 days to change that. And I did what she said. I went and googled what the treasury said about revenue. I found it. Can't believe it. So this is the sources of federal revenue. 50% of the revenue comes from individual taxes. So there's Social Security is 32%, Corporate Income Tax is 8%, Miscellaneous 0.68, Excise Tax, 1.9, Customs Duties, 1.90, Estate and Gift tax. So there you. There. It's, it is there. And that's for 20. 25. That's for, for the year. What is it? TD. FYTD.

Speaker A: Fiscal year to date.

Speaker B: To date. But anyway, it's 50. Anyway, I just want to say. It is, it is. Like she said, you can just look it right up there.

Speaker A: So, all right, you said she's Nomi Prince.

Speaker B: I know, I know, I know. But you know, it's like one of those things where you want to say, well, let me see.

Speaker A: No, I, I agree. Double check. But it's, yeah, first of all, know me, we're not double checking. You we're, we're.

Speaker B: I wanted to see how easy it was to find it. Yeah, you know, how do you find it? And so there. It was some.

Speaker A: It wasn't hard to find, was it?

Speaker B: No, actually, I. You had everybody else that had something, and then you just had to find the one. You had to include treasury into the search. So there you have it. So some questions from Twitch. Sandy dug on, is the Taurus any good? When the Taurus ever. Will it ever be used? And then he said, ukraine's going to launch it and watch it get shredded. Is the missile any good?

Speaker A: It's never been used in combat, but I would imagine that it incorporates technologies that are replicated in other weapon systems that have been used. I would imagine that the Russians, having a very capable intelligence service, have acquired technical, you know, data about the Taurus and have developed solutions to the Taurus. You know, there's always a period of time when a weapon system's first used where, you know, you collect more information about it. But, you know, the Russians right now have a very quick turnaround from being exposed to a technology to coming up to a solution for that technology. I mean, they are shooting down high Mars missiles, ATACMS missiles. They're, they're shooting down bombs. You know, we dropped the JDAM from an airplane and, you know, we're so used to dropping the JDAM and having to hit wedding parties in Afghanistan at will. They were like, hey, it's a miracle weapon. And we're dropping JDAMs and the Russians are going, goodbye, bam. Shooting it down. I don't think the Taurus is. First of all, it's older technology. It's not cutting edge technology. I think the Russians will have a solution to it if they don't already have a solution. But the biggest solution is that if Ukraine uses the Taurus missile, then Germany, my understanding, will pay a direct price for that.

Speaker B: Well, there you have it. All right, so this question, I think this is a clarification question from Ryan M. Keesling. Apparently Dmitri Orlov said on Dialogue Works, he. I think he's saying that there was not a drone attack on Putin's helicopter. That, that's fantastic that the Ukrainians don't have anything capable of that. Is he wrong?

Speaker A: Oh, I mean, who is Dimitri? Olaf?

Speaker B: I don't know.

Speaker A: I mean, you know, I mean, you know, before we, we go and I mean, who the hell is this guy? So, you know, we'll, we'll do a quick. Dimitri Orlov. He's either a, a Russian ice hockey defenseman.

Speaker B: That's what I was gonna say. There it is.

Speaker A: Or an. An engineer and writer, but, you know, boom. So Dimitri Orlov will put in dialogue. Dial. Dialogue Works. There we go. The collapse here. We're. Dimitri Orlov. Name. Who is he? I. I don't. I mean, who is this guy going to.

Speaker B: Oh, let's see here. Live stream from Dialogue Works. Ah, here it is. Here it is. Here it is. I found it. Actually. Let's see here. Dimitri Orlov. Well, let's see. It's on the. Doesn't say who he is. He just says he's there on the. On the show. All right, we'll have to come back.

Speaker A: I mean, that's like, you know, Scott Ritter went on Dialogue Works and spoke about quantum physics and the closure speed ratio for a Mars intercept solution and said it couldn't be done. Wow. Does Scott Ritter know anything about any of that? Nope. Nope. I. I watch Star Trek, and therefore I'm able to. You know, I don't know who this guy is. Dimitri Orlov. Is he an expert? Is he an expert on this? Because what you're asking me to believe in this question is that he knows more than a Russian military commander who gave a briefing. Now, that is that melee commander lying. So you. In order to believe Dimitri Orlov, we have to believe that a Russian military commander is lying, making up what benefit is that? And then he makes a statement that it couldn't happen. Who is Dimitri Orlov to make this statement? Is he an expert on drone warfare? Is he an expert on Russian military, you know, tactics, strategy? Is he a technical expert? Does he understand how drones operate? How they're guided to their target? Who is Dmitri Orlov? Because I don't know who he is. I have no idea how to begin to answer this question.

Speaker B: All right, so I saw this dialogue on telegram. Alexi Arrestovich apparently has proposed that he run for the presidency of Ukraine and that he'd go to Moscow to make peace with Putin. Would that, or for that matter, any other outcome lead to civil war?

Speaker A: I mean, if he runs for president, he wins. Why would there be a civil war?

Speaker B: I mean, maybe because of the Banderas.

Speaker A: But if he runs for president, he wins, and he becomes president on that platform. One would imagine that the Banderas would either not be politically powerful enough to prevent that from happening, or as the president he is, developed a solution to the Banderas problem. I don't know. I mean, Zelensky ran on a platform of peace, and as soon as became president, was told by the Banderas that He would hang by the neck until dead on. On the main street in Kiev if he ever, you know, pursued genuine peace. So I think. I think a Restovich isn't the solution. I mean, today he's saying things, but, you know, he has a tainted past. I don't think Russia wants to bring him, you know, to empower him. Russia has a plan, and Russia has the people that Russia wants to work with. One less person, apparently, because a guy who was working with the Russians was assassinated by what appears to be Ukrainian intelligence in. In Spain. But, no, I like listening to Arrestovich because he. He's an intelligent person, all that. But I don't think Arrestovich has a future as the president of Ukraine.

Speaker B: All right, so from Facebook, from John Schultz. Do you think that presidents are limited by secret threats of violence?

Speaker A: No. I mean, no. I don't know. I mean, how. I mean, let's say I was elected president. What secret threat of violence are you going to give me? Because I'm the most powerful man in the world. So come and whisper a secret threat of violence to me, and I'll have you killed because I'm the most powerful man in the world. I own Delta Force. I own CIA paramilitaries. I own SEAL Team Six. And you're threatening the Commander in Chief, the United States of America. You're an existential threat to the United States of America, and I will kill you. I can order the Air Force to kill you. I can send a drone after you. I can nuke you. So, secret threat of violence against an American president, a sitting president, United States of America. No one would dare do that. No one would dare do that. So, no, that's a conspiracy theory, in my opinion. We may find out when the secret history of American presidency's finally written that apparently there's secret threats of violence that cow American president. I can tell you this. If I were the president, United States, and someone came and said, the Mossad will kill you. The Mossad no longer exists. They may kill me, but I can guarantee that I'll flatten Tel Kira. Flatten Mossad headquarters. Because nobody gets to make a secret threat of violence against an American president. It doesn't work that way. You don't get to intimidate the president. You don't get to do. It's just not. Not happening. So, no, I don't. I don't think there's any secret. That's violence against American president.

Speaker B: All right?

Speaker A: You're literally talking about the most powerful person in the world.

Speaker B: Excellent. Okay, so then, Jill Cocathlon says how can the US compete with China, Russia or India when the education system is so fracked off? How many years or how many generations.

Speaker A: I'm a product of the United States education system. Am I fracked off? I know I'm pretty stupid. I accept that. We know that my Russian language sucks and I'm incapable of learning language in a coherent fashion. We know a lot of things. But I'm a byproduct of the American education system and I think I'm competitive globally. I've proven it. It's not hypothetical. I stood toe to toe with well educated people around the world and come out doing all right. There's room for improvement. I admit it. Trying to make myself better every day. But it's deeply insulting. We're not producing what we should be. I think the, the fact is we have a very low literacy rate. We need to raise that. I think our system has been broken for a while, but we do produce some of the smartest people in the world. You know, that's just deeply insulting to imply that America can't compete. Who the do you think puts a spaceship up in the air and brings it down? You know, we, our guys, Elon Musk and the team that he surrounded him with. Americans, by the way they did that. China just did it for the first time playing catch up. There's a lot of technology out there. It's American technology comes from American brains. American know how Americans are out there solving problems on a daily basis. I'm not sitting here trying to sell you the American education system is the best way. It's not. The city of Albany has a horrible education system.

Speaker B: Maybe it's primary education, right? Primary and high school. Maybe that's what they're talking about. Maybe.

Speaker A: Well, I disagree with them. The, the Bethlehem High School produces outstanding students. Outstanding students. They're five miles away from Albany. Different environment. But America produces good students. We also produce bad students and we shouldn't. You know, you know, the Soviet Union and I believe Russia produces outstanding secondary education and, and their universities are, are fantastic. China, there's no doubt that the Chinese produce really good students. I'm never going to denigrate the Chinese education system. America can do better and should do better. But I'm not about to sit here and allow someone to say that we don't produce good minds. We solve problems on a daily basis as America using American brains that are derived from an American education system. What I will say about the American education system is this. If you want an education, there's one there to be had. Our problem is that we allow people to opt out and that shouldn't be.

Speaker B: All right.

Speaker A: See, I wasn't educated enough to watch the three minute clock.

Speaker B: It caught me off guard too. All right, From Mexico, the caffeine bear says that we have confirmed that drug cartels have ties to the Kiev regime, both in weapons and mercenaries. Shouldn't the US Government look at this and reconsider its support for Ukraine?

Speaker A: I mean, if we've confirmed that. But I mean, reconsider. Come on, man. Come on, man. Yeah, we, we, you have to be careful about. I mean, I think we should reconsider our relationship with Ukraine for a whole bunch of reasons, but not because we attack it on the periphery. We know it's the most corrupt nation in the world. So corrupt shit's going to happen and is happening. But you know, a linkage of corrupt people in Ukraine to drug cartels where they are sending what in the big scheme of things is a minuscule amount of weapons over there for financial gain. That's not why we should turn our back on Ukraine. Turn it back on Ukraine because there's a potential of nuclear war coming out of this conflict. We should turn our back on Ukraine because the ideology that the Ukrainian government embraces is odious. And, and, and, and we should never allow it to exist. There's a whole bunch of fundamental reasons why we should turn our back on Ukraine and not deal with Ukraine. But the, the fact that we know Ukraine has been a corrupt nation for decades now and they are behaving in a corrupt fashion, that's just business as usual. I mean, because if you got to be careful, you start throwing stones and you live in a glass house, you might find out that the CIA has a relationship with cartels where we allow drugs to come into the United States so that we maintain an intelligence collection capability so we can get the bigger picture that we tolerate the sale of cocaine or crack cocaine to a black urban populations because they're right off. We can write them off. We don't care about them. Because isn't that what they, they found out? You know, the San Jose Mercury ran, they had a reporter that dug that and then he got killed. You got to be careful when you start throwing stones because we live in a big freaking glass house. And the second we say that because there's corruption on the periphery, the whole system has to be brought down. There ain't going to be a system standing.

Speaker B: All right, Nexus Gamering says, can we talk about that? Hundred thousand truck troops staging in northern Ukraine, I think it's near. He says Loma Kovka, Russia. Do you know about that?

Speaker A: What do you want to talk about?

Speaker B: I don't know. That's what he's asking. I think he wants to know about them being there. Presumably those are, it's in Ukraine, he says.

Speaker A: So northern Ukraine would imply along the Belarus border. Well, let's, let's put it in perspective. 100,000 seems like a big number. Ukraine went into Kursk. Let's pull up a map of Russia and the Russian Ukrainian border and let's zoom in on Kursk and look at that little bubble that was affected by their invasion. 70,000 troops died. So now what are you going to do with a hundred thousand guys? You're going to occupy Belarus, you're going to drive to Minsk? Or are you going to go with a hundred thousand, get bogged down in the marshes and in the border way and then get slaughtered? A hundred thousand troops might probably be there defensively because the Zelensky has been making this, you know, talk about they're worried about an incursion coming out of Belarus. So they are massing troops along the Belarusian border to be prepared to repel an assault of that nature. You know, we know that the Ukrainians said a while ago they have 800,000 troops. So that 800,000 troops supposed to cover a lot of territory and turf. If a hundred thousand of those 800,000 are deployed to the north, that's not an unreasonable number. But I don't see any reason why to, you know, talk about these hundred thousand as if they are, you know, something special. What is their training? What is their equipment? I mean, are these people equipped with Challenger tanks, Abrams tanks, martyrs, Swedish infantry fighting vehicles, you know, Caesar self propelled artillery? Or are these territorial defense units that have old equipment and marginal training? I don't know enough about that hundred thousand to be able to answer these questions.

Speaker B: All right, and our last question here from Twitch. What makes Russians and Serbs, quote, brothers forever? Sure, they're both Slavic people, but I see a closer and stronger connection between them than any other Slavic people. What's the reason for that? I guess I edited that between them than other Slavic people.

Speaker A: So you're saying there's a closer relationship between Russians and Serbs than Russians and Belarusians, Slavic people? I don't know. I mean, that's a, it's a fair question. It's subjective in nature and I, I'm not in a position to really answer that question because first of all, I have to take at face Value what you're saying is true, and I'm not disputing it, but, you know, in order for me to answer a question, I would have to be able to say, yes, I've looked into this, and I recognize the pattern of behavior that you're suggesting exists, that there is indeed this very tight relationship between Serbs and Russians that is unique and manifests itself in a different fashion than, you know, Slavic relations between, you know, Russians and other Slavic peoples. I can't say that I've done that. And, and, and it can say that happens. I, I would imagine that the Russians are very close to the Belarusian people. So what makes the, what have you singled out to say that the Serbs and the Russians are closer than the Russians, than Belarusians? I would say that the Russians and the Ukrainians have a very complex relationship. You know, but how many million Serbs are in Russia right now? Probably not anywhere near a million, but we know that there's millions of Ukrainians living in Russia in peace and harmony, that they've intermarried, that Russians and Ukrainians, you know, it. That's one of the true tragedies of this conflict is, is that you've taken people that were so close and, and they've turned them against each other. Well, the, the Ukrainians have turned in Ukraine's against the Russians. You know, so I would make an argument the Russians and Ukrainians might be actually pretty damn close, given the level of intermarriage and, and things have taken place there. I just don't know what the data point is that, that backs up what you're saying about the Russians, other than your personal observations and maybe some emotional attachment you might have to, you know, both Russia and Serbia. But I, that's, that's, I can't, I can't further. I can't advance this further.

Speaker B: All right, well, thanks, Scott. And that is it.

Speaker D: And let's mention the latest episode of the Russia House. I think you said you were enjoying it earlier, Ryan. Yes.

Speaker B: Oh, yes, yes, Andre. First off is I actually have to read. I just started reading his article, which is also on the Russia House page, and apparently the Russian article is more recent than the English article, which is really a trap to get me to read more Russian, because my, my Russian, I, I, my brain exploded after one. The first week in Russia. I, I literally couldn't move my lips hardly at all.

Speaker D: So did you tell Scott what you told me? Like, when you got together with Alexandra, you were speaking Russian.

Speaker B: I couldn't believe it. She said, ryan, I understand you. It's good. It's good. So I appreciate her saying that. We had a great time. I know. I think Scott was a little jealous so that we went to the Cosmonautics Museum all day together. And that is an incredible, incredible place. And also the Russians there do praise American work in space just as much as their own achievements. And, you know, that seems strange, maybe over here, but they just don't differentiate the fact that we're all working on the same things together. So the article with the interview with, first off was insightful and I have to read the article and watch it again because he's a smart guy.

Speaker A: He's a very smart guy and he brings a perspective that, I mean, one of the, the whole purpose of the Russia House is to bring a Russian perspective. And here we have a Russian perspective on capitalism. And you, you know, many Americans who are ingrained with Russophobic, you know, tendencies aren't the Russians, you know, Karl Marx and, you know, Hegel and all of you know, I mean, what, how could they talk about capitalism? What do they know about capitalism? Apparently a lot. And first off, proof.

Speaker B: And he said, he said, oh, and we're a capitalist country anyway, and so is China. There you go.

Speaker A: Oh, well, maybe that's why you know something about capitalism. But the Russian perspective on capitalism and the development of capitalism and the impact that Russia's capitalist past has on the world today and the future of the world is, is fascinating. And it's one that most Americans wouldn't be exposed to because we simply go, you know Adam Smith and you know Rockefeller and you know, Bill Gates, Capitalism, it's great. Well, no, did you, did you know that. That Joseph Stalin perfected what's called anti capitalism? And anti capitalism isn't Bolshevism or communism. It's actually a different approach to industrialism and labor relations, but it had created a system that was better than capitalism at being capitalistic. Blew my mind. But, you know, first off explains it. You can read the article, you can subscribe and watch the interview, but it's like, it's like Trump watch. It's, you know, but from the, the Russia side, I have an opportunity to meet these people and ask some questions and try to, you know, pull data out from him. It was, it was just fascinating discussion with him and the insights he had opened my mind. And I've been studying Russia for a long time and this provided a whole different perspective on it.

Speaker B: Yeah, the teaser on it is just enough to make people make a lot of comments, but it's not exactly what they, what you think it is when you actually listen to the interview. So you really have to.

Speaker A: How rapidly people, I mean, I see this all the time. You know, you put a teaser out there and suddenly they're writing comments as if they know what the hell was said in the interview. And you're like, how can you. Why, why are you commenting on this? Because you clearly don't know what you're talking about. That's not what the interview is about. People should take the time. And again, I mean, for the cost of a cup of coffee, you get access to, you know, Andre Fursov's brain, and that's priceless. Yeah.

Speaker D: If you want to hear it from an American, check out the latest episode of Trump Watch with special guest Nomi Prinz. And that will do it for Ask the Inspector, the loquacious version. Please join us for the Lightning round on Tuesday at 3pm Eastern time. That's when Scott will answer every question in three minutes or less. Good show, gentlemen. Thank you very much, Scott and Ryan, and thanks to our beloved audience. Take care, everybody. See you on Tuesday.

Speaker A: Good night, Doug. It.

