" It's the growing for market podcast.  Doing things that are not good for this oil also have huge impacts in a lot of different ways.  Then we start to see our soils become depleted and then we think, oh, we need to add some fertilizers.  And so the easiest way to add a fertilizer is to do it synthetically. They're easy to manage.  You know, you just pour this cup of this in the here and you spray and it's all wonderful.  But unfortunately, those synthetic fertilizers are also not food for microbes.  So microbes won't eat that nitrogen that is being applied.  They won't eat that phosphorus that's being applied.  We have to be thinking about feeding the soil in a way that actually feeds the soil,  not just feeding plants, not just creating the most beautiful blemish-free product that we can.  Because that beautiful blemish-free product is really a result of genocide of microbial life.  Crazy.  Hello, and welcome to the growing for market podcast.  Where we talk about growing, marketing, and the business of growing vegetables and flowers for local markets.  Like farmers markets, CSA, farm stands, and local wholesaling.  I'm April Parms Jones, your host and a writer for Growing for Market Magazine.  For 33 years, the magazine for flower and vegetable market farmers.  If you're enjoying the podcast, just wait until you see the magazine, go to growingformarket.com  for more. Also, if you could give us a follow and a rating, it really helps other like-minded people  to find the podcast. And now, let's take a minute to hear from our sponsors.  It's with their generous support that we can bring you the podcast for free.  We know it's peak season. You're busy. But the messages you send now are what drive renewals later.  That's why farmhand is offering free instant access to their farmer-built newsletter builder.  No demos, no setup fees, just drop your logo, upload your list, and start sending farm-branded  emails that boost sales, engage members, and save you hours each week. Get free access today at  farmhand.partners-gfm. That's farmhand.partners-gfm. Today's episode of the Growing for Market  Podcast is brought to you by BCS America. On our farm, we've had our BCS 2-wheel tractor for over a  decade, and with no belts to slip, it's all gear-driven construction is still going strong.  Though we originally got it for road-o-tilling, we kept it even when we went mostly no-till,  because it can do so many other things around the farm. From snow-blowing to making raised beds  with a rotary plow to chipping wood, it can do just about anything you might need on a farm with  the right attachment. Need to shred a cover crop? A BCS flail mower will make quick work of even  the most vigorous cover crop and chop it up so it breaks down quickly. Want to stir in compost  or amendments without inverting soil layers? A power hero turns your BCS into a precise  tilting machine with depth control so you don't mix deeper than you want to. With so many  attachments to choose from, it truly is the Swiss Army Knife of Farm implements. It's why  instead of saying 2-wheel tractor so many people just say BCS.  Tractors and attachments are on sale through the end of the year. Visit BCSAmerica.com to find  sale pricing and your nearest dealer. Hello and welcome to Growing for Market Podcast. I'm April  Parms Jones and I'm so excited to have you guys here. We are interviewing today Megan Ayers.  She's a first generation farmer from the beautiful state of Indiana and she started out with  urban agriculture and then she expanded into a larger farm in southeast Indiana. Megan's passion  has been focusing on bringing a conventionally farmed land to a more regenerative and sustainable  landscape and we are just ecstatic to have her today because we're going to talk about conservation  minded practices and her experience on revitalizing the land. Megan, thank you so much for having us.  It is absolutely my pleasure. Thank you for having me.  I mean, I think this is such an important topic. I personally am a farmer in Akron, Ohio  and I have, as you started out, a small little acre of land, not even an acre, like a half an acre.  And I've had to use so many regenerative practices to get the land to where I need it to go,  so I can grow every day. So I'm super excited to talk about your sustainable journey and I'm sure  our listeners are going to learn a lot. Well, you know, I kind of think of farming as the ultimate  lifelong journey profession. No matter how many times you do it, no matter how good you get at it,  something is going to fail. You're going to learn a tough lesson whether you want to or not.  And just when you think you have it, I figured out you're learning something totally new that  just changes everything and really blows your mind. So yeah, happy to share whatever I have.  have, but who knows? You could definitely teach me something.  It's going to be a fun journey. So can you tell me about what drew you to  the land and starting the farming journey? Oh, okay. Kind of weird. No shade  at my mom, but we didn't eat a lot of fresh fruits and vegetables as kids.  She came out of that generation where, you know, canned and frozen were  easy and quick. And so having parents that worked full time jobs plus over  time, that's how we did dinner. And gosh, I thought it was gross. So I thought I hated  vegetables and fruit for a very long time. And I have a very, very memory of  sneaking into my neighbor's tiny backyard garden when I was, I don't know,  maybe five or six seeing this like bright red thing on a plant that I thought  was maybe it's a gumball or, you know, something that I was familiar with. And I  plucked it off and I knew that it was food because she had told me, you know, like  she was growing food, it's her garden, etc. Her name was Carol. And she let me  taste it. And I popped in my mouth and I chopped down and this flavor  explosion happens in my mouth. And I thought like, how in the world is the candy  growing out of the ground, you know, and it was just a ripe cherry tomato. And that  just stuck with me for the rest of my life. But it was way back there. And as I  grew up and I moved to my first apartment and met some people in college who, you  know, group plants and talked about gardening, I thought, oh, you like regular  people can do that. So I started, I think I started my first little garden in  the ground back in like 2002, 2003, 2004, just in the middle of the city. We were in  this really urban area, but happened to have like just a square of yard. And I  thought, hey, I'll try it. So I just spent a terrible afternoon in early June, digging  things up and planting seeds and hoping that something would grow and like everything  grew. And it was amazing. And it tasted delicious. And I even discovered that we  had natural corn smut in our soil. So that was also a learning experience. But  ever since then, I've always kept a garden. And then when I bought my husband and I  bought our first house like 10 years later, I think it was 2013 again, small urban  lot, but significantly larger, you know, like a tenth of an acre instead of the  20th of an acre. And I mean, before I even broke ground, I bought three chickens and I was,  you know, ready to start this journey. And I just did a bunch of research because it was  such a small environment growing. And I was just growing in raised beds that I learned  about like why the soil health was really, really important. And what I could do to grow  as much fruit as I could in the smallest amount of space because we also had dogs and  chickens and I planted an orchard. And I ended up with more food than I needed. So then I thought,  oh, okay. So I guess farmers markets are next. So I started selling to farmers markets, I believe  in like 2014. And then I think I started a CSA maybe the next year. And then it just kind of  rolled from there. So that's for four or five years. Just in addition to my regular full-time  job and it felt like a really great way to unwind and relax and help me get my thoughts together.  So I didn't think of it as an income source. I thought it more of a therapy source. And I waited  to just connect with the land, get my hands dirty, stretch, just enjoy the quiet sounds of nature.  And then in late 2019, my husband ended up getting what he thought was his dream job. But it was in a  totally different state in a different part of the world, not that far. Maybe like 90 minutes away from us  where we were in Cincinnati. And so I thought if he was going to get to have his dream job in  Louisville, then like, well, I get to have my dream piece of land. So we made a pact that we would  move to the country. And he was very, very generous and agreed to commute an hour to work every day. So  that we could live on some land. And so I started looking for land and could not find a thing in a greater  Louisville area, because that is high value land for horse people and for development. And sure,  you've talked to other farmers, you know, land access is a real problem. And we thought wrongly  that finding a small farm would be so easy. And so we looked for a really long, long, really long,  long enough time that we ended up being homeless because we had sold our home. And then we had to  move out of our home. And we still didn't have a place to live. And I was just really lucky to have  the support of some friends shout out to my friend Leah. Thanks Leah. That was with her for a month or two  while we found a place. But we ended up in Indiana, South Eastern Indiana, one just a little chunk,  11 acres with a tiny falling down house on it, not a tiny house, but, you know, a house under a thousand  square feet that was in terrible shape and it was kind of just right place right time and  desperation. So we moved out there. Yeah, I guess the rest is history. When we moved in it was just a  field of muddy field with some cornstovers left over from the previous season. It was gray clay,  smelled terrible, just like a lot of anaerobic. Actually, because of the compaction and  I started from there just utilizing some soil health practices to start small and get bigger.  And so now five years later, I've got about an acre in orchard, about a quarter of an acre in  berries, two acres in market garden, about a half an acre of sugar mapples so that I can tap.  And then I've also done a hedge drill because I'm surrounded by conventional corn and soy  farms that are heavy sprayers with drones and airplanes. So there's just a lot of drift that  I deal with. And then we also have chickens and geese that we rotate and we just got two  kuni-kuni pigs maybe one week ago. Very excited about those guys, but they're not for food,  but to be our farm friends and to help with, you know, land improvement. I'd also like to bring in  some sheep and just rotationally graze those guys through the areas of our land that get essentially  zero use that are yes habitat for like coral and bugs and other creepy crawlies that we love because  the whole point is to create an area that is abundant with life rather than to kill all the life so that  we can make human food. I really like to think about it as a system, trying to mimic nature as  much as possible the most diversity that I can encourage essentially and hopefully some of that  encouragement can be human food or food for the animals that live around us. That was a lot, sorry.  No, it was a lot. I was taking fabulous notes so we can kind of segue a bit by bit throughout our  conversation. I would like to first start talking about relaxation. I feel like we all need to relax  and enjoy ourselves and there's just so much more in the world in general that having access to  the land to garden to a little plot in a community garden, can you talk more about how you've  been able to use your land access of having land to relax and unwind and the therapy and a workout?  That's a great question. It is. I mean, if you struggle with downtime, do not farm.  Because there's always something to do, right? No matter what something is broken, you're always behind.  And so there's a really interesting dichotomy in utilizing this lifestyle to be mentally  healthier while also dealing with the stress of I have to get these plants in the ground by this time  if I want to meet the needs of my customers. But I think that overall it's a mindset shift.  I have to put my brain into the rhythm of the season. I have to not fight against what the earth is  doing. I have to work with it. And so I think it's human nature to struggle against the tide to  try to make it be the way we want it. And that's really difficult and it's frustrating and it's stressful  and it causes you feelings of anger and maybe even you start to talk badly to yourself because  you're not getting it done. But I found that over time when I've just accepted that  hey, we've had an incredibly wet spring. I'm not going to get anything into the ground because I can't  get a wheelbarrow to where I need to go because it's too heavy and it just sinks in the mud.  That's just reality and I have to just let it go. And that's been incredibly helpful.  Additionally, I think that because everything that I do, I do by hand, I don't have a tractor,  the biggest piece of machinery I have is a ride-on mower. And boy, do I wish I did have a tractor.  But because I have to do everything by hand, it's very active and it's a lot of resistance work.  So picking up heavy bags, rolling wheelbarrows around, digging in the earth, getting dirty,  being sweaty, lots of stretching and movement, it just feels good. Even if I'm, you know,  sunburned and sweating and covered in mosquito bites, at the end of the day, it's a job well done.  I can see what I've done. And I think those of us who work in other professions where we never  really see the work that we do, it's just sitting down at a computer and doing 75 emails and  answering the phone or even working on a long-term project and just being that tiny cog in that  project. In farming, you get to see the labor of your work almost immediately. It's magical.  You put a seat in the ground and got it gross. And I've just, every single season, I'm just  overwhelmed by the magic of that process. I did nothing. And I have food. It's just, it sounds silly  to be amazed by it after, you know, gosh, over 20 years of doing it. But it overwhelms me because it's  helpful to me because it feeds my community. I get to nourish them with, I say very little effort.  No, that's wrong. Of course, there's huge effort that goes into it every day for months and months and  months. But it doesn't feel like a lot of...  effort because there is that rightness to it because it does mimic the seasons, it mimics  the rhythm of nature. And so, despite the fact that I'm sure everyone you talk to just  talks about that toll, that work, that stress, that farming, especially small scale farming,  takes because the larger scale, of course, also stressful, also a lot of time, and different  kinds of stresses. All that small scale because it's often not mechanized or not mechanized that  much. We're relying almost entirely on our own bodies and I'm not a spring chicken. I'm 45. And I don't  know how much longer my body is going to cooperate with me, but I know that no matter what happens,  I can scale what I grow to my ability. And that's another part of this job that's really  unique. You can't do that in other professions. You can't say, well, now that I'm 60, I won't do  my job. You can still do it when you're 60. You can do it when you're 70, when you're 80. And it's one  of those professions where time and experience can be passed down to younger people. And be it,  five-year-olds, like me stealing tomatoes, or 25-year-olds coming out of college and not knowing what  they want to do, or even 45-year-olds who were in a profession and have decided that maybe this isn't  for me anymore. Because that's kind of what I did. When we moved to Indiana, it was right when COVID hit,  and COVID kind of broke me. And I was in education before that. And I was just seeing  how my students were not responding to anything really. And so I just felt like I could be more  useful feeding people than I could be teaching them where a period goes or when to use a semicolon.  So while I still have a full-time job, and I get to work in agriculture, which is really lucky,  and I really love my full-time job working with urban soil health as an urban and small scale. So  health specialists, in my heart of hearts, I'm all farmer. It's very much more a, it's like a  vocation. It's not a job. Because it's a part of who I am. It's an identity. And it's, you know,  this is going to sound very woo-woo. You know, like it's a holy practice where we get to care for  other people in this really unique way by nourishing them, by creating a community surrounding that  food, by talking about the ways in which they can too engage in this practice. There was a farmer  that I used to work with at a farmer's market. Her name is Nancy, shout out to Nancy. She's  sorry that at the farmer's market, we sell 10 pounds of produce with, but they get 20 pounds of  education. And so I just always took that with me because when I'm selling food at the market,  yeah, you know, I'm talking, oh, here's my tomato. Here's my squash, my celery, my carrots. But really,  what we're talking about is how can we get this raw ingredient into your body? And so we talk about  cooking. We talk about preserving. We talk about even how easy it is to grow something like this.  All you need is a, you know, a one gallon pot and some sunlight. So sorry, that was a tangent.  I feel free to stop me at any time.  And now let's take a minute to hear from our sponsors. It's with their generous support that we  can bring you the podcast for free. A well built high tunnel is one of the smartest investments  a small farm can make. It protects your crops, extends your season, and keeps income rolling in  even through winter. Nifty hoops builds complete gothic high tunnels that are easy to install  and built to last. They're easy, bolt together construction makes set up straight forward and  efficient, whether it's a small backyard hoop house or a dozen large production scale high tunnels,  especially through their community build option where professional builders work alongside your  crew, family, or neighbors to build each structure, usually in a single day. Most growers go with  nifty's full setup, steel framed end walls, roll upsides, baseboards, double plastic with inflation,  automated vents, and real doors, all priced to make the best choice the easy one. Nifty is a small  crew out of Michigan using US steel and working hands-on with growers across the country.  They'll help evaluate your site, handle an RCS paperwork, and if they're building with you,  they'll even float your costs share until after the build. Visit nifty hoops.com to learn more.  Farm more seasons. Grow more food. Nifty hoops. This is Nathan from Tilt Soil. The other day,  I told a friend that I think any product advertised on a podcast is probably a scam. And now it  gets to eat my words because I really do think it's worth talking to serious growers about living  soil. But instead of listening to me, blow V8 about root development or trace minerals,  you're probably better off just trying it out. Go to tiltsoil.com slash GFM to request a sample of  our seed starting mix and see what your plants think. If you're not impressed, then forget  we exist. But if you like what you see, then reach out and we can get into the details. Whether  you need a yard, a truckload, or want help organizing a group by caller. text. Josh at 206-870-0642.  And yes, I am reading his personal cell phone number in a podcast ad. All right, play the jingle.  And now...  back the show. I think those are excellent points to talk about how the food really is nourishing  your spirit and your soul and the community making it more resilient, making it more robust, making it  you know more economically viable because if you're healthy then you maybe have less health issues  and then you're able to enjoy your life more you're able to show up for your workplace and be more  productive you have less sick days I mean we can go on and on and on so food is definitely very  viable to our economic and spiritual and happiness in general I agree and I love that you spoke about  how caring for the land actually cares for you and your full body and as the stress relieved  and as a workout and I've really enjoyed how you talked about this is something that you can do  until the end you can always scale up you can scale down you can bring in helpers and the  distance and you have so much knowledge that you can share and pass on as you are learning your own  agricultural knowledge so I think that's all very insightful I would love to talk more about the soil  and how you're able to elevate the soil make it more productive for you and your smaller space of  urban farming but then also in your larger space as well yeah so when I was in Cincinnati growing in  just raised beds the first thing that I did was learn about companion planting and how  some plants just like to be neighbors and you know just like humans some of us get along  and some of us just don't so I just followed those principles and also thought about a good  crop rotation I learned about which plants take up a lot of nitrogen take up a lot of phosphorus which  put that nitrogen back in and I learned about soil microbes though gosh there is just so much to know  I feel like such a newbie talking about it but learning about the various beneficial microorganisms  that live in our soils and how we can farm or grow or even just steward them into having the best  lives that they can that as a direct result of their happiness they give us those nutrients in the  soil for our food and so with healthier soil microbiology we have healthier food and if we have healthier  food then we have healthier people so what would be this strategy to grow out and have more healthy  microbes in your soil? Great question that's all about soil organic matter when I think about  growing food a lot of people we you know we talk about like oh we want to have seed our plants  but no we want to switch that messaging on our heads we want to feed our soil so the best way to feed  your soil is to give it soil organic matter give it the appropriate carbon to nitrogen ratio  so soil microbes like a carbon to nitrogen ratio of 8 to 1 I'm sure you've already read all this  information so I'm not gonna turn on the teacher Megan here but there's a lot of ways that we can get  our soils to have that soil carbon to nitrogen ratio now the first way is utilizing mulches right  so we always want to always want to keep our soil covered no matter what so soils that can see the  sun our soils that are gonna be weedy and they're going to be dried out prematurely and they are  going to be erosion prone so if we can cover it with a mulch be it strong hey wood chips like in  our pathways not in our actual garden beds or even my favorite mulch to use is plant-based compost  so rather than utilizing something that's big and heavy I really love a plant-based compost because  it increases that soil organic matter it's closer to that carbon to nitrogen ratio whereas like a  higher carbon product is gonna take longer to break down so works very well as a mulch however  because it's very high in carbon our soil microbes are gonna say like well I'm tired of eating this  carbon I want more nitrogen I'm gonna go over here where there's nitrogen so often what people  report is that oh I put on all of this mulch and then my soils did poorly and essentially what that  means is that the soil microbes didn't get the nutrients that they needed there wasn't enough nitrogen  available so with regard to that soil organic matter feed and so what they did is they just ate all  the excess nitrogen from the previous season and so come spring there's no nitrogen available in  in those soils so a great way to feed those soil microbes besides mulches is also to keep living roots  in the ground and the way that you do that is of course is come fall come winter rather than  ripping out your old plants just leave them there leave them there because they're going to be  food sources both for those microorganisms in the soil but also in vertebrates that are going  below the soil surface and coming back up as well as other bugs other invertebrates like slugs and  snails which are then food for larger insects and birds which are then food for larger birds you  know the whole soil food web right and so another way that we can keep living roots in the ground  if you're say like not to sure that you want to do that is to plant cover crops so that's another  soil health principle. Planting cover crops is a great way to fix nitrogen in the soil to get  rid of compaction to get rid of that erosion problem it keeps soils covered and then some cover crops  are winter kill so you don't have to worry about a termination  strategy in the spring, you can just let the cold weather kill those cover crops. And  that plant residue acts as a natural mulch in the spring. All you have to do is move it  out of the way and transplant your plants in or direct seed depending on what kind of mulch  you have. Like if you have a cereal rye, obvious, well, I shouldn't use cereal ryes  in example, because we're talking about winter kill cover crops. But if you have say like  a field pea or like an oat, what I love is a field pea oat and dicon radish altogether  planted in August or September allow it to grow up, do its thing. And then once it's super  cold, it'll die, come spring. You've got all that great plant material on top of the soil.  So your soils were covered all winter long. You've got roots in the ground that you've  got your mulch and you've got food for your soil microbes over the winter. So it's a it's a win,  win, win, win, win. I love it. I love it. Now that's something that we haven't I haven't  talked to a lot of guests about, which is feeding the actual soil. I mean, we've talked about  companion plants and crop rotation, but really thinking about how you can feed your actual  soil and making that your primary focus and focusing on the carbon to nitrogen ratio,  eight to one. I love all that and the cover crops and mulching and covering the soil and using  plant based compost, which I'd never thought of. That's amazing. And keeping the living  roots, I love that idea of keeping it in the ground because you do. I always have that notion  of like, I want to be perfect and clean and sparse and like fresh ready for spring. But thinking  about how if I keep the roots in, I'm actually helping myself to have more nitrogen and have a  healthier soil, which is important. I love that. Thank you. So more thinking about growing and small  spaces. Can you give us some tips and tricks about what you found to be really successful  growing and small spaces? Yeah. Essentially, I like to think about so, you know, like if you're container  gardening, do you're not getting a lot of turnover in your soils? So I would say add worms if you can. You're  really going to want to increase that biodiversity. Additionally, continuing to think about your plants as  neighbors, because when we think about our plants as neighbors, we know that we do really well as humans, then we're  exposed to lots of different types of people, right? Like our experience is more interesting. We learn more things. So  really start to think about putting as many plants together as you possibly can. Those companion plants can have  multiple functions, right? Like they can feed you. They can act as a insect deterrent or as a beneficiary where it  brings in something that is going to take care of, say, a pest that you don't want. So for instance, lots of people love their  fresh tomatoes, right? But they don't like tomato hornworms. Those suckers can decimate a tomato population in a single night,  right? So a great strategy is to plant sweet elism underneath your tomatoes. The sweet elism brings in parasitic  wasps and those parasitic wasps move their eggs onto the tomato hornworms and then eat the tomato horn  worms from the inside out. Yeah. Yeah. It's pretty gross. I love it. So yeah, I love the idea of using companion  plants to strategize and fight against the past because I feel as if as I far more longer and longer over time, there's just  more pressure in general. Like there's more past pressure. There is more climate pressure. There's more water pressure, erosion  pressure, tons of erosion pressure, especially in Akron, Ohio. We have such huge downpours that just hit the ground, boom, boom, boom,  very violent. And then it's gone. And then your soil is just kind of eroded away afterwards. So yeah, absolutely using soil technique,  but also companion planning to help with that is really key. Yeah. And the higher your soil organic matter is the more resilient it becomes. So your basic say like farm field,  well, have a soil organic matter of maybe one to three percent. But when we're talking about small scale diversified fruit and vegetable  gardens or farms operations, whatever you want to call them, because they've utilized these practices, we're looking at soil organic matters between like six and 12% and for every  percent of soil organic matter that is in the soil, that allows the soil to mitigate rain events. So for every percent of soil organic matter you have in your soil, that will allow one  inch of rain to filter through without puddling, ponding or flooding per acre. So that is a lot of rain. And so when we have higher quality soils,  more soil organic matter, what we find is that your soil filters better, you are also able to hang on to the moisture a little better. So you don't have that drought as soon as it stops raining for five days,  instead you can really utilize dry farming. So when our soils are mulched, they stay nice and cool when it's really, really hot out or early in the spring,  when we mulch our soils, especially say with compost, that dark color and that layer of compost makes our soils warmer.  that we can plant and germinate a little bit earlier as well.  So all of these soil health principles,  the increasing of diversity,  the keeping the soils covered,  the living roots, the, ooh,  I didn't mention one more.  Trying to keep as little disturbance as possible.  So I'm sure many other farmers here  have talked about no till or low till.  And the prevailing, you know, attitude  is that like, well, I have to till.  Like I can't get in there unless I work that soil.  The soil wants to be worked.  It's nice and fluffy and delicious  and it smells so good and it dries it out  when it's wet in the spring.  But like that's actually counter  to what you want to be doing.  Because if we look at our healthiest soils in the world,  those healthy soils are in completely undisturbed areas.  We're talking like forests and rainforests.  The only thing that's happening in those forests  is a lot of biodiversity, absolutely no disturbance,  and a ton of, just a ton of life,  whether we're talking above ground or below.  And so like any time we're mimicking nature,  what we're gonna be doing is working with nature  rather than fighting against it.  So when we see huge fields being tilled in the spring,  what we're actually seeing is the breaking up  of that soil profile,  the releasing of nitrogen into the air.  And we are killing the environment of those soil microbes  that have worked hard all winter long  to create a community there.  So when we're talking about improving our soils,  it's really important that we just do crazily enough,  like the bare minimum.  Just keep them covered.  Try not to mess with them too much.  And you know, give them food.  When your tomatoes are done, let them rot.  Let them fall over.  Let them sit there all winter long.  The only exception of course being if they are blighted  or if they are showing some sort of disease pressure,  then all you have to do is just clip them off  right below soil level and get rid of them.  But I do encourage people to compost as well on their own.  Yeah, utilize and compost is a great way  to obviously divert food waste from our landfills,  but also to give our soils food.  I know people who the idea of like a big pile of rotting food  in their yard is gross to them.  So they just dig a hole in their garden  and they just bury the food scraps right there.  And compost gets a really bad rap.  I feel bad for compost because it's pretty cool.  But with the right maintenance,  you can create a beautiful rich compost  for not only yourself, but your neighbors as well.  I'm sure many of your neighbors,  especially those of you who live in close proximity  to people, they would have plenty of food waste  that they would want to get rid of.  So any composting program  even between a couple of households  would be really, really exceptional.  No, I agree.  And I can we talk briefly.  I agree about the compost.  It's so important.  I've composted myself.  I think that the problem like you've stated earlier  is that people have trouble about that,  especially if you're in an urban environment  of past coming in or like the smell of the compost.  If you don't have it quite right, it can sometimes smell.  So can you talk about some key compost tips  that people can utilize?  I love that you talk about just actually digging it  into your garden.  And then you don't have a lot of those issues  of like past and then also the smell.  But other tips that you would have for doing a compost?  Yeah, absolutely.  The problem of compost is that people think  that if you just pile a pile of food waste,  that's compost.  Or even I live in a rural area.  So a lot of people will say like, oh, yeah.  I got some compost from the farmer down the street from me.  He has really old manure that he's been composting.  But old poop that's in a pile is not compost.  Compost is a process.  And it's a process by which, again, soil microbes  work to break down those nutrients  into plant-friendly food, essentially.  So additionally, telling also increases the compaction  levels of fields.  And so telling essentially turns dirt particles into dust.  It just makes those soil particles very, very small.  And when they're really small and say it begins to rain,  those tiny particles get smushed together.  And while from our perspectives,  we don't think of those of a raindrop  as being particularly harmful, a single raindrop  is significantly larger than a couple of soil particles.  And so that raindrop is essentially an explosion.  And it makes those soil particles start to be compacted  over time.  So it's not just walking on soils or driving on soils  that creates compaction, but instead,  a consistent round of tillage.  And so that tillage creates almost an impermeable surface.  So water can't get in.  And our roots cannot penetrate appropriately,  which means that then our microbes don't have a place  to congregate, to eat, and even to move through.  Because if you don't have, say, worms,  because very heavy soils don't have worms,  and soils that don't have any life  aren't going to have worms either,  because worms are going to go where there's food, right?  So it's very much like creating a biodiversity environment.  huge impacts in a lot of different ways.  Doing things that are not good for this oil also have huge impacts in a lot of different ways.  And so with that compaction and the inability of our soil microbes to eat as they want to,  then we start to see our soils become depleted and then we think, oh, we need to add some fertilizers.  And so the easiest way to add a fertilizer is to do it synthetically.  They're easy to manage.  You know, you just pour this cup of this in the here and you spray and it's all wonderful.  But unfortunately, those synthetic fertilizers are also not food for microbes.  So microbes won't eat that nitrogen that is being applied.  They won't eat that phosphorus that's being applied.  We have to be thinking about feeding the soil in a way that actually feeds the soil, not just feeding plants, not just creating the most beautiful blemish free product that we can.  Because that beautiful blemish free product is really a result of like a genocide of like microbial life.  It's crazy.  Yeah, absolutely.  Now, and I agree.  Now, I'll tell you a funny story.  I had I made some eggs, so Ohio fresh eggs from Ohio farm in Wadsford because I don't have chickens.  And I was frying it up and then I had a little bacon from Ohio because I love bacon.  And I put on top of it.  It was like an omelette with cheese, Ohio cheese for delicious.  Okay.  So then I put on some rosemary for my garden.  And my mom was eating in my child and they were like, my mom was like, this rosemary is not, it's not that great April.  I was like, where'd you get the rosemary?  I was like, it's for my garden.  She's like, well, it's not like the rosemary you had last year.  And you know, I was at her house building a per soil for like two years.  And so that was the rosemary she was talking about.  And I was like, yes, mother.  I just planted the rosemary.  I have not done all my amendments.  It will be better next year.  And we had a good laugh about it.  So it's exactly what you're saying that when you work with the soil,  then you're able to get really delicious, nutritious produce or even flowers that really make a difference.  And you can taste the difference by working in the soil and increasing the soil content.  So it's so true.  My mother was right regarding the rosemary that I had to work the soil more to engage the soil so that it's more robust.  And then therefore you can taste the difference with the rosemary.  It has been such a pleasure having you on the podcast.  I feel as if I've learned a great deal.  I know the listeners have learned a great deal about the soil and how you can use working in the land as therapy, acquiring land.  We've covered a wide range of topics that are beneficial to anyone who is working on the land working in the soil.  Thank you so very much for coming on the podcast today and for engaging with me and for sharing all of your vast.  wonderful knowledge with myself and our listeners.  Thank you again.  Thank you for having me.  Thank you for joining us for this episode of Growing the For Market Podcast.  If you've been enjoying the show, please consider giving us a follow in a rating or review.  And really hopes others to find the podcast for more tips and tricks from farmer to farmer.  Check out our magazine at growingformarket.com.  Whether you're a commercial grower or just want to grow like one, subscribe to growing for market magazine for the nitty gritty of growing, marketing and the business of market farming.  We published 10 issues per year with articles written by experienced farmers on topics ranging from tools and techniques to farm business operations and marketing.  If you've been listening to the growing for market podcast and haven't yet checked out, growing for market magazine, we've made a change so you can try the magazine for free.  We've added a free month to the beginning of all first time subscriptions.  Try out the digital or paper magazine and if it's not for you cancel within 28 days, I know never get billed.  With digital subscriptions starting at just $39 per year, you'll get a year of the magazine plus 150 back issues from the last 15 years.  Head over to growingformarket and subscribe today to benefit from over three decades of writing by farmers or farmers and growingformarket.  Next time.  Next time."