Speaker A: Hey, Captain Epoch. Fire up the antimatter burners Crank the chronometers and step on the gas It's Captain Leapon. I travel through the dimensions In a time traveling dingy with my compass set to futures yet unseen Riding waves of time so wild and free Waves of time so wild through the vortex storms where the past is just a keel It's Captain Epoch History's at the wheel Navigator of the chronicles Throttle in my grip with the clocks all spinning backwards I'm on a one way trip Charting through the epochs A course that's never still through the centuries I ride Bending time to my will It's Captain E. Park Steering through the star.

Speaker B: With every.

Speaker A: Tick and tock I'm blazing trails afar My diary's logged with legends that thrive I've waltzed in Atlantis Watched empires revive A tumult of ages echoes in my wake for destiny is the map that I fearlessly make Past the astral tempest I chase the endless sun with constellations whirling My odyssey's not done.

Speaker B: Hey guys, it's March 20, 2025 and I'm back kinda. This is Captain Epoch and just coming back on air after a horrible few months. It was on my wife's birthday that I had a second stroke. I woke up in the morning and I was feeling weird and then my whole left side went numb and I thought it was just a headache or a migraine, so I waited the rest of the day to see if it would clear up and it didn't. So the next day I woke up and I was panicking. My. I was having a bit of a panic attack and I couldn't breathe and had to call the ambulance and go into the hospital. And this is, you know, my thought was, oh, I can't do the podcast, because that was the week I was going to do a Friday podcast. And anyways, I sat in the hospital for about a week and got out and I had a very bad reaction to my medication. So I was hyperventilating again, couldn't breathe, and had to call the ambulance again for the second time and stayed in the hospital for about a week. And apparently somewhere in between the two, I had another stroke and it affected my speech. And I got out of the hospital and was just basically trying to recover, but I couldn't really talk very well. My speech was really bad. So I had to hold off on the podcast for a while, which drove me absolutely bad, just batty. I couldn't stand it. And because I missed doing the podcast, I love doing the podcast. And when I couldn't do that, I just. I felt. I felt confined, you know. Oh. And the first time I was in the hospital, I got to talk to Shannon Davis at Omega man, and he prayed for me and everything, and I got to talk to him a little bit. That was pretty fun. I was supposed to be on the show, but with my speech problem, I couldn't communicate very well. And I found out that some of the problem that I was having was with the medication. So I, you know how I feel about the pharmaceutical company and just horrible stuff. But, I mean, I have to take the meds to basically regulate my blood pressure because when I went to the hospital the first time, my blood pressure was 360 plus plus over 198. That's the highest you could possibly get because the machine maxed out. It's actually much higher than that, but the machine could only read it at 360 over 198. So. But now I can honestly say that my. My blood pressure is in check, my mobility is almost back to normal. I. I'm just clumsy right now. But there's no weakness. No, just. Just loss of motor control. And I think that's what's going on with my speech right now is a lack of motor control. But the more I talk, the more it'll exercise, the more that it will come back, you know, and the Lord told me when this first happened, he goes, don't worry, Troy. This is all. This is all temporary. So I know it'll be. It will. It will get better. I. So far I haven't noticed any permanent problems that came about, but just stuff that I'm recovering from and, and I know it's going to come back in April, but my speech was worse in April. I know I'm kind of hard to listen to them. Hard to hear. But I had to come on and do the podcast. It's been too long. But anyways, today I'm going to. I was going to talk about the Tyken. Excuse me, the Titanic. And the link between the Titanic and the Federal Reserve, because apparently there's a link between the two, which I had no idea. I didn't know. I heard it, actually, I heard it while I was in the hospital. I said, wait a minute. You mean to tell me that the sinking of the Titanic wasn't a mistake? And. Well, I'll get into that. I have a bunch of. Bunch of websites saved here and information to go through. So there's one thing that rings true, is Satan will never Silence me. He wanted to silence me on this program several times. This last attempt was silence me for a while. But he'll never silence me forever. He'll never silence me, and I'll never quit the podcast. So we're gonna keep heading forward and pushing on. Even if I struggle talking or, you know, whatever comes up, strokes, speech problems, I won't be silenced.

Speaker A: With every trial I forge my way in the shadows I find my say mountains I'll climb them all in the name of love I will not fall where the boys are all dying Shame I stand the ground unwavering with every storm I rise again through the darkness light will guide in the name of faith I won't hide no chains can hold me down I shout his name I were proud to make this far no turning made on us all when you die it's a Rachel save us A God hiding our brow out at me oh my judgments of the slacking of the world through the storms and wildest nights I carry on embracing the fight with every heartbeat I'll step tall in its power I won't stall no fear can silence this voice of my enable I'll always shine our rally truth as we stream about with faith on our side will make him proud.

Speaker B: With.

Speaker A: Fire in my veins I'll carry on each step I take I sing the song the road is rough but I'll endure In the arms of race I star no fear tied his heart I stone in the face of trials I was walk alone with every echo of my soul's refrain in his name arise I break every chain we juvenate all us all wickets always a bless your save us and God Hiding our brow out by the press of our spinning tide of White House itself we there's nothing on the world through the valley sea I walk There's a rove with every heartbeat I'll carry the load in the silent sounds my spirit breaks free in the name of Jesus and let there be no fear condemn this light I bear with fire and purpose As I lay it bare I'll rise from ashes unborn you in the name of faith I'll always push through Wow.

Speaker B: I couldn't. I couldn't have said it better myself. That's more udi o right there for you. It's absolutely amazing. But, yeah, I'll keep pushing through. This is not going to slow me down. This is not going to hinder me in the least. So here I am. And now to hear a little bit.

Speaker A: From the fringe radio networks that make your feeling night feel the Rhythm It's a glorious night Black the light up in the discord dome Find your heart, find your palm Find your home it's on Google play get the atmosphere don't be square Is that groovy thing on the groovy fring and greedy time Baby.

Speaker B: Sa.

Speaker A: Underneath the miracle make a sing feel Let your body flow.

Speaker B: The Fringe Radio Network app. Make sure you get the app and join us live. When I can go live. I'm not going live this time, but I will eventually. Now we get into a topic I wanted to cover for a while. Now, was the Titanic sinking an accident or Captain Error? What was JP Morgan's role in the incident? Would we even have a Federal Reserve if the Titanic didn't sink? To answer those questions, we first have to talk about the meeting on Jekyll island back in November 1910 where Nelson Eldridge, Frank Vanderklip, who represented the Rockefeller's financial empire, Henry Davison, Charles Norton and Benjamin strong who represented J.P. morgan. Paul Warburg, who represented the Rothschild banking dynasty in Europe, held a secret meeting on Jekyll island to discuss the problems with the banking system. So throughout their stay at Jekyll island, they hammered out the framework for what later became the Federal Reserve, keeping their meeting secret until the 1930s. For these American dioceses, the creation of the Fed meant first hand influence on the country's monetary policies. JP Morgan's banking empire was already acting as a pseudo central bank to the American government at the time. 20 years prior to Jekyll island meeting, Morgan saved the country from a bank panic. He formed a syndicate to prop up money reserves with a shipment of 62 million worth of gold. Morgan devised a plan to secretly repair the Olympic, which is a sister ship to the Titanic, swap it with the Titanic and seek that ship for the money he felt he was owed. The Rothschilds did the same. They acted as a syndicate to keep American government propped up financially. The wealthy family had already financed and pioneered the industrialization of Europe. For them, the Federal Reserve meant an opportunity to exert such control in America. And then there was the oil giants, the Rockefellers, whose massive fortune already afforded them sway in several American institutions. The creation of the Fed for them meant maintaining their influence. One operation that Morgan owned was the International Mercantile Marines, a trust he'd formed to monopolize trade routes therein. Morgan controlled the White Star Line, a maritime merchant company that operated exclusively within the northern Atlantic trade routes. The White Star Line built the RMS Titanic and sister ships the Olympic and the Britannic. In 1911, the Olympic experienced two major incidents at sea. One of these incidents involved the HMS Hawke off the island of Wright. As was customary at the time, the British Royal Navy's own team investigated the crash and found that the Olympic was at fault. Because of this ruling, insurance would not pay to the way star line for damages that the ship occurred. This didn't bodeville for Morgan. And it's where our Titanic story theory comes into play. Morgan derived a plan to clandestinely repair the Olympic, swap it was a Titanic and seek that ship for the money that he was owed. Now, at the same time that all this maritime brahma was going down, the Federal Reserve was in its conceptual phase. Opposition stirred as to the institution's establishment. Members of three more powerful American Benjamin Guggenheim, a wealthy mining magnanimous heir, Isidor Strauss, the head of Macy's department stores and John Jacob Astor, a millionaire fur trader. All opposed the Fed's creation. So JP Morgan, the Rothschilds and the Rockefellers schemed of a way to get rid of these pesky opponents. Since JP Morgan already cooked up an insurance fraud scheme, why not kill two birds with one stone? So after the Olympic was secretly repaired and swapped with the Titanic, the Rothschilds, the Morgans and the Rockefellers coaxed Strauss, Astor and Guggenheim aboard the luxury liner as guests as guest vacationers on his maiden voyage. And if this wasn't crazy enough, the Catholic Church gets involved with the Jesuits. Jesuit members were strategically placed in the Titanic crew to see the plan through. One such member was Captain Edward Smith, who had captained the Olympics when she crashed both times. As a Jesuit brother, Smith was bound to serve his sect even if death should result from his allegiance. He was also indebted to Morgan for his previous horrible helmsman performance. Father Francis Brown was also aboard the Titanic. He was allegedly tasked with two specific duties. Photograph the three target victims aboard the vessel just before it departed. Make sure Captain Smith carried out his job, which was to run the ship at full speed through an ice field on a dark night. As we all know, the plan worked, but not quite how it was supposed to. Yes, the Titanic saint hit the aspirin and sank. But far more people perished than the Morgans, Rothschilds and rockefellers had intended. 1,500 more people. In fact. It was later discovered that the ship was ill equipped for the crash, with far too few lifeboats to properly save all the passengers and crew. Also, there was no one on board sufficiently trained to safely evacuate passengers in such an event. Regardless, Strauss, Guggenheim and Astor all died in the crash as planned in December 1913 the Federal Reserve officially came into being. It was controlled by none other than the Rothschild banking elite. Eight months after that, in 1914, the Jesuits had significant funding thanks to the Fed to start a little religious based trouble over in Europe. And thus World War I began. Which is crazy to think how intricately woven together these organizations were to actually pull this off. So what do you think? Was it an accident or was it deliberately done? So of course there's fact checkers out there that say, oh no, it wasn't done this way. Like Reuters. Now Reuters, if you know, I think is owned by JP Morgan, but don't quote me on that one. So this is what Reuters said about the about this theory. A Wilyshare meme has taken several facts about the Titanic out of context to make unsubstantiated claims that imply the ship sinking was a deliberate act. This is not true. Experts widely agree the sinking of the Titanic was an accident. The meme was posted to Facebook on March 1 and has been shared more than 600 times. It consists of two images. The one of the ship and the second of the American financier John Purport. J.P. morgan. These sit alongside a wall of text that suggests Morgan had a motive to sink the Titanic because it was hosting three powerful people who opposed his idea for a centralized banking system. The U.S. federal Reserve. Did you know the man who funded the bank building of the Titanic, JP Morgan canceled his long awaited journey just hours before its proposed departure. The meme reads. Three of the wealthiest men on earth whom were against the creation of the Federal Reserve bank, happened to be invited aboard its maiden voyage. John Astor, Israel Strauss and Benjamin Guggenheim. It's hard to say Guggenheim. I keep wanting to say Guggenheim. It then headed full speed into a known iceberg field with less than half the required lifeboats. No red signal flares, no Rothschild or Rockefellers aboard, and it sank to the bottom of the North Atlantic Ocean less than a year later. Now that the wealthy opposition was out of the way, the Federal Reserve was created and us was turned into a incorporated business with its own business number 28 USC 300215. See now Reuters is confirming a lot of the information, but not really throwing up that smoke screen saying, oh, this could have possibly happened. They go on to say, while it's true JP Morgan owned the Titanic and did not sail it on his doomed maiden voyage, there's no evidence to suggest he deliberately missed the trip because he knew it would sink. Historians have debated several reasons for Morgan's decantelous trip, but none is related to the Federal Reserve. I've never been able to find a 1912 source explaining the exact reason why J.P. morgan canceled his passage on the Titanic, but he definitely didn't do it mere hours before the ship's departure. Titanic is for George, Behe said in his email to Reuters. But like all fact checkers, you gotta kind of take it with a grain of salt because they tell you the sky is purple, not blue, if it suited their financial backing. So what do you think? Was the Titanic an accident or was it really done on purpose? Let me know. Send me an email@Captainepox79 proton me and let me know and that'll do it for me. My I'm going to talk tight here and speaking for me is very, very hard, very labored because I got to rework muscles in order to enunciate the words and the sounds. So I'm going to go ahead and call it Special thanks to Daniel X who wanted to know how how I was doing and to relay the information. And to Tim and Les. Good jacked up for playing the episode that I did with them about darpa and it really kept me going and got me motivated to rejoin the podcast and to do this podcast. So and for Omega man for praying for me and keeping my spirits up while I was in the hospital, thank you and bless you and have we have a great weekend.

Speaker A: Have to say you farewell for now. Do we meet again on another day. It's the end of the show. God bless you all and good night. It's been fun, but I gotta go. I will see you all again very soon. Aliens, earthquake, spaceships, ghost explosions can't keep me away the bus is waiting engines roll us look at friends I don't dist your life's go down you shits and falls I remember your smiles, your cheers in this hall so farewell my friends till I pass real life in this journey of life you'll always be mine Time to hit the highway through the nights I rise stars of dark light. It's.

Speaker B: That'S it folks.

Speaker A: Captain Epauk will return next Friday. Have a great weekend and see you next week.

