" Hi, this is Natalie Hoffman of FlyingFreeNow.com, and you're listening to the FlyingFree  podcast, a support resource for women of faith looking for hope and healing from hidden  emotional and spiritual abuse.  Welcome to episode 330 of the FlyingFree podcast.  Hey, I bet there are so many of you who could tell me that you have been praying  for many, many years, some of you decades for your husband to change.  And God doesn't seem to be answering your prayers.  Well, one of our beautiful kaleidoscope butterflies in our membership group shared something  that was so profoundly powerful.  I just thought it would encourage those of you who are listening here on the FlyingFree  podcast.  She said this.  I've been searching for years for the answer to the question, why didn't God change  my husband?  I prayed for him our entire several decades of marriage.  I had friends and family praying for him, my pastor prayed for him, and yet the cycle of abuse  continued.  Why didn't the scripture passages come true?  I called on God, but it didn't seem like he answered me, nor did he show me great and  mighty things.  I knocked on Heaven's door and asked, but it wasn't given unto me.  I sought, but I didn't find relief.  I had a group of people praying, but Matthew 1819 didn't come true.  If two of you shall agree on earth touching anything that they shall ask, it shall be done  for them of my father, which is in Heaven.  My husband remained the same with only glimpses of what could be when he brought out his  being nice mask.  That mask usually came out at church or when company was over.  deep down, the man who loved power, control, manipulation, and creating chaos with your  day and your emotions remained the same.  But today in my reading of Luke 10, I finally discovered why my prayers weren't answered.  I was reading Jesus's advice for the 72 disciples he sent out to minister.  He gave them all very clear instructions.  I read the passage using the CEV version.  Jesus told them that when they enter a home to pray for it, Luke 10 5 through 6 says this.  As you enter a home, say, God bless this home with peace.  If the people living there are peace loving, your prayer for peace will bless them.  But if they are not peace loving, your prayer will return to you.  My brain lit up.  I now had an explanation from the lips of Jesus.  My prayers for my husband were being returned to me, stamped undeliverable because he was  not a peace loving person.  My soul hath long dwelt with him that hated peace, Psalm 126.  I believe Jesus let his disciples know that sometimes prayers don't change things, not  when it comes to the hard heart of someone who loves to stir up trouble and has no desire  for peace.  I left my husband several years ago and he still hasn't changed, but God has changed me.  He is using this amazing kaleidoscope program to promote change.  He has given me courage to face giants in a way I never thought possible.  He is providing for my needs on a daily basis and I have lived more in peace since I  I left than during any time in my marriage.  I just love that and I hope that really encourages those of you who are wondering why God  is an answer in your prayers.  I just want to say too, when I read that verse where it says, if they are not peace loving,  your prayer will return to you, you know what I think that means?  I think it means that the prayers that you're praying for those people or that person will  end up being prayers that God will answer in your life and which makes sense when you  think about it.  She was praying for her husband to change, but who did God actually change?  God was changing her and I think that's absolutely amazing.  If you want to join me and hundreds of other Christian women who are doing this work together  in a community, just go to joinflinefree.com to learn more and sign up today.  Is this content resonating with you?  I've written a book for Women of Faith in Destructive Relationships called, is it me making  sense of your confusing marriage?  A Christian woman's guide to hidden emotional and spiritual abuse.  You can read reviews and find out.  more about my book on Amazon.com. It comes in paperback, Kindle, and Audible formats.  I've also created a companion workbook for it, is it me? Also available on Amazon.  This workbook is like 11 power-packed therapy sessions to help you process through the important material  you'll be learning from my book. These books are recommended by Councillors and Therapists all over the United States.  I've also got a website specifically focused on helping women of faith find hope and healing.  It's called flyingfreenow.com, and I'd love to give you the first chapter of my book  and the first chapter of the companion workbook for free when you hop on my mailing list at the top of my website.  Those two resources are going to help you figure out if your relationship is normal or destructive.  Now, let's get back to our episode.  Alright, today we're going to be talking about a book that has permanently shifted the way I understand evil.  Not the kind of evil with cartoon villains and bad guys lurking in the dark.  I'm talking about the kind of evil that walks into church every Sunday.  Serves on the worship team, volunteers at the food pantry, and then goes home and emotionally annihilates their spouse or child.  This book is called People of the Lie by M. Scott Peck.  This isn't just another book review. This is me handing you a key,  a lens through which you might finally understand what you've been living through for years.  So, let's get into it.  Scott Peck says this.  The central defect of evil is not the sin, but the refusal to acknowledge it.  So think about that.  Evil doesn't necessarily look like criminal behavior.  It often shows up in people who don't raise their voice, who don't hit or throw things.  In fact, they're often the ones who pride themselves on their self-control and calm demeanor while you are slowly unraveling inside.  Here's what this looks like in real life.  A husband, refusing to attend marriage counseling because you're the one who has the problem.  He's tried everything and you're just impossible to please.  A church leader corners you after the service to gently correct your attitude,  explaining that your concern about this quote unquote emotional abuse in your marriage is actually bitterness or unforgiveness.  Or a parent who insists they only ever did what was best for you,  even as you quietly carry the trauma of years of shame and invalidation.  These people will never yell, are they might not yell?  I don't know what I'm actually doing, but they will do is twist your words, deny your experience,  and watch you melt down while they stand there with a smile.  And then they'll say you're unstable.  So Scott Peck spends a good portion of the book explaining how evil people use scapegoating as a way of preserving their image of perfection.  Here's a classic example.  You can front your husband about something hurtful that he said or did and he shifts the blame immediately.  Well, I wouldn't have said that or done that if you weren't constantly filling the blank.  Or maybe if you didn't push all my buttons, I wouldn't react that way.  And suddenly, you're the problem again.  And over time, you start to believe that because it's exhausting to live with someone who always finds a way to put the blame back on your shoulders.  You just want peace so you carry that blame and that shame.  You become the emotional landfill for the household.  scapegoating in families is generational too.  Maybe you were always the difficult one while your golden child sibling could do no wrong.  If you expressed emotion, you were labeled dramatic.  If you had any needs, you were called selfish.  If you stood up for yourself, you were rebellious.  And all the while, your family's dysfunction kept rolling down the hill until it landed on you.  Another quote from the book is, Evil has to masquerade continually.  It has to wear a mask and pose as good.  Now, this one hits close to home from any Christian women because the mask of virtue is often religion itself.  The emotional abuse of husband who insists that he's the spiritual leader, even as he demeans, isolates and controls his wife behind closed doors.  Or what about the mother who tells you everything I did was out of love.  while guilty and gaslighting you into obedience your whole life.  Or the church elder who tells a woman she's out of line for filing for divorce even though  husband has been psychologically tormenting her for years. These people don't need to convince you  that they're good. They need to convince everyone else. And once they've secured their image,  you become the threat. You become the problem. Now you are the one who's disrupting the peace.  So when you go and try to tell your story then, you're met with disbelief,  minimization, and spiritual platitudes. Well, he seems like such a great guy. Maybe you just need  to pray more. Have you considered your own role in this? Oh my gosh, if I had a nickel for every  time I heard that one. You are painted as the sinner for refusing to play along with the lie.  This is where Peck takes it even deeper. He says, evil is in opposition to life. It is that  which opposes the life force. So what does that mean? It means that evil is anti-truth.  It chokes the life out of your spirit. It makes you doubt what you see, what you feel,  what you have experienced, what you know. It says, that never happened, what it absolutely did.  It says, you're overreacting when you're finally standing up for yourself. It says, you're crazy  when you've simply reached your breaking point. I remember once sitting in a counselor's office  trying to explain why I felt so broken in my marriage and hearing, well, you made a vow  as if the promise mattered more than who I was as a person. That's a kind of falsehood that evil  thrives on when systems and appearances are more sacred and protected than a human life.  Peck also writes, the evil deny the existence of their own sin. Instead of experiencing guilt or  shame, they see themselves as completely innocent and are therefore the perpetual victim.  This is one of the most maddening dynamics to live with. You will never get a real apology.  And if you do, it's the kind that leaves you feeling more confused than comforted. So in other words,  not a real apology, right? Like, I'm sorry you felt that way. I'm sorry, but I was just trying to  help. Well, I guess I can't do anything right. So what's the translation? This is still your fault.  And the worst part? They genuinely believe that they are your victim. They'll tell people,  I have done everything I can. She's just never happy. They'll cry crocodile tears in front of the  pastor while you sit there stunned, wondering how they've once again managed to come off looking  like the humble one. This is not forgetfulness. This is not obliviousness. This is evil.  It is the refusal to face the truth about oneself, even when confronted with overwhelming evidence.  So what do we do with all of this? Well, Peck says we must make judgments if we are to survive  and live well. In other words, it's not only okay to discern evil, it's actually necessary.  You don't need to scream from the rooftops or call someone the devil incarnate. You just need to  recognize when a person's pattern of behavior is consistently deceptive, blame shifting, and truth  twisting. And then you need to act according to that reality. Now, this might mean setting  firmer boundaries. It might mean refusing to engage in circular conversations. You know exactly  what I'm talking about, right? It might mean documenting interactions to keep your own sanity intact.  It might mean walking away when the system won't change. And I promise you, it's not changing  anytime soon. It also means learning to trust guess who yourself again. You didn't imagine it.  You're not crazy. You saw what you saw. You felt what you felt. And you are allowed to protect your  peace. This book, People of the Lie, gives language to the experiences many of us could never quite  articulate. It was written decades ago, but it reads like it was written for women like you and me  today. Women who've spent years trying to be good enough, forgiving enough, holy enough, and we  still come up empty. If you're in the thick of it right now, if you're tangled up in a relationship  where nothing makes sense, where truth feels slippery and your identity feels like it's crumbling,  this book is going to help you see. And when you can see clearly, you can begin to reclaim your life.  We get this resonated with you today and encourage you to grab a copy of People of the Lie by M. Scott  Peck. Keep a highlighter nearby, maybe even a notebook, maybe even a glass of wine. You're going to  have moments where you think, oh my word. That is exactly what I've been dealing with. And hey,  you don't have to figure this out all by yourself. Head up.  Over to joinflinefree.com if you want to connect with a community of women who get it,  who are going through the fires and coming out stronger and freer.  You are not a person of the lie.  You are a truth bearer.  And we know what the truth does, right?  The truth sets us free.  Hey beautiful butterfly, thank you so much for listening.  If you liked this episode, be sure to subscribe and then consider leaving a rating  and review so others can find us.  To connect with me and get a free chapter of my book, head over to flyingfreenow.com.  And until next time, fly free."