" It's time to reach on the better street, trash fire is burning up there.  Fire the whole stick with love to drown our soul, the world's beating by the fire.  Oh, day I like to survive this day away, that's all.  Before we break no save us, call it no heroes rise.  We clap together under pits, black skies.  Hey, this is James from survivalpunk.com.  Good morning. It is 63 degrees.  Today we're going to talk about repurposing trash.  To be a pretty good episode, we've probably talked about a few of these things before,  but I don't know that we've had a dedicated episode in a while.  And there's always new listeners.  The YouTube, the YouTube.  I'm starting to pick up quite a few subscribers on YouTube.  I mean, I, since it's syndicating and putting out an episode five days a week,  as opposed to before when I put out a video in years,  being consistent with my stuff, obviously it's making a difference.  Anyway, I have trying to get to a thousand subscribers.  I'd like to get to a lot more than a thousand, but if you're listening to  another platform, head by YouTube and give me a subscribe,  and that helps out a lot.  Anyway, let's get into the episode.  Before though, I am starting the bathroom model today, so I'm pretty excited.  My wife is on her way to Florida.  Currently at 331 in the morning.  They've been driving for probably three hours.  So they're probably maybe they've broken to Atlanta, Alabama somewhere in there.  Maybe.  Now they're probably still in Tennessee.  Tennessee is a long weird state.  I saw a video where a European guy reacted to the sizes of the US state,  and it was pretty funny.  Anyway, trash.  So they were talking trash.  I was about to say, you know what I can tell you.  I'm not reusing anything in that bathroom, but that is not true.  I have a cabinet counter.  I have a little shelf thing in the bathroom.  I'm going to pull that out, paint it, and reassemble it differently.  It has legs.  I'm going to pull the legs off, put it on brackets.  Take one of the legs, cut it down to size by leg.  I mean, like, it's sitting on planks.  I think I'm going to do that.  Hopefully the bottom might have some water damage, but I'm going to cut off some to make it fit  and make a full length shelf reusing stuff.  So there's a lot of things that you throw away now.  The shit hit the fan could be pretty darn valuable.  And so, as a multipart thing, right?  Now, you eat a jar of pasta sauce.  You throw it in your trash can.  Take your trash can and you put it by the street if you are a city living person.  There is some kind of trash pick up out here, too, that you can pay for.  Or, you do like us and you throw it in your car.  And you take it to the dump and you throw it in the trash thing and it squishes it.  In the shit hit the fan, nobody's coming to pick up your trash.  And no one's going to operate the local dump for you to go throw your shit in there.  Also, though, you won't be going to the store to be bringing in stuff.  You have to live on your preps.  Some of those empty containers though, some of that packaging, some of those things could be useful.  And we'll talk about other broken things in a bit.  But trash.  So, go back to that pasta jar.  For now, you can take with this as you want.  There are rebel canters that take empty jars, pickles, pasta sauce, whatever.  An empty jar and use that for canning.  If part of your brain is going, no, you can't possibly do that.  I would like you to think for a moment that you went to the store and you bought a month to like a couple months to a year old.  Can of pasta sauce that was safely canned.  So, it's a perfectly fine vessel to be canning in.  If you don't want to do that for now, if I like to, you know what, I never did do a rebel versus FDA canters.  There's two camps in canning, right? There's other three.  Once kind of an offshoot, right? So you have your FDA canters.  They only can approve FDA recipes in approved FDA manners.  By the book, right?  If the FDA says you can do this by doing this and this and this, that's the only way to do it.  If the FDA says you cannot do this, this or this, you cannot do that.  Then you have rebel canters that do different things.  They break the rules.  There's something like you, there's no FDA approved canning method for celery.  Also, there's no FDA approved canning method for butter.  But there are a lot of rebel canning methods for butter.  Even like the fucking,  there's a method of banning butter.  But you take your jars.  You put them on a cookie sheet in the oven and you warm them up to a specific temperature.  I can't remember what it is.  You melt your butter.  You bring your cans out.  You pour your butter and you put your lids on and they'll pop.  That is one thing.  If you want to be safer, still not FDA approved.  But FDA approved safer, you can pressure can your butter.  And then you know it's going to be fine.  But there's a lot of people that just oven can their butter and it works fine.  I tried oven canning margin one time country crock.  And it separated weirdly.  There's a, there's a thing where you also have to like continue to shake your butter.  Your butter.  You like you have to go in there and give the can of shakes so that it solidifies properly.  Otherwise the, the parts of the butter will separate.  You have the butter oil on top and the butter like solids on the bottom.  Anyway.  And it should hit the fan.  I would, I would not be taking jars and throwing them away.  You have a reusable canning solution right there.  I absolutely in the shit at the fan would not think twice about canning in those.  That's me.  Your mileage may vary.  But if you don't want to do that.  I mean, there's a lot of times we're all keep jars just.  To do other projects out of like.  It is, I mean, there's a reason that container is on.  The tin sees a survival.  Yes, you can make a container in the wild, but it is a pain in the ass.  Having having containers is a, is a boon.  One of the projects I did in the past with all of jars are like all of green olives.  Don't really love black olives.  I do like calamada olives.  Anyway, you take your empty jar, you wash it out, you let it dry.  You pour in lamp oil.  You might want to do this out of order.  With your lid on, if you stab it with a knife, it pushes in the metal.  Right, it creates a lip on the inside.  That's important.  Then you take a wick or you take a rag or you take a t-shirt.  You feed it through that hole you just made.  And if done right, it's hard, it's not impossible, but it's harder to pull it out.  Because the lip you made on the inside grabs it.  So it won't fall through.  If it does fall through, take some pliers and squeeze those that lip on the inside, close a little bit.  And then you have your wick on the lid, you fill it with lamp oil, boom.  You have an emergency lantern.  No, it is not safe in any means whatsoever.  Yes, if you throw this, you basically made a Molotov cocktail.  Take that how you want.  But in an emergency situation, in a safe controlled manner, it works fine.  Just be mindful that you do need something to extinguish it, right?  Having something big enough that you can put over top of it to extinguish it works well.  Obviously, I mean, it's hard to blow.  Also, you do want to keep an eye on it.  Because there's no mechanism to feed the wick out.  So I never burned these for longer than like 15 or 20 minutes.  And then I would say the next time you go to burn it and inspect your wick and see if you need to pull it out.  Generally, if you kind of just tug it a little bit, I use pliers a few times to just kind of bring it out like a little bit.  Just know that it maintains that same level.  And it works.  Generally, what I did was I kept it in my bathroom and it was my lights out emergency pooping lantern.  And it works fine for that.  Moving on.  So empty canisters and jars are a lot of things for.  As you're eating your number 10 cans, your number 10 cans can easily  then become storage.  You can store things in them.  They're metal.  They're waterproof.  They're fantastic.  To be dry, storing gear in.  I mean to a level, right?  The number 10 cans, most of them.  All of mine also come with like a plastic.  Lid that goes on top.  Those.  Or waterproof.  We'll say water resistant, right?  It's not the greatest still in the world.  But it is there.  So there's some level of water resistant activity to it.  But you have metal number 10 cans.  You can.  If you puncture holes in them, you can easily mate.  Hobostos.  So if you're cooking outside, you don't want to fire up something big.  You can do that.  As you gather a bunch, you can use those empty number 10 cans.  To make a rocket stove outside.  Technically, you could use them as a frame to make a.  An indoor rocket mass heater.  But just know that that metal will burn up.  So if you're using it.  And you're pouring like concrete around it.  So that it doesn't matter when that goes.  If you're using clay, the clay will harden.  But there's a chance that it could crack and crumble in there.  Anyway, for an outside cooking dirty rocket stove, though, fantastic and easy.  I'd never finished it, but I built a rocket stove out of empty.  Metal coffee cans with an inside.  Just like piping, right?  So I made it the J2 pipe and I came up out of it.  And I filled it with good old Tennessee red clay as I went.  You know, I went up and, you know, worked pretty good.  I mean, just for, I did try burning it in my house one time.  And that was probably not the best idea.  There is still a little bit of shit marks on the underside of my loft.  And I tried to like, I tried to make a.  I tried to vent it out of a window.  Like I made a turn and then I took some, took some wood and I cut a hole.  So I can vent it out of the window.  It didn't work great.  But, you know, for outside for fun, it worked okay.  Oh, I didn't even mention.  Obviously, these canisters are food great.  Because they store food, very easy.  You have a pot.  So as soon as you empty it, you have a pot that you could be cooking on.  So if you're outside your boiling water, boom, there you go.  Your number 10 can is now a number 10 pot.  So that works fantastic.  Let's move on to salvaging components, right?  So as electronics break it stuff, you can't just go to the dump  and throw them away anymore.  You also can't go to the store and buy replacements anymore.  So number one, you might want to consider repairing them before you throw them away, right?  I haven't episode on this where I've talked about repairing broken things like this.  To keep them going, you're going to have to be your own small appliance repairman.  Should hit the fan.  Or when they, if you have a community, there's going to have to be that guy there.  But generally I would say if you just kind of look, let me tell you the story, okay?  Years and years and years ago, when I was a 20 year old man and I was doing Atkins,  I had a George Foreman grill.  I did not have cooking skills back then.  I went from basically eating fast food in cereal to cooking every mail because there's really  not a whole lot of things you can do on Atkins, right?  I wasn't going to eat double cheese burgers from you dollars every day.  Even though they weren't cheap and affordable back then.  Yeah, so I learned to cook and learn quotation marks my friends.  I learned to cook.  I just started making my food at home and buying ingredients.  One of the things I did because I'm just, I'm not that picky and flavor.  I'm just trying to get my nutrients in and my macros.  I would take frozen chicken breast and I would throw it on the foreman and I would just let it cook, right?  Frozen chicken breast, straight from the freezer on the foreman.  You'll let that fucker go for like 20 minutes.  It's dried out.  It's not good.  But, you know, I lived on that.  And one day I plug in the foreman, no light comes on.  It's not doing jack shit.  I'm like fuck, I'm a broke 20 year old.  Like I can't afford to buy a new foreman right now.  But even back then, I was pretty, pretty mechanically inclined.  So I was like, fuck it.  Let me open it up and look inside and see if I can see an issue.  I look in there.  I see a wire that has a melted part and the wires in all connected to the part that is connected to.  I take the wire went into a, one of those little clip connectors.  I pulled the clip connector off that was on the burned in, right?  I go to radio stack when we had radio stacks.  I buy a new one.  I put it on the wire.  I plug it back in.  The motherfucker works fine until I don't know.  I don't know where it went.  It didn't make it through one of the moves.  It burned out or something.  I don't know.  But I got years more out of that.  So, you have something to stop working.  First, look at it, see if it's easy, fixable thing.  During this year's event, you will have to stockpile some of these components, right?  So like, you'll have to have your repair kit before then.  You can get those little metal crimps, those little metal connectors.  You can get them like a shit ton of them for just real cheap and have them for every occasion, right?  Yes, technically, you could have soldered it on.  Worst case scenario, you've run out of those things.  You can solder it back on.  Even like, just solder it back on.  I just say you can do a poor man solder with a cigarette lighter at some solder.  But, I don't know, anyway.  If it's just completely ruined, if it's trash, right?  Look and see if you can salvage any parts from it before you take it to your pile of trash.  You're going to have to have in the industry to hit the band.  Probably a pit.  Probably going to have to dig a pit and throw your shit in there.  But, like, plugs and stuff, right?  That's a commodity that I wouldn't throw away, right?  So, you have something as completely broken.  It'll never work.  The plug needs to probably come off of that.  Because at some point, you might have a plug that you need to replace.  And that could be the only thing wrong, right?  So, you have a dog, your dog has puppies, or your dog is just a dick of that day.  It eats your cord.  So, whatever it is, you have no longer works because your dog or your puppy,  or your cat, ate the wire.  Hopefully they're okay.  I don't know how they do it, but I've seen a lot of animals eat plugs and not die.  Replacing a plug is absolutely one of the easiest little things to do.  Also, unlike cigarette lighter.  So, I had a car, an air compressor go out.  And it was just because the wires going into the cigarette lighter adaptor came out.  So, I just cut it off and took a trash plug that I kept and wired it on there.  Yes, I mean, for now, I could have went to the store and bought one, but I had a plug laying around for something.  I don't even remember what, but it was not for anything I still currently had.  Like, maybe for a trip one time, we bought a car, DVD player set.  And we no longer had it, but I still had the plug because I don't like throw away plugs.  So, I just rewired it on there and it worked again.  So, keep your plugs, that's definitely one of the things that you want to be keeping when you trash components.  Because it's an easy fix if you have it.  I mean, for the most part, if your dog's ate the middle of your wire and you don't have a replacement wire,  you can just cut off the damaged parts and rewire and that'll work too.  The rest of the components, if it's never going to work, there's a few things you can't.  Honestly, you're going to salvage based on your skill set.  So, if you're an advanced electrical person that can that sautors right your league and do all this stuff,  you might want to be saving like resistors and diodes and stuff.  For most people, though, you're probably not going to desauder your board and work on that.  You're just not.  But, like I said, there was in that George Foreman grill.  There was a burnt connector, right?  If you open it and for whatever reason, it's just unfixable, but there are connectors on there that are completely fine.  I would probably pick those off and save those in a jar.  And that would be a good thing to save off of there.  Plugs, connectors, anything readily easily, saveable like that.  I personally wouldn't bother diodes resistors.  I just don't.  If it needs a replacement diode, I'm probably not the guy, right?  Maybe that's you and maybe you want to be that.  Your local community repairman, he probably will be saving diodes and stuff and he's like,  you definitely got a burned out resistor, let me slap a new one on there.  You're good to go.  Fuses.  That's another thing to save for and look.  So if you open something and there's a fuse in there and your lights ain't on, buddy.  Well, sucks to be you.  That's something to save and to look for.  It may be, it had a lot of things that were just as easy as it needs a new fuse.  So if you see fuses and they're fine and you can easily tell them,  look and see if they are fine, replace it or and then I'll save it, right?  Save fuses are an easy one to be saving.  So those are the big things I really feel there were saving off of like a broken electronics.  Anything else I don't really know so.  Let's take care of the housekeeping.  I hope you enjoy this episode.  It was a fun one.  I enjoyed it.  Hopefully you did too.  And if you did consider joining the trial punk army, which you can do for as low as five dollars a month or as much as.  Fifty dollars per year.  And with that, your benefits are you get the episodes in community downloads at files you get.  Um, exclusive discount to vendors and you get.  You get you get a books.  Including my own when it's finished editing and many more plan on writing.  I made.  Take a short break and slap out a survival.  Manual book or something put on Amazon after I learned the process and do it before I move on to book two of my fantasy series.  Um, next you can join a patreon for as low as a dollar a month or as much as five dollars a month.  And with that, you get the episode a day early.  Um, we are on track.  We are pumping out day early episodes.  You are good to go.  Next.  If you go to surround punk dot com and you click on any of the episodes there will be an Amazon item of the day.  If you buy said Amazon item of the day.  You will not have to pay anything extra.  But I will get a few pennies and advertising revenue and I'm hoping today Amazon sends me my check.  Um, my gift card basically.  Um, I don't know what today's episode.  It might be like, um, a crimp set.  But if you buy that if you buy the item, I make a few pennies.  Uh, if you click the link and you buy whatever the fuck you want to buy.  I also make a few pennies if you do that within 24 hours.  So if you, if you're planning out making a big purchase, you're like, oh, you know what?  I'm buying a wood chipper for the summer.  Um, and it's in your cart and you're ready to go.  If you click my link first and then go check out.  I do believe I get advertising revenue for that purchase and that would really help me out.  I would appreciate that.  Next, consider sharing the show wherever you're hanging out online and that makes a big difference to bring people to the show.  And with that, there's been James from shoppunk.com.  DIY to survive.  Use guys.  We break.  No save us.  Come and know heroes' lives.  We plan to gather under pitch.  Black skies.  Straight the rustle for broken water.  Couple dreams in a field of tired.  Steps still coffee punch the clock.  The crowd down that coast.  Take it, duct it.  T-I want to survive the same week.  That's the most before we break.  No save us.  Come and know heroes' lives.  We plan to gather under pitch.  Black skies.  It's black skies.  Black skies.  Straight the rustle for broken plans.  Scard of locals turn it on hands.  It's been you know shining nights.  Waiting this war and dim flash life fights.  Music  The sea is dreaming through some bricks.  The rhythm of the world is skipping clicks.  A colony's a foyer just sucking us dry.  We'll plant seeds of hope till the day we die.  Music  T-I want to survive the same week.  That's the most before we break.  No save us.  Come and know heroes' lives.  We plan to gather under pitch.  Black skies.  Music  The sea is dreaming through some bricks.  We plan to gather under pitch.  Music  The sea is dreaming through some bricks.  We plan to gather under pitch.  The sea is dreaming through some bricks."