Speaker A: And so, my fellow Americans, ask not what your country can do for you, ask what you can do for your country.

Speaker B: Welcome to the Politics Prepping and Paranormal Podcast.

Speaker A: Flibbergy Jibbity Nonsense. I thought it was terrific. It's not just big, it's huge. Foreign welcome and thanks for listening to the Politics Prepping and Paranormal Podcast. I'm Jeff Moran. I'm your host. This week I have a very cool guest lined up. Her name is Heidi Hollis and if you're into the paranormal world like I am, well, you should know who she is. Heidi is an icon in the paranormal world and is not only the person who first saw and reported about Shadow People and Hat man, she actually owns the trademarks to those names given to the anomalies. She's also the host of her show called Darkness Becomes Light on Coast to Coast AM and has published a slew of books on the paranormal. Heidi is a highly respected expert on the paranormal and known worldwide and I'm excited to talk to her. But before I welcome Heidi to the show, let's talk about some of what is going on this week in our country and around the world. This week a federal judge has issued a preliminary injunction that will allow Harvard University continue enrolling international students and halting, at least for the time being, the Trump administration's orders to ban them from doing so. Trump has been battling with Harvard over continued reports of violence and anti Semitism, which even the school president has himself acknowledged. Harvard's attorneys argue that Trump and his officials have a vendetta against the university and have referenced some of Trump's social media posts as evidence in court hearings. This will be an interesting one to watch and will have major long term implications for universities all over the country and what Harvard and others claim are protected under the Constitution's First Amendment that guarantees free speech for individuals as well as corporations and entities like Harvard. And that certainly will be the center of Harvard's defense in court. This story in particular caught my attention. World Economic Forum founder Klaus Schwab this week filed a criminal complaint against whistleblowers who had anonymously alleged misconduct by him, which in turn caused the World Economic Forum to begin investigating him in April. The Wall Street Journal first reported this story, citing an anonymous letter that raised concerns about the WEF's governance and workplace culture, including allegations that Swab and his family mix their personal affairs with the forum's resources without proper oversight. No, you don't say. I put this guy right up there with George Soros and some of the worst people in the world. If you don't know about the World Economic Forum and what they do, I suggest you do a little research. I'll be watching this one closely to see if these allegations suddenly disappear and we never hear anything else about it. This week, the ongoing conflict between Israel and Hamas intensified with ongoing operations and humanitarian concerns in Gaza. The US proposed a 60 day ceasefire plan, which includes the release of some hostages and a temporary halt to hostilities. Israel has accepted the proposal, but Hamas is reviewing it and has hinted that they will not accept it. The United nations has reported that the population is at risk of famine and said aid distribution has been severely hampered. For now, cease fire Negotiations continue, but the situation on the ground remains dire. And finally, of course, everyone is talking about the press conference from the Oval Office on Friday in which President Trump and Elon Musk addressed the nation and announced the end of Musk's tenure as a special government employee leading the Department of Government Efficiency. President Trump praised Musk's efforts in overhauling federal operations, attributing approximately 170 billion in savings to Doge's initiatives. Despite Elon reaching his 130 day service limit, Trump emphasized that he is not really leaving and will continue to be involved as an informal advisor. Musk echoed President Trump's statements and expressed his commitment to Doge's mission of achieving 1 trillion in government spending reductions. All the talk in the media, though, is of the noticeable black eye that Musk was sporting under his right eye, which Musk claimed was from his son.

Speaker B: X.

Speaker A: Musk joked about not being anywhere near France, which was a hilarious jab at French President Emmanuel Macron, who was caught on camera being shoved by his wife last week. The media is having a field day with it and speculation is running wild about what people are saying. Maybe other causes like a gym mishap or political dust up, so to speak. I mean, who really cares anyway? Do we not have anything better to talk about? Seriously. Anyways, Trump also announced plans during the press conference to double tariffs on steel imports from 25% to 50%, citing violations of trade agreements by China. All right, I think that just about covers all the big news stories this week. At this time, I'm excited to welcome my guest, Heidi Hollis. Welcome, Heidi, and thanks so much for joining me.

Speaker B: Oh, thank you. I'm excited.

Speaker A: Before I dive right in and start picking your brain about hat man and shadow people, could you tell the audience a little about yourself and your background?

Speaker B: Oh boy, there's a whole lot to dive into right there. Gosh. Well, I'm an author. I am the first person to ever discover, define name, copyright and trademark to paranormal phenomena. That's Shadow People and Hat Man. I have been a cartoonist for as long as I can remember and I'm also a lecturer, practicing occupational therapist, and I am part of coast to Coast AM's news correspondence and I have a wonderful podcast that is archived with them on coast to Coast AM called Dark Becomes Light where I essentially address the conflict in alien contact and shadow people and all the in between. So I live and breathe this stuff. But also I think a lot of people don't realize I had a UFO group for 15 years and that met at the public library where I was at. And it's, it's still up. The website is UFO the number two, the letter u dot com. And yeah, I cover all, everything. It's like from aliens to angels, I tell people, but I also cover things like angel encounters, Jesus encounters, because it's something that I personally have experienced. I always say I'm someone who has seen that, experienced it, freaked out, found some answers, got over it, and now I'm trying to help other people do the same thing.

Speaker A: So fantastic. You're like an OG in the paranormal world. You've been, seriously, you've been, you've been doing this, you know, I don't remember what year did Ghost Hunters first come out? Do you remember? What was it, like the 90s? Oh, gosh, I don't even remember. Yeah, you know, but like you've been doing this since like before Ghost Hunters even. Yeah, like before paranormal is even like mainstream. Yeah, because I think like Ghost Hunters was the first show that I guess nationally made, brought the paranormal into everyone's living rooms and made it mainstream. And you've been in this like before that. So you're literally like an OG of the paranormal.

Speaker B: That's so crazy. It's like, yeah, I guess so. One day I'll start wrinkling, I don't know, but it's not happened yet.

Speaker A: That's, that's so cool though. It really is. You're, you're internationally known and respected in the paranormal world. Did you ever think when you were a kid that this was the direction your life would have taken and you'd be so well known for, for talking about shadow people. Hat man, and talking with some would call demonic entities like this?

Speaker B: Yeah, I tell people, just make them appear. It's proud having named the modern day devil in the world today, you know, and, and his minions, Shadow people. It's, it's crazy. All I wanted to do growing up was be a comic strip artist. And I am now. So it's like. But, you know, I became a therapist in the interim there because I didn't want to my virgin. I didn't want to draw naked people. In college. I was like, oh, no, gosh, no, I can't. I just wanted to, you know, cartoons. This is it. And just by chance, actually, it's so strange, but I, I don't talk about this much, but I had a weird. Probably my first, like outright vision in college showed me that to become a therapist. Isn't that weird?

Speaker A: Yeah, it is weird. You know, a vision will tell you to become a therapist.

Speaker B: It's so, it's so odd. I, I just, it's quite. It's a weird story, but it's. There's so many odd things that. Yeah, so I have experienced a lot of strange things. So I'm not a person to try to judge someone for what they believe to be true for themselves. You know, it's like I have my perspective, I have my answers that make sense to me. And because I've been in this for so long, I've seen how people have developed and creating these whole, like, vibes of this is a ufo. This is how alien abductions are. They're abusing you, but it's for your own good. So it's all love and light. I'm like, come on. You know, I watch people sleep with, with, with guns under their, their, their pillows and stuff. You know, like, this is. You're kidding me. That, that you're, you're telling people that. But anyways, so, yeah, I'm not one to judge and I like to give people advice about these things too, you know, just because I have experienced so many things and I've witnessed so many things and I've spoken to thousands and now being part of coast to Coast. Hello, Millions of people have heard me and it, it humbles me. It really does. So, yeah, I don't think my family really gets what I'm doing because I'll tell you, I went to go film a show, you know, because I do a lot of shows too, you know, like a talking head on a lot of these paranormal and UFO type shows. And, And I told one of my sisters, oh, yeah, I got to go film a show. Oh, that is so cool. Which one did you audition for? Because I want to get on the game show too. I'm like, I'm just like, remember, I have eight books published. Oh, that. You know, like, it just really doesn't sink in, like, still not getting the.

Speaker A: Respect after all this time.

Speaker B: No, not at all.

Speaker A: Well, us paranormal. Us paranormal folks respect you. Oh, yay.

Speaker B: Hey, win. That's a big win, right?

Speaker A: All right, let's dive right in. Let's just talk about hat man and shadow people. For may not know what they are or experienced them before. Could you explain what these entities are?

Speaker B: Well, shadow people are something that can shapeshift into a lot of different things. And I say shadow clouds, shadow streaks, shadow spiders, which, unfortunately, that's what I dealt with the most. Something I call the head and shoulder shadow. That kind of looks like a big, hulking man with its head directly connected to its shoulders. And in the beginning, I introduced hat man as Hatman shadow. That was my mistake. You know, now everybody thinks, oh, he's a shadow being. I'm like, not. Not quite. He could blend in with the shadows, but he's a little bit different. Shadow rodents, they shape shift, and sometimes you'll see glowing red eyes coming peeking out at you that are slanted. If you see what some people refer to as a hooded shadow, that is not a shadow being. They do not wear clothes. Hat man, he wears clothes. There's a sign that he's not just like any other shadow being. But they like to hide. They like to hide. They like to blend in with a background and paralyze you while you're sleeping. And they're not really ones to speak so much. You might hear some not very distinctive mumbling, whispers, growling, and people will feel, like, heavy pressure on their chest. And. And they're, my gosh, what am I seeing? What am I experiencing here? And the interesting phenomenon that I hear about is I couldn't see it, but it's darker than the dark. And if they look at their reflection on the wall in the bedroom, if they could see themselves, they could see it on them. But they can't always see it just, you know, really clearly on top of them themselves. But in the reflections and stuff, if these things spot you at a ghost hunt, they like to charge you. They don't like to be spotted. Those don't generally like. So, yeah, they are essentially demonic things that work for hat man. And I don't know if you're recording this, but these are the different shapes and sizes that some of them come in. This is from the COVID of my book the Hat Man, A guide in comics on how to get rid of dark beings for all ages. Because I had so many people asking, I have it on my website on how to get Rid of these things under the help tab. And sometimes people just need a visual. So I did a book just for that. So that's Shadow People.

Speaker A: And. And for anybody that doesn't believe this is a real thing. This is real. I. I have experienced this myself.

Speaker B: Oh, okay.

Speaker A: I. This is actually the first time I've ever publicly, publicly talked about this. Just kind of a short version of the story here. But I was probably in my 20s and I had an apartment. Don't remember where exactly what I was doing, what I was. But I know I was asleep one night in my bed upstairs, and I had like a two story apartment at a roommate. And I remember waking up in the middle of the night one night being completely paralyzed. And all I could do was talk, I could move my mouth.

Speaker B: Wow.

Speaker A: That was it. That was the only thing I could do. And out of the corner of my eye I could. All I could see hovering over me in the bed was a black shadow. Was one. It was probably the most terrifying thing I've ever experienced in my life. And I'm gonna segue into my next question and kind of what I want to talk to you about.

Speaker B: Sure, sure.

Speaker A: Because this is the perfect segue for anybody that doesn't believe in God, that doesn't believe in Jesus. You know, I've always been a believer my whole life. But that right there, if you ever need proof that there's God, there's Jesus. Because you know, you know how I got rid of that shadow person? I started praying.

Speaker B: That's the only way I know.

Speaker A: And I said, dear God, you know, I don't remember what I said, but I started praying and I prayed that it would go away, that he would keep me safe.

Speaker B: Yeah.

Speaker A: You know, within five seconds of me praying.

Speaker B: Beautiful, beautiful. Gives me goosebumps. I love it.

Speaker A: And like I said, I've always been a believer. And I've kind of gotten some flack on this show from family because I have some extremely deeply spiritual Christian family that is like, you know, you don't need to be messing with this stuff. You don't need to be talking about this stuff. And I always do a disclaimer. I've done a lot with this show that I am fascinated with the paranormal. I always have been. But I don't go looking for it. I don't invite it, I don't conjure it, I don't go ghost hunting.

Speaker B: Right.

Speaker A: I just love watching people like you. I love UFOs, UAPs, whatever you want to call them.

Speaker B: Yeah.

Speaker A: That sort of subject matter. Bigfoot, Cryptids, any of it. It's just, for whatever reason, it's just always fascinated me. I think it's fascinating. And I think, Chris, a lot of people have a very small mind of the universe and things in the universe. And I think a lot of people label people like us as being atheists or even satanic sometimes just for talking about, having an open mind about these things.

Speaker B: Right.

Speaker A: But one of the things I respect so much about you, and I've heard you talk about. I've heard you say God bless and. And you've talked about your encounters and you've talked about God and Jesus and.

Speaker B: Yeah.

Speaker A: You know, and. And you're me and people like me. And you are proof that you can be a believer and still know that the, you know, there are these things in the universe and these things are real.

Speaker B: Yeah.

Speaker A: I have family that are flat Earthers.

Speaker B: That believe that they have their nerve to say anything about you.

Speaker A: That we live in, like, a domed earth and that we can't. We've never been outside our ionosphere, you know, and out into space. I will say. I will go on record and say I am a conspiracy. I don't. I don't think we've been to the moon, but that's another subject for another time. But I do absolutely believe in space. I believe in extraterrestrials, and I believe in all these different entities and things. I mean, there's just a whole world in the universe that we don't understand that we know nothing about. And.

Speaker B: Right.

Speaker A: You're very awake to all these things and yet you still keep your faith. And I guess that's something I wanted to ask you about. About, you know, you've talked about encounters and can you just talk about, like, I, like, like with me, like how that's affected your. Your career and being someone of faith and still talking about and experiencing all these things.

Speaker B: Yeah. First off, bravo for you to keep your faith, too, and to speak it, you know, because so many people feel like, well, it's not connected. Why are you going to go there on this, you know, and, and try to shame you. Try to shame you. For crying out loud. It. And somebody told me something not too long ago, and I never thought of this, and I think I should give you this thought, too, that speaking on these things plainly, simply and casually and relating it all and keeping your faith in the mix. This is a ministry. This is a ministry of sorts, and I never thought of that. Like, you are providing information to try to get people to wake up to how to Defeat darkness, for crying out loud. Just. Oh. So I applaud you first and foremost because it's not easy. It is not easy when you've got naysayers, family, work, you know, it's I for me, because I had the combination of experiences where I was brought in to getting back to my faith in the midst of experiencing some of this stuff that nothing else mattered to me. And I really didn't care what anybody thought to keep it real because, you know, I'd experience extraordinary things and I had stepped away from my faith. I was only raised Methodist, which is very casual.

Speaker A: Raised Methodist as well.

Speaker B: Oh, see, yeah, right. So very casual. It's like I'm just like, I try to tell people. It's like you go to a bonfire and somebody just happens to say the name Jesus. I'm at the kind of laid back. I was raised in the Midwest, so it's like, I don't know, but I just, I. It wasn't like ingrained hardcore, but I had my beliefs where it's like I knew God was real. I. I believe Jesus had existed and you have to say his, his name in your prayers and he's supposed to come back one day. That's. That's what I. It was more head stuff than heart stuff. And I had to go back and learn it all again because he showed up and straightened me out really quick. And I took great pride picking on my friends who went to bed early on a Saturday to get up to church on a Sunday in college, you know, like, I am not doing that, but it was. And I knew that some people wouldn't quite get it, but all I could do is be who I am. And I love humor. I love being casual and laughing at most things. And I just like, look, I know it sounds weird, but you know me, I'm not somebody to try to make something up. And this is not the field to go into to get rich off, you know, Sorry to tell you guys. It's like you do this because it's your passion and, you know, it's important. And I have no regrets and nothing else mattered in having to come face to face, quite literally, with Jesus telling me to get to work, to finish writing my first book on the shadow people hat man phenomenon. So I'm just. I think more people have to stop being afraid to say, especially that they're Christian. What is the deal? The other main religions are like, don't you dare make fun of us because we have a name for you. But what happens when you make fun of Christians, you know, we just. Ha ha, that's funny. No, it's, I get so irritated with it though. You don't have to get, you know, super angry, but we should stay, stand firm and what we believe to be true because say in the name of Jesus, in the face of these dark things, negative aliens, Jesus works. How do they recognize that name and that force? So I think that's, and I mean.

Speaker A: I've been, I've had, I've been lectured about the Bible and about, you know, basically the Bible does not say whether aliens or do or do not exist. And obviously it does talk about, you know, the angelic and demonic worlds and things like that, but it doesn't say that none of this can exist. And I just think it's very small minded for people to think that yes, in all of what I like to say, in all of God's glory and creation, that he only created earth and, and, and one race. I think that's extremely small minded. And yes, 100 believe in God, 100 believe in Jesus, but in all his glory. You think he only created one world with one race of people. I just think that's so small minded. And I get, I get lectured and you know, torn down for, for feeling that way. But I mean, I'm sorry, aliens are real. You know, there's, there's more life outside of our planet.

Speaker B: Yeah.

Speaker A: I'm just going to leave it at that. So it's nice to talk to somebody like minded that understands that.

Speaker B: Oh yes, same, same here. I mean there I'm limited still, that's, which is a shame when they're holding congressional hearings, talking about the different alien beings that they're, they're communicating with and the different craft that they're reverse engineering and all these people with big titles are coming forward, but your neighbor still goes, you guys are just crazy theorists. Yeah, crazy that they get, they're still getting away with it. And the Pentagon, they're terrified that this gets out. Why is that? I think there's several reasons why. And, and one of the, the big selfish reasons for themselves is they would all go to prison for hiding this. You know, they would, they made so many cool gadgets for themselves and left us in the dark as they're healing their cancer and flying off and doing different things. You know, it's, it's ridiculous. So it's not fair, plain and simple. But they also understand there is a battle between good and evil going on. That I've heard directly from ex CIA agents that they want to step forward the CIA. But Pentagon thinks this is the battle of all battles and they are terrified. So go figure.

Speaker A: Yep. Speaking of all this subject matter and what we're talking about, you're. You're one of the only people that's really starting to connect the dots between faith, spirituality, angels and demons, entities such as shadow People, Hat Man, UFOs, Cryptids, Portals, Etc. I've long thought to myself that UFOs or UAPs, I guess we should call them, or connected, the spiritual world. And that all these elements or aspects of the paranormal and spiritual world are intertwined and connected somehow. For those of us that don't know, and I think that probably includes me, can you help explain and tie these things together, how they're connected and understand our place in this world, in this universe? You know, I think you're starting to connect the dots a lot more than most. 98 of the rest of the population.

Speaker B: And remember, I started talking about this stuff in what, the year 2000, I think it was, you know, so. Been a while. I've been flapping my gums about this left and right. But it's like, it's funny to me because some people will step forward and say, and try to school me on shadow people. Heidi, did you know shadow people are related to aliens? I'm like, you don't say.

Speaker A: Literally wrote the book on it.

Speaker B: Literally. It's like I wrote it in 97, so I was experiencing this stuff before that. So it's just, it's a, it's a shame that people just are not listening, they're not paying attention. And to say, what's connected now, I want, I don't want to take full credit for knowing what I do because I. This is not my information. There was no way. Yeah, it's like, there's no way I could have studied this stuff. This information coming in the form of shadow people, hat man stuff. I tell people, it's like, you name your teddy bear something and now the world knows, like the boogeyman. For me, I was like, ooh, shadow people. That's why I called it, you know, and now the world knows. That was my nickname for it. And, and what that all means, you know, so, and to have a definition, I didn't know what I was experiencing. So there was nothing that I could have said to my neighbor, hey, you know those things, what are they doing for you? There was no way I could have studied this. So this information came fully from non human beings. And, and that's where I ran into people trying to divide my Topic up. Like, this part is paranormal, this is the alien part. And I'm like, no, guys, it's always been blended. It's always been in the middle and connecting all the dots. But you know something that Hollywood love to mess with me about, you know, gosh, you know so much about everything. We'd love to have you on our TV show, but we can't have a woman lead. Can you teach a guy everything? You know what? So. Nope. No, this is not that long ago. I've had several tell me and, and I'm like, so then you've got guys that are presenting my material as if they are the, you know, the, the person that came up with everything and they know everything. And I'm like, you just stole all my material. And it's crazy. It's crazy. But they also are false information out there, which is, it's really sad because it's causing harm to people. Where people have tried to conjure up these things because they're being told there's nothing to fear. And it's just disgusting. I'm like, wow, like, is this really worth it? To lose one soul is not worth it. But to get back to your question, I'm trying to think of where to begin on it, because for myself, just to start from the beginning, I first saw a shadow being following a friend of mine while I was in college and it was broad daylight. I didn't know what the heck I was looking at. All I know is this big hulking thing, what I call the head and shoulder shadow, was jumping tree to tree, following us to our destination and ducking behind bushes. And, and I'm just trying to ignore this thing. But it followed us all the way back to her home. And I was staying at her family's house. And by the time I reached her home, I was like, oh my gosh, I don't know what I just saw here, but I just saw this thing and I drew it out and I thought she was gonna laugh, thinking, well, Heidi's just a nut job. And she looks at it, goes, oh, gosh, that thing again. You know, it's. It's back. Dad, look. And he's like, oh, not him. And I'm like, what the heck? So I, I just couldn't believe it. I'm like, what, how did this. How have you been seeing something like this? I was raised in a haunted house, so I'm familiar what ghosts look like. This didn't look anything like a ghost. It was solid black, just horrific looking thing. So anyways, I Had to go upstairs. I had to go grab something. I was staying at her family's home. And I went to grab what I needed, turned around to leave the bedroom, and there it was, hulking over me, blocking my way out of the room. And I tell people, I don't. I don't even know how to describe, like, what that kind of terror feels like when you're being met with something out of a horror movie and, you know, glowing red eyes. And just. I knew if I swung at this thing or ran, it was somehow going to get me. And I felt as if something whispered to me, stay calm, close your eyes, start praying, and walk through it. And that's exactly what I did. And people are like, what did it feel like walking through it? I'm like, are you kidding me? I was so numb, I couldn't imagine. You know, I just was. I knew I had to get out of that room because I was certain I was going to die if I didn't. And I would have passed out or something. So I didn't know after that that had occurred that that thing somehow was like a contagion or a catalyst to what happened to me next. Because I started waking up having nightmares of shadowy spiders in my dreams, right? Only to wake up and they're actually in the room. I was like, what am I looking at? Like, sometimes, though, they were like, oh, I just can't ever get over the chills of this freaking thing crawling on my ceiling, right? And they would lose their grip and fall onto my bed. And, like, with every step, oh, man. And I would, like, wake up trying to kill him, and, oh, it's just a nightmare. So I. I know what I was dealing with, but I was never paralyzed. I'm jumping, I'm moving. Sometimes there are thousands of them. And I was like, okay, okay. You know, I don't. I don't know why I'm having these nightmares. And so flash forward a little bit. Moving to an apartment, and I was, like, still dealing with these odd little shadow spider dreams. And I. Again, I didn't know what I was dealing with. So I. I had seen, however, very large or distinctive UFOs that were answering me. And I'll give you a quick example of one of those. My friend's family, where I saw this black shadow following her. Her family was very religious, and they knew that I was into these topics and, like, who the demons are gonna get you and all this stuff, and why are you devil worshiping? And. And I'm like, I'm just looking into the topics, like, I found it interesting and I had seen some odd lights when I was growing up. Sticks, right? And. And I was like, it got to me because I. I believe in God, you know, man, if this is evil, I don't want to have anything to do with it. So I went out behind their family. So I'm bringing this story up because of what you're going through too. And I went out behind her, her family's home. And. And I was like, it, you know, I'm looking up at the night sky and I'm like, you know what, you guys? If you have anything to do with anything evil, I am done right now looking into anything. Unless you show yourself. Show yourself. And I mean, I meant it because I was like at my edge of, like, it was getting to me. And I saw a really high flying light. Do like zigzags. And guess what, Jeff? I said, and that's not good enough. I really did because I was like, I was done. And as soon as I said that, this metallic craft showed up at the end of this parking lot I was standing at, and it lit itself up and it streaked just the length of the parking lot. And, oh, I. I'm sitting here complete head to toe goosebumps right now because I was like, they hurt me. You know what I'm saying? Like, I couldn't believe it. And. And it was weird because it, like, it gave me this reassurance and this, this, like I felt like a connection. Like, how. How did you know I was that desperate? I was right at that edge to say, I'm done if you have anything connected to being something evil. And, man, it changed my whole energy towards trying to find answers about these topics, right? And so I joined this UFO group because I had UFOs that were answered like that and saw a big, massive craft as well. And so. And I just, I found it interesting. In this group, everybody was part of this therapeutic clinic. People that have been hypnotically regressed and they have ptsd and they had no reason to have ptsd. And then they get hypnotically regressed and there's aliens in their lives. Lives, right? And here I joined and I've just seen UFOs answering me showing up, right? And I listened as these people were terrorized, just like being examined and brutalized and every kind of abuse you can imagine. I won't name names on it because you'd have to edit it out, but you know what I'm talking about. And it was horrible. It was disgusting. Children, grown men. It didn't matter and people bawling their eyes out. So I got an apartment, and I was there, and my dad always told me, you know, a young lady shouldn't live on the first floor of any apartment by herself because, you know, somebody might break in. So I got smart, and I got an apartment on the first floor that had beautiful little metal bars, you know, like flowers. And I'm like, ha. Dad, I'm safe. Don't worry, right? So I. I wake up one night because I hear crazy, crazy noise at my apartment. Like, somebody broke in. And I was like, oh, my God, My dad was right. You know, somebody's broken in. And now I can't get out the windows because there's bars on it. And I'm like, oh, no. So I'm laying there in bed. My bedroom door is wide open. Who's ever broken in is right in my living room, right next to my bedroom door. And I'm like, as soon as they see my feet hit the floor, they're gonna spot me. And then it's over. So I'm like, all right, Heidi, you're gonna count to three and just run like heck through the living room to get out. So I went to do that. I'm like, 1, 2, 3. And I start running. And as I'm running through the living room, I stopped because I couldn't believe I saw two what I thought were little children standing in the middle of my living room going through my stuff like crazy. They had their backs to me, but they're tiny. I don't know, three and a half feet tall or something. And I'm five eight. I don't feel intimidated, you know? And I'm like, what? You know? And I. And again, I thought I was about to die. So I'm talking really fast. I'm like, who. Who are you? What are you doing here? You know? And I stood in between the two of these things that were going through my bookshelf, and they had my stuff in their hands, and they. They turned and they looked at me, and they both were gray alien beings, right? And, like, people say they have two slits for a nostrils and a slit for the mouth, but their slit for the mouth was open, like, oh, crap, she's up, right? And I was like. And I'm talking really fast to them, and I'm like, give me that. What are you doing with this? What are you doing here? And I'm taking all my stuff out of their hands, and. And then I heard noise behind me because I had a walk in closet, and There were two more in there going through my stuff like, like fast robots, like really fast. And they all froze. And again, their mouths open and made this. Oh. And I'm. I mean, any point I could have left this apartment, but I'm not feeling intimidated because they're very tiny, okay? And they seem frozen in fear that I'm moving around. And I knew what they were. I knew what they were. I'm like, these are those ugly things everybody in the meeting have been complaining about, you know, but they're always paralyzed. And, you know, I'm like, I just, you know, they have no business being in here if they're not paying rent to. So I'm feeling, you know, I was just like going through. And, and, and there were two more in my. My kitchen. And as I'm in the kitchen, I'm saying to all of them, corey, what are you doing here? You know? And. And there was a bathroom right off the kitchen. I flung the bathroom door open because the light was on, the door was closed. I'm like, what? They are not using my toilet. What is going. And I flagged the bathroom door open, and there was one behind the door, and I accidentally knocked that one to the floor. And then there was. I know, I didn't know it was there. And there was a second one grabbing something off the back of my toilet, right? And all of them were naked except for the one grabbing this object I had on the back of my toilet. And I grabbed that one by its little skin tight suspenders. It's like. It's like clung to its body. And I grabbed it. And I'm not violent. I don't know why I grabbed this little thing, but fight or flight, right? You know, and. And I. I pick it up and I say to it, who are you and what are you doing here? Because I'm repeating this and nobody's answering me, right? And the one that I had accidentally knocked to the floor. And, and this all connects. I'm just giving the whole backstory.

Speaker A: Yeah, you're good.

Speaker B: And he's got his little hands up, and he's. As if he's afraid I'm gonna step on him. This one that I knocked to the floor, still holding his little friend in my. In my hands. And I hear him scream in my head, I'm your nephew. I'm your nephew. And I turn my attention to it, and I watched this thing shape shift into my nephew in a baby blue suit and an afro right in front of my eyes. And I'm like, you're not my nephew. You look like him when he was 10 years old. Like he was in his 20s now. He was almost my age, my nephew. And I'm just like. And then I turned my attention back to this one in my hands, right? And that's when I got a really good look at this thing because I had it up to my face. And this thing, it had the shape that's head shaped like a gray, but it was fleshy, pinkish color with freckles, curly red tuft of hair on top of its head, and giant almond shaped eyes, but they were human. And this thing was shaking so violently, like it was short circuiting. And. And you know when kids are about to cry, like, you know, like. And I'm like, oh my God, I just terrified a child. I'm like, I go to set it down, like, hey, hey, hey, relax, relax. I am not gonna hurt you. You guys, it. Nobody's answering me. This one's lying over here and I'm trying to calm it down. And even on coast to coast, I always laugh at this, but I actually offered it a cookie to calm it down. I did. I swear to you I did. I mean, and. And I'm like, so I'm like, do you want a cookie? I'll get you a cookie. Just relax, I'm not gonna hurt you. And I turned around to leave the bathroom, right? And that's when all the others that were in my apartment had gathered together and they formed like a V. And. And I was like, oh, great, what do you guys want? You know, like. And I'm looking at over my refrigerator, and on top of it's my cookie jar, right? And I'm looking over their heads, I'm like, can you guys move? I need to calm this little one down, you know? And. And they. And it was wild because they went on their heels three times, you know, 1, 2, 3. And then the. They leaned forward on that third count and I felt like. Like a. Like almost like this wave hit me right in the forehead and knocked me out. And I woke up the next day as if nothing happened. And I was like, oh, no, you did not just do that to me, you know, I was like, that just did not happen, you know? And that next day, the big giant head and shoulder shadow showed up. I hadn't seen him since that day. He followed my friend, like, I don't know, two years earlier or something. And I was like, what on earth is this? You know, And I honestly thought, you know, because I was part of that UFO group and all Those other people have been abducted. And here I'm sitting there, doo doo, doo. Never been abducted. And they sent their little friends over. It's like, why come to me? You know, it just didn't make any sense. But, but my whole place became bombarded with shadow people. Now I'm seeing this thing lurking around. I'm like, I can't make any sense of it. And I'm like, I get rid of these ugly little grays and now this. So I get a roommate a little bit later and I move across the hall to a larger apartment, a two bedroom. And this roommate, she was. I thought she'd make a cool roommate because she was an art major like I was at the time. But she was very Pentecostal. Long hair, they never cut their hair. The big skirts, you know, they very religious. And she was like, look, your demons can't touch me. All this stuff. I'm like, okay, great, you'll still be a roommate if you want, you know. So she moves in and she became like my other friends, where it's like, she's not going to discuss these topics unless she's making fun of them. Like, that's just what you did in college, right? Like, so until one day. But she was seeing them. She was seeing them because I caught her sketching them one day as I was drawing what I was seeing, but she would never admit to it. And I'm like, your drawing looks like mine. What were you drawing? What did you see? And she's like, I don't know, it's just something in the corner. I said, said, oh man. So anyways, one day she's. She's driving to her, her college and she went to a different one than I did. And it was broad daylight, downtown Milwaukee, and she calls me in a panic and I'm like, what? You know, what's going on? She's like, heidi, Heidi, Heidi, Heidi. Something jumped on the hood of my car and she's trying to go into detail. She's followed me into the classroom and I'm like, what, what are you talking about? She's bawling her eyes out too. And she's Puerto Rican. She had very, very thick accent. And I don't speak Spanish. I don't know what she. She's half Spanishing me and I'm like, what? I. I don't know what you're saying. And so long story short, we go to meet up at the lake and I'm like, so what is this? What did you see? You know, I'm like, finally One of my friends my age is gonna be into these topics, right? And she starts telling me. She's like, heidi, this. This gelatinous, sparkly, see through, like being jumped on the hood of my car and it shoved its head through my windshield. I'm like, what? Never heard of anything like that, you know? And she's like. And it had a real calming effect to it. She's like, I just calmed down right away, like, and I just felt like I could ask it anything. And she's like, so automatically I just started asking it, who are you? And she's like, heidi. Now this is where it gets weird. But when you go to the dentist and your mouth gets numb and so you do cavities and stuff to fill cavities, I'm like, yeah. She's like, when my mouth went numb and I felt it slapping up and down, answering me using my own voice. Well, that's weird. I was like, what do you call that? She's like, but we did this back and forth thing. And then when I went into my classroom, it. It followed me into the classroom. I said, no. She's like, yeah, and I saw it. Nobody could see it. So that's when I called you. And so I was like, wow, that's. That's crazy. And as she's telling me more details, suddenly she goes, oh, I need to meditate. I'm like, meditate? Like, what do you mean you meditate? You know, that's like New age stuff. I'm like, what, do you want me to leave the car? And she closes her eyes for just a few moments before I could even like, think to get out of the car or whatever. And this voice came out of her and had a very reduced accent. And it said, hello, I've been waiting to speak to you for a very long time. And I just. Samantha, like, what? What's going on? You know, oh, this is not Samantha. And I don't even know how to describe even, like, what that feels like when you know your friend, you know, she would not be weird, you know, and. And she's talking about something jumping out of her car. And then she's. This voice comes out of her. I'm like, okay, who's talking? You know, I'm like kind of being a smart aleck because I'm like, she pulling my leg after all of this, you know, like, would she really go that low? And then one of the first things she brought up, this voice brought up was about my mother who had passed when I was seven years old. And I'M like, now, she would not go there. You know, I'm like, whatever is going on, this is real. And. And I had been a part of this UFO group where I'd seen people who have been hypnotically regressed. And instead of talking about their situation, one of the beings stepped in, started sharing what. What it was that was going on and the abduction. So I. And I'm telling myself I'd have seen this before, but she's not hypnotically regressed. What is this? And she's never seen aliens. You know, it was just. It was so weird for me. So anyway, so she's. This voice is coming out of her and. And I'm like, okay, you know, so who are you exactly? It's like, well, I'm what you would call an alien. Oh, okay, well, alien, where's your ship? I'm kind of not being, you know, I'm. I'm still joking with, you know, I'm like, maybe she is pulling my leg. I don't know. And they said, well, all right, we can't come down as low as we once did because your governments know how to shoot us out of the sky. And I'm like, oh, how convenient. I'm thinking, you know, and then without me asking, he goes, but I think I'm close enough to emit an image of myself. Oh, you say what? You know, I'm just like, so you could do what? And the car starts humming, right? And I'm like, what is happening? And this being. This gives me chills too. Appeared right next to us. And my friend, she's reclined kind of with her eyes closed. And it was very childlike looking. It looked pinkish fleshy colored with more rounded features than a gray, but had a bigger head. It kind of looked like a small nude child. And it wasn't until, honestly, this past few years did I ever think of what a cherub might look like, you know? And when it's. When it showed up, I was like myself. I had my body pinned against the door going, okay, okay, I believe you. I see you. I see you. I see you. Okay, you know, like, go now. Type of thing. I'm like. And then it faded away. And I was like, oh, man. You know, like, this is real. And I'm like, okay, okay. You know, and there's so much that happened with that. But the long story short, so my friend pops up. She goes, what was that? I'm like, you tell me, what was that? And she's like, I saw an alien. I'm like, I Saw an alien. She's like, she's like, well, you know, how's this possible? I'm like, I don't know. And I started telling her about the people at the meetings. And we get back to our apartment. She doesn't like reading English. She starts grabbing my UFO books off the shelf and tries reading all of them. And she's like, I want to talk to your, your weird, demonic, demon worshiping friends at the meeting. I'm like, oh my God. She's like, maybe they can help me figure this out. And I'm like, oh my gosh. So she was blown away with what took place, right? And this is where it gets really interesting with, in connecting all the dots, with everything that we're discussing here. So being college kids, you know, we're like, you think you could that again? You know, I know it's real. So I'm like, okay. So she, you know, closes her eyes and, and she sure enough, this voice pops back. And I'm like, so can you tell us the lottery numbers? You know, we were absolutely being stupid. You know, I like, you got all the answers to everything in the universe. Let's just talk about all of it. And, and most of the time it. Nothing of value came out of it. I was like, where are you located? Would not benefit you to know that. Ah, you know, what's this? What's that? Would not benefit you to know that. And I'm like. So I, I got kind of despondent, you know, and. And Samantha would ask me to write down questions for me to ask because she couldn't readily do it herself, right. Even though she could pop back anytime she wanted. But. So I. One day I got bored and I'm like, well, I had a weird dream and it was probably like one of the first, like what I call waking dreams I've ever had. And it seems so real. It didn't happen. Like, it didn't happen. It was, it was just. I shouldn't say the better way to put it. It's like. It's like it was hard to believe it didn't happen. That's what I want to say. So anyway, so I'm like, this dream was. It was broad daylight. I was in Florida for some reason, and I saw the moon coming towards the earth and it looked like it was going to destroy the planet. When all of a sudden a very large UFO showed up in front of the moon and, and put it at an angle so it wouldn't destroy us. And I'm sharing this, this dream with with this voice, right? And he says, well, I'm not in charge of dreams, but I'll tell you something. We saw what was happening to your planet, that the darkness inside of the planet was pulling the moon towards destroy it. And we saved it. And I'm like, back up again. What? It's like, what do you mean? What darkness? And this is when he said, you call them shadow people, but we call them shadows. And my. My mind just like, totally imploded with. Are you kidding me now? You mean those things I've been seeing? They're real? Like, you know, it's like, oh, yes, they're very real. And that's when this being started spilling. It's like. Like I almost had to ask the right questions in order to get real answers that meant anything. And his true mission came forward talking about the threat of this demonic force and how essentially this is so crazy. Like, here I am, somebody that's seen so many aliens, that's seen so many different things, ghostly things, angelic things too. And here he's talking to me about matters of the soul. How, how, how people's souls and are taken before they suffer too long. What is the point of doing this? So we will help remove this. I'm like, hold on, hold on, hold on. Stop, stop, stop. What you're telling me is something I've heard of in the Bible. It's like, are you telling me, Are you guys. Are you angels? What. What is this? And all he said was, we've been called a lot of things through time and then offered that we only listen to God, the same God that you know, and that this is nothing that they take lightly. And Jesus is who he says he is. We take orders from him. And I mean, I don't even know how to. It's like just the chills right now. I'm like, I think that was such a hard thing for me to get over because I had stepped away from it. And then he asked me, why did you stop praying? Nobody knew I stopped praying. You know what I mean? And it's like, he is real. He is everything. And I had to really check myself. Like, I'm thinking aliens. I'm dealing with an alien. And here this alien is schooling me on God and Christ and the battle is on that there is a spiritual war going on, and it's happening in the privacy of people's bedrooms. Here we laugh at them that they say, oh, I saw a boogeyman, and they had to fight for their lives. And it's not being taken seriously. So this battle that has been brought to our doorstep has been going on for, since the beginning of time, but not always here, that it's taken over other planets as well. And it was also mentioned to me that there is like, we come from a light source of God, they come from a dark source of evil. And hat man is at the helm of a lot of that. And, and he will tell you that he is the devil himself and he is in control of the onslaught. These different types of shadow beings, the grim reaper looking thing, the negative alien beings, shadow people and hat man have been seen right alongside of so called alien beings. And I was told that these beings, you know, would. We got the praying mantis, the Nordics, the grays, the reptilians were like, what do they have in common? They're all kind of doing horrible, horrible things to us. And I was told that these are conquered beings, that they are essentially from when they were on their realm or where they're from. This dark source infiltrated was the demon in their ear telling them, take a left instead of a right, kill your brother and your sister. Getting these beings to turn on each other and then also becoming puppeteered by this dark source, which is essentially a possession. We're talking about, we're talking about possessed alien beings. And this conflict is, is here at our doorstep. And the being that I had the most contact with, the positive one, he said, we're here to help support mankind, but this is your battle. It's no time for fence sitting that. It's time for us to wake up to what's really here in front of us and that, you know, they can't, they can't do it for us. So we just have to know that, you know, so many people don't even regard that they have a soul. And now's the time to acknowledge that soul because it's like candy for these dark things and what they're aiming to do with us, us and control us and conquer us, very much like these other beings. So it's, it's a whole lot. But I'll let you ask your questions. I know you got so.

Speaker A: No, no, that's.

Speaker B: I know it's a lot.

Speaker A: I mean, it's, it's all connected. I mean, you know, Jesus. Yeah. Is real and good and evil, heaven and earth, it's. It's all real and, and a lot of these things are so connected. And I guess that kind of segues into my next thing. I, I want to play a little game with you, if you would. Humor Me.

Speaker B: Let's do it. Jeff.

Speaker A: You've answered some of this. But I'm just gonna go down my list I had wrote up here for you.

Speaker B: Sure.

Speaker A: And I don't want to copyright anything, but, you know there's a television show called Factor Fake. I figured we'd play Factor Fake with Heidi Hollis. I'm gonna run through a little list here first.

Speaker B: I love it.

Speaker A: Yeah. And I want you to tell me like we've already answered some of these. But I'm still going to go up and down the list and tell me if you think. Think the. You know, these are different things from the realm of the paranormal. If you think they are real or fake and just your opinion.

Speaker B: Sure.

Speaker A: UFOs are UAPs. Yep. Aliens are extra. Extraterrestrial. Same thing. Basically. Portals and interdimensional travel.

Speaker B: Real. And I know how to point them out to you too.

Speaker A: Okay. Angels and demons on Earth. We've already answered that one.

Speaker B: Real.

Speaker A: Ghosts and spirits. We've already answered that one.

Speaker B: Real.

Speaker A: Bigfoot.

Speaker B: Yes. Real.

Speaker A: Okay. So I. What? I've been on the opposite side of that one. I did a show about Bigfoot and I've. I don't know. But. Okay. Interesting. Same. Same question. Just different part of the world. The yeti. Same thing. Basically.

Speaker B: Real. I experienced Bigfoot. So.

Speaker A: Wow. Okay. Wendigo.

Speaker B: I think those are real too.

Speaker A: Vampires.

Speaker B: I would not say in the tense. I guess in the. In the manner that people believe them to be. From Hollywood. No.

Speaker A: Werewolves?

Speaker B: Yes. Dogman.

Speaker A: Skinwalkers or shape shifters.

Speaker B: Yes.

Speaker A: I guess that kind of ties in. I guess a lot of these bands are probably just the same things with just different names or perceptions, I would say.

Speaker B: Right.

Speaker A: Sheep Watch, which I was. One of the most bizarre Cryptid stories I've heard about the sheep. Squatch. What, you never heard about that?

Speaker B: I have not. But I know they have done horrible things with sheep and destroyed them.

Speaker A: There's actually. Look it up. There's a lot of stuff and.

Speaker B: Okay.

Speaker A: There's a bunch. I think there's a show called. What's the name of it? Monsters and Mysteries in America.

Speaker B: Okay.

Speaker A: That's one that. It's been on a bunch of different shows. But I'm surprised with you. Your knowledge. You've never heard of that. But I. I guess that one different variation. Or gin or genies.

Speaker B: Yes.

Speaker A: Reptilians.

Speaker B: Yes.

Speaker A: Okay.

Speaker B: Real. Yeah.

Speaker A: That's my list.

Speaker B: And I may have left it out. I love it.

Speaker A: I was curious. And on what you thought of them. The one that really got me that it was Big me for foot. I've been very on the fence about that.

Speaker B: And yeah, I don't know what it is that I saw exactly. This is. Imagine this. And I've talked to a lot of different people that study these things and no one's heard of something like this that I experienced with one of my friends, Samantha. So I had that UFO group for 15 years. And people will come to the meetings and be like, oh, you know, they think I'm psychic or something. Can you come to my place? Something's going on. I'm like, so this lady kept coming month after month to saying, can you please come over to my place? Something's going on over here. And I'm like, if I could bring my friend, you know. So we go over to her place and it's an apartment above a bar, of all places. And she's walking through her apartment, she's like, and over here, get a cold breeze over here. I'm like, me and my friend are like, okay, whatever, you know. And this is in Milwaukee. It's not a small little area, you know, and it's like a city of about 650,000 people, you know, And. And so we're sitting in her. I'm sitting in her living room, me and my side by side. And she's sitting across from us. And behind her is her kitchen, right? And her. Her cabinet are hanging over her bar that. And so you got this little space. You can look into her kitchen, right? And she's talking and talking, and me and my friend are like, okay, yeah, all right. Yeah. Oh yeah. I thought I saw something move, just nothing distinctive. Right behind her in her kitchen. I saw, you know, like when you see a mirage, like heat rising off a road, this big hairy freaking beast appeared. And I jumped up, screaming and pointing at the same time as Samantha. I'm screaming bigfoot and my friend screams werewolf at the same time. And the lady's like, where? And we're like, in your kitchen? It was like simultaneously, she spins around and I watched this thing shimmy out. Though you could feel the presence was still there. Now because the kitchen cabinets were hanging low, we couldn't see its head, but it was absolutely a shaggy freakin beast standing upright. I have never ever seen anything like that. And it was solid. It was solid. And for me and my friend to see at the same time. I mean, wow.

Speaker A: That's the interesting sighting too, because most peoples are always in the wilderness, right? Yeah, whenever people say that. But there's a lot of theory around Bigfoot that It's extraterrestrial related and there's been a lot of sightings when there's a lot of Bigfoot sightings. There's also been a correlation in a lot of instances with UFO sightings. So, yeah, to me, that was my only way that I could ever justify Bigfoot being real, you know, as if it was either going. Crossing through a portal or something or coming from outside of our world. Because, you know, with all the drones and technology and satellites we have these days, we'd have called it by now. You know, that's just my thought we would. That we'd have found, you know, bones we'd have found remains, something. So, you know, that was always my thing with Bigfoot. If it is. If it is indeed real, it's not, you know, just a. A hominid type creature, you know, from this earth.

Speaker B: So looking into missing 411 and how when Bigfoot are seen and how they block off the area and it's all these, you know, search dogs are not allowed. It's weird, right? It's weird. And it's with our government, the way that they're behaving with UFOs. I wouldn't put it past them to be hiding this thing and to, you know, helping it do what it wants to do. And being in the position that I have been for as long as I have now, I've had a lot of really unbelievably connected people contact me to tell me. To tell me things that are like anything you can imagine, they are in it and messing with things.

Speaker A: I wouldn't even want to know some of the stuff you've been told.

Speaker B: So angering. It's angering because they have left people in the dark and then threaten your life if you tell. Don't you tell me. You know, I'm like, are you kidding me right now? How could you sleep at night? It's. It's horrific. It's horrific.

Speaker A: So I scare people to death, too. I interviewed a MUFON state director a few weeks ago on my show, and we were talking about that and I asked him a question. I said, so, so. And he didn't mean it like that question. He's. I said, so in, in all your time, have you ever run into the government? Have you ever been. You ever been shut down? He's. That you had to ask me that, didn't you? Like that?

Speaker B: See?

Speaker A: And he said yes. And he said, I cannot. And. And he. He didn't want to talk about it, right? And he said. He said yes. A certain three letter agency, they were investigating mutilations, cattle mutilations. Cease and desist. See, he said, I cannot talk about it more than that.

Speaker B: Isn't that crazy? It's, it's like, what, what are you hiding? And, and it's a matter of people's souls. It's not just the physicality of somebody dying, that's a given because they don't really seem to care much about that because they're threatening to kill you if you talk. But when it's like having to deal with matters of souls, that's where I'm, I am most furious at, because they know what's going on. The Pentagon has been apparently talking to those three lettered agencies about this type of thing. And the conflict is they don't want to talk about something that has this level of spirituality and religious connections. They don't want to have that conversation. But it needs to be done, it needs to be said. And trust me when I say religious institutions are digging. They are talking to people like myself. They want answers. And they know, they know what is happening and what's going on. It's like, and, and I've been not shy this stuff, you know, and I just, I worry because we can't depend on people to have our back at higher levels because they're having a field day with all the technology and all the knowledge and just like as long as their friends and family are good, they don't give a crap about the rest of us. So, so what we have to do individually is get ourselves right soul wise. You need to be able to close your eyes and feel what is in front of you if it's good or bad. Because God gave us that little intuitive element in us that knows if something is for us or against us. You know, and I have people, so many people write me and say, I don't get into that religious stuff, but I just saw the devil. I'm like, well, throw a shoe at it because you better hope that, you know, you gave this title that's very religious to something quite evil. You better hope that there's an opposing force to that. You know, what are you going to do if you know there's nothing, you feel nothing, but you felt evil. So that tells me that your soul is in there and it knows it was threatened. So I like to tell people too that have experienced these dark things. It's wild because I've had people that have experienced like shadow people or hat man once, 40 years ago, and people that have experienced it for 40 years, and their fear is equal, that it would ever show back up again, you know, And I tell people, but think about it. The effort that it takes for you to be taken down by these. This dark force, like, they have to come as a thief in the night, paralyze you, whisper in your ear, you're paralyzed. Oh, we got you now. I'm like it. And then show all their might, you know, as a big, burly something. And I'm like, think about that. That's a whole lot of effort just for one little you. So there is something to be said about the human potential that we are something to be reckoned with. And they don't want us to call on Christ because they are really trying to avoid that.

Speaker A: Absolutely. All right, switching gears here. You like to write and share your insight and experiences with the world. Can you tell us about some of your books and where people can get them?

Speaker B: Yes, I have several books that I have put together. I live in Wisconsin, so don't mind the Harley going by.

Speaker A: I was wondering what that sounded like. That was a helicopter flying over my house. We're talking about government stuff.

Speaker B: Oh, no, those are the Harleys. They're out. But, yeah, so I. The books that I've. I've written, some people don't always see or understand, like, the connection between them all, but it. I wrote it all to encompass this very important topic of good and evil. Shadow people, angelic encounters, Christ encounters, crossing over to the other side type of thing. And then I have the people that have said, you know, I don't get into that religious thing, but, you know, what do I do? So many people struggle with their faith. And I like to tell people, it's like, look, just. Just God made us flawed, for he knew he did it for a reason. But you think the one place that you're supposed to be perfect is your faith. It's got to be perfect or I give up, you know, like, I'm screwed. I'm gonna go to Hades anyhow. It's like, oh, give me a break. You know, it's like that's. It's almost a tantrum. Jesus already told you, just the size of a mustard seed, if you could. That that's all you need to not have doubts in. If you could have that little bit, you're gonna be just fine. Just fine. So don't stress yourself. And so I. I got tired of, you know, trying to repeat this and get it in people's heads. And I'm like, you know, I did because I'm a Cartoonist. I wrote a couple of books. If you go to theotherfword.com on the topic of faith. So it's like Diary of a Wimpy Kid type book on the topic of faith. Having fun with your faith, figuring out where you're at in your faith faith and, and how to get to the next level. And it's cartoons and whatever. So I, I just, I just want people to get it and feel okay and stop doubting themselves. And I'm somebody who's absolutely cheated in their faith because Jesus had to come and knock me upside the head to straighten me out, you know, And I'm like, so I have no doubts in my faith and, and I needed to have that because here I am taking on the modern day devil topic and his minions. So. But I tell people if you're experiencing anything out of the ordinary, you need help or suggestions, feel free to reach out to me through my website. I have all my books and everything there. It's heidi hollis.com or for people who don't know how to spell my name, I put shadowfolks.com but, but yeah. And then on social media could follow me at 1, put a 1 in front of Heidi Hollis us on and feel free to reach out. People always like, it's funny to me because they'll say, oh, I know you're a very busy lady, but I have a question. I'm like, if I can't get back to you, you know, then okay, I'll get back to you at some point. But don't think that I'm too busy to try to reach out to me. You know, I do my best to get back to folks. So. But yeah, so it's like we're all in this together and I hope people really understand that because we're not going to be rescued by anybody but one. God. Christ. I mean we just, we have to know that because these things are placing their bets on us to not figure them out. But doing my best to spill the truth.

Speaker A: Absolutely. Last question I always like to ask all my guests is when I end the show. But outside of talking about all this crazy things and being in this world, what do you like to do for fun? Do you have any hobbies? What do you like to do? I know you said you're a cartoonist. What do you like to do when you're not talking about this stuff, Doing your show, doing all these. A thousand interviews all the time.

Speaker B: Believe it or not, I, I do love the cartooning. I, I do love painting and my nieces and nephews. But I really enjoy writing my, my, my books and I have a new one coming out out soon and it's a doozy. It's a doozy. I. I usually have taken like a couple months to write a book. This one has been years in the.

Speaker A: Making and name of it, or not.

Speaker B: Just yet, not just yet, but it's very close to being done and oh, all I could say is send prayers because it's bigger than the shadow people and hat man stuff. So. Yeah.

Speaker A: Well.

Speaker B: I appreciate that.

Speaker A: Awesome. Heidi, thank you so much for talking to me. I appreciate all your time and all your insight. This has been a great conversation.

Speaker B: Thank you, Jeff. Same here. Thanks for playing the game too. That was fun.

Speaker A: Great. That's my show for this week. I want to thank Heidi Hollis for joining me and sharing her wealth of knowledge on the paranormal. Normal. You can catch Heidi's show on coast to coast am. Be sure to check her out and check out her website@heidihollis.com or pick up one of her books available just about anywhere. And please be sure to like and subscribe to my show on your favorite platform and follow me on social media, Facebook, x Instagram, Blue sky or email me at. The PPP Podcast See you next week.

Speaker B: Thank you for listening to the Politics Prepping and Paranormal Podcast, your source for real news and analysis on politics, prepping, paranormal, conspiracy theories and the volatile state of the world we live in. Tune in next week and every week for a new episode episode and stay safe, stay healthy and stay vigilant.

