" Welcome to Illinois Family Spotlight, a conversation about issues of the day from a biblical  perspective, as well as highlights from interviews, conferences and events.  Here's Monty alleric.  Thanks for making Illinois Family Spotlight part of your day.  We're recording this interview.  During the Illinois Christian Home Educators Conference at Olivet Nazarene University  in Bourbon, A. Joining me is Abraham Hamilton III, one of the speakers here at the conference.  Mr. Hamilton is a husband, father, Bible teacher, a national radio and television host,  a lawyer and he is a homeschool dad.  After all, you have on your plate, how do you find time to be a homeschool dad?  That is a great question.  The best and most immediate answer is my wife.  So we have to obviously communicate quite a bit because earning our scheduling, concerning  things that we have going on, has how we do so.  And so one of the major things like right now, I teach a constitutional law class,  and I teach a specific class, economics and other things to high school aged homeschoolers  in our area, including my oldest children.  And I also work with my employer in order to make my schedule flexible enough in terms of  office days versus home days in order to make that happen.  So I do my, for example, my radio program, my home studio set up to allow me to be at home  when I need to be at home as opposed to having to go to the office with a conventional  schedule.  That was worked into my agreement to join American Family Association, which was my commitment  to my family and my children.  And so they were amenable to establishing a schedule that allowed me to be at home when I  need to be at home and to be in the office when I need to be in the office.  What do you see yourself as an example to other parents that they can find time in their  schedules to be homeschool parents?  I would say hopefully in inspiration, you know, because all of our family makeups are unique,  our occupations are unique.  And I never would try to impose my how on anybody else.  But I would say the things that our priorities to us, we usually make the time to do  them.  You know, I understand that it's a commitment.  It's definitely a commitment to me.  A lot of sacrifices involved, but the things that our priority, we find time for them.  And one of the things that encouraged me to make the adjustments that I've had to make  within my family is the recognition that I don't get to do parenthood over again.  And so recognizing that we have this short window with our children, the adjustments that  we've made, we feel like they were imperative.  They weren't just optional.  They were impaired to first from the scripture and secondarily in recognizing the stakes.  With the stakes are concerned about children, we had to make the adjustments.  Your bio on the ICHE website says that your ministry focal points include marriage,  family, biblical worldview training, and discipleship formation.  Well based on your experience, how does Christian home education improve your marriage and  your family life?  Oh, and that is a wonderful question.  One of the things that we've learned is that quantity of time gives rise to quality of time.  And what I mean by that, by having frequent engagements with my wife and my children being  home more than I'm away from home, it creates an environment that allows those unplanned,  qualitative moments to come to the fore.  And with my wife and I both committed ourselves for this phase of our lives to pour into  our children that unity of purpose aids us even in our marriage.  And I'm pretty sure you can relate to this.  I played basketball through college and some military veterans share this, that you have  a unique bond off the with teammates or with fellow soldiers.  And why does that bond so strong is usually because you've both been committed to a shared  transcendent purpose.  You go through an intense battle to get to a winning basket in the tournament.  That's a memory that you share together that you never leave.  Well, that type of unified commitment to a transcendent purpose for its debon between the two,  that similar phenomenon transpires between my wife and I in marriage because we were both  equally invested in cataclysm and evangelizing and discipling our children.  And so that unified purpose and investment aids us in our development and cultivation of  intimacy between she and I.  And so that's been a thing that's aided us there.  Then the last component of that, I'll just say this very succinctly, when Jesus  asks about the great commandment he gives to, you should love the Lord without your heart,  your soul, your mind and your strength.  The second is like you love your neighbor as yourself.  For far too long, people have failed to recognize that mind cultivation is central to  disciple making.  And so if we would export and see the authority to cultivate our children's hearts and minds,  to people whose positions really are hostile to scripture, then we could very well be  seeding our children to a context that's working against what we ultimately want to see,  which is that they're John for phenomenon.  We have no greater joy than to know that our children are walking in the truth.  A lot of home educators are rightfully concerned about the math, the science, the reading  part of home education, but they neglect or maybe they're not as concerned about the spiritual  aspect of home education, the discipleship, the worldview, the biblical worldview training.  You think they're making a mistake.  It is a mistake to focus exclusively on, I would describe it as academic matriculation.  The concept of academic matriculation being severed or bifurcated from spiritual development  is not really.  a biblical concept. You know, Proverbs 1.7 says, the fear of the Lord is the beginning of knowledge.  Proverbs 9.7, fear of the Lord is the beginning of wisdom and knowledge of the holy one is understanding.  If we have a posture where we're willing to focus on academic matriculation but we're excluding  spiritual development. I think we again are working against what we ultimately want to see. If we  neglect that spiritual development, we very well may be working against what we ultimately want to see  because Jesus said to himself, Matthew 7, it was the prophet of the man that gained the whole world  and loses soul. But Matthew 633 says, if we seek first the kingdom of God in His righteousness,  all these other things will be added. When I've experienced in my own family and what I've  studied from history, that if we set Christ as the objective that we're pursuing, we're often  in love with people who are intellectually adept, who are inquisitive about nature, who are willing  to experiment and to innovate in all of these things because they're engaged with it's not merely  the exercise of human ingenuity, it's a responsive exercise in worship because we love God with  all that we are and informs all that we do. Because we love God and recognize that He's the creator,  it moves us to want to understand how His creation works. And so we have things like historical  discoveries, the boiling point of water, pasteurization of milk, understanding that the sun is  the center of our system and not the earth, all of these were the result of people who had a  biblical worldview, the scriptures drove them to inquire and those inquiries are still blessing us today.  That's Abraham, Hamilton the third will continue our conversation right after this.  This science neutral, this is Ken Ham, an author and speaker on science and the Bible's reliability.  Many people think science is neutral, a scientist just follows the evidence where it leads,  but science isn't neutral. What do you believe about the past determines how you interpret the evidence?  For example, what you believe about how old the earth is or how a life got here will influence how you view  the evidence and your conclusions. As biblical creationists, we start with God's word and interpret  the evidence through that lens. But evolutionists also have a starting point, millions of years  and evolution. No one approaches the evidence from a neutral point. We all have starting assumptions  and influence our interpretation. Want to learn more about science, creation and evolution? Visit  answersradio.com for more information. Go to answersradio.com  Thanks for joining Illinois Family Spotlight. Monty, lyric here at  Olivet Nazarene University, the site of the Illinois Christian and Home Educators Conference.  We're recording this interview and I'm joined by Abraham, Hamilton the third with the American Family  Association, American Family Radio. Wow, you have a radio and a TV ministry. You can find my  program. American Family Radio has about 170 plus stations all around the country. So if you're  looking for your particular station, you can go to aFR.net to find where you can hear me on the air  live. You can also follow the Hamilton corner and all social feeds. And if you're a podcast or you  can find the podcast, wherever you get podcasts from, the Hamilton corner side of the program. Also,  in our BTV is a television network that airs the show, which you can watch on Friday evenings at  8 p.m. since your time 9 p.m. Eastern time on in our BTV. Okay, great. Let's put on your lawyer hat  for sure in here. Let's say a new version of the homeschool act becomes law in Illinois.  My fear is that somewhere other, they're going to attack the Christian part of home education.  Do you hold that same fear? I do. I pray that we never see any version of the homeschool act  codified in Illinois State law. Unfortunately, the organization that sponsors the legislation,  they have articulated their concern with the Christian investment in home pedagogy. And so I have  grave concerns that any similar legislation will seek to curtail parents' ability to share the  faith of Christ following with their children in the homes. And so I pray and encourage Illinois  homeschooling families and Illinois citizens will not even be homeschooling families to oppose  any measure that would seek to impose upon the liberty of your fellow citizens and shaping  and investing in their own families. Do you think the real goal of this legislation is not just to  regulate them? It's to put them out of business. Yes. I have no doubt that the ultimate objective is  not merely regulating families who are discipling their children in the homes. I strongly believe that  the true objective is to try to eliminate homeschooling as a viable option for families in the state,  which requires perpetual vigilance against those types of measures. Because again, these are not just  ideas that exist in a vacuum. There have been writings in dialogues and conversations and communications  by people who support the model legislation as to that being their true objective. And so I am  gravely concerned that that is the objective. Should any form of this measure pass ultimately,  that what we'll see is an elimination of Christian home education in the state.  How do we fight this? Yeah. You're an Illinois. It seems like we're up against impossible odds here.  Yeah. I would say the first place to fight is in prayer here in big blue Illinois. I believe we  saw the hand of God stop this monstrosity already in big blue Illinois. House Bill 2827 did not pass.  And we saw thousands of the citizens go to the state capital talking to the legislators,  sending in comment cards and things of that nature. I think all of those efforts are needed  continually to stop any version of this thing from passing passing in the future. But I think  the past gives us an indication as to what's possible even in a little if.  Illinois, this type of frankly wicked legislation can be stopped as we've already witnessed  in a bipartisan manner. I think that can continue when people recognize truly what's at  state.  Well based on your legal perspective and expertise, do you see any legal argument that could  hold weight against this legislation should it become law?  Yes, there are scores of bases and legal strategies that can be employed that would simply  say any legislation passed in this form would violate foundational constitutional,  federal, constitutional rights that are protected by our Constitution, namely the First Amendment,  the free exercise of one's religion. We have the freedom to do that. And when you have legislation  like this that could potentially impinge upon that liberty, you provoke a constitutional  crisis. So if something like this were to pass, I don't think that would be the end of  the story. But the best way to fight this legislation before it ever could pass is to keep  it from passing. But if it did pass, it would be necessary to fight against it in the courts.  Well the Trump administration says it supports education choice, education freedom. Is it  time for the administration to step in here in Illinois?  Well in terms of stepping in, you can do so in a number of fronts, not necessarily in  a formal manner, but you can express your support, for example, for Illinois citizens who  oppose this type of legislation. I'm not in favor of having an all-encompassing, all-overseeing  federal bureaucracy. I believe in federalism. I believe in the states being laboratories of liberty  that should be allowed to flourish. So I wouldn't necessarily want a heavy-handed overbearing  federal government, domineering the state of Illinois on this point. But one of the major things  that the federal government is doing already under President Trump is moving to dismantle and to  minimize the impact of the federal department of education. Simply saying that the people closest  to the children are the ones who make the decisions. You can't get any closer to the children  than their very own parents. Here's a problem with that. We have to deal with Illinois bureaucracy.  A corrupt government. Sure. A leftist government. Sure. And we're giving more leftist control  of education in Illinois. You see where I'm getting? I do. But what I'm saying, similar to an  answer I offered before, House Bill 2827 was stopped once already. So that would need to continue.  Now, in terms of other policy that a very well-made require federal involvement, but particularly  as it pertains to the homeschool act itself, I wouldn't necessarily say federal intervention is  the order of the day. But in other areas where you have just overwhelming leftist government,  domineering, educational choices and options, there are places where the federal government  can rightly interact with the state government to kind of loosen that grip somewhat so. But one  of the major challenges is major municipalities like Chicago to where you have this kind of unholy  union between political apparatus and union involvement and interaction and that quid pro-pro phenomenon  going over and over and over again while the children suffer. I think it's kind of answered it.  But do we need Congress to act and put out federal legislation to protect home education  and private schools? That would be very helpful. And with the move to a dismanned to the federal  Department of Education and to get states to be further strengthened in their rightful role  concerning education, I do think it would be helpful to have federal action to bolster private  education, home education in terms of defining the parameters and establishing borders of  non-intrusion, if you will. Basically to keep the government away from what we're trying to do with  our children and our families, we don't need their help. We're doing a pretty good job about it. There's  an organization called NHRE where you can get all kinds of data concerning home education and its  impact. How well families and children are doing, how they're thriving. And I think with the fallout  a COVID-19, lots of families are seeing, wait a minute, we can do this without children. There's been a  surge in home education as a result of it. And lots of families are recognizing, man, my children are  thriving even better now than they ever have now that we focused our attention on instructing them  and disciplining them and training them from our homes. But if this new attack on home education  comes our way, we have to be just as organized, engaged in a lot of prayer just like  yes, we did to at least stall House Bill 2827. Yes, I would say even more engagement, more  prayer, more vigilance. And I'm hopeful that the effectiveness of the first fouring will encourage  others. And I'm hopeful and I'm prayerful and even encouraged that that is what we will see should  a boomerang come back to citizens of Illinois concerned in the homeschool act that we will see more  people engaged, more diligence, more determination, more resolve in order to continue to protect  integrity of our homes. In the meantime, I would say the effort that happened here in Illinois to  hold off 2827, the homeschool act. Since a message to other states, nothing. It absolutely does.  And we know that the homeschool act in Illinois was a product of so-called model legislation that  will be offered in other states. There will be people trying to advance this in other states. And so  I believe I'm one of the people who are encouraged by what happened here in Illinois to say,  hey, we can do this in our home states. Should this thing come our way, we know what to do,  we can follow Illinois's example. Let me throw this at you. I just noticed that you're black.  Really? I've heard this. Home education, Christian home education is just another example of white  privilege. Oh, man, if somebody were to say that question to me, I would say either  you are woefully ignorant of the scripture teachers or it's evil. You're offering an evil notion.  Now tell you, plainly why Christianity was African long before it was ever European.  That's just a simple truth.  You know, it serves a scripture, for example, Acts chapter 11, 12 and 13, you know, you have  people in Antioch, you know, which was the first, if you will, mega church that was comprised  of Grecian's Hellenistics and among the elders who even laid hands on Paul and Barnabas,  you have Africans.  You have Acts chapter 8 where the Ethiopian Eunuch is encountered with a gospel and was already  clearly participating in Judaism to a degree, but was reading this scroll of Isaiah that  you have Philip the Deacon that goes alongside to him and presents the gospel to him starting  first with the Hebrew text and the Ethiopian unit returns to Ethiopia with the gospel.  So to suggest that Christianity is synonymous with anything regarding why privilege was just  honestly ignorance.  You can go to second, third, fourth century where you have theologians and scholars who  are all African, like even a gust of hippo.  That's a serving as a bishop in Africa.  So Christianity was far more African than it ever became European.  And so that would just be an ignorant assertion someone would make.  Christian home education is growing in minority communities.  How can we grow it even more?  I think the best way to grow it more so is to help people to understand what the scripture  says that we as parents have an obligation to do.  For example, Ephesians chapter 6 is a very familiar passage of scripture, but I think people  don't really understand the weight and the gravity of the passage.  But the verse says if he's in six verse four, in particular says fathers do not  exacerbate your children rather rear them in the nurture and admonition of the Lord.  The phrasing nurture and admonition of the Lord in Greek is the paidea and new theesia of  the Lord.  The word paidea means the whole training of the mind and the morals.  No bifurcation in the scripture saying that fathers implicit in that text includes mothers  are ultimately helped respond to before God for this happening.  The thing that's not as obvious is that that is actually a command from God.  The first half of Paul's epistle to the Ephesians is written in the indicative mood in Greek,  indicating who we are where we get glowing transcendent theology like for you.  I once did and trespasses and sins, but you've been quickened a lot together in Christ  Jesus that's written in indicative mood in Greek.  The second half chapters four through six is written in the imperative mood.  Those are commands.  So as more people recognize that God commands families and ultimately fathers being ultimately  responsible just as in the garden when the rebellion transpires, you know, though Adam  and Eve are present, the scripture records Adam, where are you?  Similarly, fathers will be questioned by God.  One of the things when I stand before the Lord that I'll be questioned about is what did  I do with his heritage?  So on one 27 describes our children as the heritage of the Lord.  What did I do with his heritage?  Well, God commands me as a father to rear my children in the paidea and nuthizia of the  Lord.  That's the whole training of the mind and the morals.  That's reading, writing and arithmetic that spiritual development.  That's the fruit of the spirit.  That is geometry.  That is constitutional law.  in this physics.  There's no bifurcation because in all of them crisis aid at the foundation at the bottom.  When we study mathematics, we're peering into an aspect of the mind of God.  When we study the very sciences, we're peering into an aspect of the mind of God.  Scientific experimentation would be impossible if we did not have a finite universe within  which to experiment.  So all of these things gives us an opportunity to peer into the mind of God and point our  children to direct them to the mind and heart of God in our pedagogical offerings.  Wow.  Abraham Hamilton III.  Thank you so much.  God bless you and your work.  Once again, tell us how people can listen to you, view you.  Yes.  Any social media look for at Hamilton corner.  That's what you can find me.  You can download the podcast, the Hamilton corner, anywhere you get your podcasts.  You can listen to my show live on the radio at 5 to 6 p.m. central or 6 to 7 p.m. eastern.  You can find your local station, we're going to aFR.net, put your state in and you'll  see where your station is.  We're on Monday through Friday, five days a week and you can find us there.  What topics you talk about?  We talk about life, government, politics, education.  Really the whole objective of the show is to develop a cultural apologetic.  We navigate the lens of scripture and learn how do we apply the truth of God's word to  contemporary circumstances and world events.  Thank you.  God bless you and your family.  Let's keep up the fight for homeschooling.  Amen.  Thank you very much.  Thank you folks for tuning in.  Please support the work of the Illinois Family Institute.  Remember we have a big banquet coming up with the Riley Gaines, the conservative pro  woman advocate standing up for women's sports and women's privacy, women's safety.  You don't want to miss her speech.  So it's November 7th and if you'd like more information, just go to Illinoisfamily.org.  Click events.  We'd love to see you there.  Tell your family and friends about Illinois Family Spotlight and until next time.  Stay healthy.  Stay active and God bless.  For more information about Illinois Family Spotlight, visit ifiraction.org.  And to email questions and comments, do so at pvef at ifiraction.org."