" You are now on air.  And a good morning to you all.  Dear Rich Roberts, at Fireman Rich, over there on X at Fireman Rich here on Spotify for creators.  For the audio podcast, the Fireman Rich audio podcast.  This Tuesday, we do this on Tuesdays and Thursdays, except after another, other, every other Tuesday.  We do this cloud.  We do music platform there where I present eight songs every other week.  So we're going to be doing that again next week.  We'll be the 15th July 15th, July 29th.  We had one last week.  We get three this month.  But Rich Roberts here at Fireman Rich, over there on X, my mainstay.  We're all signed up at on all these other fine social media platforms.  Check out the links in the description.  There are just Google at Fireman Rich.  It usually gives you the thing.  But we are getting our day started here.  Our morning started with a good hot cup of coffee.  And it tastes good.  It tastes good.  It tastes good.  Nothing like a good hot cup of coffee.  And let's go ahead and go ahead and go ahead.  Click, tell the intro music there because we're on a new set up sort of speak, folks.  We're using the Marantz microphone.  And I usually change that out when I do the audio podcast with the CADU37.  But over the weekend, and I hope everybody had a good weekend.  Over the weekend, I was tinkering with my setup over there on the live streaming side.  And using OBS, going into rumble studios.  And I got it set up to where I don't have to use it.  I can use it, but it came apparent that I don't really need the virtual cam anymore.  Because there's what is known as an egress setup on OBS studios.  It's a pastor where once you have it initiated with an RTM connection from another platform, I guess.  In this case, with the rumble studio, or no, the OBS, another application.  It allows you to come right into rumble studios.  And through rumble studios, I broadcast out to seven.  I told it to seven different live streaming platforms.  And in doing so, I got messing around with my audio also.  And I come to find out that over the years, I've had this Marantz MPM 1000 microfarms.  for at least a couple of years now.  Since maybe longer than that, it sits the half stays.  I got it in the half stays.  And I always put it so I would be speaking through the top of the microphone.  And it's not necessarily so.  There's one side that you're supposed to have it up like a regular microphone.  And talking through the side of the top of the microphone.  And I think the sound is a lot better.  So I decided to go ahead and give it a go here on the audio side to use that microphone.  Because like I said, I usually use the CADU37, which I got way back in the lab days.  That's another live stream application that I used to use.  So we're going to be going with this.  And I'm going to evaluate it.  And we might do it Thursday too, because it's an easy, easy setup.  I sort of streamlining it because it's just, I'll still use the CADU37.  And I like that microphone.  But I was just dumbfounded.  What it dumb asked I was when I figured it out.  It's like, oh, wait a minute.  I've been using the microphone wrong.  And if you're watching me on the live stream, you can see how the microphone's positioned now.  So it does sound a lot better.  Especially when I'm gaming.  And the audio is a lot clearer.  It's not in the...  It's in the proper position.  It's no longer in the incorrect position.  And I had it for like the last several years.  But how is everybody doing this morning?  We're waking up this morning.  We've been having some sort of hot weather as far as that goes.  And was it currently?  We have a temperature of 72 degrees Fahrenheit.  And the humidity's already coming in.  The missus has already turned the air conditioning on for the day to cool down the house.  Which it's actually warmer in the house.  It's 76 degrees in the house according to the water monitor.  Put the monitor we have out on the front porch.  It beams into the clock here.  And the studio, which is actually the dining room.  I have a corner of it as far as the studio.  The temperature outside 72.  But you can start...  the temperature.  the humidity so it's going to be a hot one. Probably not as hot as the last couple days as far as  that goes but currently like I said we're at 72 degrees Fahrenheit which is 22 degrees Celsius and  we had a heat advisor yesterday but we don't have it one today so today's going to be mostly  cloudy. Periods are rain this morning. We had some thunderstorm that came through last night at six  p.m. and I had to call up my neighbor to say I don't think we can play chess online because it's just  when you got thunderstorms rolling through up here there's always a possibility of  the power going out and if there's some disruption or something like that I just told  it. I think he fully understood it. You don't want to be playing chess when you got a thunderstorm  coming through because we had one that came through last Friday and it passed by us but over in the  Binghamton area they took a whack and I have a family member there that they had they took some  damage to their above ground pool. It took a tree and there was a lot of damage over there in  Broom County and they've they're slowly recovering from that as far as I think everybody's back on  power over there but they had thousands of people in Broom County that were without power for a  couple of days and some people here in Tioga County in the northern portion of the county were  out of power but a nice act that's a New York state electric and gas company got them back going so  what's periods of rain so it doesn't sound like it's going to be no real thunderstorms just some  rain coming through. High 81 degrees Fahrenheit so the 81 you could probably add about maybe five  to six more degrees on it and that's what the temperature will be later today. When it's going to  be out of the northwest at five to ten miles per hour chance of rain 90% so we are definitely going to  get some rains some rain this today probably later this afternoon. Our world times the temperatures  as I speak starting in Honolulu, Hawaii at 150 am currently cloudy skies 77 degrees Fahrenheit in  Phoenix, Arizona at 451 am currently clear skies 91 and sport in the morning almost five in the  morning of Phoenix and there already at 91 degrees Fahrenheit. Chicago Illinois is at 651 am currently  they've got cloudy skies with a little bit of sun peeking through and 72 degrees Fahrenheit there in  Chicago and over New York City which is south of here probably about a three and a half  I'm three and a half hours northeast or northwest of New York City up here in the southern  tier of upstate New York. I'm between Binghamton and Elmira here in Tioga County but New York City  the concrete jungle at 751 am currently at 751 am here in the southern tier of upstate New York  also but down in the city the concrete jungle of New York City sunny and clear 80 degrees Fahrenheit  down in New York City going across the pond to Cork Ireland at 1252 pm and Cork is cloudy skies 73  degrees Fahrenheit there in Cork and in Milan, Atalia Milan Italy at 152 pm and I know I'm late  because usually I say Monja, Monja, Monja but we're at 152 eight minutes to two there it's in it's a  sunny afternoon in Milan with sunny and clear 81 degrees Fahrenheit and they're already in  there at the CS I think I remember living in Italy there was always BSCS at time after one o'clock  till about three o'clock so they're in the CS at time they do have that CS to thank going on there  skipping over to Kula Lampaar Malaysia at 752 pm in their evening early evening  clear skies 86 degrees Fahrenheit and in Tokyo Japan at 853 pm clear skies there in Tokyo  at 84 degrees Fahrenheit down under on the great continent and in the great country of  Australia great friends and allies to the United States of America we do appreciate it clear skies  with a few clouds 51 degrees Fahrenheit and over to the east of Melbourne and Sydney Australia  clear skies in Sydney at 57 degrees Fahrenheit and 953 pm also in their evening and those are  world times and temperatures as I speak so down there in Australia it's winter time where it's  because they're on the southern hemisphere and here in the northern hemisphere it's summer time  summer time summer time okay let's see we do have a thought for the day and the thought for the day  let's see oh I forgot to bring that up oh let me check this out hang on folks hang on we have a  thought for today from Winston Churchill he has a quote that I'll be reading here as long as I  spring up his bio excuse me sir Winston Leonard Spencer Churchill was a British statesman military  officer and writer who was the prime minister of the United Kingdom from 1940 to 1945 and again  did sort of what President Trump did he had a second term but Winston Churchill had a second term  in 1951 to 1955 so we have a quote from sir Winston Churchill I believe he was knighted and  goes as follows. It's not enough that we do our best. Sometimes we have to do  what's required. Let me read that again. It's not enough that we do our best.  Sometimes we have to do what is required. Well, if you're doing your best, you  you can't do more than that, can you? Well, once the Churchill is sort of  emphasizing that the necessity of fulfilling one's obligation and taking  necessary action, even if they are challenging or go beyond what is comfortable  or expected. So you're gonna go a little bit beyond that your best. That's what's  required. To get it done, you have to do it. Sometimes your best isn't enough. You  have to do better than your best if there's a requirement for it. So it's a  challenge. It's challenging and to go beyond your comfort zone. It highlights  the importance of prioritizing the outcome and taking whatever steps are necessary  to achieve it. Sometimes taking whatever steps could be stuff that you don't  really want to do, but you have to do to finish it out. And even if it  requires extra effort or difficult decisions and so that creates your backbone,  I guess in a sense. So a great quote from Mr. Sir Winston Churchill, God bless  and God speaks or thank you. Our national day, let's see, we got several here.  We got national raspberry day. I'm not a fan of raspberries. So Mrs. likes raspberries.  I'll eat one or two and they just don't appeal to me. We have national  chocolate with almond days. Ooh, that's a good one. But we also have cow  appreciation day. And I do like the cows. They give us the milk to make a  you know, a lot of things here. Ice cream in particular. But national chocolate  with almond day and national cow appreciation day aside, we're going to go with national  freeze pop day because it's hot and who doesn't like a freeze pop? I could use a I could use,  we should have got some freeze pops. The last time we want the BJ's I think that's a  box store there sort of like a Costco's that. Oh, we did get ice cream. I'm sorry. We did get  some ice. We get a box of ice cream. That's right. But we see these these freeze pops  during the summertime when I was working. There was always be a big box of them in the freezer  and you know, let's get one or two of them on a day as far as that goes. But hashtag national freeze  pop day. It's it's the heat of summer national freeze freezer pop day brings the sweet chill  of relief. On July 8th, grab one of Americans favorite ways to cool off with a frozen sweet treat.  Freeze freezer pops have a long, have a long history. One that's over 60 years old. They're  sleeping around for 60 years. And that history includes kids in summer fun of course. You used  to have these when I was a kid. What's better than getting outdoors and spending time with friends  and family while perhaps cooling off with a freezer full of freezer pops and every flavor and rainbow.  That's pretty cool. Summer is one of the best times of year. It's important to keep the freezer  or cooler stocked with freezer pops of all varieties and textures. And you need to throw, we got  ice cream ice cream cones, ice cream bars, ice cream sandwiches and stuff that's all good. But  the freezer freeze pop is always good. I call them freeze pops. And they're shareable too.  Everyone has their favorite flavor and you know which one it is. I like them all basically.  By looking and in the seemingly always never ending freezer or cooler. Sometimes we get that  first box. It's just like it's like never. It's never ending. And when it gets down to two or three,  it's like, oh, who's starting to buy a freezer pops? From lazy summer days to busy sporting events,  these portable treats please even the pickiest crowd. So today is National freezer pop day. I like  that. That's a good one. Okay. We do have an interesting story. It's sort of a follow up on a story.  Couple stories I've done in the past. And I remember those pesky little plastic bags, I guess  they put a ban on. Especially here in New York State. You can't get them anymore. I think maybe  you can get it. Well, we use the Walmart down in Pennsylvania. So I think we still get them. We use  them as trash bags. But these plastic bags seem to just be everywhere before they started ban on them.  And I don't really like banning stuff. But these plastic bags, I don't know. They get  they're not properly thrown away and stuff. And they're they're not really that biodegradable  as far as that goes. Not that I'm a tree hugger. Okay, you know, I believe in a good environment,  a clean environment and to the common sense wise. But ban plastic bags really work  which which I just said shoreline litter is slashed by almost half where policies are in place. So  along the shoreline that's where this is most prevalent as far as seeing these things. And  like this is sort of a follow-up story of the the law of of the of banning of them. They don't  sell them anymore. If you want to get a paper bag.  I'm going to call it a question like an extra nickel or dime.  I'm willing to pay an extra nickel or dime.  No problem there.  But I still think we still get plastic bags,  so from Walmart down in Pennsylvania.  So here in the United States is a state by state thing.  But new research shows that shoreline litter  has been slashed by almost half since plastic bag bands  around the United States have gone into effect.  The introduction of fees or bands has led to a 47% drop  in litter along coastlines and beaches,  say scientists from two universities.  And the decrease rose in magnitude over time  with no evidence of the rate returning to previous levels.  More than 100 countries have now introduced bands  or fees for plastic bags, which are among the worst  culprits of plastic pollution.  So that's the thing.  That's the main thing of these bags.  It's they cause plastic pollution to the max.  It's a lot of plastic out there.  And we have to decrease that plastic that's  out in our environment.  But the culprit of plastic bags and the ocean,  entangles birds, marine life, and breaks down  into harmful microplastics.  So they never go away.  They just break down to us my new where we can ingest  and animals can eat that, that microplastics.  But what efforts, those policies  were having on the amount of plastic litter  in the maritime environment had not been fully evaluated  until the new study was published in the journal Science  Analyzing the Effectiveness of Bands  Across the United States.  The research from the University of Delaware  and Columbia University found that fees or bands led to a 25%  to 47% decrease in plastic bags as a share of total items  collected in the shoreline litter picks  compared to areas without such policies.  The study co-author professor Kimberly Ormos  got the idea from for the study  when she learned that volunteers at Coastal Beach  cleanups in Delaware were using an app called Cleanswell  to track the litter collection.  Oh, they got an app for everything now.  The figures go into the ocean conservationists,  conservationists, trash information, and data  for education and solutions.  TIDES, tides.  Oh, that's convenient.  Database, which keeps crowdsourced records  for from thousands of cleanups around the world each year.  When we found the database that had information  on different shorelines, shoreline cleanups,  we realized we could look at the comparisons of litter  before and after a policy to see what affected  heads that Professor Ormos from Delaware School of Marine  Science and Policy.  The team compiled over 600 policies for 2007 to 2023.  Sounds like a pretty extensive study data.  With a lot of variations in their scope and geographic scale,  a lot of previous economic literature  on plastic bag policies has used checkout data  at the store level explained study leader, author, doctor,  and a pap of Columbia University.  So two university's here.  So we were excited to add to that direct measurement  of plastic litter on these shorelines.  The research team looked at tens of thousands  of shoreline cleanups and hundreds of local policies  determined how the legislation worked in terms  of reduced plastic litter in the environment.  The research focused on the United States  because it has no federal plastic bag policy  allowing them to compare the effort of different types  of policies at town, county, and even state level  within a single country.  So it's basically it's a state-by-state thing.  So Pennsylvania, I think that's where we get a plastic.  We do have some plastic bags here in the house,  and we go across the border into Pennsylvania  to the super Walmart, and that they still use  the plastic bags there.  While it might not seem surprisingly that banning  or taxing plastic bags would reduce litter,  Professor Ormos, Ormos,  says the results were more robust than she explained.  Let me ask the message here.  Do we get plastic bags still from Walmart?  Downstairs.  Downstairs.  So it's a Pennsylvania, okay.  So New York State, they're banned, okay.  So I was correct on that as far as that goes,  because I just know we have mixed to the refrigerator  this plastic bags that we use.  Yeah, we use them.  Okay.  Yeah, we use them for trash as far as that goes.  Okay.  So continuing with the article,  Dr. Pamp was surprised to find that around one  in three Americans are living in an area  where some sort of plastic bag policies in place,  and we have that policy here in New York State.  But across the border, Pennsylvania, they don't.  So the study also found that some legislation  seem to be more effective than others  in reducing plastic litter.  The data.  discovered most robust impacts from state level policies compared to town level policies  with fees appearing to reduce litter even more than bands, though more research is needed  to understand why.  Another finding was that the bag bands and fees were most effective in places where the  plastic bag litter problem was more severe to begin with.  If it was more severe, you have more people looking out for those people that are just  tossed in their plastic bags.  With the United Nations Environmental Program announcing that the next round of negotiations  on the International Plastic Treaty will happen in August of this year, the researchers said  their study highlights the opportunity for a more comprehensive approach to the problem.  While reducing at 40%, that's almost 50% to go in the right direction.  They're taking care of the problem.  Let's see.  Let's see.  R's is the first large scale study to use hundreds of policies and tens of thousands  of cleanups to look at their efforts with the data that they collected there, said Professor  PAP.  Overall, our findings do show that plastic bag policies are broadly effective in an event  in a limited amount of, let me bring that back, broadly effective in limiting litter  along shorelines.  So I got that out.  But the main thing is it's not the policies of the band.  It's the stores can't carry those plastic bags anymore.  So the policy establishes it, but the stores are complying.  So I think that's a missing part to where the stores have to comply or also get fined.  So it's just a common sense saying it's a simple thing.  I'll use paper and charge.  That was the big stickling point on these when I first heard about the banning on the state  level there.  They were saying, oh, you're going to be creating, you're going to have to buy a paper  bag.  So what's an extra nickel or dime?  It's 50 cents.  Or it's 50 cents?  Oh, it's 50 cents.  Oh man.  I'm behind the ties.  But even still, what that extra 50 cents for a paper bag, if you really need a paper bag,  right?  Right.  So in most cases, in our cases, when the missus goes shopping, we have our own cloth  and plastic bag.  Well, it's like a plastic bag, but it's a, what kind is that?  It's a freezer type.  It holds the cold.  What kind of bag is it?  Oh, it's a hot cold bag.  It's a hot cold bag.  Hot cold bag.  Right.  Right.  So, right.  Like, cold plastic coated bags.  Right.  Right.  So, you know, but we don't throw those away.  Those are reusable.  So that's the key thing.  Right.  And so the stores not having them, well, of course, the reduction is going to go.  But in some states, like I said in Pennsylvania, they still have that.  I'm not sure what the shorelines.  I'd be interesting to look at the data that these professors are looking at for the  Pennsylvania coastline and river lines and stuff like that.  You're ready to single use water bottles.  Well, I think that's next to water bottles and stuff like that.  That's another challenge here.  But as far as a band plastic bags, I guess the policies are working from what the data's  showing.  You know, you've got close to 47% drop in litter along the coastline.  So there's our interesting story and a follow-up on a story that I've talked about before  the band.  There's people cleaning up plastic.  And plastic is a big, big, big pollutant.  So there we have that.  Okay.  We're going to go into our history segment here.  And we're going to go to Fox 40 news.  I follow this culture.  I have no affiliation with Fox 40 news.  But we're going to present like we've been doing this.  And I enjoyed doing this 100 years ago as of July 7th, which was yesterday.  And we do this on the live streaming broadcast.  So let's go ahead and listen to what happened here in the southern tier of upstate New  York 100 years ago as of yesterday.  Welcome back tonight.  We're going to be seeing our segment on sharing some of Broom County's past.  A railroad crash and lost chickens.  Broom County's story in Roger Luther has these stories and more in tonight's edition  of 100 years ago today brought to you by UHS.  100 years ago today, the de Forest Street Bathhouse and the front street bathing pavilion  on the Schengle River were both crowded with young swimmers over the hot Independence  Day weekend.  18 men who celebrated Independence Day and violation of the 18th Amendment were arraigned in  City Court this morning and charges of public intoxication.  Six railroad cars filled with freight and an engine were all derailed this afternoon when  they collided with another engine in the Lackawanna Railroad Yard near the Robinson Street  Library.  And finally a box of 12 young chickens was reported lost somewhere between the state  hospital and five mile point.  Reward is being offered for their return.  And that was the news.  Oh, and never sees this to amaze me.  Never sees this to maze me.  Thank you Roger Luther.  He's a Broom County historian that presents this bit here over there on Fox 40 that's  local Fox affiliate on television network there are television station there.  and festival in New York and we love hearing from him but there's a couple good nuggets  here as far as a hundred years ago. Well the 18 men who celebrated independent days in oddly  enough 18 men, the 18th amendment, the 18th amendment was prohibition so I believe that's  what it was. Let's just check to me. I'm almost sure because they had to do with alcohol.  18th amendment what is the 18th amendment and it says the 18th, oh no that's not the  8th amendment, 18th amendment to the United States Constitution was ratified in 1919,  prohibiting the manufacturing sale and transportation of alcohol beverages for  leveraging purposes within the United States. This period of prohibition was  primarily enforced and lasted until it was repealed by the 21st amendment so back at this  100 years ago we're still under prohibition so when we do these 100 years ago people arrested  for they were still drinking, people were still getting their alcohol and stuff but it's just  funny and then we had a major train accident and looked like cars filled with freight and an  engine were derailed and afternoon after they collided with another engine in Lackawanna railroad  near Robinson Street that's the railroad that comes through the area. I'm not sure if it's still  Lackawanna but that's a Pennsylvania railroads but the box at 12 young chickens just like what was it on  a truck and they fell off. I was lost somewhere between the state hospital five mile point a reward is  for the return. They're probably all dispersed. I think during the box they fell out of the box that  probably the box broke open so somebody got some free chickens. Well that's 100 years ago from Fox 40  with Roger Luther. In other history let's see back in 1776 the Liberty Bell was wrong to summon  citizens of Philadelphia, Pennsylvania to hear the new declaration of independence written by  the Continental Congress. In 1889 the Wall Street Journal was first sold on four pages costing two  cents. I think that newspaper is like a couple bucks now printed by Mr. Dow and Mr. Jones and Charles  Berg stresses stressor. Let's see in 1948 the United States Air Force accepted its first female  recruits into a program called WAF Women in the Air Force and let's see it was back in 1969 on  this day. US troops began withdrawing from Vietnam as 800 men from the 9th Infantry Division were  sent home. So that was back in 1969 they're doing the draw down and in the year 2000 the fourth  installment of JK Roland's Harry Potter series Goblin of Fire was released breaking all publishing  records with the with the initial print running 5.3 million copies. Wow that that's something  and let's see 1776 Colonel John Nixon gave the first public reading of the Declaration of Independence  outside the state house now independence hall in Philadelphia and 1950 President Harry S Truman named  General Douglas MacArthur Commander-in-Chief of the United Nations Forces in Korea. Truman would  later fire General MacArthur for in support nation nine months later and 1972 President Richard Nixon  administration announced a deal to sell $750 million in grain to the Soviet Union however the  Soviets were so engaged and secretly buying subsidized American grain resulted in what  critically dubbed the Great Grain robbery so they got subsidized on that they got it from a  I think they they they have a large area to where they can grow their own grain but I think they had  problems here. Let's see going into this past weekend the subway series between the Mets and  Yankees on Friday the Yankees lost to the Mets 6 to 1 and on Saturday the Yankees lost again 12 to 6  to the Mets but Sunday they came back winning 6 to 4 against the Mets and last night we had  both the Mets and Yankees were off so going in tonight the Mets will be playing the Orioles at 635  PM and the Yankees are they playing they play the Mariners they're hosting the Mariners and tomorrow night  Yankees and Mariners and Mets in Oreo so that's who they're playing the next two days as far as  that goes. Now I've been we've been following Wimbledon over there on the live stream and there was  some news there Wimbledon yesterday the number one seed center who's the Italian  was playing this gentleman  Gregory Dimtrove, can I say that right Gregory Dimtrove and Gregory Dimtrove is a tennis player  who was ranked in this he was ranked  Let me see. He was ranked 19th, 19th overall. But let's see. And he is from Bulgaria.  So he was playing center of the Italian. And he was winning against center, the first two  sets. He won 6-3-7-5. But there was an incident. It was looking like center. It was on  the verge of being upset. But it's a site from Wimbledon's ex-posting that they posted.  It says, a site we've never seen. Gregory Dementrove is forced to retire while leading two  sets to love. Everyone at Wimbledon is wishing U.S. speedy recovering. And what had happened  was he was leading by two sets. He's the number 19 seed. And there was muscle beneath his  right arm was injured. It was an injury there that was clearly serious enough that he could  not lift up a tennis racket. So that propelled sitter forward in the Wimbledon. So good  passer because of 6-3-7-5. And it was love, meaning what the third set was tied before  Dimtraff retired. So that automatically makes center of the winner. Let's see yesterday, the American  won in four sets against the other Italian. So he'll be moving on. And it looks like the, who's this  guy? He's the number 6 seed. Novak, I think he's from Serbia, the server. I think he's the  server. Number 19, what is he? He's the number 5 seed. He's won Wimbledon before. I can't pronounce  his name, but he is from Serbia. Yeah. Belgrade, Serbia. Novak, developed it, I guess. I guess.  I guess. I guess the name there. But that's the big news out of Wimbledon. And as far as today, we have  one American Sheldon. He's number 10th, he won. But for today, we have the number 5th seed. That's another  American T-Fritz. He's playing right now. He's leading 3 to 0 in the first set. And then we have the number 2 say  the Spaniard Carlos Elkeras. He's playing at 940 this morning. So we're following Wimbledon. And  they're going to have the, I think it's this weekend. They'll have the finals and stuff. And I usually  watch that. It's usually, it's like the week before, 4 to July weekend, then the week after, that's  usually when Wimbledon takes place. So with that, that's our sports segment. And I can see we're pushing 40  minutes on this broadcast folks. So I like to keep this within 30 to 45 minutes. So we're going to go ahead and  exit stage left and get our day started and see what, see what transpires. And let's see what we're going to  go for, I think we'll go with this one. And we'll see what the day brings. So I want to say thank you  for those people that are listening to the Fireman Rich Audio podcast here on this Tuesday, July 8th, 2025. I am  Rich Roberts. You can follow me over or you can just check on what I'm doing on these interwebs by going over to  X at Fireman Rich on X. And we're at Fireman Rich here on Spotify for creators and at Fireman Rich  over on Spotify. So you all have a great one wherever you may be live life. Have fun.  Ciao for now. As always, peace. Take care folks."