" Welcome back to The Breakdown with me and I'll W.  It's a daily podcast on macro, Bitcoin and the big picture power shifts remaking our world.  What's going on guys, it is Monday, July 7th and today we're talking about the mystery  of the ancient Bitcoin.  Before we get into that however, if you are enjoying the breakdown please go subscribe  to it, give it a rating, give it a review or if you want to dive deeper into the conversation,  come join us on the breakers discord.  You can find a link in the show and it's going to bid.ly-breakdown pod.  Alright friends, welcome back from the long holiday weekend at least for those of you  in the US.  And over the weekend we had a fun little mystery come about.  While most people were getting ready for 4th of July celebrations the following day,  big co-enters were watching the chain.  A huge quantity of ancient Bitcoin was on the move.  Across a series of transactions on Thursday night and into Friday morning, over 80,000  Bitcoin were moved from an ancient wallet cluster.  That is around 0.3% of all the Bitcoin that will ever exist.  These addresses have been dormant since 2011 so these Bitcoin hadn't been touched in 14  years.  At the time Bitcoin was priced at around $6 a coin.  So this represented around half a million dollars worth.  Small by today's standards but an insane gamble based on how early things were.  The coins were acquired in May of 2011, a few months after the silk road launched but  before the gocker article that made the dark web market notorious.  It was also just five months after Satoshi's last post, meaning that we are firmly in  the earliest era of Bitcoin here.  Now ancient wallets waking up isn't all that unusual but this is the single largest transaction  of its type we've ever witnessed.  Coinbase director Connor Grogan traced the coins back to a single miner who once held 200,000  Bitcoin in a single wallet, one of the largest wallets that has ever existed.  Security expert Taylor Monahan noted the strange way the wallets were arranged.  Instead of consolidating their coins, this person had split them into multiple 10,000  Bitcoin wallets.  That's completely normal now but in its era that would be like separating a few hundred  thousand dollars into fifty thousand dollar chunks.  Monigan commented, the more money you have, the weirder of a practice it becomes.  I've never done this, never heard of people doing it, never seen people do it.  Although the whole things were relatively large for their time, they are of course completely  dwarfed by the 8.6 billion the Bitcoin is worth today.  According to Forbes billionaire list, this is a top 400 personal fortune being moved on  chain in the middle of the night on a national holiday.  It was enough to make CZ jealous with the Binance co-founder tweeting, I got into crypto  too late.  One of the first observations was that there was no test transactions.  The whale had transferred 10,000 Bitcoin at a time, risking the loss of a billion dollars  to a typo.  The big question though was who owned the Bitcoin and why they were moving it after all  these years.  The natural assumption was that an ancient Bitcoin whale was cashing in.  It's a fairly crazy idea to leave 80,000 Bitcoin untouched for 14 years than one day decide  to sell it, but stranger things have happened.  However, that doesn't appear to be the case.  Once the movement of funds was finished, Arkham Intelligence tweeted, there are no indications  that this whale is selling Bitcoin.  The Bitcoin is now sitting in eight fresh wallets and hasn't moved since Saturday morning.  Price movements also suggested no one expected the coins to come to market.  In weaker markets, we've seen the price crash when dormant coins wake up, but this time  the price didn't move below 107,000.  Trader Tyler Neville commented that the entire concept of selling this much Bitcoin in this  manner was a little preposterous tweeting, if you have nine billion of any asset, you can't  just sell it FYI.  You borrow against assets when you have this much of it.  I meant that someone was likely coerced on 4th of July to do this just to see the market  reaction.  You would move much smaller amounts if you were planning on actually selling it.  Yet still, the movement of funds captured the imagination of everyone on crypto Twitter.  By the end of the weekend, Connor Grogan had an interesting but admittedly speculative theory.  Writing, there is a small possibility that the 8 billion in Bitcoin that recently woke  up were hacked or compromised private keys.  I found a single BCH test transaction from one of the Bitcoin whale clusters 14 hours  ago, followed by the full amount.  An hour later, the Bitcoin wallets begin to move.  There is a possibility that the owner was testing the private key in a way that wouldn't  get noticed, as BCH isn't monitored heavily by whale watching services.  What makes me say this is the other BCH wallets have not been touched at all, why wouldn't  they also sweep these?  This is all extreme speculation, but the movements are extremely odd here.  I do not think that this is an exchange wallet due to the BCH activity and given the Bitcoin  transfers appear to be all manual.  If true, again I'm speculating on straws here, this would be by far the largest heist  in human history.  In other words, while this could be a simple case of someone finding their keys after  more than a decade, it could also be more nefarious.  Alongside the risk of physical or digital theft, some were concerned that this could have  been a quantum hack.  Quantum computers aren't ready for prime time right now, but the technology is moving  fast.  To some it wasn't completely implausible that a research computer could be used to compromise  a private key at the stage of the tech, but even if you were willing to entertain that  still kind of far out their notion, breaking into 8 wallets in a cluster seems extremely  unlikely.  In fact, the way the quantum interacts with this could be a little bit simpler.  David Hoffman, the co-host of Bankless tweeted, Old Bitcoin moving from a quantum insecure  wallet to a secure one looks identical to a dead wallet getting exploited by a quantum  computer.  Another angle of the story is that the actual transfer is kind of insane.  This wallet predates a lot of the modern systems around Bitcoin security.  Back in 2011, there were no 12-word seed phrases.  Bitcoin was stored in a local file called wallet.dad.  The file could be encrypted, but there was no recovery of the file was lost.  Dactions from these old wallets need to be manually constructed and broadcast to the network  adding a few additional points where a billion dollar typo could be introduced.  Block 21K wrote,  This wasn't just moving money.  It was digital archaeology.  They had to preserve an unencrypted file for 14 years, keep it safe from hackers, bit rot  or hardware failure, execute a flawless $8 billion transaction in 2025.  Wild.  Charles Giamet, the CTO of ledger commented on just how crazy the transaction was.  in the last year.  Yesterday, 80,000 Bitcoin worth roughly a billion were moved on chain.  These coins date back to 2011 before the BIP.  39 standard existed.  Back then, private keys were managed individually per address with no hardware wallet support,  even today.  This suggests the keys were stored in a wallet.dat file and the transaction was likely signed  using a software wallet like Electrum.  From a security standpoint, this is absolutely insane.  While the security model is pretty wild, CASA CTO Jamison-Lop is also in the No Test Transactions  Club.  He commented,  Anyone who understands the UTXO model knows that a transaction completely destroys and  then recreates your money.  That's the idea of a test transaction is laughably naive.  Just make sure you verify the transaction details on dedicated hardware.  In other words,  from all of this,  we can assume that this is someone that was deeply into Bitcoin all the way back in 2011.  They had dedicated hardware.  They maintained a working knowledge of the old methods of transferring Bitcoin and were  ready to put a billion dollars on the line.  Today's episode of The Breakdown is brought to you exclusively by Grayscale.  Grayscale is almost certainly a name you know.  They've been offering exposure to crypto for over a decade now and offer over 20 different  crypto investment products ranging from single asset to diversified to thematic exposure  to crypto and the broader crypto industry.  They have long been innovators at the intersection of TradFi and crypto and one of the benefits  for a lot of us is that Grayscale products are available right through your existing brokerage  or IRA.  Now, of course, investing involves risk, including possible loss of principle.  For more information and important disclosures, visit grayscale.com.  Go to grayscale.com to explore their full suite of crypto investment products and invest  in your share of the future.  The big question is of course, then, who is this?  There are really only a small handful of people that fit the description.  This wasn't someone who made a small fortune in Bitcoin from the Silk Road era and decided  to keep it.  Without naming anyone in particular, most of the OGs that are household names today emerged  out of 2013.  They took a conviction bet that Bitcoin was more than just money for the dark web and built  their stacks after the marketplace was shut down.  Instead, it looks like someone who is willing to put in a fairly decent sum of the time behind  the nascent tech.  Some of these addresses have shown up in Bitcoin discussions over the years.  One address showed up in a post on Bitcoin Talk in 2021, with a new poster asking for help  to recover 10,000 lost Bitcoin.  Another two were mentioned in the Craig Wright lawsuit, with the fake Satoshi claiming  he all numbered lost the keys.  However, this was an eight-wallet cluster and none of those documents mentioned the entire  group.  In a move that will just absolutely shock you, Craig Wright may have just selected some  old large wallets from a block explorer.  The more reasonable suggestion came from Sony of Timechain Index who wrote, I'm 99.99%  sure it's Roger Ver.  Sometime last year, Mr. Hoddle was discussing Roger and the potential size of his holdings  during a Twitter space that prompted me to dig into his historical purchase activity.  I cross-reference those dates with my database of unidentified addresses and found only six  addresses worth 60,000 Bitcoin.  Today, all six of those addresses moved.  In addition, two more addresses also moved, once I had previously missed because they were  already labeled as individual XMI system and therefore excluded from my unidentified filters.  It's not that much to go on and Sony didn't show his work, but this quickly became the  dominant theory across crypto Twitter.  Now without getting too deep into Roger Ver's background, he was of course one of the  earliest Bitcoin evangelists.  Prior to 2016, he was sometimes known as Bitcoin Jesus, but had a fall from grace after  putting his weight behind the Bitcoin cash fork.  Ver bought large quantities of Bitcoin in 2011 and invested in the earliest Bitcoin companies.  That September, it was the major backer of Bit Instant, Charlie Shrem's early Bitcoin  payments company.  When he found Bitcoin in early 2011, Ver was already a reasonably successful businessman  through his computer components company, Memory Dealers.  One of the wrinkles is that Ver didn't appear to have a ton left in reserve.  In 2022, he was named as the reason that coin flexed at Bitcoin cash focus exchange was  forced to halt withdrawals.  The exchange said that Ver, who was also an investor, had failed to meet a $47 million  margin call on a leveraged position.  Not exactly the behavior you would expect from someone with billions in Bitcoin.  Last year, Ver was arrested in Spain for U.S. tax evasion.  He's accused of failing to declare 131,000 Bitcoin he owned in 2014 when he renounced his  citizenship.  The numbers roughly line up, although we don't have a good idea of how many Bitcoin  Roger Ver retained from the early days.  Uney Worthheimer told the crypto Twitter by posting a fake Trump tweet claiming Ver had  made an 80,000 Bitcoin donation to the U.S. government to clear his issues and obtain the  first U.S. Bitcoin visa.  Although the post was a joke, Uney commented,  Well, I have your attention.  I don't think there's anything bearish about this.  We already knew Roger had a lot of Bitcoin and that is under the IRS's thumb, so there's  basically no new info here.  CT traders wouldn't know this, but when Wales wanted to liquidate, they don't just ship  80,000 Bitcoin to buy an answer and market sell.  In fact, if you really wanted to liquidate the best way to do that would be to see the new  public treasury company and sell shares over time at a 3X premium.  And hey, a settlement with the U.S. government isn't off the table either.  Of course, the speculation over the weekend was off the charts, so there are a ton of other  theories out there as well.  Some believe this is the NSA or the Chinese government shifting some Bitcoin from a long  forgotten operation.  The timeline doesn't really line up for this to be a Chinese miner, with that trend  not really beginning until 2013 at the absolute earliest.  U.S. intelligence is always a possibility, but without any evidence it's based on wild speculation  alone.  Could be that this is part of Trump's government-wide Bitcoin audit.  A certain group also read into which tokens moved in which didn't.  Whoever this was moved their entire stash Bitcoin and Bitcoin cash, but didn't touch the  other forks.  Some B.S.V. true believer thought this was a signal, but you could easily justify moving  40 million in Bitcoin cash and not bothering with 2 million in B.S.V.  Some were thinking about entities that could buy a billion of Bitcoin in and over the  counter deal.  GameStop is really the only company that comes to mind with over 6 billion in cash and  amending to buy Bitcoin.  Other more intriguing theories are floating around related to early anonymous Bitcoin miners  who have never been revealed.  However, those were based on even less evidence, and so it'll make it hard to add all that  much to the conversation.  The most remarkable thing about this story then is that we truly have no idea who just  moved $8 billion in Bitcoin.  Air mass commented, you know, people have been larping for over a decade that Bitcoin  is not private, that you need Monero or Zcash, but then somebody sends $8.6 billion in  nobody on earth can tell me who it is.  Bitcoin isn't private because it hides your transactions.  Bitcoin is private because identity is never recorded to begin with.  And without identity, all cheats.  analysis boils down to educated guesses, not proof. That said, this is one of the last transactions  from an arrow when being truly anonymous that this size was possible. Siding of time chain index  noted that these are the final unlabeled 10,000 bitcoin wallets he had in his database. There's also  the question of how big a deal this is moving forward. While it's a remarkably large amount of  bitcoin coming back online, it's not all that big in the grand scheme of things. Simple Steve tweeted,  even though it's a lot, moving 14 year old coins is not all that unusual. It was nothing  compared to the amount of 2010 coins we saw moved in 2024. Most on chain analysts view these  movements through the lands of coin days destroyed. This was the second largest spike in the metric  ever. Usually a lot of old coins coming online is a very bearish signal, but it's not that simple.  We have no indication that the bitcoin is being sold, and there are, of course, as we've heard,  lots of good reasons to upgrade to a modern wallet. The movement also calls into question how  much bitcoin is truly lost. Analysts generally think between two and three million bitcoin have been  lost forever, but these coins were included in those calculations. Every cycle early coins wake up  and start moving again, so we really have no idea how many are permanently lost. This fact has  large implications for how a migration to a quantum safe bitcoin protocol should be handled.  The idea of marking old coins as abandoned and leaving them behind was always a risky proposition,  and this transaction demonstrates why. We may never know who moved these coins or why they  moved them. Could end up being a sale, but so far there's no suggestion the ancient whale is going  to dump their coins into the order books. In the end, this is one more mystery to be added to  the series of bitcoin myths that have been built up over the years. Not moving the price,  it's a mystery without immediate implication, but still some fascinating intrigue. Ultimately,  if you are interested in the uniqueness that is this asset and the people around it,  the singular fact is that no one knows who just moved $8 billion in bitcoin.  That's going to do it for today's breakdown. Appreciate you listening, as always.  And until next time, be safe and take care of each other. Peace!"