" Welcome to the Adnosium Podcast where classical gourmons everywhere can finally get their  fill.  Join us for a delectable discussion of Greco-Roman civilization stretching from the Minoan  and Mycenaeans through the Renaissance and right down to the present.  And now ladies and gentlemen here are your hosts, Dr. David Noey and Dr. Jeff Winkle.  Welcome, Adnosium listeners to episode 186.  As always, my name is Dr. David C. Noey, the C stands for Capcious and down here in the  Vomatorium with my good friend, the Montana big sky guy.  So his T-shirt proclaims.  Yes, what place I've never been actually.  Oh, really?  How's it gift?  Dr. Jeffrey T. Winkle.  What is the T-stand for Jeff?  A tenacious.  Tenacious.  I think I probably use that before.  I feel on it.  Tenacious J.  So you wear the T-shirt, so you've never visited the state of Montana.  No, my wife was a leader on a high school trip up there near Bozeman and she brought  that.  There's love in the T-shirt for you.  Very nice.  We don't want to devote too much time to the banter and to the warm up because we got  a little bit of a nudge from one of our listeners.  I'm not going to give his full name, but we'll call him Tom because that is his name.  And Tom pointed out something that was really nice.  He said, you're really taxing the listeners' patience because it took almost 15 minutes  before you got to the topic.  How do you feel about that, Jeff?  I mean, I will receive the criticism and assume good faith.  Better you than I.  But you know, I guess there's always the fast forward button.  That's true.  We can banter all the harder.  Right?  Get to the meat of it.  That's true.  So if 15 minutes was too much, should we do a solid 20 or 30 before we actually get to  the content?  I like doing things just for spite.  You do.  Yeah.  It's one of the most underrated of all emotions.  Spide in resentment?  Yeah.  Yeah.  Yeah.  That's right.  Well, maybe we'll get our engineer to add in some chapters at some point.  That would be.  That we can banter part one, banter part seven, subsection A, little one, they can skip  right to that.  Yes.  And I believe Tom actually suggested the chapter.  He did.  It's a brilliant, excellent idea.  So thank you, Tom.  Thank you for listening.  And we're going to get right to the meat of it today.  Yes, exactly.  Well, after a little bit of banter, because as the could say, it's been a minute.  It had.  It's been a while since we've done one of these shows.  And the kids also talk about the vibe of the podcast is a little bit of silliness or  maybe a lot of silliness and a little bit of instruction.  Exactly.  So you've been off to Greece.  I have.  Briefly, I'm going to start my stopwatch here.  Tell me about Greece.  It was great.  So I got back a couple of weeks ago.  I took 12 mostly wonderful students over there.  And there's always a little bit of this.  There's some drama there.  As my friend and colleague put it, I was telling her about this.  She says, well, you have the stages.  And that's right.  But you're forming, storming.  Really.  And then renorming.  And it was crazy how text book that happened.  You mean the group dynamic?  The group dynamic.  So we got together.  We kind of established a kind of a baseline of how it's the forming.  That's the forming.  And then led to kind of the norming.  Right.  So here's the clown.  One person's designated the cut up.  Exactly.  The person would be designated the warrior about where they're going to eat.  Exactly.  A third person would be designated one.  Well, I mean pick your liner.  Pick your union architect.  OK.  And so you all play a role.  But inevitably those, those, those archetypes, they clash.  OK.  And so we had a little bit of drama.  And you were a Chewbacca.  Was that kind of your role?  Chewbacca.  Yeah, just got a group.  Right.  So norm, uh, forming, norming, storming.  Storming is where the group's functioning really well.  Is that right?  Seeing all the sites, that's the storming.  No, the storming is when kind of the tension's bubble over.  Oh, right.  Exactly.  So that's a bit of a stretch that they call it storming.  Storm, why they just wanted the ride.  Yeah.  Right.  So we had to have a little sit down and iron things out.  And then after that, re-norming, things kind of went back to their.  The new normal, the new normal, which was great.  But that's neither here nor there.  It was great.  We it was sunny.  It was very, very hot.  Yes.  As Greece can be in the hot for sure.  Yep.  And it was actually, they were going through a heat wave.  Right.  But the way I like to look at it, no rain.  The country was beautiful.  We had, we took an island hop.  Agena.  Agena, Poros and Hydra.  All right.  Which was fantastic.  I mean, Delphi has always made niches and.  And about half of the students were students of the head taken the archeology.  Okay.  Theology course with me.  So they were primed, you know, invested in the subject matter.  And it always helps to have a quorum of those kinds of students.  Sure.  Yeah.  And no issues nobody got injured.  Nobody got lost.  It was great.  So Athens, you know, concrete brick marble just soaks up the sun.  And then radiates the heat all evening.  Yes.  Even into the night.  Exactly.  But at the same time, it was wonderful to our hotel was right by the air move.  Okay.  It was that pedestrian walk tour, which takes you from Sintagma down to Montes, Montes  Iraqi.  That's right.  And I mean, all of the vendors and the busking musicians, it was fantastic.  It's really nice.  I loved it.  So you are, here's the first of many bad puns for this episode.  You were definitely in local parentis, right?  For some of these folks.  And sometimes it gets a little more loco than other types of people.  And my right.  It is.  Yes.  So what do you do?  Because you're solo, right?  Loco solo.  And you can't play good cop bad cop, which is something you and I have done at checkpoints  and I'll travel.  I did have a colleague along.  Yes.  So I did.  So we could do.  that we could do that to a certain degree in some of the  So was this individual? He's a in my department his name is Derek and he's he's great  He's very personable. Are you thinking about starting another podcast? I'm starting to get a little jealous  No, no, not at all. No, I don't think that that would go well. Okay  But Derek was great. I mean he was he was he's younger than I am and he could you know  He could kind of get with the kids got in a way that I can't anymore right right  So we could we could play that role right and that worked out quite well excellent yep  And you Dave yes, we're off even further away from us in South Africa  Yes, I looked it up and I found that when I was in Cape Town  This is the farthest I have been  geographically from my hometown ever. Yeah, by just a little bit  But it's I mean I'm distant. I'm picturing. I'm thinking of a globe in my brain right now  But it would be hard to get a lot further. I mean, I mean you went to parts of Russia  Sure, yeah, when I was in South Korea  I was one way from home Cape Town just as the crow flies  Just a little bit further. Yeah, so what are you doing there? Well, I was giving a lecture on theater, Baysa and  It's a long way to go for a lecture. Well, I was invited  Yeah, turn that down exactly and a little bit of a vacation with Mrs. Noi took her along  Yeah, and also preached at the church there  The Reformed church of the southern suburbs. It's called in Cape Town. Yeah, did some sightseeing  I got to see lions got to Petachita  Got a Petachita. That's correct. It's really they were petable. Well, it's at the cheetah conservatory  Okay, that's the name of it the cheetahs play cellos and violins and harps and you know voice lessons and things. Yes  And no, it's it's a place where they're raising money and raising awareness for the plight of the cheetahs. Are they endangered?  Yes, and they have one just close to endangered they have one designated  There that people can pet you know for a large fee. Yes, and then the funds go to gotcha  So it's okay, and they pick their kind of their chilis. Yeah, this one was raised on a bottle, you know  And it's still very controlled because it's a wild animal right right, but the  Africoners that I was hanging out with they live like  Homeric heroes. I have never eaten so much beef and drank so much red wine in moderation in one week in my entire life  Is that right? It was fantastic. So they were slaughtering the  Cuckatones goats and that's right. Yeah the kinds putting on spits  They have barbecues in their homes called a bry so these people not to live right man  It was excellent was there any like singing a recitation like others a little bit of singing not too much recitation  There was a lot of joking okay got some people interested in the podcast as well  So I'd like to say hello to John and Martin and  Louis and Alex hopefully they are listening. Yeah, and it was beautiful. What a lovely country  Yes, fantastic. Yep speaking of lovely countries. Yes. We are doing today a fourth of July themed episode  Yeah, a little late a little late yesterday was the fourth  But that's okay. Yeah, the fourth has a kind of penumbra you might say there we go right it emanates  You can enjoy it a few days after you did so what are we talking about precisely today Jeff? Here we are at minute 830  That's about the right amount of banter. Yes. Well, we are creating into chapter five of a book that we have been working our way through over  The last several months. Yeah, it's a year a year. Yeah, so this is Karl Rashad's the golden age of  Classics in in America, right? So we're not going to maru no no no not maru today  Right we are talking about the book that  Dells into the influence of the classics on early America. Yep. I think that you miss maru  I'm okay with maru maru. We can keep maru can stay over there for a while. Okay. I think you will maru the day  That's my bit. It did not return to maru and the history of education and antiquity look at there  All right, we'll get back to him. But today we're talking about chapter five in rishard's book on romanticism  That's right. I thought this was really really interesting really. Yes. I love this era  in European and American history and I did not like it. Oh  This sounds good this is a little bit of contrast so the golden age of the classics in America Karl rishard  2009 chapter five as you said and the theme is romanticism. Yes  So part seven Jeff as we get into this. Yes. Can you set it up for us? What is  Romanticism and what does it have to do with the classics? Right. Well, I want to reference it. I think I brought this up  On the show before something I'm fascinated by but it's one of these these theories about the rhythms of history. Okay that you have periods of  deep rationality into electoralism  Mathematica approaches a way of understanding look at the world which are then followed by more  chaotic irrational more mystical kind of periods. Okay, so you know for example  The classical era gives way to the Hellenistic era. Okay, so if you were to compare a kind of a statue from the classical era  You know very poised  Emotionless in the face  perfectly balanced and compare that would say the famous Lao co one  Where you have the kind of the twisted bodies and the agony on the face of the serpents and Hellenistic Hellenistic era, right?  And so it's  That's often used as kind of  an emblem of kind of the the theme of  One era kind of giving way to the next. Okay, and so here we have romanticism  This is all in hindsight of course so people in the early 19th century say oh yes  Well, how are you enjoying the romantic era? Right?  But this follows on the heels of what we call the enlightenment right so a place or an era of  Science and rationality and and you know by the numbers gives way to this this more this mystical era  so if you compare say  the  The fuchsia of Bach yes are much more kind of you know mathematical in a way that you compare it to kind of the bomb as to Beethoven  Okay, who's as a represent of the romantic era nice and then you also have  I mean this is all over this chapter is the divinity of nature.  Right.  You're not going to find God with your slide rule.  You're going to find God in the forest.  You're also not going to find him in a revelation, right?  In the scriptures.  Right. Exactly.  This is what the romantics say repeatedly.  So this is one of the things that one of the themes I would say  regard develops, which separates the intellectuals of this era quite  starkly from the founding generation.  There's lots of reference here to the row.  Right.  To Emerson, even Edgar Allen Poe.  So like Herman Melville.  Melville.  Nathaniel Hawthorne.  Walt Whitman.  Right.  But yeah, so like Gothic literature and art gets kind of woven  into this period as well.  Of all the names that we mentioned, I'm only an admirer of Melville  and Poe.  I haven't warmed up to any of the others.  I can't say I'm shocked that you never had a love.  Whitman for the transcendentalist.  Right.  Well, I thought this was really interesting about how in previous  chapters, you know, the name Aristotle, of course,  very important.  Right.  Without Aristotle, you don't get the enlightenment to some degree.  You don't get Western civilization.  Right.  And so, you know, Richard, I thought this was really helpful.  Kind of breaks the status that Aristotle, if you want to compare  into Plato, Aristotle says, how do you understand the world?  It's from the outside in.  It's your senses and you take it through examination and then  reasoning through the results of what you have observed.  Exactly.  Right.  And there, I mean, that's an enlightenment principle right there.  Romantic era says, no, no, no, let's go to Plato.  Right.  And particularly kind of the more kind of mystical aspects of  Plato, where do you find truth?  Where do you find being?  Where do you find God?  Right.  You find it within.  It starts inside and then moves outward.  Yes.  Now, I'm no expert in transcendentalism or this era of  romanticism.  I'm only a small expert in Plato.  But after reading the chapter, I don't think they're reading  Plato very accurately.  Well, I agree with that.  I mean, Richard makes much of how, you know, so many of the  romantics and so many of the transcendentalists, they were very  much against like, you know, don't imitate these guys.  Don't, you know, do what, what, what Plato did or I do this  quote, there were one of these, these guys says something  that no one became Shakespeare by imitating or copying  Shakespeare.  Yeah.  And so I think that that a transcendentalist said, well,  we're not, we're using Plato in that he represents kind of the  spirit of the class.  Correct.  Right.  And so I, so I think because they're not kind of relying on  specific, well, let's look at the gorgias.  Right.  It comes off much more.  It's like, well, let's just look at kind of what, what  Plato represents.  It's very impressionistic.  Not very analytical.  I don't know.  Yeah.  You could tell I wouldn't like it.  So let's get started.  Okay.  Let's get started.  Romanticism says, re-shared.  This is on page 120 in the antebellum period.  Nationalism and democracy merged with romanticism to form the  United States first national literature.  Although American Romanticism emphasized enjoyment of the present  over preoccupation with the past and nature over scholarship as  the true source of enlightenment.  Emphasis that might have caused the romantics to repudiate the  classics, these very emphases were largely based on the  platonic valuation of intuition over reason and experience.  Yes.  Right.  So this is one of the great things about re-shared as a writer.  That first sentence says it all.  It does.  Right.  Those first two sentences, I should say.  Yeah.  It's a brilliant, brilliant encapsulation of the theme of the  chapter altogether.  I really wish Mr. Maroo would take a page.  No, I'm not going to go there.  I'm not going to go there.  Right.  But you're right.  This is perfect.  And the way that re-shared will sum up his chapters in the last  paragraph too.  It's just absolutely brilliant.  It's great.  It's great.  But you'd like it at the beginning to point the way.  Yes.  Let me just read a little bit more.  Because this is also, it says, while the romantics, like the  founders before them, invade against the slavish uncritical  acceptance of all things classical, they revere the  same.  And it's even suggesting that the ancient positions closer to the  dawn of time had given them a clearer understanding of truth.  He comes back to that theme of the universe.  Yes, he does.  Which is, I thought was really interesting.  So the fact that the agents are simply chronologically closer  to the beginning of things makes them pure.  They're younger.  Right.  They're childlike.  Right.  And so it's not a surprise.  Out of the same era comes the whole notion of the noble  savage.  Right.  And so you get the treatment of the native indigenous  Native Americans as being kind of inherently morally  better than the European settler.  Because they're closer to nature.  They're closer to the beginning of things.  Yep.  Right.  The very next sentence also sounds an important theme.  The transcendentalists says, Richard, like the  ancient's moralism and love of nature and viewed  individual classical figures like Socrates as the greatest  models of nonconformity.  Mm hmm.  Men whose courage had enabled them to heed their own inner  voices in contradiction to the dogmas of their societies.  Yeah.  Now, this is why, I mean, if this is true, what Richard  says about the transcendentalists, I'm sure it is.  This is why the majority of the chapter says almost nothing  about the Romans.  Yes.  Because you can't say about the Romans that they celebrated  nonconformists.  Right.  Exactly right.  They were a bureaucratic machine.  Yes.  The motion maybe of Seneca is praised here as a representative  of stoicism, which I don't think fits very well in the overall  romantic project.  Mm hmm.  And in addition, Plutarch, who wrote in Greek, but lived in  Rome, and celebrated a lot of Roman heroes in a way that I don't  see how it really fits with romantic themes and impulses.  I guess, you know, so, Richard, as we end this chapter talking  about Plutarch.  in his place and all of this.  I mean, I guess if you look at Plutarch's parallel lives,  he deliberately choosing a philosophical Roman,  paired with a militaristic Greek.  He is saying, okay, well, the stereotypes of the Greek  being the intellectual, the Roman being the spear wielder.  By flipping that around, I guess he's saying,  well, who didn't conform to those stereotypes  in their own era, right?  Right.  So the first section, a national literature  for a democratic romantic age.  So the way I read this portion of Richard's chapter is,  there's a bit of a conflict or a bit of a question.  What kind of a people can produce good literature?  Yes.  So he cites this individual Thomas Dew,  this is in the second open paragraph.  Thomas Dew attacked the European dogma  based on the glorious literature of Augustine Rome  that works of literary genius required royal patronage.  So can you draw that out a little bit for our listeners?  Right.  So I mean, he's talking about the idea of, well, one,  looking at Augustine Rome as a golden age of Roman poetry.  Right.  Roman poetry.  Right.  The whole crew.  And he's kind of attacked the argument.  Well, that could only have happened  if Augustine hadn't put his mind in his weight  or guys like my seen us.  Right.  Yeah, the circle around them.  That's what the argument he's attacking is that,  that could only have happened  if there had been this kind of,  if there hadn't been this kind of pattern.  Right.  So in other words, the democratic society  isn't able to produce great literature.  Yes. Right.  But Dew, he wants Thomas Dew.  He wants to refute that notion.  He does.  Because as a patriotic American,  he wants to think our new experiment  is going to reach the heights of literature.  Exactly.  Right.  So he continues his Augustus and my seen this May lavish today,  the imperial treasures upon literature.  But Tiberius and St. Jane is May starve  and prescribed it tomorrow.  Right.  So he seems to be saying that it really has nothing to do  with, you know, you did an autocrat.  Right.  Because, you know, it's the character of the people.  Exactly.  It's kind of the form of government.  Right.  Or you could say, me quickly, your Augustus could be,  could be associated to see the by a Tiberius.  Right.  And then the whole thing just kind of goes out the window.  Right.  Right.  So then he also cites Constantine the Great  as an example of an autocrat who had massive resources,  but couldn't revive any kind of ancient art  or literature during his time period.  I don't know if that's true.  There was a flourishing, a flowering,  you might say, of literature under Constantine,  like Lactantius whom we talked about.  Right.  But there wasn't a whole lot in terms of drama and such.  Right.  So let's go down to the next page.  Okay.  122 where do, it can extend his argument.  And here, Rashad writes,  After allowing the astonishing literature produced  by the Greek democracies, works of genius  that the European monarch has glossed over,  do express his confidence in the future greatness  of American letters.  He predicted, quote,  we shall then have an empire formed by a mere internal development  as populous as that of Rome and much more wealthy,  speaking all the same language  and living under the same or similar institutions.  Such a democratic empire,  blessed by modern commercial prosperity,  would provide a vast market for literature,  a form of patronage beyond what kings and princes  confer.  Hmm.  So do was write in one sense.  I mean, we don't all speak the same language,  but most people speak English.  And we have far surpassed Rome's population.  I think under Constantine,  it was a million individuals in Italy,  which was the most populous part of the empire.  Now United States is a little over 330 million.  So vastly exceeded that.  Yes.  What is common of vast market for literature?  Well, I mean, I think to some degree, he's right.  I mean, the Rashard or, you know,  do doesn't mention it here,  but of course, levels of literacy  would play a control issue.  I'm sure this argument, right?  And so, you know, estimates about who was literate  in first century Rome.  Yes, it was very few people.  10% or less.  Right.  And so the way people got their literature  was, if you couldn't read as you heard it perform.  Correct.  Right.  And you listened to podcast  or top 40 radio, right?  That was exactly right.  Yeah.  And I mean, into own a book,  back then was also an incredibly expensive  out of reach enterprise.  And so if you consider literacy  and post Gutenberg mass production of books,  are we, we could be talking apples and oranges  to a certain degree?  There.  But I guess idea that, you know,  democracy will produce a more broadly educated populace  and a more prosperous populace.  And therefore, time leisure and money to buy books.  Okay.  And so I think he's onto something here.  Yeah.  Well, he is definitely,  but his argument, I think Thomas Dew's argument  is that America will excel,  will surpass, will excel,  and then surpass the ancient societies  in the production of high quality literature.  Right.  That's the next one.  I'm not sure that that's,  I don't think it has happened.  Herman Melville, you know, Moby Dick,  talked about this before,  has the best claim to being an American epic?  Yeah.  So that's the part of this chapter I really enjoyed,  but I'm not convinced we have an American epic.  Right. So we'll get to Melville.  I can have to admit that,  that caused you to snooze.  Well, Moby Dick is chloroformin print.  That's great novel.  But I think we should,  we should talk about something that we mentioned  to show their off mic was, you know,  walking into a bookstore.  Yeah.  I compare this also kind of doing the doom scroll  through Netflix.  Right.  It's this more of more,  more is more philosophy  that it, I think it's harder and harder  to find those diamonds in the rough.  Something that stands out.  When you have an Augustus or my scene is basically,  you know, being the.  gatekeepers. I mean, they're releasing these polished diamonds. Whereas at a mass market,  there's good stuff out there. But one, it's not necessarily going to be loved by the public  because the public tastes don't necessarily gravitate towards the list.  What kind of a list are you? A huge one. And two is just going to make it much more difficult  to kind of find this. So we need time to filter things out.  Exactly. Exactly. Right.  Let's move on to the second part of the chapter. The repudiation of slaveishness.  Okay.  Jeff, can you set this up for us?  Yes. Well, let me just, let me set it up by by reading the intro paragraph here.  Rashad writes, the romantics eschewed the antiquarianism and abject  slaveishness of some antebellum classicists. Quality is that conflicted with the transcendentalist  emphases on living in the present and on nonconformity. Walt Whitman, the least classical of all  the romantics wrote concerning the classics, these two lines here.  Regarding it all intently, along wild and dismissing it, I stand in my place with my own day here.  What does that mean? I've never been a huge fan of Whitman.  But I mean, he's saying his most famous set of poems, it leaves of grass.  Yes. Right. That was, you know, pages of boredom.  Is that the alternative title?  I think it was one of those books that like years ago, you give someone as a gift on graduation,  it would just remain unopened and not on bed. Right. But I think the point is here is that,  you know, why are we obsessing with the past? Well, the only thing that matters is the here.  Well, now, right. Yeah. All right. So to go on, Rashad writes,  Whitman criticized the British poet John Keats for his slaveishness, quote,  Keats' poetry is ornamental, elaborated, rich in wrought imagery. Isn't that good?  Okay. It is imbued with the sentiment of the gods and goddesses of 2,500 years ago.  I would say that's also good. Yes. I'm editorializing, you realize.  Its feeling is the feeling of a gentlemanly person, lately at college,  accepting what was commanded him there, who moves and would only move in elegant society,  reading classical books in libraries of life in the 19th century. It has none.  Anymore than the statues have. It does not come home at all to the direct wants of the bodies  and souls of the century. So I see in there, I mean, it's mentioned of college there,  this idea that college is producing these automatons. Right. They're just,  this slavishly reading books of reading, a little chomping, classical literature here.  Yeah. None of which happens today, by the way, right? The historical moment has moved on.  Yeah. I wonder what Whitman would say today if he were to encounter a completely pragmatic,  almost entirely, I would say outcomes based kind of education, which is for employment.  Yeah. Yeah. I don't know. And I also find kind of this, like, in the on the first page,  you know, Rashad refers to Socrates. Right. And so the transternals love Socrates,  not for any of his real philosophies. No, or instance of humanity, but they just like that,  he kind of stuck it to the man. Exactly. And so that that, um, kind of standing out and being,  you know, a person standing out from and above everybody else is also a very much,  and often a annoying romantic guy in the middle.  Let's skip the next little bit about Poe as interesting as it is.  Go on to Nathaniel Hawthorne and his trip to the British Museum.  I thought this was really interesting.  It was fascinating.  Can you share that, Jeff?  Yeah.  Picking it up on that same page, other romantics shared this distaste for the  slavish imitation of classical works.  While at the British Museum one day, Nathaniel Hawthorne could wish that, quote,  the Elgin marbles and the freezes of the Parthenon were all burnt into lime.  What a crazed man!  Yes, no. He comes around.  I know, but why would he say that?  I dropped the book when I read that.  Why is he desire the destruction of beautiful antics?  Yeah. Well, Richard continues.  He explained, we have not time in our earthly existence to appreciate what is warm with life  and immediately around us yet we heap up all these old shells out of which human life  has long emerged.  Yeah, that is a kind of strange false dichotomy.  Right?  Yeah.  Every time I've been to the British Museum, I have enjoyed the experience  with a friend or family member.  It's not, you know, lifelessness versus warmth.  Right?  You see these beautiful statues and together you stand in awe.  Indeed.  Then you go have fish and chips and talk about it.  Exactly.  It's very human.  Exactly right.  So I understand, maybe I'm just not an artist like Hawthorne  and he feels constrained by the admiration of the form.  Instead of people, I don't know, dedicating themselves to new art.  I guess so.  I throw out this chapter and certainly here I kind of saw that very,  you know, American architecture type of the Maverick.  Right.  And it's this idea that everything has to be new.  Right.  It has to be different.  Right.  And I'm here.  I hear I was kind of hearing that Hawthorne's voice is kind of like a hippie,  like you're living in the past, man.  Have you read any Hawthorne?  Uh, I know I have.  I'm just a little bit of a scarlet letter.  Yeah.  I hate it.  High school.  Yes.  Um, some of the short stories I liked.  Um, but the Tanglewood Tales, which you'll talk about later,  is all about classical themes, including mitas and so forth.  Right.  I tried to read the House of the Seven Gables.  God's unreadable.  Right.  It's like, I don't know.  The book of the endless dictionary.  Right.  Hawthorne is just constantly showing off the expansiveness of his vocabulary.  Right.  I remember what's traveling the Northeast and a friend of with a local took me to see the  House of the Seven Gables.  It's a real thing.  It's a real thing.  And I went there and I counted them and they weren't indeed seven, but that was about.  Then did you get some fish and chips?  We got some, some, some, we got some lob stuff.  Okay.  Because it's in New England.  New England.  So then I'll share with us Jeff the parenthesis about how Hawthorne came around.  So, Richard, on a later visit, Hawthorne not only repent.  of his desire to pulverize the only animals.  But even doubted whether such an act could achieve its purpose.  Oh, really?  Since quote, the grace and nobility  seemed so deep in them as the very heart of the stone.  Finally.  Finally, Nate.  Exactly.  Right?  So it took him two bull trips across the Atlantic.  Yeah, you couldn't just take a slight to Heathrow  and take the tube to British Museum.  Exactly.  It could be a huge effort.  A huge effort.  Well, I'm glad that Nate came around.  I am glad to.  Then we move on to RWE.  RWE Ralph Waldo Emerson.  And his famous essay, Self Reliance.  What does he have to say about the?  Why don't you pick that up?  Why don't you be that?  Sure.  So this is the bottom of 123 in the top of 124.  Richard writes, Ralph Waldo Emerson,  in his famous essay, Self Reliance,  repudiated the worship of the ancients and of other past heroes.  He wrote, quote,  The roses under my window make no reference to former roses or to better ones.  They are what they are.  You're chuckling already.  I kind of like that actually.  You do.  I'd like to attack it in a minute.  They exist with God today.  That which each can do best.  None but his maker can teach him.  Shakespeare will never be made by the study of Shakespeare.  For Emerson, the key to genius was to listen to one's own inner voice,  which constituted one's connection with God,  rather than modeling oneself on anyone else, however, esteemed.  So Jeff, tell me what you like about the roses?  Well, I mean, I just like it as a visual metaphor.  I don't agree with Emerson and what all to me,  what he's trying to say there.  Shakespeare will never be made by the study of Shakespeare.  A lot of stuff strikes me as it reminds me a lot of what in my religion's  got to be teach by Buddhism.  The only thing that matters is the here and now.  Can't control the past.  All true.  All true.  Right.  But the focus on being kind of the standout,  individual unique voice here.  Right.  It just goes too far.  Right.  I would say if there is going to be a next Shakespeare,  my sense is that next Shakespeare should probably have some familiarity with  Shakespeare.  Right.  It's also just kind of false, isn't it?  The roses under my window make no reference to former roses?  Of course they do.  Of course they do.  Of course they do.  Of course they do.  Of course they do.  Of course they do.  Yeah.  Through whatever kind of generation roses go through.  Yeah.  I don't understand that.  I guess only when you have a high degree of artistic development, can you,  what's the word I'm looking for, look down upon the way that you got there?  Right.  Pull the ladder up once you're in the fortress so that others can't climb up behind you.  I guess so.  It strikes me to it.  I don't really quite understand where this, all two and where this  petulance comes from, right?  Is it just comes with this desire to be just so starkly different that we are not the,  we are not the authors, the poets of the past.  We are forging our own pattern.  Is that really just what it's about here?  I guess.  Because that's, it strikes me so emotional rather than, you know, in an argument that really  holds together.  Right.  Well, let's drag in John Adams here for just a minute before we go on to the next section.  Okay.  Next open paragraph and because you read a little bit of that, please, where he talks about  John Adams lecturing his son.  Yeah.  Yes, in their condemnation of slaveishness, the romantics were hardly alone.  Even John Adams had paused in the midst of lecturing John Quincy on the importance of studying  the classics to warn his eldest son.  Quote, these great masters of antiquity, you must sooner or later be able to judge critically,  but you must never imitate them, study nature and write accordingly.  And you will resemble them, but it is nature, not the ancients that you are to imitate  and copy.  Yeah.  I mean, it sounds very dawatt.  It does.  It's a, it's a revocation of any kind of sense of the value of education of what you can learn  by the imitation of what others have done.  It doesn't work in music.  It doesn't work in architecture.  It doesn't work in sports and games like chess and so forth.  Now somebody listening might say, Dave, you know, you're really being narrow minded  and hardheaded.  Can't you grasp that what Adams or Emerson is after is a kind of striving for, you know,  the essence of the activity?  Yeah.  My answer is no.  Yeah.  I can't grasp that.  I don't really understand the, the, the, the, the, the, the, the, the, the, the, the  excellence like you said.  Right.  And even so it is nature that you are to imitate and copy.  What does that even mean?  I think it means that individuals like Sophocles, your rippities, Aristophanes, the Greek  masters, you know, praxitelies and so forth.  What they did was, what they accomplished was by listening carefully to some kind of nature  speaking to them from their subject matter.  And I agree that that's probably true.  human nature, the divine that spread throughout the universe.  Yeah.  Although I'm not a pantheist, obviously.  Right.  But if we're going to try to do that, we can't just kind of sit around and wait for inspiration  to hit.  Don't we have to imitate what others have done and then try?  Yeah.  I totally agree with that.  I mean, I think I would also see here too is Rashard in the chapter talks a lot about simplicity,  right?  Right.  And that, that it being kind of the heart of, oh, kind of a romantic view of the world.  It's the scripture that calls to mind is when Jesus says, you know, don't worry about  your life.  You look at the birds and look at the flowers.  Yeah, the lilies of the field.  Right.  There's kind of a natural kind of simplicity and beauty and harmony in nature.  Sure.  And with all of our striving, right, we don't want to.  We can miss that for sure.  Yes.  Right.  But Christ was talking to his disciples about not worrying too much about where their food  and clothing was coming from.  Right.  And the individuals who wanted to write massive epics.  Right.  You're true enough.  That would.  survive millennia. Right. Imagine a virtual word to take this advice. Yeah. Yeah.  When find a little point, Jeff, before we get to the next section, yeah.  Richard mentions this individual George Fitzhugh, whom he labels a thorough opponent of  romanticism and as fervent a supporter of the classics as you could find. Then he says,  like Fitzhugh, this page 125, who used classical examples to argue against quote,  classical laws, Emerson quoted ancient authorities in support of his emphasis on the enjoyment  of the present. As early as 1820, he quoted Horace, a poet who enjoyed the present as much as anyone.  Right. Carpe diem quote, nor in naive neglect, sweet love nor dances, while life is still in its  bloom and crabbed age is far away. End quote, the past was not to be studied for its own sake. This is  Emerson, channeling Horace. But for the benefit of the present, Emerson wrote quote,  the use of literature is to afford us a platform, once we may command a view of our present life,  a purchase by which we may move it. We fill ourselves with ancient learning, install ourselves  the best we can in Greek, in Punic, in Roman houses, only that we may wisely or see French,  English, and American houses and modes of living. End quote. This is why I don't like Emerson.  Because he undercut the argument that he just made exactly. But also it's a completely  instrumentalized view of literature. It seems to me, right, study literature so that you can,  I don't know, get more enjoyment out of your study of French and English and American houses and  modes of living. That doesn't seem honestly charitable. No, no, I agree. I can't remember somebody  through Keats Under the Bus on a previous page. Keats also romantic, but he also,  truth is beauty, beauty is truth. He saw kind of literature and poetry has its own value and  wonder, whereas Emerson would say, well, how's it going to help me build this house?  Right. Right. Yeah, and not in the sense of measuring and such, but build a great house.  What a great house. Yeah. Who cares? Right. The final quote here. Yes. Emerson saw no irony  in quoting a line from Avid in the original Latin that translates as quote,  let the ancient times delight other folk. I congratulate myself that I was not born till now.  Now, of course, end quote, Avid is saying that facetiously. Yeah.  I congratulate myself. My big accomplishment was that I wasn't born till now.  Does Emerson miss the humor? I think so.  Do you really know of Emerson? I think that, yeah, I probably, he's taking this at face value.  I don't think there's an undercurrent of, he's not smirking. All right. So I could be wrong.  Okay. Well, speaking of smirking undercurrents, it's time for the end. Do it.  This episode of Aud  is brought to you by the wonderful folks at Hackett publishing. These guys have been with our humble  little podcast since the very beginning we floated the idea out there. Hey, would you want to get behind  us? Right. The idea, because I think our philosophy is line up. And like we try to do with this podcast,  Hackett is a company that is keeping the flame alive. And since 1970, they have been doing just that  with their attractive, affordable, airy-dite translations and publications of all these wonderful  books, do yourself a favor and you know, flesh out your own library with books from this,  this, this great, did you say flesh out? I did flesh out. I'm glad that you said that. A lot of  people say flesh out. Flush. You heard people say that is a flesh it out. They mean flesh out. But I  don't think they really want to flesh out their own. No, no, no, but scaring things out,  got to the bushes or just deluging them with a lot of water. Right. So I went to Hackett  publishing dot com. Yes, you were talking so eloquently. And I see on the landing page three column  is a Asian studies. Yeah, readings in classical Chinese philosophy and introduction to utilitarianism.  Okay. Should be a useful book from theory to practice. And a new translation of the heroides  are Guy Avid by Stan Lombardo, introduction and Malina McClure with an introduction by Terrell Well.  Yeah, Stan the man he never stops. He never stops. Then we have so much other great stuff,  including Aristotle's like sister to we have Kierkegaard's fear and trembling,  something called Kudrune. Do you know? I don't know. I think it's maybe some Buddhist or Hindu  instruction. Then we have the whole lingua latina series. Yeah, so much great stuff on the website  of Hackett publishing. Right. And if you go to that website Hackett publishing dot com that's H-A-C-K-E-T-T publishing  dot com, you can see this for yourself. You'll see how affordable these books are and the wide  ranging of titles that are that are available there. So do yourself a favor. Go to that website,  find the books that you want. Put them in a little grocery basket. And if you use this coupon code  AN2025 as AN is an odd-nousion plus the current year, Dave, that will get them to 20% off.  Yes. So not only are the books affordable, they just became more affordable, 20% off and you're going  to get free shipping. Yes. Right. Now does Hackett have any competitors Jeff? Yes. I was just reading  about this today. Yeah. Really? Yes. Have you heard of this newcomer tracket? Tracket publishing.  You know exactly. It is tracket and what do they do? Well, you order books from them. Okay.  And then you will get texts and updates and emails that will cost it to you where the book is.  They will track it. Okay. But the catch is that the book never actually. The volume never arrives.  So the whole joy is just knowing that it's on its own. It's out there and it's somewhere.  Correct. So that's tracket public tracket public. T-R-A-C-K-E-T-T. Yes, exactly. But don't go there.  I wouldn't go there. Go to Hackett because Hackett would never do that to you.  with them.  No, they would never do that.  Right.  Now, free shipping, the book will actually arrive.  Yes.  So do yourself a favor.  Check out heck at publishing.com today.  This episode of ad nauseum is also brought to you by the great folks at ratio coffee.  My friend Mark Hill, wed the American entra Brunur tried to up everybody's coffee game  and he succeeded with the ratio eight.  The ratio six and now the ratio four full fleet.  Jeff, during your travels in Greece, did you imbibe from the coffee bean?  I did sadly from the in-house hotel machine.  It was the...  That's a gruel.  It was a marzipad.  There are chunks of coffee.  Yes, it was awful.  And so every day, I mean, I love traveling in Greece.  But one of the downsides was being away from my ratio eight.  Back home.  That was a unique kind of suffering.  It was, right.  But now that I'm back, I've got the ratio eight at home.  I have in the past used the ratio six and another wonderful machine and now in my office.  I'm the ratio four.  Yeah, my coffee game is, I think, at its peak.  Yes, at its peak.  Yep.  So I was in South Africa, thanks for asking.  And the coffee there was pretty good.  Yeah.  Because one of the most popular places to get coffee was a place called boot legger.  Okay.  Boot legger.  You know what boot leggers did during prohibition, right?  Yeah, they sold hooch.  Yes, indeed.  Ellegally.  Bathtub gin.  That's right.  Now, the coffee at boot legger was very good, but I couldn't really enjoy it because the  the name of the store sounds too much like a boot liquor.  Ah, okay.  That got in the way.  Yes.  Okay.  Homophone, it ruined it, right?  Boot liquor.  Who wants to drink coffee at a place called boot liquor?  Right.  Exactly.  It's just a bunch of sycophants.  It's offering around, right.  And so I was very happy to get back to the good old US of A were in my kitchen on the  countertop is the ratio four.  The ratio four.  And it was excellent.  That's actually.  It's perfect for you because you're the only one in your family.  Right.  Yeah.  But during the colloquium, which is coming up pretty soon, we're going to bust out the  ratio eight again, the Millennium Falcon of coffee makers.  Indeed.  And everyone's going to enjoy its goodness.  So listener, don't go to the bean and bagalized barnery.  No.  Don't go to fire down below manufacturer of scorch pads instead and don't get those  burek, right?  Right.  The marsupods.  A little joey and every sip.  What should they do instead?  They should go to ratio coffee.com.  Listener, if you want up your coffee game, it's a little bit.  I mean, this is not cheap stuff.  It's attainable.  But why would you want to buy cheap stuff?  Exactly.  For the daily ritual.  So if you want, if you're playing the long game, get yourself one of these machines,  the ratio eight of your kitchen countertop, the ratio four, if you're the only person that  drinks coffee in your house or something.  For his ideal for the office, you cannot go wrong.  Not Dak and Blacker.  No.  Not Masu coffee.  No, no, no, but the ratio four.  The ratio four.  And they should go to ratio coffee.com slash ad nauseum.  Yes.  And then they need to enter a coupon code.  Jeff.  And what is that coupon code?  Sorry.  A N ratio ad nauseum.  Right?  No.  No, I think that wrong.  It's a N ratio.  No, 2025.  Sorry.  Yes.  It's like we said, it's been a while.  It has been a while.  Then they get a huge discount off their order.  Indeed.  Check it out.  This episode also brought to you by Della Chilpka Art.  Ready for art that truly speaks to your story?  Meet Della, a Tucson-based oil painter who captures the people  places and moments you cherish with breathtaking detail.  She showcased her work in multiple galleries, illustrated books,  and is often commissioned for standout projects.  You can see her work current works for sale at her website,  DellaChilpka.art.  That's D-E-L-L-A-C-H-E-L-P-K-A.art.  And to find your inspiration, visit there.  Use the coupon code, Appellis.  Appellis.  Yes.  What is that?  One of the most famous, if not the most famous,  artist from Greco-Roman antiquity.  All right.  Peter.  And if you use that coupon code, Appellis, that's APELES,  you will receive a 10% discount on anything you might order  from Della.  Yes.  So check out her great works of art.  Visit the website.  Look around, see something you like,  and take advantage of this wonderful discount we're offering.  Jaff, as we resume our discussion of this fascinating chapter.  Let's skip ahead to page 128.  Let's do it.  Here we're talking about the transcendentalists' interest  in Neoplatonism and Stoicism.  Says, Rishard in the middle of that page,  as early as 1820, in his Bowden Prize winning essay  at Harvard, the character of Socrates, Emerson  praised the Athenian philosopher as found  in the dialogues of Plato, Emerson asserted, quote,  regard this character of Socrates,  and we shall be inclined to wonder  that men without revelation, merely by the light of reason  and nature could set forth a model of moral perfection,  which the wise in any age would do well to imitate.  This patriotic philosopher extended his wisdom  to the body of the people in the first city in the world,  and communicated to his disciples not a mysterious  or higher-roglyphical scripture  to amuse the learned and all the ignorant,  but practical rules of life adapted immediately  to their condition, and little infected  with the dogmas of the age, end quote.  All right, so why do we have Socrates laid out  by Emerson as someone unique and individual,  doing something different.  He's a man of the moment.  We also have that element that we were just talking about  that it's not mysticism, it's not something kind of hidden  and gnostic, it's very practical.  So both of those things too.  I think that, I mean, there's a depth of truth to that too,  but I think he also-  In his characterization of Socrates, you're saying.  Yeah, sure.  But, I mean, if you read the Mino,  there are elaborate geometrical proofs.  Emerson doesn't seem so excited about that.  No, no, and by and large,  it seems that these romantics  are much more interesting.  in kind of what these men represent, rather than what,  what particularly they are saying or teaching.  Mm.  All right, moving ahead.  So at the top, near the top of page 131,  Rashad writes, Henry David Thoreau and Margaret Fuller,  other leading transcendentalist,  shared Emerson's Platonic idealism.  Thoreau wrote, but there is only necessary,  a moment sanity and sound sense to teach us  that there is a nature beyond the ordinary.  We live on the outskirts of that region.  Is not nature rightly read that of which she is commonly  taken to be the symbol merely.  I am not without hope that we may,  even here and now, obtain some accurate information  concerning that other world,  which the instinct of mankind has so long predicted.  Interesting.  So here we're starting to get into,  well, this is Thoreau.  This is the realm of the forms.  The realms of the forms, exactly right.  And so this is kind of mystical pleatidism.  Yes.  So to continue,  in Thoreau's imagination, Ancient Greece was the closest,  earthly approximation to Plato's ideal world of the forms.  He found Aristotle to rationalist and materialist.  We get a brief mention of Margaret Fuller,  whom we're gonna discuss in a moment,  but let's go to the next page, Jeff,  and that interesting part about Henry David Thoreau  and civil disobedience.  Right.  It shouldn't shock anybody that I figure like Antigonee  was very much beloved by someone like Thoreau.  And by these romantics,  you know, someone who's kind of shaking their fist  at the powers that beat.  At the establishment.  Right.  So on page 133, Richard writes,  like many early American believers in natural law,  Thoreau was influenced as much by Sophocles Antigonee,  as by the Stoics.  In the play, Antigonee defies the king's edict  against burying her brother,  who must be buried in his souls to find rest.  In his highly influential letters from a Pennsylvania farmer,  the patriot John Dickinson had quoted Antigonee's  declaration of natural law and support  of his own resistance to parliamentary taxes.  Quote, I could never think a mortal's law of power  or strength sufficient to abrogate the unwritten law,  divine immutable eternal, not like those of yesterday,  but made airtime began.  So I think you can see in this,  I'll show a lot of the ideals of the American Revolution, right?  Definitely.  Stick it to King George,  continuing with Richard less than a century later,  Thoreau like Dickinson learned from Antigonee's discourse  on natural law and her resultant resistance to injustice  that he must give his own allegiance to natural law  rather than to human statutes.  While writing his essay on resistance to civil government,  would you, would you, would you force to read that?  No, I don't think I've read it.  I had to read in high school.  Yeah. Okay.  While writing that essay, Thoreau returned to Antigonee,  which he had read as an undergraduate  and translated passages concerning the heroine's  defiance of civil authority.  Thoreau's more famous on civil disobedience.  That's the one that's more famous essay.  Yes.  Advicated resistance to the statues  that conflicted with natural law  as determined by the individual conscience.  In turn, there was essay inspired Mohanas Gandhi,  Martin Luther King Jr.,  and other modern advocates of civil disobedience.  I see, right?  So there's that kind of that non-conformist  in the surface of justice.  Which I think is probably more in keeping  with the general American spirit  than what the founders were doing.  Yeah.  So here I'm gonna tip my hand a little bit.  I like the founders more in terms of their view  of the classics.  It's not slavish to imitate, despite what John Adams said.  We wanna imitate the great things  of the men of the past and the women,  but the romantics are probably in their pragmatism  a lot closer to the general American spirit.  Yeah.  No, I would agree with that too.  And I think, I think Sophocles would disagree  with Thoreau's reading of Antigonee.  Yes.  For sure.  So Antigonee has become already made  a feminist heroine.  Yeah.  There's something wrong with that.  The classes are there to be reinterpreted and retold.  But I always go back to that.  If you're gonna be a hero or a heroine in a Sophocles play,  you have to be alive at the end of it.  That's right.  And so I don't think we've seen her.  And you can't be a commoner.  You have to be descended from royals.  Exactly.  From the gods.  Exactly.  So to take the theology out of the play,  is to do an injustice.  Indeed.  To Sophocles main point.  I indeed.  I see what Thoreau's doing here.  It's just kind of at odds with what I mean.  Right.  It's original intent.  But we're crusty old classes.  Yes.  That's what we would think.  Keeping ahead to page 138, let's talk about  Margaret Fuller.  Yes.  A fascinating individual.  About whom I previously knew nothing.  Yeah, it's about you.  Same here.  I thought this was really quite striking.  Yes.  Do you want to pick it up in the middle there from 1839 to 1844?  Yes.  From 1839 to 1844, Fuller organized 10 series of conversations  at a bookstore with women who paid $20 to hear her speak  about many different studies.  Now $20.  That's a lot of money in 1839.  $500 is something seriously.  Right.  I mean, we learned above this that you know, Fuller,  I think was her father, her giver, kind of a pile of books.  Right.  And she was particularly enamored with Avid.  Yes.  I wish we could have her on the podcast, right?  Indeed.  And some Avid vignettes.  Yes.  Continuing on her observations on classical mythology  were considered so interesting that she was asked to repeat  them for men.  In these conversations, Fuller expressed the opinion  that some of the gods were representations of human faculties  and attributes.  Apollo was an origination power, mercury  and executive power.  Apollo was the light side of genius.  Baca's its warm side.  Does genius have a light and a warm side?  Is it like the McD LT, for example, of the ancient past?  No, you are going way back.  That's a deep cut to the 80s, right?  The McDonald's hamburger.  McDonald's hamburger.  Right.  Separated the patty from the lettuce  until the very last moment.  Exactly.  To keep the hot side hot.  And the cool side cool.  Exactly.  Yes.  I remember those awful advertisements.  So genius is like that.  Yeah.  I suppose it has a light side and a warm side.  I think not a dark side and a cold side.  I think, well, I was reading this.  It strikes me as that she anticipates.  I think she anticipates Nietzsche.  Oh, yes.  The Apollonian and the Dionysian.  For sure.  I hear this is put too much to it's much too squishy for me, but Apollo being you know the rational side and  Boccas or Dionysus being though the wildness in nature and culture that a kind of push and pull against each other right?  Yeah, I like the traditional Christian interpretation of the gods, which is that they were real persons  They were not representations of forces or impulses  But I guess in the enlightenment time in which these individuals worked that was not an option. Yeah. Yeah  Yeah, exactly. Yeah. I mean I want to continue. Sorry to know. Yeah, no. I mean I mean I think this not only in his or his niche  But I think this is very much true of all the way a lot of  Modern scholars. Of course. Yeah, yeah  So Apollo was the light side of genius Boccas's warm side. Yeah  Can you once you continue their day? Yeah, the story of psyche was like that of Adam and Eve and which suffering led to purification and redemption  Minerva a model for women was wisdom which sprang from the intelligent creative power  Just as Minerva had sprung from the head of Jupiter  Raya represented productive energy which rescued Jupiter who represented indomitable will from Saturn  Who represented time? It's very elaborate. Yes. Do you know the female form of indomitable will always lost when she opposed Jupiter the superior  Male form Jupiter's defeat of the titans represented the victory of the will over the low and sensual passions  This is almost like Freud or something. It's very  It dissipates a lot of that too. Yeah, right though Vulcan who represented mechanic art was powerful  He was not comparable to the perfect wisdom of Minerva which sprang ready armed from the masculine will  Fuller concluded that while quote the age of Greece was an age of poetry  The 19th century was an analytical age a fair assessment considering her own reduction of Greek mythology to a set of universal abstractions  Richard nails it. Yeah, I don't want to read stories that are a reduction to a set of universal abstractions, right?  Right, right. Do you I don't know that appealing? No, I found it. I want to read all of it as these are great stories, right?  Yeah, that was really interesting. I mean, Richard  I think he talks about it with Fuller that you know, she did not have  a lot of time for the  Contemporary Christianity of her days. She kind of kind of definitely not cold and  And it kind of keeps you arms linked and she was much more drawn to kind of the wildness and the chaos  Right of these of these stories and found in it perhaps a better explanation of of human nature  So she wrote a book called woman in the 19th century in 1845  This is on page 139 and she claimed that the ancients as Richard had represented the two aspects of women's nature as  Muse and Minerva  Mm-hmm. Muse was the traditional stereotype of women inspiring man to create while not herself creating  Minerva partook of traditionally masculine qualities including rationality and independence. Mm-hmm. So I think you see that  Kind of reflective of kind of an early  Confeminist that's cool. But happy right so and and seeing kind of I mean it doesn't surprise me that she would be drawn to Athena to Minerva as  As a as a powerful symbol you know someone who has a foot in both kind of the traditional domestic world of the woman and the adventurer warrior  Right world of the man on both and say well  The feminine can embody both of those but like with Emerson. It's once again the instrumentalization of education  It has to serve some kind of purpose. Yes. I don't I don't really like that  What about Fuller's tragic end on the bottom of 139? This is fascinating. Yes  So Richard writes that Fuller died a tragic death when her ship returning from Rome was sunk by her king  Just a little bit of background. I I did some more background reading about her and so  she moved to Italy and  Living her a long time. She had married an Italian and they had a son Angelo and all three of them were coming back to the states and  On their Concord or  I don't know what the name of the ship was. I mean that plane the plane would no this is 18  Okay, so pre-concored. Okay. Yeah  But the ship sunk by a hurricane  I also learned that it was like not in the middle of the Atlantic  But it actually crashed on a sandbar a hundred yards from fire island  Which is just south of Long Island, New York. So this is this was close. It was close and many people were able to jump up and swim for it  But as Rashard here picks it up  Unfortunately the history of the Roman Republic that filler had just completed parrot wither  She was swept by a wave over the over the rails along with her husband and her two-year-old son that they all died  So she had written a history of the Roman Republic. Yes, it sank when the boat went down. It was it  All right, so this is one of these  I was doing some reading about this to this is one of these things that many scholars wish that it's a huge loss  Sure would love to have seen what a very curious. She would have exactly say yeah  Thomas Carlile wrote to Emerson that her life Fuller's life was quote as wild as the prophecy of a civil the Roman  Oracle her focus on mythology demonstrated how the expansion of classical interest beyond political history and theory  The great preoccupations of the founders age to encompass drama and poetry  To give politically disenfranchised women and others focused on self-improvement a greater connection to the classics than it had been possible in the  18th century so there is there's kind of a democratic  Expansion right of the franchise via the classics via the classics right and while I I think it's great that the franchise was expanded  And I would probably share some of Fuller's  General feminist interests not all the way, but you know, I'm a man of the late 20th early 21st century  I guess it's not early 21st anymore a quarter of the way. Yeah, I know it's crazy  Still I object to Fuller not for those things  But for the instrumentalization of the stories right read it for his own sake right exactly that's the drum  I'm beating I think yeah, I I guess maybe with the transcendentalist kind of more mystical  interest we might get a kind of a taste of of kind of in appreciation of the  classics for their own sake okay but at time and time again Rishar comes  around to is like well you know how can it serve the present moment and I  with you when you reduce it just to kind of like a a handbook right a checklist  here's the impulse to power here's the impulse to passion here's the impulse  of genius it loses its magic because that's not how the I don't think that is  how the ancient authors saw it I agree yeah we have to talk a little bit about  the marble fawn okay let's talk about it Nathaniel Hawthorne this is pages  140 and 141 okay says Rishard the direct product of Hawthorne's tour of Italy in  the late 1850s was a work entitled the marble fawn published in 1860  subtitle the transformation in a clear reference to Avids metamorphoses  the protagonist Donatello is treated half as a mythical being half as a human  somehow descended from gods the villain meets his end in an  apt way being hurled from the tarpan rock like the Roman traders of old  after Donatello commits this act he is abandoned by all of his friends except  for the owl Athena's companion which symbolizes Donatello's newfound wisdom  gained through sin and suffering okay so this is a very popular and successful  book that Hawthorne wrote I don't think anybody reads it today never heard of  it did you never heard of it I never heard of it before this chapter no I mean it  sounds fascinating yes it does yeah it sounds a little bit like Lewis's famous  do we have faces with yeah Cupid and psyche you know a modern  retelling of an ancient myth yes in the middle of page 141 Jeff could you  pick it up where Rishard is talking about the marble fawn and the classical  world yes Rishard writes it is indicative of the hold of the classical world on  antebellum Americans that the marble fawn not the scarlet letter or any of  Hawthorne's other stories set in the American past was the most commercially and  critically successful of his books that's astounding isn't it nobody knows its name  that's crazy continuing for decades American visitors to Rome brought a  copy of the novel with them relishing its beautiful descriptions of the sights and  sounds of the eternal city Hawthorne himself wrote in the preface to the  mobile fawn quote in rewriting these volumes the author was somewhat  surprised to see the extent to which he had introduced descriptions of various  Italian objects antique pictorial and statue West yet these things fuel the  mind everywhere in Italy and especially in Rome and cannot easily be kept from  flowing out upon the page when one writes freely and was self enjoyment and  again while reproducing the book with a northern blast with howling in my ears  the complete change of scene made these Italian reminiscence shines so  vividly that I could not find in my heart to cancel them so it's a scapism  kind of yes yeah that so there is Hawthorne not trying to set fire to the  elgan marbles and so forth right but actually appreciating something about the  beauties of Italy indeed that's why I love to get it to read about the marble  fawn he didn't just come around and a second visit to the British Museum he  kind of he he said okay I was wrong about that and incorporates that kind of  that love it is later work well maybe someday we'll do an episode on the  marble fawn yeah or at least on the marble rye perhaps I saw what you did  all right all right Dave we you had mentioned right Melville early correct let's  get down to a little bit about Melville and the classics yes because unlike you I  liked the novel we did all right page 142 it was in Moby Dick 1851 perhaps  the greatest of all American novels really well less than 500 copies sold in  his lifetime yeah that's right he was not appreciated no yeah continuing that  Melville moved beyond the use of classical mythology for descriptive purposes to  rely on supine for tragic elevation and structure meditating deeply on the  masterpieces of the Athenian stage as well as on Shakespearean dramas that  his edition of Shakespeare compared to the Greek tragedies Melville learned  that tragedy was based on three elements the greatness of the hero the  seriousness of his crime and the torment of his suffering each of these  elements Melville employed successfully in Moby Dick his ahab was based  partly on Prometheus so are you a little more interested in a melod bit more  curious you're into rosy piqued as they say pickwood it mildly right I  don't know I'm gonna be running out to kind of pick up a copy of Moby Dick and  write out into it but um to whale of it tell man you had to do right but yes I  would be much more interested to look at Moby Dick through that particular lens  yes yeah so I mean that's all we're gonna say about Melville and Moby Dick for now  perhaps in a future episode we can plumb the depths you might say yeah of that  that's your novel I'm open to that classical references yes okay don't call me  here ish Mel right that's right and now we skip to the end and plutarch a big  helping of plutarch before we finish up this episode all right so the chapter  ends looking at at plutarch and and Richard writes that plutarch was one of  Ralph Waldo Emerson's favorite authors Emerson wrote quote we cannot  read plutarch without a tingling of the blood and called the bag of for the  elixir of Greece and Rome once a odd metaphors very odd ever plutarch I never  felt my blood tingling no like plutarch he thought of plutarch's heroes when  traveling in Sicily he made certain that plutarch lives was on the reading list  of a young a hillman Simpson Homer no hillman hillman Simpson whose  education emisser finance and supervise supervise following the death of  hillman's father in 1837 Emerson wrote plutarch I esteem a greater benefactor  than Aristotle to him we owe the brassidocis the deons the Phocean's and the  other men all right I didn't I this is also new to me I didn't know how how large  plutarch right in this era and and for these particular well he's a great story  teller yeah and he's a biographer and he compares all these men in the parallel  lives but also the morality right a Richard will spend a lot of time talking about  plutarch's morality which is again is one of those works relative  unknown. Right. We should also mention perhaps before we wrap it up that Plutarch, this is page 149,  contributed more than any other author, ancient or modern to the great man theory. Yes, the  belief that individual heroes were the primary determinant of the course of history,  a theory prevalent during the Antebellum period. It is no accident that when Emerson wrote history,  he focused on important individuals and entitled the book, Representative Men.  Biographies of George Washington and imitation of Plutarch,  ranging in authorship from John Marshall to person Weems,  abounded as did biographies of other great men. So I guess the romantics, they like that connection  to nature, the sense of the isolated individual defying authority, going against the establishment,  not conforming. Right. And they get that from Plutarch. Exactly. So history is driven by the non-conformist.  Yes. Right. You agree with that assessment? I think there's definitely some truth to that.  Okay. Absolutely. I think that there are, you know, the example that I have in use in class when I  talk about, you know, that the release of history is, you know, Constantine at the Milvian Bridge,  right? There's a moment where the world changes forever through the actions and through the  interpretations of one man. That's true. Right. So page 151, the final paragraph, Jeff, can you read  just that first sentence or maybe the first two sentences to wrap it up? Yes. Richard closes us out.  While the romantics admiration for Plutarch and interest in classical philosophy,  united them with the founder's generation, their deep love for an extensive use of the emotional  and mystical elements of classical mythology separated them from the founders. Their application  of the ancient myths of Greece to the new realities of American life produced a vibrant national  that serve the aesthetic and emotional needs of antebellum Americans. That's a beautiful way to sum  it up. Yeah. What do you think? Yeah. Well, I mean, I, I definitely agree. I think that I'm  fascinated by that question of, you know, under what kind of system of governments, you know, can  create literature. Right. Be produced. And we didn't even talk about the metachies. Exactly. Right. So  I think that's an open question, but your shared seems to think that to a large degree,  the romantics were right. Yes. Under kind of a democratic experiment. Great literature can be  produced. They figured out a way to reinterpret the classics very differently than the founding  generation and give Americans. I don't know a lot of literature that today, nobody reads.  Other than Scarlet Letter, uh, leaves of grass, Billy bud, maybe another Melville novel.  Yeah. Bits of uh, Moby Dick are a sign. Did you read Moby Dick anymore?  Wow, I did. Okay. Okay. So I'm nobody. Um, what else? Nobody knows Margaret Fuller. They still read,  the row for his essay on civil disobedience. And I mean, Poe is mentioned here. We didn't really  go into it. But, um, you know, um, Poe's a great author. Yeah, he strikes me as classical in his interests,  not like these other guys. Right. What do I know? Yeah. Yeah. Yeah. Good stuff. But, we've got to get  out of here. We do. And so, uh, before we go, Dave, can you tell us a little bit about, um, if,  somebody out there wants to read, right? Learn how to read some Latin or Greek for the fun of it.  You can't for some political pragmatic reasons. Exactly. Right. You can help them. I can help them.  They should go to latinperdiam.com. Check out one of my courses. I have Latin courses that take you  from the beginning. I have advanced classes and master classes. If you want to study, uh,  Cicero, John Calvin, theater, Baysa, Erasmus, any of these guys, you can take one of my  courses for under a hundred bucks. And there's no pressure of being called on being put on the spot  and you get access to all my expertise as much as you want. Maybe more than you want. You can also  go to the YouTube channel and check out more than 2300 short free instructional videos on both  Greek and Latin. If you like something on the webpage, you want to sign up for a course, maybe  Moss method for Greek use this coupon code 10 plus one zero PL US and that'll get you 10% off  anything on the site. Excellent. Jeff, we have some people to thank as always. Yes, uh,  Mishka, our intrepid engineer who turns this around so quickly and makes a sound better than we are.  That's right. Always big thanks to her. Uh, are these wonderful musicians that screaming guitar.  That's Mr. Jeff sheets sheets. Yeah, wonderful song thrill seeker. Yeah, right, which introduces  the episode and closes it out. The thrill is learning and enjoying great literature. Indeed.  Yes. And then also Ken Tamplin to who provides the bumper music that you also hear. That's right,  on both sides of the of the ads. Hey, if you want to get a mention, if you want to shout out,  if you want to, uh, suggest an episode, you have a correction, a critique. Don't hesitate to  to write us a note. You can contact Dave. Dave at ad nauseam.com. Don't forget the V or Jeff at ad nauseam.com.  Don't forget the V. We poked a little fun at Tom in the beginning for the banter, but he was right.  Yeah, he was right. We can learn from our audience. So please send us your comments, your critiques,  a little bit of praise. Now, and then is okay to we like that. You know what our, uh, our email  address is Jeff at ad nauseam.com. Don't forget the V. Jeff, what is coming up next week? Well,  we had promised a while back now. That's right. Third episode talking about, um, the bet,  what's the best Greek textbooks? So we want to fulfill that promise. And we'll pick that up in our  next episode. We've got, uh, at least a couple more intro Greek texts to discuss this talk about  Master Nard and off and Nazi. Yes. And after that, we're looking at some wonderful episodes on  how the Greeks built cities. Maybe something from apologies, Socrates, library of Alexandria,  and then your favorite. What are we doing? I can reach. I'm a hoo. Oh, yes, Maroon MCU.  MCU, the maroon cinematic universe. So we got to get back to him. And we can't miss that.  What is this? I'm looking forward to it, it to it all. All right. Uh, and Dave, I believe you  have our gustatory parting shot.  Yes, and I don't have any particular enthusiasm for this GPS, this gustatory parting shot.  This comes from someone named Anthony T. Hinks.  Yes.  And the quote is just three words.  Yes, and what are they?  Happy Cabbage Day.  Is it an annual thing?  I don't know.  No, I'm gonna skip it.  Thanks for listening."