Speaker A: This is Jon Batchelor. The show begins tonight in the Rocky Mountains. We Travel with Jim McTague out to see his grandchildren and his son and daughter in law going to back to back Denver Rocky games. Had a great deal to say about the baseball model that he observed. Had fun at the stadium, was well attended, almost full and then he flew back to Lancaster county, best county in Keystone State. What he saw along the way was a lot of consumption. Planes were packed. The holiday travelers at the airports, the Harrisburg airport, the Denver airport. I think he stopped at one in between transient planes. Dallas or one of the in between ports full, full airport packed and everybody packing into the overpriced franchises. Eating food. Jim said he ordered a $17 vegetable sandwich. Seventeen. He paid it. He was hungry. A lot of consumption at the baseball stadium too. And then he got home and went to Costco shopping. A lot of food. People piling their baskets. Went to diners and restaurants in the area packed. So if there's a recession, it's not going to be caused by the consumer. Though the month month statistics suggest that the consumer was cautious from March to April. We'll see. But right now Jim didn't see any caution out there. Jim McTag on the long awaited and not yet here recession. Then I turn to a conversation about Italy. Giorgio Meloni, the very popular prime minister of Italy, is understood as a Trump whisperer. Somewhere between the European union dominated by Mr. Macron of France and now Herr Merz of Germany and Mr. Starmer of London. But Georgia Maloney has a representation to Mr. Trump that is not the same as the others. And she's meeting with Mr. Macron next week to talk about European Union matters, especially the trade negotiation between Washington and the EU if it goes forward. Everything is now in turmoil because of court decisions. Then I turned to small business with my good friend Gene Marks. Small business also has uncertainty stretching all the way to Vegas, Las Vegas. The month to month traffic is down. The traffic that's up is people coming out there for events, large events. However, there is a hesitation in the housing market and that is not a good sign for the future. The Federal Reserve keeps the interest rates in a fashion to reduce inflation at a good inflation number. But still no movement from the Federal Reserve. And we had fun talking about artificial intelligence. Gene very much recommends this earpods that do instant translation. I'm going to look into it. No matter where you're standing, no matter who's talking to you in what language you don't understand. They translate simultaneous as Gene into your language. And then tells you what to say back in the language of your correspondent. Off to Bob Zimmerman Talking about SpaceX and Mr. Musk's preaching multi planetary humans and then Europa, active surface, Bob says, spotted by telescopes. Hubble probably, maybe James Webb. We've got a probe going out to Europa next couple of years to find out what's underneath that ice sheet. Bob says it looks like an Arctic ice sheet, but something comes up between the cracks. He said it was red. Don't know. Then a debate. Ronald Reagan and Donald Trump. Reagan's dealing with Japan incorporated in the 20th century. Mr. Trump dealing with China incorporated in the 21st century. Who's a free trader, who's a protectionist. What worked then? Does it work now? Two colleagues from the Civitas Institute, Marcus Witcher and David Hebert. Off to Egyptology. The Ptolemaic dynasty between the pharaohs and the Romans, the Ptolemies, you remember Alexander the Great, conquered the whole world, but especially Egypt. Lingered there for six months and died back in Persia. His empire was divided between his generals and Ptolemy was one of his favorites. He grew up with ptolemy. Ptolemy was 10 years older than Alexander. Alexander died in his early 20s. So we're not talking about graybeards here. Ptolemy founded a dynasty that was very successful in knitting together the Egyptian society and the Macedonian. The Greek society. The first three Ptolemies were builders, including the library and the lighthouse. And then came the Cleopatras, seven of them. Number three is what Toby Wilkinson and I discussed. But all of them are are colorful characters and especially Cleopatra vii, that's the Roman Cleopatra who dealt with Caesar and then Mark Anthony and then Octavian in the end. That's the second hour of two hour conversation with Egyptologist Toby Wilkinson from Cambridge. Finally, a debate about American civilization. Is it coming apart? Does it no longer exist? Did we let the sentimentalism of Rockwell substitute for a shared identity in the mid 20th century? Is the question asked by a new book by James Hunter, Democracy and Solidarity, reviewed by my correspondent Bradley Watson of Hillsdale College. And then Richard Epstein debating trade and the Constitution. The Constitution first article legislature, that's where the tariffs are assigned. Tariff is a tax. And then the Chinese Exclusion act of 1882 and its relevance because of the Trump administration intention to review and to bar ban review again the visas of Chinese national studying in the United States and working in the United States. Much more to the show. I hope you enjoy it. Thank you for listening.

