" Tim Cook goes to Jungnam High, you could call that the White House of China, and pledges to invest,  not spend invest, $275 billion over the next five years.  One, that's $55 billion a year.  The Chips Act, right, Joe Biden's flagship policy to bring chip fabrication back to America,  is $53 billion over four years.  That was called a once in the century investment.  I thought, oh, maybe what people will resonate with the connection that this is like a martial  plan, thinking that maybe the martial plan is only double the spending or triple the spending.  To have the spending, I know it sounds nuts without the context to say that Apple had a nation building  like Impact or a martial plan like Impact on China, but the numbers totally back it up.  I mean, the martial plan included Food Aid.  There's no Food Aid in the Cook Plan.  It is all about high end electronics.  The martial plan was 16 countries.  The Cook Plan is one country.  There is no hyperbably comparing this to the martial plan.  The martial plan looks like a lemonade stand versus what Apple does in China.  A warm welcome back to DeCouple.  Today, I'm joined by Patrick McGee.  He is a Canadian-born business journalist, financial times correspondent, and author of Apple and China,  the capture of the world's greatest company.  Patrick, welcome to DeCouple.  Thanks, Chris.  Happy to be here.  So you have been making the rounds, my friend.  I've seen you on the daily show, channel four.  Sounds like you're kind of 24-7 on podcast circuit right now.  I really appreciate you making the time.  Well, look, I hope it's because the book is good, but I'm all too aware that the timing of the book,  which has nothing to do with me is spectacular.  And as good as my publicist team is it's hard to rival that my chief publicist, which is Donald Trump,  literally putting iPhones, specific tariffs out into the world.  So that locked up a number of interviews.  We were mutually pleased by the consequences of this interview.  So in the last week, we've been having a sort of collective holy shit moment.  It's been happening for each of us in different ways.  Basically, this sense that China is catching up has caught up is ahead.  For me, I'm not a car guy at all, but you know, I was some of the Kim across me Instagram, a Western,  like he's a car influencer, and he's doing a BYD thing on the gang, you ate SUV, and my God.  It's got everything in it, right?  I mean, it's 0-103.6 seconds.  Massive range.  It's got a built in karaoke system.  And, you know, being at a new car, like I drive a shitty old car.  But when I go in my friends, like New Tesla, I'm like, I just time traveled to the future.  Like I'm living in 2025, all of a sudden, I go back to 2010 and I should do a little car.  But in any case, like, there's this rising sort of anxiety, which I think your book is really tapping into.  Why don't you just give us the summary then of what your book is pausing, essentially,  that Apple has played a real significant role in terms of these capacities that we're becoming aware of?  I like the way you're framing it, because I could see someone saying, like, oh, I don't care,  but Apple history, I don't need to read this book.  But I'm trying to tell a story of how China became dominant in tech,  but I don't think you'll read the story if I named it, you know, China's emergence of a supply chain superpower,  or something like that.  I mean, that would just be a narrow audience.  If I can tell the same story, but through the eyes of the world's sexiest company,  who, you know, you probably have thousands of dollars worth of their products.  And I don't mean you.  I mean, anyone is listening to the podcast.  I mean, that is just like the norm for a lot of people in the West.  Frankly, even globally.  So yeah, I mean, the story, I guess, like when I pitched the story,  it was really just about Apple being stuck in China, that the competencies that China has  are such that at the scale and demand for quality at the demand for low cost,  high margin products that Apple is building, there really is no place else on the planet  where they can build this sort of stuff.  I mean, we're really talking about like experts struggle to understand  the order of magnitude superiority that the Chinese manufacturing  topography offers.  The surprising thing in the development of the research of talking to more than 200 people  was the thesis that, oh, China got to where it is largely because of Apple  playing this completely outsized role relative to how large its own workforce is  in essentially sending America's top engineers to hundreds of factories across  China to train, audit, supervise, you know, teach engineering 101 and indeed  install machinery worth hundreds of millions of dollars and later billions of dollars  on the production line.  So these suppliers that create the next generation of components for Apple aren't coming  to Apple saying, you'll never guess what we created.  Apple is going there in co-inventing not just the parts,  processes, the manufacturing complexities, if you will, behind those parts, right?  Elon Musk sometimes calls this the machine that creates the machine.  And so, you know, in the early 2000s, like Shen Zhen is a maker of, you know, crappy  products, you know, toys and plastics and, you know, it's just known for its cheap  stuff, not its quality stuff and Apple more than any other company really plays a role  teaching the Chinese the competence to really build stuff.  It ridiculously high yield is the manufacturing jargon term.  In other words, if you build 100 products, how many of them can actually be delivered to the  final consumer without defect.  And Apple really cares about things like yield.  And they teach, you know, what Steve Jobs calls giving a shit to the Chinese.  Like, and like, you could say this about any number of companies.  Like, but it would not be that meaningful, because as I like to joke, like, what's  your favorite Dell computer from the early 2000s, right?  There is no favorite computer for Dell because there is no Johnny I've had Dell.  There's no imperfection of defects at Dell.  I'm not trying to harp on Dell, you know, HP gateway, anyone.  They don't have the design sensibilities, the taste, the aesthetics that Apple has,  and to build those products at scale.  Like, it's not a knock against the Chinese.  Nobody knew how to build this stuff.  It's people responding to Johnny Ives demands and coming up with methods to do it.  So, in the sense, you could say, Cupertino had the skill,  and it was that marriage that really created Apple, but really interestingly created China.  And this is, this is really significant.  I was looking at the Australian Strategic Policy Institute.  They have a critical technology tracker back in the early 2000s.  They said China was leading in three of 64 technologies.  They're tracking things like biotech, AI, drone, sensors, optics and that kind of stuff.  2023 they're up to 37, leading in 37 of them.  2024 up to 57 out of 64 technologies.  Wow, I'm actually not familiar with those numbers.  I mean, that totally tracks.  And I would almost wonder what they're looking at.  Because sometimes we make the mistake of looking at a profit share.  And when you do that, America comes out looking good because we have a sort of shareholder first.  Maximize the profits form of capitalism.  And China does not have that model.  So, China comes to dominate industries in such a way that it deindustrializes other rivals.  But it doesn't show up in the balance sheet because profits are not with their after.  It's a different form of capitalism that prioritizes command and control not maximizing shareholder returns.  And with I think in the book you talk about this, I mean, the big EV companies, what I referenced in the beginning,  there in terms of my kind of aha or holy shit moment.  People talk about EVs as phones on wheels or maybe drones as phones with not wings, but rotors, robots, et cetera.  You really, you're really saying it's suggesting that, I mean, there's obviously a lot going on here in terms of strategic industrial policy more broadly.  But that Apple is kind of the sensei, I guess it's it's such a kind of ruthless sensei in the dojo that it accelerates dramatically.  What I probably would have happened, but maybe would you say that it sort of put China heads for 10 years and a lot of these critical strategic industries.  I haven't put it in years so don't make me make a fool of myself.  I'm trying to make a guest there, I don't know, but I should say as ludicrous as the thesis can sound, if I haven't done handholding through 400 pages.  By the way, and I should say a lot of readers basically, they will hear a clip of me giving some numbers like how much Apple invested in the country.  They think it sounds just ludicrous.  And frankly, it is ludicrous, like it sounds unhinged.  And then they get to the end of the 400 pages and they go, you know, it's actually kind of common sense.  Once you think about it, and it's like, yeah, absolutely it is.  Because if you understand the scale of Apple products and how they built them in China, then of course there was technology transfer on an epic scale.  And so it's really funny sort of having to debate people in social media where one half is saying this is actually kind of obvious.  And the other half saying like this sounds totally unhinged.  And it's like, well, you've either read the book or you have it.  Exactly.  That's the litmus to us.  So the other thing I should say is that the Huawei founder has referred to China.  I'm sorry, the Huawei founder has referred to Apple as the teacher.  You know, all too familiar with the fact that the reason why the suppliers Huawei is able to rely on for its next generation in phones.  The reason they're so good is that Apple has trained them all.  So my kind of clip on this, right, is that we think in the West that iPhone killed Nokia.  But iPhone never had more than 20% market share globally.  Nokia had a far higher market share.  So who killed Nokia?  The answer is the Chinese competition.  And the Chinese competition was in a position to do that because Apple trained all of their suppliers.  I like that you say an EV is a smartphone on wheels because basically what that's pointing to is that if you train all these suppliers how to build smartphones,  they don't just sort of stick with what you've taught them and they don't innovate on their own or they don't think about where else the market is for their for their competencies.  And so an EV a smartphone on wheels is sort of the next place to go drones is the next place to go.  And if you're learning at the hand of Apple how to build electronics at scale and in great quality.  And of course you use those skills for other things.  So so a Apple sort of gives birth to the Chinese smartphone market because if you're a supplier making any sort of component for Apple at the clip of you know tens or hundreds of millions per year then of course.  You try to find other ways to maximize your your market share or to set up your profits by supplying to Apple's closest rivals in China.  And then you use it for other fields so EVs and drones and in a scary way military weaponry.  In terms of what's special about Apple products and how they synergize with this ecosystem and as you're mentioning.  You know Apple grabbing some of America's top engineering talent fresh out of school and sending them an airplane straight to China to start sort of downloading and transferring the skills.  This isn't like a joint venture transfer of Apple IP but this is a transfer of the know how.  So maybe you could describe that a bit for listeners.  Yeah, I mean let me make a point that I'm not making often enough in podcasts and really it's just a paragraph or two of the book and if you read the book the book is really dense it's not sort of a magazine article that's been padded out.  There is just new information it's like a fire hose of information really just every page standing continents and spending.  Decades so one point I would make is I'm not even really suggesting there's a transfer of knowledge from America to China it's it's much worse than that it's from the globe to China because Apple had a specific team of SMEs.  Subject matter experts and their whole job these are basically PhDs.  You know and things like chemistry would be to go through factories in Japan, Switzerland, Germany.  You know places that had really great automation places that knew how to make Rolex watches and they would figure out what the great technology would be for like the next.  Component of the iPhone and then they would sign a private deal with those companies and then go scale the hell out of it in China.  So the technology transfer that China ends up receiving from Apple is really global in nature.  Which is really quite scary because again I do think China practices capitalism but it's a form of capitalism quite distinct from our own.  And the better that China does in these categories the more it's all of its rivals become industrialized and I sort of de-industrialized.  And Apple doesn't really mean to in the earliest stages but it basically has played a monumental role here.  And so I mean I really compare Apple transferring its technology into China and consolidating its production to China to a geopolitical event akin to the fall of the Berlin Wall.  But it's a event that played over the last 25 years rather than one night when the wall came down.  And of course it took place in a censored media landscape where all the actors who knew what you were doing have been under NDA.  So that's why we don't know the story and so you know I'm not trying to just sell books with this hyperbole here.  I really do think it's the biggest untold story in tech for the last quarter century.  And of course the technology transfer is accidental almost not in terms of the transfer technology but the implications that you're describing here.  Maybe it's it's started to in the last five or ten years become a little bit more apparent.  But let's get into that a bit later I really want to understand.  Under kind of granular level why Apple chose China why there was such a comparative advantage there you talk in the book about this floating labor pool for instance.  I want to get nitty gritty into what the factory floor looked like I guess back then maybe it's changed now but what made this symbiosis so incredibly profitable.  There's that joke that boomers always tell you know if if you could go back in time and advise you on yourself what do you tell them.  By Apple stock you know in the late 90's right there's an incredible amount of value that was extracted or created in this process innovations a part of it.  But part of it is exploitation of workers I just I want to get a granular sense of of what that looked like these these factors what they look like now.  One is that I think leaders are going to surprise once they get past the introduction that all of a sudden they're back in 1996.  And I know sometimes that can be jarring it's like you get a biography of some of that you love and then you're reading several chapters about the grandparents you know like this is what I wanted.  But but I had to tell the story of Apple moving from in house manufacturing which is what they do for decades right from early 1980s onwards apple is building.  It's own computers even its own circuit boards in California, Ireland and Singapore when it adopts an outshoring I'm sorry an off outsourcing slash offshoring model really before Steve Jobs comes back and that's important this is not just a decision of Tim Cook who comes in in 1998.  There's their original suppliers basically replicate this triple continent strategy so the trans losing iMac that most people remember I mean I had it in tangerine back in 1999 that was built by LG in Korea and then Korea I'm sorry then LG at the behest of Apple expands to do production.  In Mexico just south of California like literally a few miles and in Wales so like that's just a story that people don't really know and then when LG comes I'm sorry when LG is sort of displaced over time by foxcon foxcon is still doing the triple continent thing so yes they're in China and is worth knowing that foxcon is Taiwanese not Chinese but they're also doing it in fullerton California and they're also doing it in the Czech Republic so I tell this like seven year experimentation story.  where China is not necessarily the answer it is one of eight or nine countries where Apple is doing the production of its computers Taiwan and Singapore being two other prominent examples.  But the you know basically if you have like an excel sheet of where you're producing stuff especially if it's the same product and you're comparing the cost in China versus Europe versus North America China is winning every time on cost on efficiency on just what they're capable of.  And so you know I know some people think the book is just on the title etc it's going to be anti Apple it's not I know some people think it's going to be anti China it's not I mean China earns its place.  When I say Apple is the great teacher I'm not diminishing the importance of the students in the same way if I say Harvard is a great teacher or a great university I'm not diminishing you know someone who graduated from there of course I'm not I'm giving all kinds of credit to the Chinese for having world leading industrial capability.  World leading work ethic 12 hour work days all sorts of things that you and I wouldn't want to do so what China is offering is really like why do they went out.  Is that I mean there are a host of policy measures right so places like Shen Jen are these early like experimentation zones are called bonded zones where.  You're exempt from all sorts of tax and and labor pools are coming in literally over decades by the hundreds of millions where people are coming in from the rural hinterlands to work in these factories and I actually really dispute the idea that this is slave labor.  You know I've got a book and by my foot here called I slavery and I mean I'm not saying these jobs are good but you've got to understand that the people going to work in Shen Jen six days a week 12 hours a day.  They're doing that because that's a much better prospect than toiling in the fields in western China for 14 hours a day under the hot sun.  That's a terrible existence and and it's far better pay to do a sort of four-year stint in Shen Jen where you could basically have a dowry and like go live back in your western village if you wanted to.  You know for the next decade I mean they can earn all kinds of money the wages is just really lower our standards, but not by Shen Jen standards.  And this floating population that's what this is called I mean literally a number counted in the Chinese census I believe the last figure was 300 million.  So just like have that digest for a second I mean that alone is 10 times the population of Canada is larger than the labor force of all of America.  And these are rural migrants who are not allowed to put down roots in urban settings so if you're in western China as a Chinese rural person and you go to live in Shen Jen I mean your kids cannot go to the local school.  So your kids if you have them are going to be raised by your your parents right so kids are raised by their grandparents in western China.  This is really problematic in certain degrees because if we're like oh what do we do to compete with China will are we going to adopt that in the West I mean it's kind of a terrible practice right it's really short termism in a sense on on on China's part.  But I just mean like I guess I'm pointing it out because on the one hand that's kind of the secret sauce of China's industrial prowess because as companies like Foxconn offer what we call manufacturing as a service.  The value of that is Apple is not paying Foxconn when the Foxconn workers are not building Apple products right it is not a fixed cost it is a variable cost you are only paying for it when the people are there and Foxconn is brilliant.  In the States because state's thoughts or buses go to the West and come up with pick up these migrants.  And so it's it's it's a really efficient capital I mean they're out capitalizing how am I saying this like they're better at capitalism than we are.  But using methods that we would not want to replicate ourselves so not only are they beating us in a host of ways like labor wages and things like that but they're sort of beating us philosophically because we're never going to compete with that in the West.  Can you can you talk about the products themselves because you look at an iPhone I mean from your book I learned there's you know something like a thousand little sub modules that are part of the final assembly.  Everything has to be done to such precision you know with our current sort of.  Yeah techno moment we think it seems going to be the machines that are doing this right but this sounds very very labor intensive described as what's happening on on the shop floor.  The division of labor this insane sort of assembly assembly line Adam Smith division of of labor.  Yeah really taking to an extreme where you've got a conveyor belt system where you know you're working on something it takes nine to eleven seconds and you're just doing that with few breaks for 12 hours a day.  In factories this size of football fields line after line where there might be 300,000 people 500,000 people at a single site or a single industrial cluster I should say probably multiple sites but all next door it's called next door manufacturing when you sort of have.  You know the metal stamping the tooling the other machining the the plastic injection molding the CNC machining all within you know a stones throw let's say a final assembly.  The misperception that people get is that if they understand okay so the iPhone is actually a handcrafted device like that sort of makes it a luxurious product they say well why can't you just automate this there is wild automation in the iPhone process right anything that can be automated is automated.  There might be future advances and what can be automated certainly but if it can be automated that was already done it so it is both highly automated and labor intensive it's this is not an either or thing it is both when people say why not just automate everything and bring it back to America.  There's sort of a couple problems there like one the dexterity and nimbleness of human workers is really just such a so much greater than than what a machine is capable of particularly because building iPhone is not like building a car where you set up the production line and in effect you build the same car for the next seven years so that's sort of the product cycle for a car.  The iPhone you're sort of building a massive quantity in a matter of six months and then the the it really tapers off and then the next iPhone is developed and it's got different components different battery different processor and so forth and even if they're little even if the differences in size are quite my new.  That's enough to have to retool the whole assembly line reprogram all the machinery and everything so one smart reason don't think people know this why Apple continues to sell older model iPhones right like the where at the model 16 right now but you can probably still buy the 15 maybe even 14 and certainly the lower and models like the SE which sort of you know are continuing to use the chassis and other components that they've had years later because those phones are being for far more automated there's less labor intensity the more that you're able to sell these phones for multiple years.  So versus 10 years ago when you really just had a new iPhone and you got rid of the past one Apple is actually sort of flexing its automation capabilities by having multiple phones and so the new ones have more labor intensity than the old ones.  I want to keep going a little bit more on this because I think it's also quite illustrative of why you know contrary to.  Trump's hopes and maybe what Tim Cook is trying to promise you can't just take iPhones and build them here in the US so we've talked about this incredible roving labor pool.  The size and scale of these factories understand some are producing half a million units every single day but also just these industrial clusters.  There's a place called iPhone City for instance just walk us through a little bit more of that supply chain stuff I know you you wrote this book and you said it was sort of a trick to get people to read about supply chains and a sexy way I mean I love reading about supply chain so we go a little deeper on this but again I just want to get fairly granular in terms of.  Building the cases to why it's not such an easy thing to just see if we're going to have a tear of policy we're going to force manufacturing and we'll be able to do it in the US for instance.  Yeah, so there's a former manufacturing design engineer who's been quoted frequently and I really like this quote he said you know junk Joe which is which is a portion of which is called iPhone City.  I mean that has 500,000 people working on the iPhone at peak season and to be comparison to the city of Boston also about half a million people really giving up everything they're doing.  I'm just working on iPhone instead so you know picture the album with Bill office and nobody nobody's going to be a lawyer anymore we're all going to make iPhones right but every city block.  Every every person in Boston deciding to do that.  I actually think he's underestimating the challenge because not only is it that.  It's the city of Boston working on something else for a long time and then sort of floating over to Milwaukee to build the iPhone and then floating over to Buffalo to build something else or whatever right.  So it's not just that you have the density of population working on this stuff it's that their dynamic and that they go from one area to the next.  We are just never going to compete with that even if we adopted that model as insane as that is we would still be doing so at a rate of labor that is never going to be competitive with China and we were doing it without the same sophisticated industrial clusters and automation.  I think I'm right in saying that the number of robots China has on the production line is greater than the rest of the world combined.  And frankly even if I happen to be wrong by that I'm not going to be wrong by 2030 that is the trajectory of everything that's going on.  I believe the stat is that by 2030 China will be manufacturing more than the rest of the world combined so experts in industrial supply chains really struggle to even comprehend or articulate.  The degree of superiority China's China has in advanced manufacturing.  The idea that we're going to be competitive I mean I think I've made three or four reasons there's probably 20 reasons.  It is just not going to happen that's not to say that we shouldn't be trying I would love to see a revival of the industrial might in America.  But I think the real answer is not reshoring it's friend scoring so I would like to see NAFTA on steroids.  I would like to see Foxconn and others being pushed kicking and screaming to India.  You know ally nations where the sort of Pax Americana growth of Germany after World War II Japan Taiwan South Korea this is all a net good for these countries it was a net good for the world.  The trouble is we tried to do it with a communist country of more than a billion people who is so large that they don't just participate in the American-led world order they seek to overthrow it.  That was a strategic error on our part it was probably born of hubris I don't really pull I don't really think the argument was made in bad faith like I don't think it's I don't think you have to throw Bill Clinton or Larry Summers or any number of people under the bus.  For allowing China into the world trade organization I think we had a real strategic sense that this was going to be a net good that a middle class was going to develop in China and in effect overthrow the communist authority.  But clearly in retrospect that didn't happen and we're just dealing with the consequences right now the points of my book is really to get people more conversant in that conversation.  But I'm not going to do it if I write a wonky tone on China's role in the World Trade Organization or you know supply chain 101 so I'm selling you on the sex appeal of Apple products but hopefully getting you conversant and why this is such a big deal for who controls hegemony in the 21st century.  Yeah in that unique polar world moment I think there was such a sense of hubris that you know liberal democracy would inevitably flourish in China and that you know through globalization and extending capitalism into China that we would be doing something.  Doing a good there and hasn't quite played out the way will not.  Yeah and I refer to the iPhone as a catalyst not for globalization but for Chinaification I contrast that with the IBM PC in 1981 which really gave birth to electronics contract manufacturing maybe didn't mean to but that's what it did and the impact of the iPhone has really been quite different.  The last 10 years have really been a case study in an American made product becoming more and more Chinese the real estate within the iPhone is increasingly Chinese the multinationals operating in China are being squeezed out by the quote unquote red supply chain.  Who have better access to the state which gives them an ability to operate at lower margins because they get free labor sorry not free labor just better access to labor free machinery free land and so forth.  China has this like Nietzschean will to power and they're going to dominate through manufacturing the epigraph of my book is quoting a 2015 document from Beijing that says without manufacturing there is no country and there is no nation.  It's really tough to compete with and it's made itself the indispensable manufacturing nation certainly for Apple which I guess has made the choice to localize more than 90% of its supply chain in China.  You see there's you're chasing quarterly results at a certain point there must have been a moment where I'm not sure if any resources told you about this but I would I would have to hope that someone must have said hey we're putting too many eggs in one basket here but I guess it was it just too too lucrative and would have been too much of an expense to try and start diversifying away from somewhere where it just works so well to build these devices.  So one of the earliest products it really does consolidate to China is is the ipod particularly the ipod mini so the classic ipod is built by invent tech in Taiwan and then it begins to go so well that invent tech says the apple hey we need to set up another factory and we're going to do it in China and then for the ipod mini foxcon who's been a partner of apple for several years at this point.  Basically believes that we're not involved in the most popular products of apple right now. We're not doing their desktop computer anymore because they weren't selected for what's called the the iMac G4 looks like a sunflower that was built by Quanta in Taiwan and then later at a place called QS MC Quanta Shanghai manufacturing and they're not building the ipod that's invent tech and so foxcon's worries that they're losing their partnership with apple and so they literally designed a replica ipod and have a bunch of people come over to their own.  So it's basically show in tell it's a show in tell of two things one the replica to say look you don't even train us to do this look how damn good this thing is an apple people that are there are saying this looks like we designed the hardware and the software like this is amazing.  It's basically a fox on orchestrated the job interview for themselves and then they show them the facilities and they basically say look what we've already built all of this is for you this is at your disposal fox on is brilliant at learning in apple.  I guess we could we could jump a little bit into here because in terms of this transfer you mentioned your book there's a Marshall plan scale investment into this this manufacturing ecosystem.  But also again that that America America's best engineers are being taken right out of graduation and basically flown on a jet straight to China like what is being transferred you mentioned millions of workers are being trained.  I just want to get a better sense of how this all works like topography of apple that had never really been described before is what's called the pyramid structure.  So most people even without knowing with the pyramid structure is are familiar with the top of the pyramid this is ID industrial design this is about two dozen people in the golden age of apple led by Johnny I've.  It's that team that comes up with we're going to use translucent plastics and these are going to be the colors it's that team that comes up with the iPhone is going to be all unapologetically white and it's going to have a scroll wheel and it's going to be chrome on the back.  They sort of kick it over to product design PD this is the bigger team within the pyramid who have basically a bunch of engineers who have to figure out like.  Okay, this is what Johnny I was demanding how do we actually make this thing function how do we fit in all the electronics what is the circuit board going to look like what kind of battery can we fit in there.  Another level of genius but it's different from ID after that is MD manufacturing design to be fair these guys don't quite exist as a own distinct unit until 2008 2010 and for a long time they're called supply base engineers but let's just skip over that that's footnotes.  D is the team of engineers who fly over to Asia to co-invents the parts and the processes behind those parts to fulfill the vision of ID and PD.  So in other words, Johnny Ives team comes up with some mind bending design but nobody actually knows how to build it I mean literally nobody in the world knows how to build a computer that looks like a sunflower it's never been done before.  I mean you literally have this this like Rome neck that's based on precipitiously hardened metal at an aerospace grade an apple has to like corner the market on this metal like the literally competing with companies that are doing like.  Vacuums for semiconductors and an aerospace sector in order to get their hands on this metal and apple begins to operate at such quantities that their their procurement team literally has to do negotiating themselves.  Because they need to make sure down multiple tiers they're going to have enough raw materials to be able to like go through various factories to get it all refined and everything.  Apple begins to take unprecedented control of this sort of stuff not just the manufacturing but the logistics the negotiation for those prices.  Nobody else is doing this if you're a Western PT company you're basically hoping the component makers come up with innovations where the materials become more durable maybe better looking.  And you know lighter or something like it apples not doing that apple is working hand in glove with the suppliers to co-invent the very things that will be in the next computer or the next phone or would have you.  So this is where the transfer of knowledge is just enormous but I guess what I say one way of saying is that Cupertino has the skill it doesn't have the scale it finds the scale in China and that's where you get the perfect marriage because.  China has this like drive indigenously innovate right to move up the value chain to learn all of this stuff and that's where it begins to see that this is great irony that in order to.  Really become a leader in indigenous innovation they realize you work with the mother of all capitalist companies to get that into effect you work with apple.  I mean that the sounds like you know Japanese major restoration kind of thing where I go find the best the questions and bring them into teacher infantry had a word go find you know the Navy and the UK and get them to teach you and had a form of Navy and then go and beat the Russians.  So yes and no so China has something called the thousand talents program and it's explicitly that right it's like.  a professor at Oxford who can teach something or other and bring them into China this is sort of happening under the radar like apple is doing this on their own without basing even understanding what they're doing from 2003 to 2012.  And like to such an extent that the book opens with Xi Jinping becoming president and effectively through CCTV attacking apple because he sees apple as an exploitative power I mean apple is just.  Operating from afar nobody seniors living in the country they don't really have anyone senior doing government affairs.  They don't understand the culture they don't understand the politics they in effect don't need to they are just having engineers fly into all these factories.  To such an extent by the way that I mean United Airlines is literally taking new routes to cities in China that they don't go to just to serve apple because apple says we will buy enough first class seats three times a week to go to Chengdu to go to Hangzhou that if the rest of the plane is empty you will still be making money.  So I point that out just because that is not the case for the Google pixel team okay that is not the case for the Facebook advertising team apple is unique in terms of how many people is sending to China.  And it's affecting other industries like the airline industry I mean it's just on an absurd sort of level.  So again they haven't formed this joint venture there's not any.  Out in the open technology transfer we've talked about everything that's going on in terms of of you know what they are what they are transferring and at a certain point as you mentioned.  Uh G uh through this uh what is it accountability day for for corporate bad corporate behavior consumer day.  Consumer day gives apples and I tell that story and then how apple makes the case I guess to G G paying that they're in fact contributing massively to China just doing it in their own special way and I guess making explicit what was implicit before.  So consumer day is a program watched by millions of people in China it's March 15th every year goes back to 1991 effectively a bunch of local companies and the 90s are called out for not living up to the socialist ethos.  It's like this really well produced program where hidden cameras go into these shops and they find out what the policies are and find out that Chinese consumers being screwed this way or that way or whatever.  Um what happens is western companies sort of get involved in in in in in the late 2010 so in 2012 you know McDonald's is the big enemy for for food violations and in 2013 36 hours after Xi Jinping becomes president apple is called out.  Now they're called out for warranty differences the claim is that you know with their hidden cameras they go present problems to let's say a French apple store and they find that you know if the if the if the if the phone just isn't working upon purchase.  The French store says oh my apologies here is a new iPhone and in China the same thing happens and it's not here as a new iPhone.  It is.  Let me take your phone we will take it for 30 days will refurbish it and give it back to you.  And so the Chinese are like wait a minute we're being treated this in inferior way this arrogant company is is exploiting the Chinese consumer and you know China's coming off of its century of humiliation.  It's called right where it's taken advantage of but the is exploitative powers who you know obviously a next Taiwan they sort of play a role in the opium wars.  I mean they're called that because Britain against the will of of China is exporting opium sort of a modern the premodern equivalent of fentanyl to the country and having this disastrous effect.  So China is very sensitive to being taken advantage of.  But there's this riddle that I basically solve.  I solve this after I submitted the first manuscript by getting better sourcing of of why the warranty differences existed and the reason why is this holy wild story this is my favorite part of the book it's part four.  It's called insatiable demand and it's that the iPhone becomes such.  The biggest status symbol in 2010 with the iPhone 4 that there's this massive supply chain I'm sorry there's this massive supply demand imbalance in China.  To such an extent that these gangsters these quasi gangsters with triad connections known as the yellow cows notice this and they try to begin a massing as many iPhones as the economy literally tens of thousands of iPhones so that they can take them to other cities the problem is Apple won't sell you tens of thousands of iPhones they'll sell you to.  So at the Beijing store in sanley ton districts they begin busing in hundreds and later later thousands of migrants to stand in line literally circling around the this door with six seven thousand people and so you know it's worth knowing like.  These are not fanboys of Apple this isn't like you and I getting excited about the latest iPhone and camping out the night before which is the sort of stuff you see in the west.  For migrants who can't actually afford the phone but they're being given the exact same amount of cash and if you sort of picture that conveyor about logic of how you build an iPhone that's how busy the store gets where they're just sort of taking the same amount of cash here is your iPad you know here's your iPhone moving on to the next thing.  The process and just an insane level of transaction means they're setting world records selling something like 25,000 phones per store each day until inventory is cleared.  They're actually having to like you know only sell iPhones between eight in the morning and ten in the morning because if they sell them all day your ordinary customers not able to go into the store.  I mean we're talking about such level of demand that someone sells on the on the black market they undergo black market surgery to sell a kidney and exchange for a new iPhone and new iPad.  Apple is totally flum mixed by this demand they don't know what to do they have research or standing outside the Apple store talking to people ordinary buyers who once in a while can by the phone and they say like.  You know like who are you what's your income why did you buy the iPhone and like among these people is a mailman who spent 30% of his annual salary to buy a new iPhone and he says to them when people see me with the iPhone I'm not just a mailman.  So the demand is just totally off the charts now the crazy thing that goes on here and I'm sorry I'm trying to really sum this up in three minutes or whatever but this is four chapters including the prologue.  Is that the the you have to remember that the yellow cows are backed by triad organizations and they're greedy and they're making loads of money.  They begin finding ways to go to America go to a tea mobile shop of Verizon shop with a fake identification and they buy a phone under a 24 month contract they pay the first month with no intention of ever paying the 23 months.  So in other words they find a way illegal to buy an iPhone for less than a hundred dollars right and then they're able to still sell it in a city like Chongqing population 32 million number of Apple stores zero and sell it for eight or nine hundred dollars.  Okay I'm saying they are making more money per iPhone than Apple and this is happening every product launch for multiple years the story is wild now.  Saby listeners will be like you can't take an iPhone from America and use it in Canada that's true so with factory connections they zap the processor they render the phone in operable but at the same time they are masking the retail market of origin.  So at the genius bar someone's looking at the iPhone and being like I can confirm this is a new phone.  I don't know why it works there must be a supply chain problem my bad here is a brand new phone in a sealed box so this is subscribed to me is like cocaine to the yellow cows.  But of course as this happens we literally talking about people instead of sneaking around the front of the store they're sneaking around the genius bar line and you're unloading backpacks full of iPhones and saying none of these work and they're all new.  And so if Apple is obviously catching on that there's something going on here but they don't really know what it is and this is the origin of them saying let's wait 30 days let's send this to Singapore where we have a logistics hub.  We're going to refer to the phone and in that time they're trying to figure out like how is this going to be tampered with because the yellow cows are so damn good at this that beyond what I already said which is already really sophisticated.  They were also taking apart the phone following it out and then putting replica components inside that I didn't actually function or weren't actually Apple authorized.  And so they could make money selling the components like the memory and a market in Shen Zhen.  And then hand it back to Apple and get a brand new phone. This goes on for eight years.  And if you've ever wondered why today's phones are such a pain in the neck for right to repair activists it's because everything in the phone is now serialized to the motherboard.  Because Apple had this problem with people scamming them with all these fake components in their iPhone.  So like I'm sympathetic to why Apple so like so so adamant with everything has to be an Apple component it's because they were being screwed.  So anyway, so this is the origin story of why the phone has to be refurbished so Apple wasn't really treating the Chinese in an inferior way.  But that's the allegation because it is based on a truth that there was a warranty difference but it's because Apple was dealing with scammers on an epic scale.  All of this is new by the way. I mean none of this has been reported so it's just a wild story.  Apple definitely needs China does China still need Apple anymore.  I mean what's happening here with G flexing his muscles potentially using this consumer rights moment to his to his favor.  And Apple then having to prove themselves and they're almost their loyalty in terms of the kind of investments that they end up making his result.  Yeah, so I don't think China needs Apple anymore. I think the student has become the master.  Chinese smartphone makers have 55% market share and they're no longer just mimicking the iPhone.  You actually get better phones coming out of time and now so the Huawei Mate XT is a phone that literally unfolds twice.  So it's a little bit thicker than an iPhone but that once you unfold it like a tri-fold it becomes a size of an iPad.  So it's sort of a two-in-one product at a time when Apple phones can't unfold once.  The Chinese competition is designing and shipping phones that unfold twice.  It costs $2,800. It's how people sort of criticized it.  And it's like you're totally missing the point here. It was just 10 years ago that Xiaomi was being blamed for you know,  brazenly copying the iPhone and then selling it in a fraction of the price.  And now we're actually having you know, Chinese smartphone makers that are doing things the iPhone cannot do  and getting a premium selling them in the millions.  That's quite an extraordinary change for what was in effect 11 or 12 year period.  So that's sort of amazing.  In other words, China didn't get the lesson of how to fold an iPhone from Apple right?  They now have their own world-class designers and engineers who can do that on their own.  Where I would say Apple is still teaching is if you've ever tried the Vision Pro Hens headset,  I mean, it is a market failure because it doesn't really have any content.  So there's very little you can do with the damn thing.  But nevertheless, it is an absolute marvel of technology.  And that is made by luck share.  Not a Taiwanese company, a Chinese competitor to the Taiwanese part of the red supply chain in fact the most successful.  But sometimes in the market worth more than foxcon despite having a fraction of the orders.  But it's because Chinese investors see the writing on the wall and they know that the political connections  luck share has to the party will result in greater and greater orders.  So I mean, that's a heavily automated device.  And Apple is absolutely teaching luck share how to do it otherwise luck share wouldn't know how to build it.  So just to sum up maybe more directly answer your question.  I don't really see Beijing going after Apple.  I mean, there's two main reasons why they wouldn't do that.  One is that Apple does continue to be a teacher.  Why would you get rid of someone who's voluntarily handing you the gift of fire on an annual basis,  teaching you the latest techniques coming out of Caltech coming out of MIT,  Apple higher from SpaceX and Tesla and then have those people go to China.  I mean, it just makes no sense to go after Apple.  I mean, why would you do it?  They're just too beneficial.  The other reason is that, you know, insofar as those like care of discussions,  like much to the benefit of my book, people use Apple just as like the paradigmatic example of a Western company manufacturing in China.  And no one knows that better than Beijing itself.  So if Beijing took drastic action, like close to factory in China or whatever,  that would instill fear among any number of Western corporations that either do business in China or are thinking about doing business in China.  So if they're going to take action against Apple because they're moving the India or something,  it's going to be subtle, hard to trace things like an electricity.  Sorry, like a net, what am I trying to say?  Like an electricity blackout at a certain factory for a few hours.  The sort of stuff that wouldn't make national headlines, but would impact Apple without sort of causing the blowback of other Western companies.  Has it hating as to whether or not they're going to build their next product in China?  But you do describe this, this gang of eight that is assembled in order to sort of convince Xi Jinping of the value proposition of Apple and why.  I don't know why shouldn't be forced into a joint venture, much of those threats were on the books at all.  But they made that case.  And again, you mentioned this Marshall Plan scale investment.  When is that happening?  So yeah, when Apple is attacked by CCTV and state sponsored media, they really do fear their products are going to be blacklisted.  No hyperbole their Facebook is blacklisted.  Google is blacklisted. Apple worries that it's going to be next.  The gang of eight is a team of executives hired or transferred to China.  First time that Apple has seen your people living in the country.  I mean, this group includes two vice presidents.  But it's also people overseeing third party sales, retail sales, Apple University, R&D, etc.  So for instance, Apple has no R&D in the country.  Today they have five labs in China, five different cities, right?  That plays a big role in employing higher value people PhDs and stuff in China.  But also just demonstrating to prevent dual authorities, not just Beijing because you have to understand.  Yeah, our model of how we think of China as a communist power is totally backwards.  It's not like the Soviets.  It's not a top-down thing.  It's really grassroots level up from the quadris on forward.  I described it as federalism on steroids.  So you don't just work with Beijing.  You need to work with local officials.  And so that's why you have five R&D labs.  And that's why they're in five different cities because you have to play a number of authorities.  So the gang of eight really is the team that begins to understand.  The threat here is that we're going to be forced to do joint ventures.  And after lots of research, they realize our impact on China is enormous.  And the problem, the reason why they're angry with us, is that they don't know what our impact is.  So we need to stop being the secretive company that we always have been.  And we need to get this out to the highest echelons of communist power.  You have no idea how much we are contributing to the country.  Here's what we're doing.  And they basically pledge in May 2016 when Tim Cook goes to Jungung High.  You could call that the White House of China.  And pledges to invest, not spend invest.  $275 billion over the next five years.  I compare that to the Marshall plan because I could not find any corporate equivalent.  If someone has one, please let me know.  But instead, I compare it to two things.  One, that's $55 billion a year.  The chips act, right?  Joe Biden's flagship policy to bring chip fabrication back to America is $53 billion over four years.  That was called a once in the century investment in American manufacturing.  By the commerce secretary.  So Apple is investing the equivalent every year.  So you could think of that a chip's act every year for the last decade.  And then the other thing is I thought, oh, maybe people will resonate with the connection that this is like a Marshall plan.  Thinking that maybe the Marshall plan is only double the spending or triple the spending.  It's half the spending.  Apple is investing more than the Marshall plan invested over four years.  And they've been doing it for a quarter century.  So I know it sounds nuts without the context to say that my argument is that Apple had a nation building like impact  or a Marshall plan like impact on China.  But the numbers totally back it up.  I mean, the Marshall plan included food aid.  There's no food aid in the Cook plan.  It is all about high end electronics.  The Marshall plan was 16 countries.  The Cook plan is one country.  I mean, I can just go down the line.  You know, government bureaucrats don't have the same level of efficiency of America's top engineers  at a hypercapitalist, ruthlessly efficient organization.  So there is no hyperbably comparing this to the Marshall plan.  The Marshall plan looks like a lemonade stand versus what Apple does in China.  Hasn't Tim Cook offered a fairly similarly sized investment in America to Trump most recently, 500 billion?  Yes.  But the difference is there's no substance to it.  I mean, just think of it this way.  Some people have some skepticism that Apple invested $55 billion a year.  And yet I don't see those same people having any skepticism that Apple's investing.  What it said in February, which is that $500 billion will be invested in America over the next four years.  Okay, really?  Okay, really?  So we're skeptical that they're spending $55 billion a year or 90% of their production takes place.  But we're not skeptical that they're spending $500 billion over the next four years,  where none of their production takes place come on.  Give this some common sense.  What Apple is counting most likely.  This is my opinion.  I don't have the math doesn't work unless you do it this way as far as I can tell.  Apple is counting as investment in America, share buybacks and dividends.  Because 70% of Apple shareholders are in America.  So if you are in effect buying as they do $100 billion of your own shares per year,  then you do the math.  You quickly get to at least $400 billion, right?  Plus dividends.  Then multiply by 0.7 so that you're only getting the American investors.  That in a sense is an investment in America through through the shareholder program.  That is not, of course, an investment in American manufacturing.  But the press release is structured so that you come away thinking that it is  without Apple actually explicitly saying that it is.  In other words, the Tim Quoke quote,  maybe the headline are all about American manufacturing and bringing jobs here,  but it's ludicrous.  They say they're investing $500 billion and it will create 20,000 jobs.  How bad is your government run program if I'm making an analogy here?  If you were spending $500 billion in your only creating 20,000 jobs,  none of this makes any sense.  It only makes sense if you begin counting shareholder buybacks and dividends as part of the figure.  Okay, but what about the MacBook factory in Texas?  Do you describe that?  Are you suggesting that that's about $500 billion?  No, this is not.  I just want to hear about what kind of legacy of success we're building on  in terms of bringing the supply and chain back to my mind.  I spoke to, I think, seven different people involved with making the Mac Pro in Texas.  This also had political origins.  So in the 2012 Romney versus Obama debates, Apple sort of got hammered  for sourcing all of their jobs to China.  And so their solution was let's create a low volume product in America  to demonstrate our commitment to the country.  They were absolutely able to make a snazzy video of quite frankly, a bunch of white people  putting products together.  To such an extent, by the way, that the Chinese were upset because when they show factories in China,  they do not show the Chinese faces, right?  And so Apple is very clever about how they kind of do this stuff.  They understand political optics.  I mean, it's Apple.  It wasn't like one of those AI-generated spoof videos that China's been putting up recently  of the fact.  Oh my god, those, I mean, to be honest, that's not so different from what happened.  So basically, you know, I talked to people who said like,  the Apple managers are always mad at me because I don't move it trying to speed.  You know, this is a 50-year-old kind of heavy-set white guy.  Yeah, so essentially what happens is Apple makes this commitment to Texas.  They build a factory, they don't build a factory.  They manage the factory at a company called FlexTronics,  and it's a quote one engineer on the project.  It was an unmitigated fiasco to quote another person,  Tim, as in Tim Cook, hated it.  You could just tell.  I mean, I talked a bunch of people who basically just said it was such a formative experience  and just how much better trying to had become at all of this stuff.  You couldn't build it in the heartland of America.  Even if you were working with a company like Texas instruments,  you know, location as the name implies is Texas.  You couldn't get the same sort of prices,  the same sort of volumes from that company as you could get it in Asia.  And so this is a computer factory where they're trying to turn out 500-600 units per day.  The iPhone is at a million per day.  So if we can't be building the Mac Pro with those volumes,  we sure as hell aren't about to create the iPhone,  which is more complex, smaller products, you know,  gets revamped every year, where's the Mac Pro is every four or five years.  I mean, it was just a formative episode in demonstrating  the total lack of capacity and know how an experiential knowledge  in America versus that of China.  And the only way that someone says, oh, but it does exist,  I own one.  It says made in America.  Yeah, very prominently.  But guess who built it?  A bunch of Chinese employees from FOX gone  who were flown over to take care of the job  because the Americans couldn't do it.  I mean, it's devastating.  But that's what happened.  What's happening most recently?  We had liberation day.  I'm Apple lost a good chunk or 20% of its market cap.  And then, suing day mayhem around around the sort of tear of escalation.  I understand that that was an exemption was carved out,  probably because of Tim Cook,  and because of the impact on people's portfolios.  Catch this up a little bit with what's happening right now,  and how Apple is trying to adapt either in real terms  or symbolically to signal that they're not as vulnerable  as they've made them out to be in terms of this dependence  on the Chinese supply chain.  So I'm glad we've already spoken about the $500 billion investment  because my understanding how they're getting to $500 billion  is not what has been explained to the White House  because the White House press secretary has said  it's quite a chunk of change that Apple is investing in America.  They really have sort of taken the coup-laid from Apple and thought,  oh, the company really is reshoring.  And so a few months go by, they're sort of like looking around  for the press releases or the factories that are being built  and of course none of its taking place  because $500 billion is not being invested in American reshoring.  And so I think it's sort of a problem with Apple's own making,  but it's what they did in Trump 1.0.  According to Trump, Tim Cook promised three big beautiful factories  in America to turn on Apple products.  That was in 2017.  It's almost a decade ago, none of those factories exist.  So I don't think it's unfair to say, Tim Cook's strategy  was to run the clock on the Trump presidency  and that worked out well.  He just didn't know the Trump was coming back four years later.  So where are they now?  I think they're trying to do the same thing,  which is that some snazzy press releases will play Kate Trump.  But Trump still has what 1200 days left in the presidency.  It's hard to run out to clock this time,  especially when your previous announcements  were obviously full of hot air.  I mean, there aren't no factories.  So I don't know exactly what happens next,  but Trump is basically, you know, for the first time  and I think world history created a tariff on a single product.  I'm not even a single company.  I single product, the iPhone, and basically said like,  I don't care where it's built.  If it's not built in America, it's subject to 25% tariff.  Frankly, that tariff is not high enough  for Tim Cook to budge at all.  I mean, the cost of making an iPhone and Pittsburgh  is going to be way more than a 25% premium.  So you're not going to change anything.  But the truth social or tweet or whatever that Trump put out  said at least 25% and Trump is an erratic figure  if Tim Cook doesn't play ball in some way,  that figure can go higher and higher.  And we've seen go to 145% without any warning.  So Trump's looking to have something from Apple by the end of June.  I mean, this is a ludicrishly short period  for a supply chain commitment.  And then just remember, because I think people kind of forget  this sort of stuff when they're thinking about it,  Apple doesn't have any manufacturing facilities.  So it's not even a matter of Apple saying,  okay, dammit, you know what?  We're sitting on 100 billion dollars in cash.  Let's just spend three billion building something.  They don't do that.  So they have to convince a Foxconn, a luck share, a BYD,  and hopefully, if you're Trump, a number of others  to build the whole industrial clusters, even build this stuff  because if they just have a Foxconn here  and all the components are being flown in already  subassembled for one final step in Texas or something,  I mean, the reporters like me are going to say,  this is basically BS.  They're not actually making me iPhone here.  They're just assembling it.  And the deficit with China is no different  because you're just importing all the subassembled components.  So look, this gets to my point now.  So I'm sure that at this point the list is like,  well, what should they do?  And the thing is like, nothing.  There's no great action for them to take.  The whole point of my book is this company is great.  It's the world's greatest company.  And they have been out maneuvered by a political entity  that is a nation's state and authoritarian one  that they can't really negotiate in good faith  with Apple is stuck.  They are captured.  That is the subtitle of the book.  It's not hyperbolic.  That's the state of affairs.  I'm trying to find historical precedence  for what you described in your book.  One of them was the Gorky Auto Plant,  which is where Ford Motors transferred several automotive designs.  And indeed a whole assembly line in factory  over to the Soviet Union in the late 30s.  There was no Cold War at that time.  The news government did stand in the way.  They transferred an ability,  and probably accelerated the sub unions  ability to mass-produce cars, trucks,  and tanks to some degree.  But America didn't lose any of its dominance  and dominated an automotive manufacturing  for the next half century.  Maybe I'm thinking of, you know,  ways to clean as a manufacturing superpower  as the US overtook.  This feels more dramatic in a sense,  and more vulnerable.  Maybe I'm just not good enough historian of the UK, for instance.  But just just looking at this and sort of the grand arc of history.  How unique do you think this moment is  in terms of, again, the rise of one power  and the eclipsing of another?  I think totally unique,  because the complexity of a 21 supply chain  is just orders of magnitude more complex than anything  you were doing in the 1930s.  I mean, there's no counter-argument.  The other thing is that I'm not all that familiar with that episode,  but it's not that Ford sort of like shut down,  Dearboard, Michigan or whatever, river Rouge,  and just like exported everything over there.  That is what Apple did.  I mean, now you used to have factories,  their own factories in multiple states,  and in multiple countries, they don't have them anymore.  So like the closest counterpart,  contemporaneously, is Tesla.  Because Tesla basically adopts the upper model  and says to the Shanghai officials,  including the Shanghai mayor,  like we're going to do for EVs,  what Apple did for smartphones,  and they literally hire Apple employees  to execute the plan.  I mean, so that's a good section of the book.  But even so, Tesla does do its own manufacturing.  Obviously it works hand-in-glove with suppliers.  It does play the Apple model,  but they actually do build their own stuff.  I mean, there are manufacturing plants,  say Tesla outside,  where the IP is just for Tesla,  and the higher value stuff is not given to suppliers.  So it is different in that respect.  It's also different to the respect  that even though Shanghai accounts for about 50%  of global car production for Tesla,  they do have a localized supply chain in Berlin.  They do have a localized supply chain in California,  and in Texas.  So they are not nearly as exposed as Apple  to a authoritarian churn in China.  In other words,  if China annexes Taiwan,  I mean, there's no more chips for any other Apple products  for the foreseeable future,  and potentially no products are coming out of China,  because if we're at war with China,  I think trade basically collapses with them.  I would describe that as a meteor strike  on Apple's operational business.  A meteor strike on Tesla's Shanghai business,  but I think for the most part,  you would still have things turning along OK  in Texas and California and Berlin.  I suppose I should ask for that with  I don't know exactly where the chips are coming for for Tesla's cars.  So the chances are very high that they do indeed come from TSMC  and apologize I'm ignorant there.  But nevertheless, they could probably get some high advance chips  from Korea from Samsung and so forth,  whereas Apple's not really able to do that.  And even if they could,  their greatest competitor is Samsung.  So in the event that the China annexes Taiwan,  the chief beneficiary,  I think is pretty clearly Samsung,  and so that makes it difficult for Samsung,  who does not just smartphone,  but they fabricate their own chips to then supply Apple.  I get into this in the book, by the way.  So if I'm not being able to audit it in a ticket now,  it is in the book.  All right. Well, dear listeners,  it's time to order that book because,  unfortunately, it's interview has to come to an end.  Patrick, it's been a real pleasure.  Thank you for making the time.  Look forward to hearing lots of feedback on this episode.  My pleasure. I'm sorry.  I don't have a nice Canadian friendly optimistic note  to end the interview on.  But yeah, I mean, I'm open to,  you know, being countered or whatever,  but unfortunately, I'm pretty pessimistic about  the state of China's manufacturing dominance and the role we played  in giving it to them.  Well, hopefully this book sparks some conversation  on that topic and some problem solving.  Thank you again. Cheers.  Thank you.  Today's episode was made possible through a generous donation  from the Xerxes Foundation,  and for listeners like you,  making pledges on our sub-stack.  If you'd like to join the tribe,  please do head over to our sub-stack.  Smash that pledge button,  or if you would like a tax deductible receipt,  you can hit the donate button  and make a contribution to our fiscal sponsor.  We genuinely appreciate your support  as only through your generosity that we're able  to continue to offer energy literacy on demand."