" All right, guys, it is time for second date update update.  When a pass guest comes back with a little update,  do you guys remember talking to Maggie, Maggie and Cole met on Tinder?  And they went out to a restaurant.  He took her purse.  Was it a Chanel Savannah?  It was in D. E. Chanel.  And he put it on the ground because it wasn't room on the table.  It asked for me.  And then she snapped at him.  We got it.  But they she apologized to him.  He apologized for not knowing he don't put a designer handbag on the ground.  They agreed for a second date.  She is back with an update.  Hey, Maggie.  Hi, guys.  Miss you.  Woo-hoo.  We missed you too.  I'm so glad you're back with an update.  I was actually shocked to hear the reason that he was ghosting you.  He thought you snapped at him when you, you know,  when he put your purse on the ground.  And then during conversation, he was like, well, next time he was all up for another date.  Well, I so basically we did go another day.  And it was fantastic.  We went for a hike.  We went out to lunch.  I brought a tote bag.  We had a great time.  OK, no design of purse.  No, no, no, no.  I have learned my lesson.  However, it's now been over a week.  And he's ghosting me again.  Oh, my.  I know.  So at this point, I'm just like, whatever, man.  Clearly he's afraid of commitment or something.  I don't even know how much the purse thing really meant him on the first day.  I like maybe it was just an excuse.  I feel like it kind of was.  All right.  Well, I don't think we need to delve into it.  If you don't want to get any answers, we're good with this.  I say you move on.  Amen.  I am ready to move on.  I'm ready to move on to a man that respects a luxury item.  There we go.  Respect the handbag.  Gents, let's go.  I love that.  Well, thank you so much for checking in with us with the update, Maggie.  And good luck to you.  Thank you very much.  Tips for us.  Yeah, and today's probably the worst day to deliver this news because it's Amazon Prime Day.  Oh, gosh.  But according to a new survey, nearly half Americans say they need at least $100,000 a year  to feel financially secure.  OK.  25% of respondents said they need one, 50 or more.  And then 77% of people said they did not feel financially secure right now.  I just need however much I need to be on a yacht.  OK.  So that's a lot more than most people.  Yeah, and that's probably in there $500,000 to million range.  Savannah.  My dream.  We're going to help you get there to that goal by paying your bills.  We pay your bills 13 times a day.  Your chance, the first one coming up this morning to win $1,000, coming up at $9.10.  Well, Scarlett Johansson broke a record.  She's become Hollywood's highest-grossing lead actor  thanks to Jurassic World Reebur.  She actually took over the lead role from Chris Pratt.  Yeah.  Her lifetime career box office grosses $14.8 billion.  That's in films where she played a lead role.  She announced her past the Samuel L Jackson, Tom Cruise, Brad Pitt,  like all of the big ones.  She's the big dog now.  That's amazing.  Yeah, she's married to Colin Jones.  She's married to I know.  Well, she was in four Avengers films in Captain America.  And so she played the lead in all of those grossing $14.8 billion.  Looks like smooth sailing for Orlando Blue,  and Katie Perry's co-parenting, the newly split couple spotted with her four-year-old daughter  on a double date with newlyweds, Jeff Bezos and Lauren Sanchez on a yacht,  Nidalee.  Now, Orlando went to the wedding alone.  She was on tour.  Apparently, she flew there a couple days ago,  and they've been walking around Capri stopping  for ice cream with her daughter.  They're making co-parenting look really easy.  Oh, that's nice.  I mean, I mean, it's Katie Perry, Orlando Blue.  At this point, I feel like anything's easy.  That's true.  You can see the photos I've got them on my blog.  And finally, is Olivia Kulpow expecting twins.  Her fans are convinced she just dropped a major hint  that means she's pregnant with twins or even more.  OK, why?  She posted a photo of her enormous.  I mean, this is one of the biggest baby bumps I've ever seen,  captioning the photo, buns with an ass in the oven.  Burgers on the grill.  Ah.  Not bun in the oven.  Gotcha.  Buns in the oven.  There's definitely a couple in there.  But I think she also looks so much bigger  because she's so tiny.  She's like five foot nothin.  She's like a little.  And I wonder if from behind if she'd even look pregnant.  But she looks, she's very big.  She looks like she's do any day now.  Yeah.  You can see the photos and more.  Kiss957.com slash Courtney.  Sabrina Carpenter, hey, she performed with Durand.  Durand the other day, if you know who Durand Durand is.  It is Kiss957.  Savannah's like playing at this morning.  First thing this morning, she's like,  I gotta hear this song.  It was amazing.  Like honestly, I love Durand.  I love Sabrina.  It was chef's guess.  If you want to check it out, it is up at Kiss957.com.  It is time for good news.  And I've got good news if you're headed up for breakfast  this morning, starting today.  This morning, right now, McDonald's is introducing  the new spicy McMuffin breakfast at which it's the same  as the egg McMuffin with the addition of spicy pepper sauce.  Also dropping today, the blueberry and cream pie.  All right.  Some sort of warm, big pie.  So really reaching here, McDonald's.  That's what it sounds like.  Are those back?  Like the little at the end pies.  Yeah, but this one is blueberry and cream.  And it's out today.  So if you get breakfast on the go, check it out.  That is my good news.  Savannah's like, I've got good news.  If you like tequila, I'm like, yes, please.  Hey, it's five o'clock somewhere, right?  So there's a brand new tequila coming out.  And apparently it's very exclusive, like so exclusive  that they're actually making you fill out an application  to purchase.  So much.  Yeah.  So it's called tequila Parisimades from Mexico.  They're focusing on like ultra premium ingredients.  And it's so ultra premium that the water that they use  an tequila comes from springs like 1300 feet underground.  Like it's crazy.  But yeah, you got to fill out an application to buy this  tequila.  Do you know how much it is?  It's got to be expensive.  They don't say, okay, well there you go.  There you go.  Probably really crazy.  All right, Jeff, good news.  This good news is a long, a whole trucker  from North Carolina spent tonight in Maryland.  He bought a lot of ticket.  and then he ended up winning $50,000.  Oh, that's it?  Yeah, I know, that's it.  But he's gonna use the money to replace the engine  on his riding mower.  Oh!  So he can mow his lawn.  How awesome is that?  That's something I would do.  That's a stretch too, Jeff.  It really is.  There's not much of the good news department  over here, Courtney.  I love it.  Good news, junk in the trunk on Kiss 95,  7-year chance to win everything you need  to get that beach body or the junk in the trunk,  or you could win junk from our actual trunks.  But either way, you're gonna win,  and it starts at 7-40 this morning.  Today's a great day to do a little shopping.  It is Kiss 95-7, Courtney and Kiss of the Morning.  It's Amazon Prime Day, but I feel like they have it every month.  Yeah, it's kind of lost its luster.  I would have to agree.  I kind of got excited.  Like Amazon Prime Day starts today, it goes until Friday.  Oh, wow.  Not only is it if it's like one or two days,  they've made it four days, and they make it every month.  So how is it really live?  I don't know, but you sounded pretty excited  when you found out your mushroom coffee was $4 cheaper  than it was yesterday.  I put it in my car yesterday.  Boom, all of a sudden, my mushroom coffee's only $13.  That's crazy.  $13 for coffee.  Really happy for you.  My now deals are only good if you're an Amazon Prime  member.  So people like me who are not prime members,  I don't really care.  But I don't understand why you're not,  because Jeff, you got deliveries coming to your house.  I know.  Because my wife and I have separate bank accounts.  So she is a prime member.  Oh, but you're not.  But I'm not.  I'm not.  I haven't shared the password with that.  No, because then it goes on her card.  Well, you can add your card.  You can add a different card to it.  But I don't want to have my wife trying  to figure out how to switch back and forth.  She doesn't want to call Mingle Fox.  Oh, my God.  It's like dealing with passwords with Courtney.  I know.  I know.  I agree.  But anyway, if you didn't know Amazon Prime Day  starts today, it goes until Friday.  Ashley and glass are very steady.  But I haven't a problem with her boyfriend.  OK.  He's acting strange.  She wants to know if he's got another girlfriend on the side.  And we are about to find out where the rose is coming up  in just five minutes.  All right, are you guys ready?  Yes.  You ready for a little war of the roses action?  Yes.  And we are going to Glastonbury Ashley's on the line.  Ashley's having a problem with her boyfriend, Ryan.  Good morning, Ashley.  Good morning.  Oh, goodness.  Listen, welcome to War of the Roses.  I know your boyfriend's name is Ryan.  I think in my notes, the producer said you guys  were together for two years or something.  Yeah.  Yeah, exactly.  And he's just been acting weird.  So what is happening now that's  making you think he's cheating?  What's going on?  Well, he blew me off to go water skiing with the boys.  He's never done that before.  OK.  Does he usually take you with him?  No.  OK.  OK.  Does he not usually hang out with friends?  I'm confused a little bit.  So here's a thing.  Like we're pretty like a mesh.  So generally, he takes me on stuff like that.  Like when he sees his friends.  OK.  OK.  It's almost like a lot of his friends or my friends now.  All right.  So he blows you off to go water skiing with the boys.  What else?  So that's not like to me.  That's not like red flag.  I don't know.  That's a big red flag.  Why?  Really?  Yeah.  Guys should not be together on a boat in bathing  seats without a woman there.  Ha, ha.  She'll be there.  I'm being 100% honest.  I'm being 100% honest with you.  If you see a guy full, a boat full of guys,  what's your first thought?  They're having like a batch.  No, not a water skiing.  No, that's not it.  Anyway.  Let's get back to the whole.  Yeah.  The trouble was going on.  All right.  So he's water skiing with his friends,  which he doesn't usually blow you off for.  Is there anything else?  Well, he's been really distant.  And I never see his phone lying around anymore.  OK.  Again with his phone.  Yeah.  Those are two things for me that are a red flag.  Yeah.  A guy needing a guy's day with his buddies.  That's not really red flag.  But being distant, yes, because guys get nervous.  And they're big wussies.  And then they seem strange and not leaving his phone around.  Yeah, the phone's a big one.  All right.  So let's just call him.  We're going to call him.  You're going to be listening in.  We're going to try to get some information out of him.  And if you want to talk to Ryan at any point,  you jump in, OK?  OK.  OK.  All right.  You'll be listening in.  Feel free to jump in.  Let's call.  And we just see what happens here.  I know.  Who's the forest?  Oh, I think it's me.  Good.  Tis that.  There are certain things guys  shouldn't do together without women.  OK, like.  This is Ryan.  Oh, hi, Ryan.  My name is Karina.  I'm calling from Flowers Express here in Glastonbury.  Just a quick courtesy call to let you know  that you are the winner of our online weekly contest.  Congratulations.  Contest.  Contest.  Yep.  So it looks like you actually entered online on our website.  And so we do a random drawing once a week.  And it looks like you are this week's lucky winner.  Congratulations.  OK.  I mean, is this free?  Yeah.  So yeah.  So you are the winner of a dozen gorgeous.  I mean, absolutely gorgeous.  Long stem roses.  The one catch that I will be honest with you,  it is a pay it forward promotion.  So we can't send the flowers directly to you.  But we are more than happy to send them to someone else  but on your behalf.  So you're still going to look like a great guy.  All right.  Yeah, let's do it.  OK, fabulous.  I have a card in front of me.  I can take down a message for it if you'd like.  All right.  All right, whenever you're ready.  OK.  Let's say, hey, you make a boom look sexy.  boom.  What's a boom?  Do I want you?  I don't want to know what a boom is.  I don't want to know.  So I'm a water scare.  And a boom is a pole attached to the side of the boat for, like,  beginner.  So for, like, beginner.  Water skiers. Oh, so it's like training wheels for water skiing. Yeah. Oh, okay. So it's like having the bumpers when you go bowling. Oh, I like that. Okay. All right. So you make a boom. Look sexy. Um, is there a name that I can address the card to  Yeah, uh, Christie Christie you said  Mm-hmm. It's Christie like a  Christie. That's what I'm trying to find out. Wait. What Ryan. It is. It is. That's your girlfriend Ashley Ryan. You're on the radio. You're on kiss 95 seven. Go ahead. Ashley  I'm asking you that  Are you getting flowers to another girl?  Because she makes the boom look sexy, which is apparently training wheels. Oh, my god. Look  You okay? Yeah, right. Ashley deserves to know. Ashley. Do you know anybody by the name of Christie? I  Don't okay. All right. Look, look I I didn't want to do this like this  Do what I don't know why you're putting me on blast here, but fine. Um,  I want to see other people sounds like you're somebody else. I  Mean I'm just telling you right now like it's not working. Okay  You aren't just in the things and I will click  You're not adventurous. I mean you think water. I'm a water sphere. You hate getting your wet  You don't even like going to the beach. You don't like getting your toes in the sand. I mean look  I'm just done. I tried  Together for two years  And you're just gonna go behind my back  Christie two of the most expensive years of my life. All right. Well done. Wow  We were together for two years. I didn't realize I was dating a two year old. Wow  Wow, yeah, I didn't realize I was dating somebody that only liked my magnetic strip. Okay  Doesn't like doing anything. I like doing I'm I'm through credit for it. Oh, I didn't know what that man  Okay, all right. Can I so you know this is going this is going south fast  Ashley, you've got your answers. I'm sure because you sent flowers to somebody else  But Ryan what you're saying is this relationship is over for you because you don't have enough in common  Yeah, and I mean it just doesn't seem like you know, okay, like it's working  Oh, okay, I would think it took you two years to figure out. She didn't like the water right like how it that's  That's stringing a lot. All right. Let's go. Let's go easy  You know, it's like we order in and she's always picky. Oh, hey Chinese can't do that. Oh, I mean  Always something I might not like Chinese, but I definitely don't like heaters  There you go, and you deserve somebody who's not a cheater Ashley  Absolutely, and you deserve somebody who's going to send flowers to you  Exactly, okay, I just can't believe you would do this  I'm gonna put you guys on hold. I want you to talk off the air for a little bit hold on Ashley  You got your answers hold on  Your chance to win everything at least get qualified to win everything to give you the best booty of the summer  Color 10 looking fee right now junk of the trunk, but it looks like smooth sailing for a lindo bloom in Katy Perry's co-parenting  they  Split up they made it official and now they're out having a little vacation in Italy with their four-year-old daughter  Oh, that's nice strolling the streets of Capri and buying ice cream and making it look pretty easy  So they didn't do the kid drop off at Burger King like most couples do like hearing Connecticut  Yeah, well they have somebody watching. Yeah, you know, you have to go with somebody  No, no, no, they're all by themselves. Yeah. No and said they're on a yacht. Yeah, I mean to an  800 million dollar yacht by the way if you're wondering how much that y'all cost nothing Scarlett Johansson has become Hollywood's biggest  Groasting actor lead actor. Thanks to Jurassic World Reber she took over the lead role from Chris Pratt her lifetime career box office  Groce's 14.8 billion dollars. Those are all movies where she plays a lead role  She has surpassed Samuel L Jackson Tom Cruz all of the big huge Hollywood actors  She has surpassed them all she's now new Maru no  Love well, she's been in four adventures films Captain America  And finally is Olivia Colpo expecting twins or more I'm thinking more  I think she's gonna have triplets. That's me her fans are convinced she dropped a major hint that maybe she's pregnant with twins  Or more posting a photo of her huge baby bum captioning the photo buns in the oven  Okay, and there was a girl behind her with like hamburger buns on it  But she buns with an s I think and it looks like she's doing a day now  Yeah, she literally looks like she is going to pop that's right  You can check out the photos and more in all of these stories kiss 95 7 dot com slash Courtney. Hi kiss  Who's this? Hi good morning. This is Jeff calling from Lynn. Tester. Yes in Winchester your collar 10  So yes you get to play with us junk in the trunk all you're gonna do is give us a number one through 60 and find out  What you want for junk in the trunk awesome? We're gonna pick number 55, please number 55, please Savannah number 55  55 is a Lou Lou lemon belt bag  Thank you so much you are welcoming out qualify for the grand prize which is a brand new ribonco elliptical  A booty sprout glute fitness machine and a step machine all of it. Yeah, that is wonderful. Thank you guys  You're amazing. Oh, we love you and who are you with today, jess. I am with my daughter Kaylon  We are pumped this morning about winning. Oh, yeah  Well, jess and Kayla. Thank you so much for listening. Thank you have a great day guys  Yeah, another chance to win with us junk in the trunk  It is Kiss 95 7 Courtney and Kiss of the Morning.  Savannah and I are obsessed with reality shows.  And she's like, oh, I just just got this list.  Things you need to do or how to get on a reality show?  Yeah, if you've ever wanted to be on a reality show,  a casting director just basically gave you  like the roadmap of how to get cast.  Go ahead tell us.  Tell us.  All right, so they said if you're looking at shows  like the traders love islands.  They say that you want to be like very authentic.  They want to see vulnerability.  They said don't be someone that you've seen  on like Big Brother or Survivor any of these other reality  shows they want to see who you really are.  Well, and take your clothes off.  If you want to be on Love Island, just strip down.  Yeah, and if you think that they're looking for a villain,  they're not.  But if you are naturally a villain,  yes, just kind of roll with it.  But they said the biggest mistake  that you can make when applying for a reality TV show,  having problematic content on your social media.  Yeah, get wiped it clean because they're having issues.  Love Island has some major issues right now.  One world just got the boot because of her social media.  But the funny thing is, Jeff, Savannah,  do you know she was asked recently to be on a reality show?  Really?  It's too late for her.  It is too late.  Go ahead, Savannah.  So the producers of 90 Day Fiance  literally reached out to me to be on the show.  And they're like, well, we think we might be a little too late  going by your social media.  I'm like, yeah, you guys are about two years late.  She was my word is so on it.  Oh, wow.  So if you could do any reality show,  pretend you're not married to Air Von.  Is that one you'd want to do because you like foreign men  and you want to K1 visa and all that stuff?  I don't know.  I feel like if I was single, I would love to do a love Island  or a perfect match or something like that.  Interesting.  Courtney.  Oh, me.  Thanks for asking.  Farmer wants a wife.  Yes.  Yes.  Or from couple to trouble.  Yes.  Farmer wants a wife.  There's a new one.  It's called Farming for Love.  It's the same thing as Farmer wants a wife.  But you go live on a farm with a cowboy.  Oh, OK.  Like I'm talking about a cowboy.  Cowboy farmer.  He's going to have some horses.  Maybe some fruit fields or whatever.  Gotcha.  Jeff.  Deadly as catch.  Oh, that's so sweet.  Seems like a fun show.  He's standing around, smoked sigs all day.  And you can't get some crab.  You can't be outside.  Why?  Because you would explode if you had funny ass.  And it's almost good.  So you would do Alaska.  Oh, yeah.  Absolutely.  100%.  100% of you know.  Come here with the phones.  What reality show would you be on if you could be on one?  Let's do that.  What reality show would you be on if you could be on one?  860-247-9570.  Farmer for love.  Farmer for love.  Thank you.  What do you guys?  Farmer wants a wife.  Hi, kisses this.  Hi, this is Melissa from Stafford Spring.  Melissa, if you could be on a reality show,  what would it be?  Alone.  Alone, yes.  See, I see.  I applied for alone 13.  I haven't heard some comments about three months  four months now.  But yeah, I could definitely be dropped off somewhere  and be alone.  I like to be alone with no people.  Oh, my God.  What was the app?  Did you have to do a video application?  It was not a video application.  But I sent some information and some photos in.  Oh, OK.  All right, well, you won't delete.  If you get chosen for alone, can you please call and let us know?  I absolutely am super excited.  Yeah, I'm going to try again and apply again  just to make sure.  But yeah, they say just apply and then sit back  and see what happens.  But I like to do survival and ocean craft and fire starting,  things like that.  I'm not an expert.  I don't do it for a living.  But I think it's super cool.  I could definitely be out there for a little while.  She doesn't need anybody to talk to.  You had me, but you had me at Bushcraft.  That's where I want.  Oh, my God.  I did.  Yes, that's called me and escaping.  Gotcha.  I love it.  Well, listen, keep us posted and thank you so much for calling.  Thanks.  Have a good day, guys.  All right.  If you could be on a reality show, which would it be?  860 24 7 9 5 7 0.  Do you knew Britain on the line?  Dee, we're talking about if you could be on any reality show.  Which one would you want to be on?  Amazing race.  Oh, really?  Good one.  Who would your partner be on amazing race?  Oh, my best friend.  Oh, OK.  Savannah would do good on that because she travels a lot too.  Wait, can I just tell you?  My husband on multiple occasions has been like, babe,  we should apply for the amazing race.  I tried, but my job said no way.  If you're going to be away that long, we don't need you.  Oh, I'm not right.  You just need to apply for something like amazing race around Connecticut.  Well, thank you so much for.  Thank you for calling.  If you ever get on it, let us know.  Yes.  Well, too.  All right.  What reality show would you be on 860 24 7 9 5 7 0?  Ashley and Bristol is on the line.  Ashley, if you could be on a reality show, which one would you be on?  Survivor.  Really?  We were just talking about that.  Survivor like apparently Savannah's husband wants to go on naked and afraid.  But you think you could be on Survivor, huh?  I definitely think I can be on Survivor.  I've been watching it almost religiously since the beginning.  I missed a couple of seasons in between.  But for the most part, I think I think I could do pretty good.  And I had applied way back when when I was a lot younger,  when you had a Sunday in an actual videotape.  Oh, my God.  So how long I've been a fan that you know what?  So funny about Survivor is not only do you actually need to survive.  You also have to worry about everybody else.  Like trying to screw you over at the same time.  Like it's a lot.  Yeah, I think what would be good for me is I'm very good at reading people.  Um, so I think that would be something that I could keep in my back pocket and use my  advantage for sure.  I like that.  Okay.  Well, listen, if you ever get on the show, please let us know.  You got it.  Thanks so much, guys.  Have a wonderful day.  You too.  Thanks for listening.  If you could be on a reality show, which one would you be on?  It's XO 2479-570."