Speaker A: You're listening to radio free hillsdale 101.7 FM. Welcome to off the Trails. I'm Nicole Suguartao, and I'll be your adventure buddy as we discuss some of my wildest stories from my outdoor endeavors. This week we have a special guest on the podcast, My Dad.

Speaker B: Hi, Nicole.

Speaker A: Hi. So this week we're going to be talking about desert hiking because of this article that Mr. Bertram, the radio professor here, sent me. But before we do that, we're going to go and talk about our trail markers. So I'll actually share mine first because mine isn't super interesting and I know yours is a lot more. I recorded earlier in the week, so I don't really have a whole lot to share. However, today I went for a bike ride right after my final, and it was a beautiful morning, around 60 degrees, and I biked over to Homer, Michigan. So it was around 40 miles round trip. And thankfully I had a headwind on the way there, which meant on the way back it was a tailwind. So I went pretty quick for 10 of those miles, which was fun. But otherwise it's been an uneventful week. Mainly just studying for finals. So.

Speaker B: Wow. It sounds. Sounds like a fun, fun afternoon that you. You had.

Speaker A: Yeah, it was great. What's your trail marker?

Speaker B: Well, my trail marker. Well, speaking of desert, last weekend I went to a friend of mine that he has a property out in the desert in the Mojave Desert, close to Blythe, which is at the border of Arizona and California by Colorado River. So he has a property, about five acres in the middle of the desert, very remote, very off the grid. There's nothing there. There's a little cabin, but no, no amenities whatsoever. There's no water, there's no electricity. There's no restroom facility. But we go there occasionally and we enjoy target practicing and celebrating our second amendment, basically. And. But in the desert, it was, I don't know, about 7, 89, 95 degrees. So it was pretty hot.

Speaker A: That's toasty. Especially with all the heat reflecting off the surrounding rocks and sand. That could get pretty hot.

Speaker B: Right. But however, comparing to 85 or 90 degrees in the city, 85, 90, 95 degrees in the desert, it's actually not that bad because the concrete in the city retains a lot of the heat out there. The sand, the rocks, the big rocks may get hot, but the sand doesn't really get that hot. But it was pretty pleasant. We camped and in the morning was actually quite chilly that I had to cover myself in order to, to keep warm around 3 or 4 o' clock in the morning. So it wasn't too bad.

Speaker A: Yeah, I mean it does cool off. The temperature in the desert can swing quite a bit, especially overnight.

Speaker B: It does. And then there was a, there was a slight breeze during the day, so. And we have shade, which is important. And we had plenty of water. We drank, I drink a lot of water. And we. Which is very important in the desert because you don't realize you get dehydrated because of the dry heat.

Speaker A: That's true.

Speaker B: Yeah.

Speaker A: So speaking about the desert, we're going to get into this article that Mr. Bertram sent me. It was published by Fox News by Stephen Soros. And this lady was hiking in the mountains of Arizona around Superstition mountain, which is 40 miles away from Phoenix. And the temperature got super hot, over 100 degrees on Sunday when she was hiking in May. So not even peak summer and she got heat stroke, apparently heat related issues is what the article says. And it said that she was hiking around 1pm local time, which is not a great time to be out on the trail. Midday is really less than ideal for hiking, especially in the desert.

Speaker B: Right. I think I, I read that article too and it just shows that people go out there in the wilderness without being prepared or without knowing how to deal with these extreme temperature ranges that can occur in those, those mountains and in a desert. Comes to mind where when we did the Rim to Rim on Grand Canyon Rim to Rim hike, I think you were what, seven or eight?

Speaker A: I was seven, yeah. So for those of you who don't know the Grand Canyon, obviously it's a national park, you can go visit it. But there's a trail that goes down to it. Most people end up visiting the south side. That's where most people go to visit. And so that's the South Kaibab Trail. Kaibab, yeah, Kaibab Trail. But you can hike across the canyon and we ended up hiking from the North Rim to the south rim and that's 22 miles one way. But you can also just go down into the canyon from the South Kaibab Trail and then come back up that again. But we ended up doing it rim to rim going north to south.

Speaker B: Right. So speaking of extreme temperature ranges, when we started on the north side, and the reason we started, I think it was around the same time of year, May, mid May, late May, is because the North Rim doesn't open. It sits a lot higher than the South Rim and there's a lot of snow that needs to melt off and allow the people to travel on the roads. And when you start on a north rim, I think I know if you remember, but it was quite chilly.

Speaker A: Oh, it was really cold. I remember the night before we left, it was very chilly outside. And in my brain I thought, oh, we're going to the desert, it's going to be warm. But no, you definitely needed a jacket. And it was pretty chilly. And the morning that we started hiking, we were layered up. At least I was because I was very cold. And then once you start moving, you know, you warm up and you peel. But it's a lot colder than you would expect it to be.

Speaker B: Exactly. And what the problem was, we didn't want to take a lot of warm clothing with us because as you hike down into the canyon, the temperatures at the bottom of the canyon would be over 100 degrees. So we, I think I remember I had like a handkerchief around your, your head instead of a hat.

Speaker A: Yep.

Speaker B: There were, there was no gloves. We didn't take any, we didn't take any sleeping bags because sleeping at the bottom of the canyon, it was going to be a hot, hot, hot night.

Speaker A: I don't remember us not taking sleeping bags, but I guess that does make sense.

Speaker B: Yeah, we didn't take sleeping bags. You know what we did? We had this little fleece.

Speaker A: We had a blanket. Yes. Oh, I remember that now.

Speaker B: And fleece blankets because a sleeping bag is just, just overkill for, for Grand Canyon. And we took our tent and with no rainfly, we just had the mesh on it in order to keep the bugs and the critters away.

Speaker A: The scorpions. Scorpions, yeah, rattlesnakes.

Speaker B: Rattlesnakes. But so that's that, you know, it tells you right there that you need to, to research and you need to be prepared for all these conditions and especially in, in a desert environment. And I don't know what those people did, but they should have expected at around one o' clock for temperatures to go up. You know, it may have been cool in the morning, but in the afternoon you get some sun.

Speaker A: Oh yeah. Well, I remember we had to keep moving because we were hiking through the canyon. But even when it got to the afternoon, we took a break over at Ribbon Falls.

Speaker B: And that's what it was called. I was trying to remember. I kept thinking Rainbow Falls.

Speaker A: No, it's Ribbon Falls because the green. It's this waterfall down in the canyon and it's completely covered in this beautiful green moss. So it looks like a ribbon. And you're able to hike up alongside it. And get below the waterfall. The water's not falling on you. You're under this ledge, but the mist blows towards you, so it helps cool you off. And you're in the shade.

Speaker B: I remember it was quite chilly.

Speaker A: It was very nice to get out of the sun. And this is actually, this is where we swapped keys because in order to hike from the North Rim over to the South Rim, we needed our car there. And so you trusted a random stranger to drive our car to the South Rim and, and we drove his car to the North Rim and we met at the waterfall and swapped car keys.

Speaker B: It wasn't quite a random stranger. It was somebody on the hiking forum there was a. I was a member at, and we communicated online many times. And, and I trust, you know, I trust hikers. I trust people, people that they love the outdoors. You can trust those people. That's. That's my experience.

Speaker A: That's true. I still think it's kind of funny, though.

Speaker B: It was. We took his vw. I'm looking at a picture, picture right now, a VW of Jetta or something. And he took our Forerunner. But another thing that we did, hiking through the desert, I don't know if you remember, but every little stream crossing, there's. People think of the desert, especially Grand Canyon, it's dry and. But there's a lot of little streams that, that flow down into Colorado River. So every little stream crossing, we did our mountain tradition, which is we stick.

Speaker A: Our faces in the water and get soaking wet. Especially if you're in the desert, you want to get your handkerchief sweat. And we had these little towels called frog togs. And they were thicker. It's thicker than a handkerchief. It feels really, really odd. It kind of reminds me of those divers have these little towels they use before they dive into the water. I don't know if you watch. When you watch the Olympics, they use those. And so it's kind of the same texture and they retain the water and help keep you cool. So we would dunk those in the water every single time, then put them on our head or on our shoulders even. And those really helped with keeping us cool.

Speaker B: Right? Keep you cool and keep, keep the, the, the sun away from, from your skin, basically, in order to, to stay away from dehydration. And then I don't know if you remember that. The other thing I would always recommend and insist on. And every time we stop. Where do we stop?

Speaker A: In the shade.

Speaker B: In the shade. And if you had, if you had. The trail was. Half of it was in the sun. Half of it was in the shade.

Speaker A: You hike in the shade.

Speaker B: Why hike in the shade? And people call me crazy, but, you know, every little bit helps, you know. So that's where experience comes in. And I don't know if these hikers, they went. They went out there. They went on their own, and there was nobody with experience with them. But it is tragic that something like that happens when it could be avoided.

Speaker A: Yes. You are listening to off the Trails on radio free hillsdale 101.7 FM. And let's get back to tips for staying safe in the desert.

Speaker B: Okay, where were we? We were at. Were we getting close to the bottom of the Grand Canyon? Yes, that was. That was wonderful. But we. Let's see. So we hiked to the bottom, was about, wait, 11 miles or something.

Speaker A: Yeah, it's around halfway. It's. I would say it's probably 10, because I feel like going up took longer.

Speaker B: Yeah, there's. I think there's more switchbacks going the south side. Yeah. And we took up the Bright Angel Trail, not the Kaibab Trail. There's two trails coming to the bottom from the south side. Remember? Remember?

Speaker A: Yes.

Speaker B: So there's Bright Angel. We. We took up the. The Bright, Bright Angels. But before we get to that, we spent the night at the bottom of.

Speaker A: The Grand Canyon and we drank the world's best lemonade.

Speaker B: Well, the next morning, we got there. We got there in the. Late in the evening. So the. The little store wasn't open. But there is a little store and a post office at the bottom of the Grand Canyon. Remember that?

Speaker A: Yes, I think I sent a letter.

Speaker B: To Sophia and they delivered the letters by the mule. The mule. There's a mule train that picks up. Yeah, exactly.

Speaker A: And if you are a Junior Ranger, you know, whatever age you want to be, honestly, if you want to complete the little junior Ranger program, you can get a special patch called the Phantom Rattler Patch, which you can only get down at Phantom Ranch at the bottom of the Grand Canyon. You can't get this patch anywhere else.

Speaker B: Right. So that is. That's quite special. I think you got two of those.

Speaker A: I did get two of them.

Speaker B: I think the following year, we did the trail up and down in one day from the south side, didn't we?

Speaker A: I think. I think it was a couple years later, but yes, we went. We went down the South Kaibab and then we went up the Bright Angel Trail.

Speaker B: Bright Angel. Yeah, but I remember the. The hotel night was kind of, you know, there's no wind at the bottom of The Grand Canyon, there's no breeze. It just all the reflecting heat off the rocks. It was, it was pretty. Not miserable. But I'm glad we didn't have a sleeping bag and I'm glad we didn't have a rainfly on our tent. And we're just looking at the stars and hoping for the morning to come soon because I think we went swimming in the Colorado river, didn't we?

Speaker A: Yes, we did. We went swimming the next morning. Morning, however, there was also a river at the bottom close to where we were camping. And I remember I went swimming in that as well.

Speaker B: And we met a family from Australia. Australia.

Speaker A: Yes.

Speaker B: They probably used to heat over there, you know, in the middle of the Australian desert.

Speaker A: But I will say you could definitely tell that they weren't the most experienced hikers because of the clothes they were wearing. I think what you're wearing in the desert can also have a huge impact. So not only getting, you know, your clothes wet through river crossings, but you want to make sure you're wearing light, breathable clothing. And actually looking back at pictures, I am a little surprised because I'm pretty sure I was wearing cotton shorts and a cotton shirt, which normally you should not be hiking in cotton because cotton doesn't dry out quickly. So you want to be wearing a nice lightweight material to help breathe and allow for ventilation. So now if we were to go hike it, I imagine I'd be wearing a thin, light long sleeve white sailing shirt or they have a sun shirt. I think they call them sun shirts. And then probably I'd still be wearing shorts, but a lightweight, breathable pair of shorts, not cotton shorts.

Speaker B: Yeah, yeah, definitely. Clothing helps a lot with whatever environment you're in. But yeah, it was a fun experience. And I think we had some friends with us, my mommy's friends that hike with us at the same time. But it was. I don't know if I'm going to be able to do that again anytime soon. It was quite a challenge.

Speaker A: It was really great. Another thing to talk about in relation to when we did the hike in a day. I think another thing that's really important is stopping more than you think you need to, because I remember I personally when we did the rim, or not rim to rim, but when we did the Grand Canyon in a day, I always felt kind of bad whenever we took a break because I thought we weren't going to make it up fast enough. But allowing your body to cool down is really important because once it gets to the point of being too hot and overheating it's really difficult to lower your body temperature. So stopping maybe earlier than you think you need to and making sure you drink not only water, but if you bring along electrolytes to put in your water or a Gatorade mix to throw into your water, that can help keep you hydrated as opposed to just drinking tons and tons of water and diluting the salt in your body.

Speaker B: Oh my God. I've turned you into a little hiking monster, didn't I?

Speaker A: You're just realizing that.

Speaker B: I just realized that everything I've been hammering on all these years.

Speaker A: Wow. It actually sticks.

Speaker B: Some of it stuck. That is great. Yeah, that is a great advice, Nicole. And just, you know, and all these things either comes from experience or you need to go with somebody that have done it before and learn from them and listen to them because you think you may know better. But experience sometimes speaks louder.

Speaker A: Yes, absolutely. And another thing is starting early in the morning again. I'm not sure what time these people started hiking at, but it sounds as if they were still out there at 1:00. So maybe they just didn't start super early. But when we did the. Both times we did the Grand Canyon, we probably started at 5am pretty early. And so it was cold when we did it in a day. I was wearing quite a few layers when we started out and I was shivering, I was so cold. But it's really important that you get out there before the sun gets high in the sky and really starts to heat up the surrounding environment.

Speaker B: Exactly, exactly. That is all that is important. And a lot of people don't realize that. A lot of people you see on the trail, they show up around 8 o' clock. By the time they get the gear ready, nine o' clock, all of a sudden start hiking. And by then the sun is especially late spring, early summer sun is pretty high up there and things start to get heat up.

Speaker A: Yep. And this isn't just exclusive to the desert, especially the Sierras, which is a high desert. Yes, it's still a desert, but it can get pretty hot up there. When we did the Mountaineers route on Mount Whitney this past summer, we got up to the camp area pretty early. I would say around 1 or 1:30. And this is high in elevation. This is around what, 11, 12,000ft?

Speaker B: Yeah, I think. Yeah, it's about 12,000ft where the iceberg Lake is.

Speaker A: Yeah. And it got really hot. We were laying in the tent to take a nap and I woke up and my whole entire back was soaked with sweat because we Were just lying there in the sun. The sun was dead overhead. And so don't just think, oh, I'm in the high mountains, I'm safe from, you know, overheating and that kind of stuff. It can really happen anywhere. So it's just good to always be prepared for that and make sure to take shelter in the shade, especially during midday.

Speaker B: Exactly. I remember there was no, no refuge that we could find over there because everything was just so exposed. And we were just thankful. Finally when the sun went behind the Mount Whitney Ridge.

Speaker A: Oh yeah. To get in the shade, it felt so nice.

Speaker B: Finally got some. But then guess what happened? The temperature dropped dramatically and everything got wet because all the moisture that, that was coming out of the rocks and, and our, our tent. I think the rainfly got red wet. But yeah, you never know. That's, that's the, that's the thing that you have to be prepared. And over there we also had a lake close by that we went and filtered water and we kept hydrated. And you just need to be prepared, basically.

Speaker A: Yeah, absolutely. I can't think of many desert hikes that I want to do in the future. I feel like I'm not super aware of many, but I think the Narrows in Zion would be great.

Speaker B: Yes, that is. But you're, you, you're hiking through water over there and you know, in the summertime you, you're dealing with thunderstorms that could.

Speaker A: Monsoon season.

Speaker B: Yeah, monsoon season. And a thunderstorm that could roll through and, and that becomes an issue. But I think. Didn't we do some hikes in that valley?

Speaker A: We did, but I, I don't think they were super long hikes. I don't remember ever being concerned about heat. They were pretty short from what I recall.

Speaker B: Yeah. Pretty close to the car all the time. But still people were get out of their cars in Death Valley and they get disoriented. You know, they, they start walking and all of a sudden the sun beats down on your, on your head. They don't have coverage. They don't have a head. They don't have a.

Speaker A: That's another really important thing we didn't mention. For me, the sun really affects my eyes and so I always need to be wearing a hat and sunglasses. So that can, that can do way more than you think it would. Especially having a nice brim hat that completely goes surrounding your head.

Speaker B: That it's only smart thing to do to keep, keep, keep your head. Because the head when, when you get cold in the mountains, what they tell you put something on your head. Don't, don't, don't worry about your body. It's your head. It's that you lose most of the heat from your head and your neck. The same thing with, in the desert, if you have your head exposed and all that sun beats down on your head, that warms up your blood and eventually leads to all kinds of issues. So definitely coverage, full coverage of your face, if you can, your head and, of course, sunglasses.

Speaker A: Yep. All right. Well, it looks like we've run out of time, but thank you so much for coming on the podcast today and sharing all of your advice and expertise. We'll definitely have to have you on again in the fall.

Speaker B: Well, thank you for having me, and I hope people learn from, from us or from, from you and stay out of trouble.

Speaker A: Yep. Thank you for listening to off the Trails on radio free hillsdale 101.7 FM. We hope you have a great week and make time to go outside and enjoy the great outdoors. We'll see you out there. Happy trails. Bye, guys.

