" All right, we're back for the final segment, and we were talking with Joe Schmitz, a secret  time of planning.  And yes, I just googled the curse of Chief Leatherlitz, refers to the persistent rain  and weather delays that have played the Memorial Tour at near-field Village in Dublin.  This local legend suggests that the tournament crowns are cursed by the spirit of Chief Leatherlitz.  Wait, you know what I am?  I am not leader.  I saw in line at two park in Elvis flew into the 9-11 buildings and then fake the moon  landing and then dug up Leatherlitz, that's what happened.  Joe, you have a couple minutes left to promote peak retirement planning and your new  book.  You've written how many now?  13 or just 13?  Yeah, yeah, just three.  You don't make me talk too good.  But no, I mean, if they want to request one of the books, they can just go to our website and  piqueretirepine.com and we'll send it out to them, just we'll just mail it out there and they  just have to give us their address and I always tell people I didn't write those books to make  a bunch of money.  You know, spread the word and all the help that we can give so I think you feel free to  do that.  We've got a YouTube channel.  They like to watch videos.  Wait a minute, back up for a second, I don't want you to rush through that.  Your YouTube channel is exploding.  You get so many clients from around the country, just because they see it on YouTube.  Yeah, it's been crazy.  I mean, we've got over 40,000 subscribers now, I believe, and we only started about, you know,  you're in a half started.  I think we've had like a thousand subscribers a year and a half and now we're at 40,000 and it's  awesome because we get people reach out to us from all over Alaska, Hawaii, California, New  York, everywhere.  But the beauty of piqueretirepine planning is you don't have to live in those places.  He's right here in Central Ohio, so you can go to the office, meet Joe yourself or anyone  on his team.  Yeah, it's a good point.  Because a lot of clients that work with us out of state like they tell us like, we want someone  local but we can't find them and a lot of times they say because they don't do comprehensive  planning and they just can't find that complete team on one place, the CPA, turning all  that.  So if anyone wants their help to, they can go to our website, they can schedule a call with us and,  you know, we can see if we can help them move forward or the real professional and you know  what, you can make them a lot richer.  That's what we like.  So Booth's just turned 57, he will tomorrow, most 57 year olds have how much money save the  average human.  Oh, and not much, 50% I can tell you that's like 50% of people pretty much like pay no taxes.  So that means your income would be 30,000 or less, 50% of the people and if you have a million  dollars or more, not only save but you're net worth then you're considered 10% population  in the country.  What are you, Boots?  I'm car rich.  He's got a lot of cars.  If I sold all my cars, I'd be fine, but I love them too much.  That's my investment.  They're not going to lose value.  I got my babies and they just, they keep one up in value.  That's my investments.  What do you think when you hear that, you're a number of guy, you're a financial guy.  Yeah, I mean, if it's Boots, I feel a little more comfortable with someone who doesn't know  what they're doing and says it, then I'm going to say you're cool.  Yeah.  You know, we were talking about different trade schools and things that kids aren't and are  learning in school and we were talking about how they don't know how to balance the checkbook,  right?  All that stuff.  How did you learn so much about finances and how to make so many people rich?  Yeah, I mean, and we talked about this early too, like so much of it is rooted in your household  growing up.  My parents taught me how to say, like whenever I received money, like they taught me how  to hard work hard to get money and then when you get it, you've got to give it, you've got  to save it and you can spend some, but there was discipline, and it's been, and it's been.  Yep.  So, you know, like, and that's something we encourage people with if they have grandkids or whatnot  is, you know, you get 100 bucks, tell them they can spend half of it.  They got to give 10% of it and they got to save 40%.  It's a good rule of thumb.  Right?  Good.  I do.  You're a big contributor to that, to the golf cart, we're rocking it and your names  on there, and I do want you to work here, but with me, everybody loves it, that's right  up here.  Yeah.  I'm rotating the sponsors on it, so you guys come meet people because you'll see a lot of Midwest  millionaires in need of your help.  So, you're going to celebrate the Big 5-7 tomorrow, you've got chocolate all over your arm,  you've got chocolate on your mustache.  I might burn myself here down to Pepsi G.  Right there, though, I'm talking to him.  Save that later.  That's chocolate.  Ew.  I'm going to see that.  He's got chocolate in his mustache, too.  Yeah.  Do I really?  Yes, you do.  Okay.  What are you going to say on your last thing here?  Delete.  Thank you for all the birthday wishes and treat your friends like family.  And your family, like friends, happy birthday.  Yeah.  This has been Raw Mindy and Boots on the one and only station in the city, News Radio, 6-10 WT."