" To EBITized Evil,  what just as this is Veggie.com.  Release yourself from order and logic and enter a new place.  It's not work, it's not home.  You're no mess anymore.  You're lost and you're not.  Nothing is certain.  Everything is possible.  Welcome to Worldcast and tour.  Meggie.  All my sim in this doesn't end well.  What is all the post?  My name is Kanye West.  K has a K and C, the most.  And I'm a child.  And welcome to the end of the pie.  Yeah, for a problem.  Well, back, of course, I'm not rolling alone.  It's been so good for me.  And it's a bad time.  It's a bad time.  It's been.  Yeah, like, it's been.  I'm a real man.  I've never had like an episode of it.  It's like together.  Oh, it's been a while.  I was into like a proper, you know, regular episode.  Oh, okay.  Yeah.  Okay.  What's up?  Are you good?  I'm good, man.  I'm good.  But home.  Yeah, I'm a sweet dad.  Nice.  I'm in the week.  I feel a week, but I'm better now.  It's much better.  Yeah.  You're so better than in the morning.  What?  I'm got better.  I think that the energy I've got from the guys.  Yeah.  I know they were teasing my mom my Jersey and stuff, but  positive working environment.  It's very, it's very, it's very, it's very healthy.  Yeah.  Very healthy.  Anyway.  What is that?  Yeah.  What's on your post?  What's on my post?  is man arm man like I feel like what conversations do you think  casp on your face and go we have when they together.  Let us think about this.  Go like cason who can't come to me.  Yeah, go stupid.  Yeah, goes to be who do you think I was talking about?  Go stupid and casp about to get what conversations do you think they having?  Except like manipulating the media and okay boy we need to do this.  I feel like those two.  No, I feel like they both able to use other people to feed their own whatever they do  not that moment.  You understand casp has a way of using these little influencers now.  He has them in his interview or ever take a little video or some of Caspar.  They can bring in Kimo Minie's house.  Oh, Sharaqi kung kung kung kung kung ma actually.  He's on Zansi and Zweets.  He goes on I think every Wednesday at like how fast I'm starting.  What is really dope.  Sharaqi.  Sharaqi.  But they able to use these other people.  Like I feel like goes to his tap into a state where he's just I don't think there's a creator  that's better than that boy in the country.  I don't think there is he's able to use his relationship to his advantage.  I feel like for him it's more business than then feelings.  Definitely.  You understand what I'm saying to you.  I'm telling you what you're getting.  No, he's able to.  I don't know what they don't mind the he types into, but it's going to take a while until people  are running realize that this was just in it for himself.  He can do whatever you want with anybody.  And anybody disadvantage.  He doesn't hate bro.  He's must at the art of I don't care what people say.  Have you ever seen him in the comment section?  You never seen him in the comment section.  I don't follow him.  You understand whenever things go besug in his relationship,  he'll never be the one to go talk about it.  So there's other party.  He's just there like I'm the king of the shit.  And but he does make those reactions.  But he's I'm just saying he's the ghost.  Human can feel like Caspar can whenever he needs something to train whenever he needs to sell  something.  He knows which buttons to praise.  Now at this moment he's trying to sell his three things.  He's selling those caspams, streaming.  We're talking about it now because he wants to store about it.  Yeah.  He needs that attention to know that okay, Caspar streaming now.  Yeah, I think you go there talk about the podcast.  You'll do this do this all the shit you can traction  so that he can get these twitch thing out.  And the thing is, a lot of people feel to understand that is this thing is just the game.  It's it's on a game.  It's not personal.  You're saying sorry.  Do you think it's only about the twitch one needs to go out?  Um, it's it's also but like at the moment, it's more about growing the twitch and sort of keeping  his relevance.  But it's more about the twitch at the moment.  Try not to grow it.  Yeah, because now he's in comment section or saying, you know, get less play game together.  Whatever he's a I saw this video.  Part of those screen recording from the twitch, uh,  streaming that he does, right?  So he was like playing, uh, I think Call of Duty with the kid on the on the video.  Uh, and he was basically like asking the kid who does your parents know that you're doing this  this and I was like, that whole interaction was very weird for me.  Did you see that video where the, the, the child where he basically got on stream with a,  with a child then they were playing Call of Duty.  Yeah.  And he was asking the child, you know, does your mom know that you're doing this?  And is she cool with it and stuff like that?  I was like, uh, I don't know, man.  You know, I think I think also he's doing fill up.  I think yeah, obviously he's trying to get traction for that as well.  Yeah.  You know, and that man, I just think he's very smart.  And he understands how media works like ghost who he does.  You know, and also what to creators like TV is changing guys.  TV is changing.  We now have podcasts or national television, you know, um, but you know what?  I learned bro.  What?  I learned that being a post was meant to be on like a CBC one.  You lying.  It was meant to be on a CBC one.  Um, I found this out when I went.  into the, what I did that event.  But I don't know that the guys decided to go for a choice  and notice a BC, who are meant to be an excuse  for what I think had nine or from nine  at like nine o'clock at night.  Yeah, they said it was a dope concept or whatever.  And then much to choice came through  was supposed to be an excuse.  You know that?  Yeah.  You didn't know that?  No, I didn't know.  But I don't know that.  But I said this one, what am I saying?  I mean, never.  No way.  I didn't get there.  I didn't get that.  I don't know.  I think it's a lot of...  I did, I did.  Yeah.  Yeah.  Yeah.  It's what it was last.  Yeah.  Oh, no, man.  How much I mean, lab.  Hey, okay.  You're getting it.  You're Paul's, bro.  What's up, my past, bro?  I attended beautiful events last week.  Yeah.  Three events actually.  You know, four.  When they just start going outside.  When they just start going outside.  I said, I went out last week.  Oh, you started going out last week.  Yeah.  Yeah.  Yeah.  But I do go out now, but not for...  I don't drink any more.  I mean, control of what I do and what I talk to.  I choose.  Yeah.  Right.  Yeah.  So I went to Kuye.  Hmm.  For some experience, beautiful event.  Those guys are the most organized event organizers.  Mm-hmm.  I have ever seen.  Not only because of production.  The way DJ's respect each other.  It's on another level.  If you know, or skittings are going to play later,  you don't play any song for just to do.  And if we did, it was four, it said,  it said, it was four, it said, it was six,  it said, it was six, it was six,  it was six.  It was six.  We did all our.  We had all my.  They're not under pressure.  You get that, you play your music if people vibe with it,  vibe with it, but there's rules.  It's like there's rules.  Good.  You can't be.  I didn't hear a song and repeat.  Okay.  I didn't put it away.  I did not hear a song on the repeat.  That was from me because it's events.  It has also been about the music.  That for me was dope.  That really dope.  I went to X-Fest.  X-Fest is an X-Fest.  I used this piece today.  He's operating.  Shout out to Susan.  And he's got an idea.  Whatever day he has is going to work for him one day.  He's like, I couldn't stay there for longer than 30 minutes  because it's just kids.  I swear, this probably a 16-year-old somewhere into that crowd.  Yeah, he's got 16-year-olds.  They were at my candidates.  This is YouTube channel.  I've been following.  They're doing amazing stuff.  They just include you making music.  You're a little kid, man.  Yeah, I like the movement.  Yeah, how it's so it was like none.  And I can't stay here for long.  But when I got this, I was playing.  Dub said, I think he has an idea of where  he's taking that kid or what the girlfriend plays.  You think so?  Who is a girlfriend?  Just Gigi.  Yeah, that's the girl that is his girlfriend.  Just Gigi is the girlfriend.  Not a girlfriend.  Oh, her girlfriend is a success.  In her best success, and in this other one, just Gigi,  who is the girlfriend?  I don't know.  I don't even know if that one was a girlfriend or not.  But there was an unclop of playing.  That was great.  It's really beautiful set.  I stayed a little bit longer because I was enjoying her set.  And they've got an idea for the two-in-day, man.  So I think it's just one.  I think it's one-six miles.  I think it's one-six miles.  I think it's one-six miles.  OK.  Yeah, I think I think they need to.  OK.  It's one-six, OK, but it's not.  It's working.  Yeah.  You get me.  Then I went to all black parts.  Yeah, Mr. X.  Mr. Mr. X.  All black.  And so what is it?  Mr. X.  DJ Mr. X.  Yeah.  And so I had to.  Yeah.  All black.  Yes.  All black.  Yeah.  That event was lit.  And the boy I surprised.  Guess who plays after Stokey?  We would do the shopping do again.  What?  On pick.  OK.  So when Nuga plays after Stokey, the healthy,  he kills it.  But he didn't play.  He played a couple of songs of this.  He's going to play the caban.  And then he played one.  I come on watch it lovely.  Stokey.  Oh, man.  Of course, of course.  Right?  And he killed it.  And after that, it's like, yeah, you see.  What's up, talk?  Come on.  Don't you do that.  Don't you want?  Then I was telling you.  What's up, why don't you tell you?  He said I must tell you that his set was dope.  Because I was saying to Stokey.  He was saying he's not a good person.  So he's a dope DJ.  I just felt like he said that Zendu was not the one.  Oh.  I'm going to take that back.  It was not the one I went to him after I told it.  It wasn't the one.  It wasn't hating in terms of what Zendu was.  That's what the, it's pretty human's after party.  Yeah.  I didn't enjoy that set.  You know, I felt like it didn't fit the crowd.  Yeah.  I think he's a bad DJ.  Yeah, but it was a, it was a, well,  well-planned event.  Man, I had so much fun like, it's pro, like,  I would like to go to events like that.  You only are talking about alcohol.  What has, what changed since you stopped, like, drinking?  What is it happening with?  Is this so bright to your views?  Oh, no.  I'm very focused on my business.  You're still.  Um, I've ever since I stopped drinking,  because in the music you only make your money later.  I probably now, if I were to collect the money made now,  I'm probably like 3.7 million of the work  that I did right now.  You see, 1, 3.5 million runs right now.  I don't have it yet, but I say when if I'm...  I'm getting it.  I want it.  Yeah.  Yeah.  Yeah.  You know, I'm trying to slow warm as well,  so, oh, show, show is.  Yeah.  But you tell what I'm saying.  Yeah.  What is it saying?  He's saying what she's saying, basically.  If you were to get all the money,  yeah, it has our BCT now and trippers  and some media and in the space of two months  that I didn't drink alcohol.  I'm more focused.  I'm waking up in Stujo.  I'm doing everything I need to do,  but I have some training number three globally.  Yeah.  Here's something that says sober.  You should do a demon master case.  Oh, the demon you use.  How did that come up?  I'm a glut by views.  What did you do?  Nobody's saying nobody's saying you bought views.  What?  Oh, I think that's the way it fits.  Nobody's fighting.  You know, that's not about.  That's crazy.  That's crazy.  I mean, six weeks.  Six weeks.  Is that my vacation?  Yeah.  Is that my vacation's influence?  Oh, is it because the song is just dope?  Oh, both.  Who's on the song?  Good flavor.  And master KJG.  It's one thing with Nalita, P1.  No, no, no.  Now, I also would not let a few did farewell.  Yeah, he's still one money.  I'm sitting on mine and now I'm about to drop an album with both of them.  And then that's more money.  So you see what I'm saying?  So to answer you, they helped me focus.  If I go out, I choose who I talk to.  What's this when I was drinking?  I was over friendly.  I wanted to talk to everybody.  Because like month, I give you and tell about me.  I'm going to improve.  I'm going to improve.  I'm going to do a song.  So it helped me with that.  I'm going to focus.  I have like, I'm able to, I had the idea and stuff like that.  But now I'm able to actually make it happen instead of just imagining it.  I'm going to do body.  We're going to do biomass.  Me and you like products.  Because I know that money is a lot.  It's much.  Yeah.  So it's on my pulse.  So basically, I came across this like comment or post on Facebook.  It's just going like post it.  It's precious Ramu.  Ramu Taylor posted this.  I quote, as an artist, whoever you take along to your gigs needs to have a purpose,  you can't be with people who are just there to consume your writer and have free fun.  They need to somehow contribute to your brand.  It can be as little as taking pictures content and etc.  Oh, yeah.  I'm going to say, hey, we're talking about it.  I'll see.  Yeah.  I'll see.  I'll see.  I'll see.  I'll see.  I'll see.  What do you mean?  Which one?  I'll see.  Oh, no.  I'll give it to you.  Okay.  You already said it.  It can be as neat as that.  Yeah.  Yeah.  I bought this through some miles.  Oh, yeah.  Just.  I'm a little bit.  Yeah.  Definitely.  I agree to that.  And then she concludes and says support isn't just a company artist to gigs.  Check your circle, artist.  What do you guys think about this?  Have you have your company and artist to a gig?  No.  I don't think no.  I think so.  You have, right?  Yeah.  I'm a piece of a problem.  I'm always working.  If I do.  You always working.  If I do.  What do you do?  At a time.  I'm right.  I'm right managing you.  I was doing something.  Yeah.  Well, I think on the day probably, there's someone doing  Red managing or I'm driving it.  Because at some point, I want a business.  So, did you not have a problem with the friends of the artist.  Being in the car or driving to kids with you guys.  I was lucky enough to have a team that it's always.  Smoke.  Okay.  It's very small.  Yeah.  So you're just never like I had friends.  come over for the keep also.  They would brah, but it's not as if every day most study pass balla.  Okay, but do you guys?  Ah, Marra.  But you do have friends, but it's not like every day,  it pass my tomb of anger.  They have their own occupations that will go support or do whatever it is now in the end.  But I tell you what you're saying, I would ask for instance,  for the body will rock up in a venue with like...  It is something boys.  There is something boys.  Yeah.  If he does.  Okay, you're saying sorry.  It's pretty chingy.  I don't count.  I'm just saying like,  back by color,  gobsy.  I think that's cops.  Don't want cops, come to specifically, you know?  Because you know it moves with like seven cars.  Yeah.  Oh, fuck.  Can you know?  Why?  You don't know.  It's true.  You feel like...  It should be like that.  Like the people that you move around is that it's duty,  road manager to do all of those things.  Take care, make sure that they don't take your seats.  They don't occupy that.  Make sure that there's no people bothering you while you're playing.  Do you feel like it's your duty?  Yeah, man.  It's important, bro.  As a friend.  Yeah, as a friend.  Just, I don't know, my road you guys jacket or something, bro.  Just make him look like a superstar.  Yeah.  And that movement, you know?  Just build.  Don't try to be a superstar and try to be the guy who they're looking at.  Now, don't be that guy.  Just take your friend's side.  It's just that really.  It's just that.  It's just that.  My face is not really okay.  I agree.  Like, you kind of have a lot of people...  If...  Okay, my mom and I want to be about hype men, for instance.  That's why I was mentioning people.  I was mentioning people.  I was like, those dis-hype men.  And usually, trust comes with them or they go to his events  if they're pushing a new song.  So he's looking to build that energy.  So my same ends.  Uncle Waffles, when she performs in essay,  she always pull up with a lot of people.  Always.  But about hype men, mostly are corn.  So I guess it's worth...  I don't know.  Do they get paid?  No, my feet are...  When she performs...  When she performs...  You know, my lady has an entourage.  But do they build people with the fundamental thing  in black guys?  Let's go to that.  People are not gonna burn as rich in our lives.  But I don't care what they say.  Whatever they are.  Not everyone is getting paid.  There's some...  Some of them must just be happy that you are around the growth.  Do you need to then enter or not?  No, man.  I think they come with an entourage.  I don't think they come with any...  What am I?  They'll probably just find a spot of girls  that are like, hey, guys, let's go.  They'll come through the stage.  Yeah.  I don't know.  I don't know.  They want to arrive with them.  They're probably gonna arrive with the dance as or something.  Yeah.  With Waffles.  Waffles, Waffles, Waffles, Waffles,  are live alone or whatever.  They brought these people to probably arrive  with other buses with the dancers.  Before Waffles performed, the team comes before Waffles.  Trust me.  Superstar level. Yeah, oh, she is a superstar. Oh, oh, oh, that one is the first time.  That one gets it.  So today for our piano origins, we want to talk about basically like how you see how the copy guys have been going back to the roots.  And, you know, incorporating white or sounds with the new age, I'm a piano and just, you know, revisiting those sounds. And so generally want to talk about like how artists are like going back to their roots and like revisiting all sounds that will produce that time and like incorporating it with the new age, beyond the new age sounds and all of that.  Tati.  Yeah.  What do you have to say?  And, honestly, I think at the moment, everybody is just now going back to where they comfortable at in terms of like sound.  Right. Like it's like, I feel like it's easier to make a sound that you grew up listening to because you can easily relate to it.  Like sounds where you're on the playing, your uncle and stuff like that. You know, it's so much easier.  Like back in the days of month or who ever that's what the copy guys are doing right now. And looking at Puri throughout like in Pretoria.  He's going back to that, that, that speaker rather than the Bacardi type of sound.  You understand what I'm getting at.  Looking at me like, I'm laughing.  No, no, no, I'm listening to.  I'm listening.  No, no, no.  Give me a call.  You're gonna, you're making a call.  I'm just a man to, I'm just saying this time around.  No, no, no, never calls me.  You know what, he has, he always complains.  This is a lot of things to complain about.  So he gave me a call and he was talking about,  and he just pointed,  because we're arguing about this whole poppy sound, right?  I was like, yeah, who's the same deep  and the stakes own the sound.  I was like, the own the sound,  but they didn't come up with the sound.  And I referenced that album that I was dropped by,  comes in a small and quester.  Remember that album, that's the right one thing?  I was like, I mean, this sound could have derived from that.  And he was like, no, it's different, whatever.  And he scooted me the entire time.  And it got me thinking, I was like, oh, shit, okay.  A lot of these artists are just going back to like,  the old and day sound, the sound they grew up listening to.  And I feel like every artist eventually  that was back to that sound.  Like, look at this, my face.  He does quite do now.  He's doing a tiny, it's so much easier for him,  because he grew up around that surrounding the roses,  Alex and was quite a ton of kook money,  mama, he got him a E20 and stuff like that, right?  Look at Zuma.  He doesn't even need to rap on beating move.  It's something he's formed off.  It's so much easier for him to just, you know,  gonna beat and kill it.  It's way easier.  So I feel like with every artist,  you eventually need to go back to your roots.  Are you one that's comfortable with artist being comfortable  or you want artist that take risks?  You need, as an artist, you need to take risks.  You eventually need to take risks.  But only with the sound that you comfortable with.  And it will make sense for cocons for you to come in,  and sit here and tell us,  you the sound drives from this.  I learned so much from this.  We thought I was doing right now.  I felt like I can infuse it with this current body of a.  I saw piano sticking this direction.  I decided to go this way.  And then it merges if actually need to merge the sound.  Don't change entirely.  You need to be able to merge it.  Do you think this is creativity of the run out of creativity?  So they're going back.  One can say the run out of creativity,  but for me, it's like it's just something different to the ear.  It's like we are keeping the old sounds alive.  Anything's in.  I don't think that's what they're doing, man.  Oh, now you want to speak with?  Of course.  No, let's go.  I think what time is time to say is.  Oh, you should have said it.  I think that's what I'm going to say.  No, no, no.  Don't take me off key.  Let's say.  I think I think talking about what he's trying to say is that, look,  you take the ion of instance.  The ion is a kid of quite.  That's what it is.  So basically the sound is evolving.  And South African artists, mostly the guys that we know  who are from townships, they can relate more to quite because they grew up to quite.  You have your quite be sound.  You have your wrist, Marjorie said they're just evolving the sound  and they're making it better.  And it's that's what's happening.  Same applies to that again.  American hip hop.  A lot of good hip hop artists, they're good.  They do good music out of their 60s music that they  were influenced with in America.  And it's that they just evolved the sound.  That's what is happening.  You beg to differ.  Yes.  I feel like there's stages, right?  There was a sound.  There was an 80s soul sound.  And then that's what you would see the millennials listen to, not even the millennials,  the generation before that.  And then you get the millennials that listen to quite though.  And then you get the genzies that listen to the new H.  I'm a piano, which is birthed by quite though.  So if you're saying that it's familiar to the sound, quite this familiar to the sound,  it's not familiar to the sound of genzies.  It's familiar to the sound of millennials, right?  Now from the evolution of the sound, right?  These people are now, it seems like after the new H.  I'm a piano, there's no longer going to be another like sound.  It's not going to create anything new.  It's just going to go back.  And now they're not creating a sound for generation.  Because they're still for a while, but they're creating a sound for a generation that  is not old, understand?  And then now what happens?  to the generation that actually enjoys genuinely  the new HMAPiano.  I don't think it's evolution.  No, but also when they go back  and create sounds that are familiar to like the sounds  that they're listening to the millennials,  it's like they now speak into a different audience now.  They able to swing in a new audience, you understand?  And they didn't go off the current.  Yeah, the current does not go anywhere.  The current is forever.  Yeah, that doesn't sub-dander.  Now, let me ask you a question.  Okay, if some deep today makes a piano song aqua.  Okay.  According to you, what is this target market?  Quite be right now.  Yeah, yeah, two just to before you answer,  what is this target market?  Seeing that the sounds that he's using  or is making from quite the generation  of now, most of them don't know them.  Yeah, I think I think it is.  Which is my belief is that he is catering for you guys.  And he's catering for us,  but at the same time, the older generation.  We're happy.  The guy said, yeah, man,  the guy said, listen to the room, do, do,  the room, do, that guy's interrupting the days.  Can relate to copy, man.  It's got sounds from day.  That's the whole thing, it's the infusion.  Where do you think copy the drive from?  It is that's from sound start.  That's why you're talking from back in the days.  So you tell them now, if there's a remix of,  we do Masri de la song,  we tell them that all the generations  are going to relate to that song.  What are you willing to let?  Well, what I'm trying to do,  I don't know if I'm speaking the right and.  Come in from Lower East.  400 to 70, imagine.  Dragons of Google.  And he should attack my Kadeak.  No?  Chinese are a language.  I'm probably a word,  but I'm probably,  I'm probably, the language is on the same team,  probably.  I listen to it because  I mean, the industry and the music business.  But I don't think that a group man  that grew up listening to a man-dosa,  or back in the days,  Bonjaga and stuff like that,  well, it's now currently like,  a California, California,  I could put a fire at a little symtee.  Okay.  I doubt.  He's definitely catering for a generation  that probably didn't leave that era of quite the way we did.  Okay.  I didn't fully live in a generation of quite  but are no some songs from the quite degeneration.  So if a hot man is now driving in his car  and a song by same deep place,  that's floppy and has that quite confusion in it,  he's probably gonna be like,  oh, this is, what is this?  It sounds like, oh, this is an remix.  Let me understand.  You understand how it works?  And he keeps going and that's what he's saying.  So it's also by two seconds missing something,  Masna, how kopuk, how kopuk, how kopuk,  how kopuk, how kopuk, how kopuk, how kopuk,  lastly, look on that is when you say,  he's keeping the old sound alive.  Yeah.  No, it's not.  What is he doing then?  I feel like we're gonna debate the whole deal,  but it's my question.  Yeah, time guys.  Okay.  Yeah, but okay, conversation for another day.  Yeah, it's a conversation for another day.  Let's move on to current vibes and trains.  He is hectic.  So those are videos of Zino Malu and Timi Siede, right?  And CC as well.  So I think they were on a launch,  something they were launching like a new phone there, right?  So they're standing in a group like, you know,  they're just standing there and taking pictures.  So it was CC Z and Timi, right?  So Timi's like, so how are we gonna do this?  So she's asking, we see how we're gonna take the picture.  Yeah, because they have to like have the phones  and frame that that that that that.  So now I was thinking of a sort of like standing like this,  one of three, I'm flat-held, yeah, boy.  And then I was in the video, which then a lot of people  thought was in normal was ignoring the legendary Timbeseet,  right?  And then now Zino Malu went and performed at a gig this weekend  and she said basically when she was performing, she was like,  hey guys, I'm going to cancel me.  I've also before you guys canceled me, it's in Golis.  And then she went ahead and sang in Golis,  I came in, they look all up.  But as she's seeing the song she adds,  and they look all up,  banging as the good thing I ignore,  it's time to sound, referring to the situation that happened,  right?  So now the whole internet is like,  when it's in Zokan's, who do you think you are?  You think not that you have a V3 hand-write,  Rata, Tati, think you can, what are you saying?  So yeah, so what do you think is this cancelable?  It's beautiful, baby.  Yeah, it's perfect.  I don't think of the whole situation in J,  in how she handled it actually.  I actually called her,  oh you did?  Yeah.  What is my baby?  Oh, no, that's something that's between a baby.  Okay, okay, I care about things that are happening  in the public eye with the gonna damage her career  or something, so I'll always call her never chat.  So I did.  She said that V2 is misunderstood.  Mm-hmm.  So whatever they were doing, whatever they were,  she explained whatever the name of the event.  She said she's been interacting with Ostemi.  Do you care what I'm saying?  Yeah, before the other lady arrived,  I don't like mentioning the name.  She's been interacting with Ostemi, right?  And then when the other lady,  when the other lady arrived  and then you wanted to take a picture,  I was like, okay, but I've been taking videos  or pictures with Ostemi,  let me give attention to this side.  She's not friends with none of them.  But did you watch the video?  I watched it.  Yeah.  But you watching the video where it's showing  her giving attention.  instead of that aside, but she's saying if you had the full video, she's been interacting with us, Tim, before that.  Am I making sense? Yeah, that part is not the internet.  Because why doesn't save the pimples?  Am I making sense? You get it.  Yeah, it doesn't save the pimples. So that part won't be there, where she's there with backstage,  talking, or whatever, whatever, it won't because it doesn't save the internet.  So in Kuluman, now imagine, oh, we've been talking, whatever, whatever, then you come,  and then you take out the camera, take a picture. I'm not going to take a picture with you,  and then probably go back to what we were talking about.  Okay. So I don't know that. Like, I don't think she's a mean girl. I don't think she's rude.  I don't think she would plan to do that. Yeah, boy. I'm Kuluman, I'm Kuluman. I don't think  there's something she would plan to do. You understand what I'm saying? And come on, these are kids.  She's a kid. Right? Yeah, you can go ahead. Yeah. Yeah. So I think that now,  what I fall to fall, it's now the performance that you're talking about. I watched the performance,  but I didn't hear the part where she says, uh, yeah, I didn't hear that part. I don't like that.  Okay. I'm gonna call her back and tell her, I don't like that. Don't because I told her,  no, no, ever use those things. Don't don't drag it. Yeah.  Put my gooeyie again. You understand? But I didn't hear that part. And then now I need to go back  and call her and shout it out. Yeah. I don't think that's my side. I don't think she's a  male. I think she's a nice person. Yeah. She's very smart actually. Yeah. Smart, not really, but yeah.  What? What? No, no, no, no, no. She can't let people take decisions that might make or break  she did something to me, but it's fine. But it's for another time. And I felt like we are a character.  She shouldn't have. Oh, yeah. Bro, it's a sense place. No, no, no. It's a sense place for another time. Oh, thank you.  Hey, okay. So hey, it's a matter of going into anything. Double voice is what's going on.  So this basically, um, you see, you know, oh yeah.  Yeah. Then laugh. You know, we are right. The song from for the host and go off.  Hey, yeah.  So this basically because I saw this, um, during the week actually last week, there was a video of,  I think two shots posted it and then he shot all two shots. It's two shots, right?  I don't just say he shot him. The vocalist. So he posted, he's like, there was a group of guys like that were chanting  Oh, yeah, came. Yeah, bro. And at, um, at a club. That's a cosmopolitan.  Yeah, cosmo. So like the whole chanting. Oh, yeah. And that is usually a crew that's out of  Oh, yeah. Like I said, it's a band. I feel like move off. Yeah. Yeah. It's a group of boys.  I'm good. I'm cool. I'm seeing. Yeah. So yeah. So now the crazy part is that he's now on the song,  but he has his own verse, right? But now that part was used under song.  So I'm cool. I'm seeing. Oh, he's on his own. He's on us. And they're not weird.  Okay. Okay. Okay. So now the boy posted and he's like allegedly, it didn't give them any credits  on the song because the song goes. What is it? Oh, yeah.  Damn. But like, oh, he's like, I can't but you can hear the chanting. You can hear it.  Like the similarities of the sounds with the UK. Yeah, it makes sense. You know,  this video of the guys chanting and then the sound will go. So now,  here, I'm of the video and like an hour after that. But I had already seen it. So yeah,  basically, they didn't give them credit for using their creativity in their idea and their whole  chanting situation. What should that be? Should that be a sample on like an interpolation? What is it?  What can be a sample because they didn't drop it? So what do you call that?  Just stolen sound stolen chant. The stolen chant. So the song is called Uyad features two  bunnies, J music and in Bongi, you'll see. Right? It's an uncle waffles for the host, right?  Which is like a three track project. And then two shots captured. So this is where they took  the clip and made an actual song. These are the original voices of Uyad lee my song by uncle waffle.  And then you tagged all these other pages. And this thing was going viral. And then like she said,  it was taken down. So then what can you sue for this?  Do you see you can, but there's two things then. Okay. There's two things. If waffle said it's her own,  right? Because we don't have the dates of you. Gather. I'm saying so. That's how you need to look at  we don't have the date when they were at Cosmo Polyton doing that chant. Right? And when waffles dropped  that song or started working on that song or went on that song. No, no, but so it could be a mind you.  This is people that go to each other studios. Okay. But I don't think then two shots would have  come out and said they took our chant and put it in the song. I don't think it could have come out  and said that. Have you heard it from them first? Yeah. But what if it's too short of it?  You okay? No, I get you playing. You playing 50, 50, but generally speaking, my videos.  I don't think anybody can just come out and claim that. But we are clearly my arm and made it a song.  Where is it?  He heard it day first.  Okay, they can be debated.  Okay, come on.  Okay, here's the thing.  There is a noir I say you can sue, yet,  apart from the dates that I mentioned, right?  Here's the thing.  Can you sue somebody now when he,  he records a song and say,  why not I let him okay?  Yeah, at the moment, yes.  What if I get to go?  Is that a song now?  Why not?  I'm okay.  No, that's a song.  Exactly.  So there is no follow up to those lyrics  or to that word that says he's he's you get one of them.  So you get one of it.  It's a chant.  Like it like soccer took all your, your, your, your,  I, I, I, I can't like, um,  it's a chant.  It's a called group.  It's all right.  It's a song that was recorded.  Like those soccer songs.  Yeah.  You know what you,  you don't know.  Yeah.  It's not as if it's a song that was recorded.  It doesn't have a song that has recorded dad.  You know that like,  you know what I'm saying.  If he had a song that recorded dad would lyrics and then he had,  he had, he had, he had right now.  He probably doesn't have a song that says that.  Does he have one?  Because the best way to do it is to play a song that you did that.  But you were to prove chanting.  So then the song is not registered.  That chant is not registered.  Okay. So it's ethical.  It's ethical.  It's allowed.  You can do it.  Yeah.  It's a chant.  It's probably consume it.  Whatever.  Because it's ethical.  It's just, it's just inconsiderate.  I'm going to hear a lot about, in a sense, like, why not play the deal?  I can't, I can't, I'm gonna go to,  I'm gonna go to Badran's and Khala because they're,  okay, I'm gonna have proof.  We don't have time for it.  Okay. Let's put it like this.  My feet are so forth.  For that's allowed you to come,  I'll go, no, I'm gonna,  and let's feed you for the sake of this conversation.  Right.  Let's say they did it first at cosmopolitan.  And then she took it and made it a song.  Right.  You're saying it's not, you're saying it's right.  It's ethical.  She can do that, right?  But I'm saying to the other guys, then,  how is it?  How does it, how do you balance there?  There, there, there, there.  They, I came up with it.  It doesn't matter.  We disregard it.  No, no, it does matter.  So then, what about that?  It does matter.  It does matter.  But so many people go that way with it.  With taking chance and make music out of chance.  Do you know that there's a bunch of music  times, ah, bah, katabak, katie, way?  Yeah.  Yeah.  Is it like, if, is it like a similar situation?  No, no, that's, he's got lyrics to it.  Okay.  It's okay.  It's okay.  It's okay, but but it's got lyrics.  Okay. Let's say, let's say now, let's say now,  reason, she's all I can't didn't come to you  and ask you to clear the,  around kumul, that then goes as an a saying  and meet a song, gee, because there's no song to it.  What is gonna happen?  There was no, because the same thing,  because it's not, there's no lyrics, there's no song to it.  No, there's lyrics.  There's, there's, there's,  isn't we at the moment lyrics?  Gosasana has lyrics.  It's, it's a phrase.  It's like, it's like,  it's like, it's like, it's, it's phrases.  But, but phrases are words though.  Bro, I'm not defending.  Well, no, no, you're not defending.  I'm not trying to say that there's chance  that we can't sue people for.  Okay.  You understand what I'm saying?  There's chance that you can sue people.  Does he have a song right now that we recorded?  Does he have a video out there where he's singing it before?  Before Waffle?  Before Waffle?  Okay.  No, we don't.  We only see a video in a group of Bruce Jaming  when Boris playing actually a different beach  and they jamming to claim.  You understand?  You understand what I'm saying?  I'm saying, in court, if they're going to court right now,  they'll lose the case.  If they were to go to court now, they'll lose the case.  But they can.  They can, but they'll lose.  I don't know.  That's what I'm saying.  Anyway, it's a long conversation.  Yeah.  It needs a whole debate.  Yeah.  But seriously, because it's not a difficult moment,  I record delay and then like,  like, like, and focusing was saying  way too, way too, way too.  We were fans, which was he had the case there, right?  According to him.  Okay.  Because he he took out of the song first  and then evidence for it.  There's evidence for it.  So he could come back and debate it.  So my, I mean, before I knew this song,  I knew your waffles before I knew that chant,  that the video that came out already,  you waffles once long time ago,  but you see, long time ago, not even now.  So when did they do that?  And that's a problem now, the dates.  I think they did it before.  But what do you think?  What do you think they took down the video then?  What do you think they took down the video?  I don't know.  I don't know.  You scared of who, yeah?  You think they think is that case?  I mean, he also did it to someone.  You know, two shots and stuff.  Okay, not really, but those type of the guy with,  I'm a, I'm a, I'm a, I'm a, I'm a,  I'm a, yeah, and then he took that saying,  why he ain't in Gomra.  Oh, for good.  Figuue.  So that's great.  Oh, I'm a, I'm a, I'm a, I'm a, I'm a,  I'm a, I'm a, I'm a, I'm a, I'm a, I'm a,  that's how I say, it's probably too short of heat.  You didn't get it, but okay.  So basically, the,  Bassati awards nominations were rolled out for you.  I think two expect.  Did you see them?  Yeah, did, did.  Yeah, it's, and there's actually something I,  I've, I've noted or heard about the fact that we see,  you know, or like apply for like the, like the,  the, the study awards everybody like putting an application  obviously, like you want to get nominated,  putting your work and all of that.  Isn't that the, the whole process?  Yeah, you need to submit.  You need to submit like,  you submit for awards, right?  Yeah, you submit for awards.  I know some has made tools and stuff.  Yeah.  to get nominated me.  Well, I've come you the best for this.  Oh, my God.  That's what I saw.  That would be honest with you.  But I've always decided to argue this.  I'm in a miniscently.  I'm something.  Yeah.  I'm not.  I'm not.  I'm not seriously like going to say let's know.  Like.  Yeah.  But yeah.  So my, I was kind of shocked when I, when I heard that,  these two nominated people that didn't submit anything.  Right.  So basically, they would ask you, obviously, like, put out to  be tell, OK, the applications are open that are there.  And then people don't apply.  But because I don't know, maybe they're not interested.  Or they feel like they're not going to get anything out of it.  Or maybe they forgot.  Or maybe I don't know what ever reason.  So, but now they still tell you to apply.  And then when you still don't apply, they still nominate you.  So I'm like, OK, I'm not right here.  Like, OK.  And then the same people that didn't put in applications,  you guys are going to make them win.  And you guys are going to disregard people that actually  submitted on time, people that respected your application  what was and put in the applications and all of that.  And disregard to that totally.  And just choose the other people that you want to  choose because why would you put other people that clearly  didn't want to be nominated and just put them on the nomination  does.  I think I think I'll close that topic.  I think you can go watch the tape.  No, I'm just go off my mind.  I will close it and then whatever.  I have to say, I mean, I think for if I was around properly  and for you to make money off of those holes, you need big names.  Exactly.  That's where I was going.  Hey.  What?  But that's obvious.  Yeah.  Because that's what I was having.  Good to see you.  No, but it was the same for a shi-  Yeah.  It's the title of the meeting.  It's the same.  Why you went up and nominated on my side of the woods?  No.  I'll always say your words.  No, but I'll say your words.  No, but I'll say your words.  No, but I'll say your words.  In the list, what about this when she was here?  Like the de-stevicryta woods.  We said it.  Malela.  Oh, she said, what's your number one?  Hey.  The, the, the, the, for the sesame.  Yeah.  The, the, as good as it looks.  Yeah.  Like, it's a place.  The thing is, most people don't submit.  I never submit to it, but I was nominated.  At this point, it happens.  I think I would agree to one of my features to say the last time I was talking about the  other words.  Which ones?  The other words that happened.  Which other was your name?  The other hours we went to earlier this year.  The Metro.  Yeah.  Oh, yeah.  You're against the Metro's now?  No, no, no, I'm not against them.  It's like the, what he said when we're having the conversation about those specific words.  Right?  My chat is about awards.  Because now like, what do you mean, though?  You just do you hear from to gain?  What am I gaining out of it?  I'm not gaining anything.  And it's that.  I don't know.  Yeah, but I mean, I don't think awards would really like hit that hard if like the big  names were nominated.  Yeah.  You know, it makes sense if you're like, if you're not being awards and like, our police  and cops are nominated.  Like, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the,  the, the, the, the, the, the, the, the, the, the, the, the, the, the, the,  what do you wonder there?  You wonder big hacks.  You want people to get involved in voting and stuff like that.  So it makes sense when you use relevant names.  Names that are actually relevant now.  Yeah.  Then what about a student piece names?  So I think Zinewell is leading the pack, man.  Yeah.  With the nominees.  I'm a, I'm a pian artist of the year.  Uh, you know, I guess two, at least two females.  Yeah.  Yeah.  Yeah.  I'm a pian artist of the, obviously females.  Uh, Tetra Huts.  Nah, we have Bobby Cooper here.  My favorite.  We have Paracie.  Okay.  Bobby Cooper, Basie, Bobby, uh, Zinewell and, um, I'm on bail.  I think it's fair.  My brother is there.  Yeah.  And then we're here.  So show me your power.  And that line up that you called.  Thanks.  So I said, media power.  Go up there.  Okay.  Okay.  Okay.  Okay.  Okay.  Say the list.  Wait.  Who's not here that you want here?  Who's not here that you want here?  I'm a pian artist.  I'm asking you.  Oh, Tetra Huts.  What the fuck?  Tetra Huts and Trays.  What a chagravo.  This year.  Oh, what, what are we in the winter life?  It's like a view.  It's winter life.  But, but I don't care.  Hey, bro.  Whoa.  Hey, when I tell you, what's in place?  Hey, bro.  Come on, bro.  This year.  Who to replace?  Who to replace that?  What?  Who to replace that?  I want to say the name you already know.  Who?  Massey.  No.  Is it here?  No.  How do you do this year?  Hey, how do you do this year?  Why did you do this year?  She's a full audience.  Oh, why did she do this year?  She's on the billboards.  Why did she do this year?  That's a clause.  Why did she do this year?  She said, I just told you.  And I'll give you a point.  Did you go and check now and Instagram how much followers  she has got phones.  She's focused.  Go for it.  So it matters.  Exactly.  So this year of the year, and I did you have the year.  We have a lot of Hanachon.  Is it in the web?  Nobody from Mappiano, which is crazy.  Did you say that?  I'm there in the web.  There's a lot of stuff.  Yeah.  What is it?  Did you say that?  There's a lot of stuff.  I'm here.  I'm here.  And I'm here.  I'm here.  I'm here.  Okay.  There's a lot of numbers.  No.  No numbers.  Or some of the year, we have Zino Maru and some time.  Maybe the strategy there was.  And then we went longer to.  But guys, moment.  Well, I'm not going to go back to the chair.  No, we're not going back.  But guys, think about it now.  I think, no, there's a machine behind the song.  There's someone behind the song.  There's someone very powerful behind this.  There's no way.  It's doing too much.  And they are jumping.  So we need to give it some rest.  It's doing too much.  I love bus.  We chat a lot.  Now we're good.  And let me say this is the song.  You know that?  He said it was a recorded new studio.  But it's another story.  It's another story.  It's another main is his.  And then again we have music video of the year.  We have see again the public who powered puppy Joe and then they're  my parents in the rest of our people.  They're my parents.  For what?  I have no one.  Let me go.  Oh, you remember they gave my parents.  You met a man.  When you, you and you, you, you, you.  You said, you know, for that, that, that place when she came in to, to  greet us.  What's the place to do?  Oh, yeah, oh, I'm sure it's that.  I know you're girl, but I'm so let's take us in the  second.  You know, you let the number of chutta s and he  couples and has a s.  I guess I gave you a talk.  I bullshit.  OK, sorry.  Sorry.  It's amazing.  Oh, I'm seriously bullshit.  She's a kid.  Yeah, but my is just that reading,  and Bazzari music, oh, that's what we feature in, in, in  Namapiano.  That's basically it, man.  Yeah.  Yeah.  All right, man.  Let's go beyond the music.  Hey, why are you excited to guys?  Hey, guys, you're OK.  I saw a video in Minang Yaman and Namavaj.  Today on TikTok, actually, it's an identity in the video.  Nellie Malayla, and the video she's like, she doesn't have to go to  piano.  She has her own piano, having their in the house.  Because if you have, yeah, or my  will, I don't know between the two on TikTok.  And then I saw the comments that were like music,  I'm like, nellie, my lady is in a relationship with the  musical shape.  So to clarify, beyond the music is about beyond the music,  guys, please understand that.  Please don't come for us.  It's about anything beyond the music.  OK, thank you.  So yeah, it's back to the chat.  Well, I don't put in case of your...  Oh, shit.  I'm not eating...  And then he's eating the music on the show.  Yes.  I didn't see that one coming.  I also did.  You know, I'm not that that doesn't fall.  When I meet a legend, I'm not going on nice or whatever.  She's like, you know, I'm like,  into a time with us.  I'm a piano DJ whatever.  I don't know if he's sitting.  It's one by then.  It was all.  She told me she's like, I don't know if this thing is serious or not,  but I'm just like, I don't take it serious until I saw stuff  with Peeta and I see her as the artist.  She's in that studio with the musical shape.  They're playing a piano together.  They're in the studio together.  She's like in his house.  They're all dancing.  It's all lovey, davey, bro.  Seems like she's in love.  It seems like it's something she's been longing for.  You know, I feel like she's been wanting to get into a relationship.  No, no, no, no, no, of course.  You know, with someone else, which is in this case is the musical shape.  And one I saw that happened.  I sent out to go screenshot and I sent it to someone to me too.  I sent it to you and I sent it to shots.  Shots in notice on a lady.  I feel like you just didn't want to see it because  I mean, he loves my lady too hot.  Shame, shall I?  Yes.  You know, so many ladies gone, bro.  Not any.  I'm fucking market.  What do you think, Spisou?  Ah, my happy phone, I like this.  She's definitely a lover.  You can tell someone that love really is.  It's a haitie, yeah.  But for Chef, I'm happy for him because it's a good move for him for his career also,  is giving me a friend of the tea and Cindy Vakate, exactly my point.  Yo.  Must?  That's what I'm doing.  You don't know the vibes are getting.  Like I know the ladies is in love.  My lady is in salabades.  I really love.  My lady is genuine.  Yeah, definitely.  It's really genuine, especially when it comes to that.  She's very genuine.  Yeah.  But for the adabru, I don't know, but I'm just getting those lines.  It's good for musicals, friend.  Yeah, true.  But when you meet the coach, you feel like he's like,  I'm a man.  But why him?  Have you met him?  Ooh.  Miss coach, I'm fine.  Let me tell you something, right?  Let me tell something.  So I've been following the lady for a while.  Like I've been like, you, you, you, you, you, right?  And she's always been very open about like, I'm a relationship.  Even if she doesn't show the face of the person.  But she, she would tell you and she'd like, she goes out to see the guy,  taking him a, it's me cutting him a prison.  Ta, da, da, da, right?  But in the lady, it's always been like, like a love or girl like that.  So if anything from the lady side, it's definitely something that's  done on her.  Yeah, I just hope from that aside, it's genuine.  Oh, it's not a marketing strategy.  Have you met the musical chef?  Oh, no, he's very well.  But no, he's more.  Do you think he's capable of that?  I don't think no.  Do you think he thinks that that's a problem is not a talker?  Yeah, he's, he feels.  Is it just a talker?  It doesn't talk too much.  But the, but he does he strategize.  This might.  Oh, okay.  Okay.  That's good.  The thing is going to go for.  I wanted to go for this.  That's a call.  No, no, no, no, no, no, no, no, no.  Still here.  That's a call.  A lady, a.  Yeah, but well done, man, go to the relationship to my lady, man.  Yeah.  I hope you will.  She's now cooking there.  So why was the let me on the music?  Hey, hey, hey, is going on in these industries?  You know, I must have his and.  And who?  Hey, hey, how's that?  And go as continue allegedly.  This is all alleged by the day guys.  Oh, must have been in go to school.  Yeah, I know they're dating those ones.  They think all right, I'll full chest.  I'll full chest their daughter.  I'll take it to her.  Oh, no, no, no, no, no.  I'm not going to do that again.  That's come on.  I mean, come on.  These shooting videos in the same kitchen.  How did you put the pieces together?  Yeah, how did you put the pieces together?  Come on, bro.  Like, you went on that.  No, but I've been knowing.  You know, I've been knowing.  And I'm just glad that I'm not the one that put it to public.  I'm put it to.  I'm hoping it's about...  Yeah.  But I'm hoping for two months now.  Yeah.  But I was able to hold myself.  And until people started speaking about it.  Not that it's out there, I can fully say it's the truth.  They have to care that day.  You know what I'm not even asking people.  What do you love, Vic?  But I mean...  No.  She's a nice person.  I was never mad, huh, bro, for some reason.  You know what I'm going to go with?  No, no, to me, to me, to me, I see your videos.  I've never faced a face.  Yeah?  No, man, I think they're good for each other.  I mean, the age difference is like a few days,  you're a part of something.  The bum, the two means that you're older.  Two means go to go to school, to me, in this case.  You know, the name is Dumi.  I know, no.  Yeah, yeah, man.  I think...  I don't know.  They're good, bro.  And obviously, they're not out in public like that.  And he's not trying to use this relationship to like,  boost this career and stuff like that.  He wants to keep it private and stuff.  But it's public now, not that people know and that we know.  I feel so traditional about this.  About...  Must have been so interesting.  No, no, no.  As you're speaking, I'm trying to put the pieces together.  Yeah.  Say how?  Tell me.  But I think it makes sense together.  I've never met Gog's contain.  That's a problem.  Like, I'm going to ask me, who would be,  if you should, or if you should, or if you should, or if you should,  or even...  So to me.  I'm a sword, but yeah.  That's immediate.  No, no, no.  I'm not sure that I knew.  Someone should have done, I knew.  Bro, my feet are...  Wait, my feet are...  Okay, wait, nigga, nigga.  No, no, no, no, I'm gonna give you a practical example.  I'm further than to do.  What?  What?  What?  What?  What do you mean?  You're going to be telling me to do the...  I am...  What are they doing?  I'm trying to do...  I'm trying to do the...  What do you mean?  I'm trying to do the...  It's impure I'm midget.  No.  You're the answer to the question.  It's impure I'm midget now, because I'm trying to...  I'm trying to...  I'm trying to...  I'm...  I'm not an interesting.  Exactly.  So is he a midget?  Stop labeling us, yamabara.  Don't do that, eh?  Okay, it's all.  Yeah, man.  Yeah, but I approve of that relationship.  I don't see any of that.  I have a couple of dishes beautiful from the videos I say.  It's a beautiful lady seems like very well put together.  She seems to me like someone who is about the business.  Like from the videos I see and...  Did it...  Does she have some forecast?  I see clips of a podcast or something.  So she's been...  Yeah, I think she's our put lady together, lady.  I think they do our together.  It must have pieces...  It's focused.  And I mean, she's actually willing to like help him  in like promoting his songs and stuff like that.  But he keeps on saying no.  Well, we spoke to him to him.  He was like, no, he doesn't want that.  That involved in his career because he just wants to do it by himself.  He doesn't want to just, you know, make a relationship,  and to all and make it all in the public eye.  Now people stop focusing on the music.  Because of their relationship.  But if you should, it is gonna happen.  And it's the next thing you're gonna be seeing them together.  She's probably DJing his behind the decks with all and stuff like that.  It's probably gonna happen, man.  But we love it for them.  Why have...  Is he planning on being a pastor as well?  I don't think so.  I didn't ask him.  Is he planning hard?  Goist continues, so he's a pastor now.  So he's working if he's planning to...  Who got a pillowy samaam?  Hang into our quits.  Come on, she got pants.  Hi.  I'm used.  Yeah, but that's that.  I wish you guys well.  It makes sense, I guess, together.  Do you approve of it?  No, but I feel like you just heard from what he did to you, Fred.  Not not really.  Who is the friend?  Who is the friend?  How you can find a way of putting the ad together.  So, bro, my step piece was fucking...  My step piece was fucking lee art for four years, right?  You were fucking before years.  I don't know.  You understand?  So, and then apparently he cheated on lee art and started dating...  And then, yeah.  And then you know how friends are and stuff like that.  Do I ever hold it?  You can't do this to my friends.  I feel like she's just being a good friend.  I feel like she's being a good friend.  No, no, no, no, no, not even.  It doesn't make sense to me.  I've always viewed her,  from a perspective of someone who's matured.  Oh, mama, langyan.  My name is Leopin and this is from Tien.  And also, them in a relationship with my step piece,  the person who's still very much young.  The man who doesn't regardless of his age,  he's still very much, you know, the streets that are there.  It is with Dumi's little chitty, like,  as a child, she's lost a child.  She's dealing with...  She's been dealing with a lot of things.  I don't know, man.  That come more.  That's not an excuse.  It's not taking.  But it never...  What money do you need if you had a choice?  Masterpiece.  In the streets.  Hmm.  Probably someone likes to access.  She looks too soft to go break a heart in pieces.  Yeah.  Anyway, as you also told me that you had something...  Your bro.  And, you know, this guy...  This guy's business has always been preaching about...  About Dalionga and...  And that Tixigo.  Is it...  Tarrin.  Tarrin.  You know,  I've been on why they together.  I lost our relationship with them.  They brought a buddy to me that Dali Wonga is no longer with them.  You're going to guess who is dating?  Lady, that's going to be like a...  ...look, with the manna Jan of the industry.  There's a lot of ladies in the list.  He's in the toilet on a reality show that you walk on your back.  I walk on my feet.  Oh, not on the same way.  London, London!  London, London.  No way.  You got that right?  I call that highly.  Yeah.  I'll be right back.  How does that make sense to you?  To me, it's like it's the pocket heavy enough.  You're real.  Because she strikes me as a person.  Okay. Yeah, Marash, she strikes me as a person that goes for like,  like, Marco Tumayla, people that have money.  How did that even come about, bro?  What do you mean, meet?  When I love learning here, but like, I want my sister.  No, but I don't know.  My name is love.  Yeah.  Like, let me challenge something about these ladies.  We will look at them the way they got famous or what they got them famous.  Or how, how they introduce themselves to the industry.  Yeah, it's the industry.  Like, most of these ladies are not what we think they are, bro.  I want to be honest with you.  Like, they have that aspiration of being a Mako T.  Cook.  Take care of your man.  Take care of that.  You have that.  They just don't want to do it in a broke home.  Or they want to do it when they know they stay.  You for gold.  You want to send out a thing.  Yeah.  So, learn this.  But do you think they'll work and provide that for for for for for for for.  If it's true.  Yeah.  I think you can.  Bro, what is what is what is what is what is what is?  What is to very well somebody also not that he put a house.  Yeah, that's what I know.  And he put a beautiful house and blue.  Beautiful.  It's beautiful and big.  And blue valley.  The expensive things.  The legend.  I mean, maybe this is a thing.  No, but it isn't one is still into time with these Mako T.  Man, I think we're gonna come for him for for for that.  But I like we said it's allegedly we don't know.  Yeah.  Sure.  It's true.  They're dating.  But do you think it's safe for him to do that though?  I don't think.  The head of his career now.  Not that he's got you know the other decals and stuff like that.  Don't get things over here.  I don't think.  I don't think so.  I don't think I don't think she would date.  Won't I if that's true.  I mean, if she's if it's true that they're dating.  I don't think she would date.  Won't I if she still had someone or sometimes.  Yeah.  Yeah.  I don't think.  But I learned this very smart.  Like I'll wonder try to make a plan for you to like spend like a good  10 minutes and have a few minutes.  Oh, you've been in the house.  Yeah.  Yeah.  It's been a business studio.  Like I recorded this for almost.  And she can sing.  But do you think that relationship was going to be like fruitful?  Do you know what I mean?  When you was with like,  Tamron, they were both in the industry.  They were like both exploring outside world like overseas and stuff like that.  Come back.  I have conversations of how we're going to tackle the,  well, tackle the, the market.  Do you think he can do the same with London or are they like in different worlds?  London London is making music.  It's back to making music.  Yeah, she's back to making music.  And she can actually sing.  That she can actually sing.  That she have a song that's known.  Yeah.  Even though I love it.  She's a good mother.  She's a,  she is with the guy that passed away.  Did you say somebody?  Oh, yeah.  Yeah.  They did that.  That's a lot of it's been dog London and work before.  London London was signed and ambitious at the time.  Sometimes.  Yeah.  So she's a musician.  She knows they don't know how she's done this.  Yeah.  I know how she lost focus with the music side of things,  but I know she's back now.  Like she, she, she wants to focus on it.  I think perhaps it's the long, then you want.  But if they dating or if,  yeah, which is all that.  If,  but they,  one of the one that's rumors,  one for one.  So for now on pause,  Galahala and Limingala.  So for both.  I wonder.  I wonder.  What do you think,  because the breakup?  Oh, from,  whoa,  the longhand and the turn.  Oh,  I have a few to spoke about this before,  but rather those sorts of been in and out of the country too much.  They've been,  but they're insinuating.  Bro,  the song is crazy, bro.  Yeah.  Well,  that's,  that's your fucking,  David.  I,  I,  I had the reason she broke up with the longhand because.  She was fucking Davido and the,  that's why, you know,  the,  the,  I think we have a song, right?  Yeah.  That's all.  Yeah.  That's all.  Yeah.  That's all.  Yeah.  So now,  okay.  Yeah,  that's all.  So,  these things happen.  No,  you're all.  And walk on a hall.  I,  they okay.  It's big for them.  It takes me.  Why?  I lost him.  I'll talk.  I lost.  I lost.  Hey,  I have to ask, bro.  Like seriously,  this,  this case that care about you and I care about them.  I think,  I think,  I think,  I think,  I think,  but I just feel like the videos are there fish to fry in this case, bro.  Yeah.  I mean,  but Dalu to Davido,  I mean,  you can already see, bro.  What you see,  what's girls wouldn't say no to Davido.  Most girls wouldn't say no to Davido.  So thank us.  I got the soup.  Yeah,  but if they dig that,  that's what's called sleeping on your back.  What?  Yeah,  a pun.  I mean,  because you said you just don't like that.  I don't like to say that about.  She makes my skin on her back.  No, no, no,  no, the,  the lady was like,  I woke up my feet.  You woke on your back.  Yeah.  So why would they sleep with Davido knowing that Davido's marriage,  unless there's something.  No,  but,  but,  but,  but,  but,  but,  but,  you,  you,  you,  allegedly,  you.  You.  You.  What?  What?  No, man,  the video,  I think the influence is there.  But I don't.  Come on, man,  that's what you say.  The influence is there,  but I don't think to that extreme.  I don't think so.  No.  We'll get to that.  We'll get to that.  What do you mean,  what do you mean,  you,  do that?  to extend when you just said that,  quay la, 2.0,  as obviously someone powerful those are our two.  But Abra, quay la,  and as you see,  quay la,  is a guy's calling us pushing it, bro.  Quay la, it's pushing it.  It's been the for too long.  It's still a good song,  but I feel like it's played its part, bro.  It's played its part.  Now I just feel like there's probably a label  or there's someone behind it  and pushing it.  It's just, you know.  It's just,  and also, Basi was at ball, bro.  How did you get to be at ball?  It's good, bro.  You get, cause what?  How did you fucking, cause, cause, cause,  cause, whoa, how did you fucking listen?  Cause, fuck, listen, it's a superstar.  Ball is for superstar.  That's just a listen.  Now, bro, she's dope, bro.  But nah, Basi, I'm sorry.  I'm gonna text you on what's your message, I love you.  But, I feel to tell it's beyond this,  to, bro.  Not even, or who falls was the,  or even, bro.  Just think about this, bro.  Can't boil our food levels.  No, I'm just saying like, for half time show,  we had cast Basi, we had the vocalistic, bro.  We had the big guys and the advice,  is it because of quellard?  Okay.  No, I was saying that.  No, it's a big song.  No, you tried to just affect the focus.  No, I'm shooting.  Well, it's huge, Basi's a superstar, bro.  Like nah, guys, nah, nothing, no, bro.  That, nah, I don't think it's good.  I don't think it's been over-pushed  and it's being over-done.  It's not obvious.  No, no, no, no, no, no.  Okay, I don't know music.  No, it's it.  It's fine.  Damn, some people don't know music,  but I know one thing.  Spinazone get price drops.  Oh, bam.  Oh, bam.  Bigger than ever.  Oh, bam.  And so, the 31st of July, 2025,  you could win a guaranteed share of 2,500,000 in cash  and prizes with pragmatic play prizes.  Drops, how to answer just bid to rent or more  on select take pragmatic play slots or crash games.  Every Monday, Tuesday and Thursday between half-post 12  and half-post 10.  Each spin gives you a chance to win.  Don't miss out.  Start spinning.  Use promo code.  Yeah, no.  Or kick the link in the description box.  Remember, this is for people 18 or 18 years or older.  Only so please, please, please, please.  Please, please.  I was the boss.  I was the boss.  I was the boss.  I was the boss.  So, so this is a, I would have been to be breaking guys.  This week is a little bit different.  We actually have their man himself is too deal  to can't tell us about the song.  Yeah.  What's the week be breaking for us?  Today, we'll be breaking my recent drop code, MasterWindsani,  where I'm a Tallahassee used cigar saying DJ exit.  And yeah, man, just be gara.  I guess be gara is tahood.  Oh, my gara.  That tahood is big.  I was a few guys.  I was a few guys.  I was a big guy.  I don't know if you do it like that.  But yeah, I guess be gara.  You know, there's different elements to it.  Exits, you know, like that, that hard place  that you hear the baseline, which is home actually.  A lot of people don't know this, but exit comes  from a come background.  So he's from Tira's stable.  But then he's now doing piano.  And I think that's where that base then comes from,  that gom element into the song.  Sika and Tyler, you already know like these two combined.  It's just crazy on his own.  So I think the beat was there.  We didn't jump onto the lyrics.  The lyrics, MasterWindsani, simple things,  not even a complicated thing.  I didn't want to complicate the lyrics and write too much.  But at the same time, I needed to come back  and give a verse that people already know,  Master Peace, Tanduk Bala.  So the verse is just about that, you know, asking MasterWindsani,  you know, because there's a lot of people  who say a lot of things about me like Tanduk says a lot.  Now he's like just asking like,  Google took it, masterWindsani.  I don't know who it is.  I'll make you music.  Oh, yeah.  But yeah, MasterWindsani, so I'm just talking about  and giving, you know, some respect to the kids  that actually helped come up with this song.  These two kids from with Bank called Sepos Japer  and replacing more.  They dance as they do these combo dances.  So yeah, so even in the lyrics, that's why I say,  MasterWindsani, no more shabhinza.  So it's like a dance song,  like gah gah gah gah, we dancing.  And I'm actually, you know, paying respect to the kids  who actually inspired it to say,  I'm not just alone, but I'm with these kids.  And it's also about, you know, whenever I step into a building,  you know, people are getting friends here,  just trying to understand,  it's nang, low.  And people are like, but okay, but wind's on.  Like we hear you, it was the wind's on.  So that's what the song was initially about.  Yeah, the list is all about that.  You know, speaking about what I've done,  how people feel when I'm in a room,  or how I feel when I intend to in a room.  And I was group setting to OBS,  Austin Powers, okay, tell it doesn't know.  Tell us other names, Austin.  Oh, so I could have Austin Powers, yes.  So that Austin Power came through like hard.  Like the beat was just, yeah.  Yeah, I heard the bass line.  I heard the bass line.  We should find it because bigger as a sharp.  Yeah.  Yeah.  Yeah.  And how's the reception of the song?  Like, you know, when you perform it and stuff?  Performing it is, it's been amazing.  I think the first time I performed the song fully  was in zone six for the channel or something.  I forgot about it.  Oh, yes, you'd over everything on the 16th of two.  The reception is just amazing.  I think maybe all because of the amalgamation of certain things  that I incorporate like the skatani culture,  the dance culture into it.  But at the same time, the music as well.  So when it wasn't just the song on its own,  I think maybe the performance also gave a boost to it.  But I think after that performance,  I just started seeing,  because it was going slow after I dropped our lie.  But then like I'm receiving so much love from it.  Like the reshare is I get on a daily dimensions  that I'm kidding.  I think I just need to challenge it.  Someone came coming.  Yeah.  that's so it would be a really bad.  That's gonna be another masterpiece that Manzan.  There's people who are calling it the ManzanT did 2.0.  People who've seen me have heard, see me perform it or heard it.  They say it's the, but I don't think it's a ManzanT.  ManzanT is like the lyrics on ManzanT did a lot too hard.  So this, I went a bit easier on them.  But yeah.  I went a little too dope.  But taking us away, we've been to  to re-break myself.  Mm-hmm.  Yeah.  You had to kind of be doing just my piece of paper.  Yes.  To just do.  Okay.  Thank you very much.  Oh, wow.  I couldn't.  Now, let's move on to big debates.  My favorite segment.  Hey.  Hey.  Why are you loving me?  I don't know.  I feel like you're done getting good.  So it's very interesting by there.  So we just had a chat about TXC, right?  Now, is TXC an industry plant?  For those that don't know what an industry plant is, right?  It is a term used to describe an artist who is presented as self-made or independent, but  who actually has significant support from a record label or other industry connections.  This term is often used by music fans to suggest that artist's success is not entirely organic,  right?  But rather manufactured or heavily influenced by industry banking.  Should I repeat that?  No, I don't understand what an industry plant is going to.  Shut up.  So my question to you guys today about the big debate is, is TXC as a duo an industry plant?  Do you agree that they are not?  Sorry?  They are.  Obviously.  Yeah, they are.  If it's not too easy.  It's obvious, bro.  You think that they're not?  No, they're not.  Okay.  The flow is open.  They're not.  Why do you say that they are?  I don't...  TXC want to want to be T, right?  I'm going to congratulate them.  We're happy for them, right?  But for me, it was like, I don't think it was well deserved.  I feel like it was pushed by whoever they assigned to, whoever the distributor is at the moment.  I feel like now people are just looking at South Africa and taking these female artists and making them superstars because they believe that they perform most and they can DJ looking at workforce.  I'm looking at what they do with Tyler.  And now TXC is just next line.  I don't think...  How is it that TXC win an award, a BET award before all caps are respond?  How is it that they won a BET before Uncle Waffles?  That is just not possible for this international...  That's an international act.  Whereas we know that that are took in dance more than they do.  That's out of the country.  Firstly, how did they even get nominated?  We as a Democrat don't even know what 10% of these songs.  They don't...  TXC does not have street credence in Africa.  The other time we spoke about them, you know, I was like, yeah, they've been gigging wherever, but I have never seen them.  I've never seen TXC as a headline, a 20-ven.  I've never heard anyone speaking about TXC.  I've never heard anyone speaking about a TXC song.  I've never heard of little kids singing along to a TXC song.  So I feel like they've just taken and just put on that stage and we must just be quiet and not speak about them and let them be the superstar.  I think they want them to be and milk off of them.  That's what I believe, honestly.  They're not self-made.  They're just being made by this, but this label that's behind them.  TXC song is a lot of events in the UK last weekend.  Last weekend.  Last weekend.  It's all about the event in the UK.  It's cosmopolitan.  Leemex is already eventable.  No, but you said you're never ahead.  Yes, I'm not good.  I'm not good.  I've never heard.  Yeah, OK.  So they're my head.  I'm not sure it's fine.  It wasn't that the Indian...  Yeah, yeah, yeah.  I did say that.  So I'm telling Satah.  I said in Satah, I didn't say whether the label is pushing the...  You said that you're validating my point to where I'm going next.  Whoa.  You said that I took Zine.  They can't do it in a B-T before Shala took Zine.  Those guys perform more outside South Africa than in South Africa.  Shala took Zine performs more in South Africa than outside South Africa.  That's why they put the win it before Shala took Zine.  OK.  You get it.  OK.  Yeah, I'll get you.  Then number three, those guys brand themselves to be international.  I don't think they were...  They care about performing at Macu de Angelo.  I don't think it's now their plans.  They're how they're moving.  How they're doing everything with their brand, the look, the clothes, whatever it is.  I think they have an eye for a different Macu de Angelo.  The Macu de Angelo we are used to.  I think they have an eye for maybe a Waffle's Macuette.  I think that's how I say it.  So I don't think...  I don't think the plant...  I'll need to have proof that this messed the video for me to say...  otherwise.  OK.  So these girls now...  Yeah.  They are signed under.  This table is called Love Renaissance, right?  It's an American-Rikit label and management company founded by Kalon Ramong, right?  Guess who's in it?  Samawoka.  There's six black in it.  The TXE's there.  We have Boogie, we have GMK, said boy, it goes forward.  Right.  If you have an international company backing you, you are bound to win overseas.  Uh-huh.  Are you not bound to an overseas?  That's already a cheap code, my brother.  They don't have street-crate in South Africa.  Nobody speaks of them.  We don't know who they are.  The Lord does not know.  The cities do not know who these girls are.  You don't know who this is.  And when you are talking about them right now, I demand.  It's who can talk about them because they want to be.  That's the whole point.  That's the whole point about winning a B.T.  Because so they can have total ability.  They need things like that.  I mean, the biggest things on the biggest stages  so that they can have total ability.  You'll never hear T.X.C.  had landing at Mokouvin Charo  and then it gets packed because people want to see T.X.C.  What for us is different?  Bro, Jylos is a good one.  You can't eat T.X.C.  You can't eat T.X.C.  You can't eat T.X.C.  You can't eat T.X.C.  You can't eat T.X.C.  You can't eat T.X.C.  You can't eat T.X.C.  Please name YT.C.C.  Project that you know.  Do I know just for coming?  Name Project.  Name me.  No, they drop in one now.  Name a project that you know of T.X.C.  What do you mean?  What do you mean?  This guy.  I'm a project.  Yeah, I'm a project.  Name me.  I'm a project that you know.  Do you need one, Maas?  I think it's 10 of the lights.  I'm a project.  Is that a key?  I got you.  You don't know the projects, bro.  You just define the something that's not there.  You just say, you people are your kids, bro.  They don't exist.  I don't have a problem with them, bro.  I honestly just debate, but honestly, in South Africa, you know, everywhere.  You know what?  There's no even going to go.  I hope you'll speak about T.X.C.  If I never let you know, I'm a T.X.C.  Never, bro.  I just want to appreciate them on stage.  One is playing behind me.  I'm a project.  I don't have a problem with them, bro.  I don't have a problem with them, bro.  I don't have a problem with them.  I hope you'll speak about T.X.C.  If I never let you know, I'm a T.X.C.  Never, bro.  I just want to appreciate them on stage.  One is playing behind the decks and the other one's probably dancing.  And because they look okay.  And they look nice and I think I think they're not our people.  I think I think those, I think they're really good.  And they won my heart in my attention.  Musical is when they were playing.  Prophet  dawgheh, dawgheh, dawgheh, dawgheh, dawgheh, dawgheh...  Dawgheh, dawgheh, dawgheh, dawgheh, dawgheh, dawgheh.  I don't know about that.  There is no one here.  There is no one here.  He's going to be playing.  They don't care about those things.  They want to see themselves in the beach,  in the US and stuff like that.  That's what they want.  We haven't had a South African superstar.  That's big, internationally,  and it's not big in the country.  What do you mean?  Oh, give me a name.  We never had a superstar.  You can't start.  You can't join him today.  It's fine.  We haven't had a superstar.  That's big internationally, but it's not  where we recognize those are Africa.  There's no one.  There's no one, bro.  Yeah.  You want to start with all that?  I mean, any time you can name  what black coffee you want.  We can start there.  We can go.  Those are those.  Those guys are just a lot of them.  Bar, blanks, blanks, blanks, blanks, blanks.  I'm trying to look for a perfect example.  That goes to the top.  It doesn't exist.  It's citizen dip.  No, we've been knowing him.  He's at the heads in South Africa.  We know he's it.  We're all put there.  The guys are moving the car,  but they've been big here and they're big outside.  The shims are big and big outside.  Let's take some fillet to the emergency.  Let them go and fill zone six.  Amen.  I think, oh, no one.  Yeah.  Are you done?  My babies, man.  Ah, they put in the way.  He's just sealing it.  He's just putting no, but it's not.  The last time we spoke about this,  I don't know what katas.  I don't know.  Do we have a guess or type?  And we spoke about this.  And I was like, no, man.  I wanted to let out, but I didn't have a chance.  Because he just kept on saying, oh, my babies.  Even when the conversation started,  he was like, oh, my babies, man.  Yeah.  Okay.  Yeah.  Yeah.  I was like,  okay.  It's just defending the kids because the video call,  that's it.  But you know the truth, my brother.  Okay.  Those kids are working hard.  Okay.  I like my family.  You stand by your head.  I stand by one.  I say those kids are working hard.  Tari is stand by your head.  I think it's, I mean, who took it?  Tari, Tari, Tari.  Hey, bro.  I think it's, I think it's,  it's a common one.  No.  One.  I don't know.  I don't know.  One.  One.  That's awesome.  Nice.  You can give me a chance.  No, no.  No, no, no.  I don't have to do it.  I don't have to do it.  Yeah, the one who won.  Yeah.  Hey man, Tari, Tari, Tari, Tari, Tari, Tari.  I'm sorry.  Yeah.  Yeah.  No.  No effects.  No effects.  Don't go.  Here's some good.  Yeah.  Yeah.  I'll give you this point.  Well, thank you.  He brought some very good opinion.  Bro, these are your babies and you can't mean one project from them.  Imagine.  I love his hectic on.  That is hectic.  He asked me about what we could all tell you.  I gave, hey, this blue one to you releases that, uh, events, anything new happening.  I know there's a different July happening.  Yeah, man.  I'm going to do a lot of after parties there.  Blue is I'm going there to book.  Oh, yeah.  You look.  You look calm.  There's a combination.  It's leaving the lounge.  It's definitely a sav.  I feel like the bro is just, I don't know.  Like, I also feel the same way.  Like, I might wake up in the morning and say,  I'm still listening to my heart, but I booked just for security and safety and whatever.  I might just feel free to put my name in.  I know what you're talking about then.  I've been feeling about it.  I've been having the same feeling, but I think I'll go.  But if I wake up in the morning and I'm feeling the same way, I'm not going about it.  Yeah.  Sure.  Good.  I'm not going.  I saw all the lineups that are there, brah.  Hey, it's a hexagon.  I think we haven't had this episode in a long time.  Yeah.  I've been missed on speaking about this project.  The vault by Doom.  I'm Doom.  AKA TRP, man.  Honestly, I feel like this is the first do project that I like.  You know, I took time to listen to it.  I even bought like a JBL, it puts just for that lesson for this.  You know, obviously I like happy joy.  Sort of the best song from the album.  It features brown, brown, braid.  And then also like the one with Tracy, Tato, Hachi, and Zine,  and Toby Franco.  It's called him Toulini.  Have you listened to the project?  No, no, no, no, no.  That's so visual.  Yeah, they've been forcing it on me, man.  Go to it.  You know, the beautiful princesses, the, you know, the edges.  Yeah.  So I've been on it.  I've been listening to it.  And I like what he's doing with the visuals, you know, these like stories  like songs like the videos are so yesterday was of Tracy and Tato,  they're talking about making the song.  There's been visuals in the build up to the project before it dropped.  He had the Moshudu's with it like coming in.  He's not good on camera.  No, no, I'm not.  I'm not the guy you put in front of a camera.  I have been late.  It's working.  Yeah, appreciated.  But that's just what he had.  Yeah, yeah, I'm just sorry.  I'm just, yeah, that's okay.  No, it's just, it's not him, but he's trying.  You know, he's got a suit on the, he's telling us a story about the whole vaulting and still I'm going.  I love that for him.  It's a very good project.  The kind of been more vocals, you know, and also I, he has the thing.  I think with piano songs, I prefer songs that way you bring the vocals here.  Do you understand what I'm saying?  Like bring the vocals to my face.  Like don't hide them behind the beat.  She's in a bit.  Like, like the beat mustn't be.  I have a higher pitch than the vocals.  One can I wait.  That's mean that's better.  No, it's not, no, it's not, you can't say, who's a bad master.  I think it's just, it's intention.  It's intention.  It's done like that for some of his songs.  But now I want my who here.  Like I wanted that like in my ear.  Do you understand what I'm saying?  Yeah, we hear the beat.  Then obviously they'll be apart with just the beat alone.  But when it's vocals, I want them right up in my face.  In front of me, I want to hear a sing right in front of my face.  That's what I'm saying.  So most of these songs like the beat is in front of the, like the vocals is like at the back.  You understand what I'm saying?  But I've been joining, I've been enjoying this album.  And also I've been listening to,  I'm just in front of him.  I do.  I want them to come for me, but not at the moment.  I'm going for either a story girl, then to the.  I'm going for a story girl, then to the.  And I've been listening to to Tato Yamulim.  I've been listening to the film.  He missed the best man.  These songs that I'm discovering as I go.  I've got my favorite now is MP.  Remember my favorite that the time was was Mukuzin.  Mm.  Mm.  Now I'm like MP with Tato Haji.  So dope.  Yeah, if you listen to the album, which one?  Yeah, that's a good way.  Kevin moment.  I did.  Okay.  Um, that's my current favorite right now.  I've been listening to that.  And obviously move on to new releases.  If we had Mukuzin, yeah, that's, that was my favorite.  That's the one she's crying.  I'm going to tell you to do our band.  Mm.  Yeah.  Oh, yeah.  Hey, speaking about the 10, I heard this is Tim with a.  Hey, I legit.  I'm going to go to the other lead.  I heard this like a little dress up.  I'm getting the.  Woo.  Woo.  Oh, so.  No, I legit.  But today's a steam would be.  This is a that.  That is it's three gold balls.  So you think.  Hey, what you want to guess I meant?  I'm going to say that.  But somebody really appreciate me.  I'm going to go to.  I'm going to go to.  I'm going to go to.  So not so I see three.  You think the one or the crazy that?  Do you want surprise?  No, I was a circus.  You are in the heart about it.  Do you think?  Come on.  What?  I don't know.  You don't.  I mean, come on, bro.  Like, I mean, these days, you know, when men gain like a lot of power and.  You start making all this money and things change.  Yeah.  And in most cases, if you really love a man, then most.  What's the one with the three to it?  I mean, as Tim wants, I thought it was not the biggest.  I mean, I mean, I mean, I mean, these days, we don't win.  When men gain like a lot of power and.  These start making all this money and things change.  because not the biggest day.  But obviously it's not known to the public.  Hmm.  I don't know.  What do you think of it?  Must.  I mean, we shot the earlier episode.  I mean, we shot the other episode earlier on.  Oh, the TV.  Yeah.  And I know I expressed how I felt about his team.  Why don't agree with it.  I think you don't catch up with you.  I'm good with sharing stuff.  What do you mean?  Like, oh my gosh, do you think I'm selfish?  I'm asking.  Wow.  Wow.  Yes, I'm very good.  Very good.  But I wouldn't I wouldn't enter in one.  I don't believe in his team.  I get good.  Okay.  I'm cool.  I'm cool.  I'm cool.  I'm on do look guys.  That's when you used to be done.  Not now.  No, now I just feel like it's a selfish act.  It's okay.  I believe you.  Hmm.  What do you think?  What do you think?  What do you think?  I wouldn't do his team moving around because I...  Stem shabbies online.  But many times shabbies are built.  And also, all right, the one woman is here.  Why?  Man, out too.  And then...  I get good, but this thing's gonna get out all night.  I get good.  Oh, this is a song, eh?  And this album, right, Tada, Mimi.  With singing, with Rumba Peach.  I think I hear it.  That's what...  Is it the one way this is such a other?  Uh-uh, okay.  It's Mumba Peach along with his,  just...  I don't know what it's called.  I forgot what it's called, man.  You know that it's...  Damn it.  I'm finally just now, but it's...  It's very good.  Oh, it's called...  Yeah.  You tell it?  What, what, uh...  Tell it?  Ash.  That's...  That's...  That's on her side, girl.  No, no, it's just kind of Mumba and Mumba Peach.  You tell it?  It's a very good song.  I feel Mumba Peach is actually a bit underrated.  It's very good.  It's another best.  I think I'm probably putting my top 10.  Especially with Mumba.  Did you hear that?  The thing, the...  Was I kid's thing project that he dropped?  No, no, no.  It's good French, French, French, yeah, God.  Yeah, that was dropped too late.  Yeah, that was dropped too late.  Oh, and it was dropped.  That was pretty.  Dropped on the 27th.  Um, oh, it's too bad.  Too bad.  It's good.  I listened to that.  And also, it could drop project called O'Rathili.  Mm-hmm.  You know, five track features the Yams,  10K music, Dandome, Marcubi, Starheelas, O'Rina,  and the Zitovans.  You know, you know...  You don't know...  You haven't heard it?  No.  What's the songs?  Yeah.  I had that EP way back.  I had that EP maybe a month ago.  How did you?  I had an EP when he came to shoot the episode.  Yeah.  I had it.  I had it.  It's a beautiful song.  It's a beautiful album.  Um...  It's a beautiful album.  And I have to get used to EQ doing that kind of song.  That kind of song, right?  Yeah, I have to get used to him.  I mean, the T&K name...  That's I say, I have to get used to that.  To that song.  Yeah, that song.  It's good that is doing other,  like experimenting other songs and stuff.  But a one and out to get tripped place where I get used to him.  Overall, was it like a good EP?  Oh, sh...  It's an EP.  Hey.  I think it was good.  Okay.  What did Co-Pair release like I think this in AIDs after EI?  Yeah.  You see that one?  Yeah, it did.  Yeah, you already.  That's different.  What's the difference from the first one?  I haven't really listened to it like that.  But I don't know.  I can't really comment on it because I haven't listened to it like that.  But there isn't much difference.  The sound is similar to the first one.  Like the inter...  The interchange between the soulful and the scoop-boo type of understand.  It's just more...  I think a few more tracks that are added that are soulful.  And then a few more that are scooped and obviously the other ones that were already there.  Mm.  Okay.  But then there's pretty much...  Oh, TXC has actually an ama piano right now in Apple Music.  That's the number one song.  It's called boom boom boom.  Well, it's called...  It's called Pal's and it's called Mappu.  Yeah, it's dope track.  Is it lit?  Yeah.  Let's talk about it.  Yeah, it's bigger.  It's bigger, but it's good.  It's a little bit.  Oh, your kid's in the tube.  It's a fusion of the...  Did you just drop in?  Did you just drop in?  Yeah, did you just drop in?  Yeah, I was dropping.  I'm waiting for that one.  I already know it, but I'm waiting for you guys to hear it in an room.  I also have VIP access to it.  Oh, is it?  Oh, is that not?  Are you pushing it?  Yeah?  Are you pushing it?  I thought you were working with him or something.  Yeah, I'm close to him.  I'm close to him.  I told him.  But the album is actually really, really, really, really dope.  This is about this song that I'll take home.  Is it commercial?  That's sound of this, but there's three songs that are commercial, which are the ones that I love.  Yeah.  And just like upcoming artists, they only like...  I like when they always put...  Coming out to stand.  Give us the same voices.  Mm-hmm.  Okay.  Yeah, guys, I think that that's all from us, just like...  I mean, um, done.  And nothing.  Sorry.  You know what I mean?  No, no.  I don't know what I don't think I'm going.  I'm not going to Darwin, bro.  I'm not going to Darwin.  You're not going to convince me...  No, it's going, but I...  Ooh.  No.  What?  What?  I'm going to...  I'm going to tell my little note.  That's how I let it know.  Yeah.  Never, you're going to have fun with knowing me.  No, it's really fun, though.  That's what I'm trying to say.  Nah, not really.  I might.  Yeah, I might.  Did you do a note?  Yeah.  Yeah.  I'm not going to Darwin.  I can't...  I'm not deciding the morning.  I see how I feel when I wake up.  If it says go go and I feel like something that's off,  I can lose the booking mind.  John, that's crazy.  Oh, Paul.  Yeah, I always listen to how I feel, bro.  Yeah, definitely.  You should do it.  I feel like something is going to cook there.  I...  And then you're going to...  Yeah, I'm going to...  Yeah.  It's going to be charged.  I did this, my boy.  He's going to be charged.  I know, I know, I know you like it, but it's...  Guys, it's where I'm going to choose to use my key.  Yeah, I'm just...  He's going to give you a question.  I have access to Devon, July.  I'm into...  Effect, Devon, rocks.  I have...  Like, I have a lot of access.  I have a lot of access.  It's just...  It's how I'm feeling in my heart.  Yeah.  Paul knows what's going to go.  That's why I feel like...  Oh, Paul knows what's going to go.  You're getting a pound.  That's why...  I do but now I don't want to I have but I don't want to like  I mean, I'm enjoying my freedom this day  If I go out to my own I'm enjoying because I can fight for myself anyway  That is all from us guys. Thank you so much for watching  Vienna Parks  Next week, yes, sir"