{
  "podcast": "ChooseFI",
  "episode_id": 41355546495,
  "episode_title": "Living Off the 4% Rule | Marla Taner | Ep 560",
  "audio_url": "https://dts.podtrac.com/redirect.mp3/adbarker.com/stream/FUtw8akGsdUcxjeJU7HY5o1V/traffic.libsyn.com/secure/choosefi/living-off-the-4-percent-rule-marla-taner.mp3?dest-id=455223",
  "duration_seconds": 3754.807,
  "created_at": 1755585979,
  "podcast_author": "Brad Barrett & Jonathan Mendonsa",
  "podcast_description": "Personal finance and financial independence strategies with stories from the FIRE community.",
  "text": "Hello and welcome to Chooseify. Today on the show we have my good friend, Marla Tanner,  who's here again. She was on the show way back in episode 77 talking about advanced travel  rewards and that's a fun one to go back to listen to. But today she's here to talk about  living off the 4% rule. I think this is something that a lot of people are looking for that example.  Right? We always say the world revolves around stories and we're looking for that example of  of somebody who has reached by who is selling their assets,  who's living off the 4% rule.  And to hear about their journey,  to hear about the mechanics of it,  to hear how this all went down and what's really neat.  So more than I knew would be the perfect person  to talk about this, but she actually just did this  as a presentation at Camp Mustache very recently.  So this is the ideal time to have her on  because she's actually run the numbers.  She's run the numbers both on her own life  and an alternate scenario of worst case scenario Marla,  essentially, which is really, really cool to see how this would have worked out and how it did work out and  interestingly and the spoiler is it would have worked out beautifully even in the worst case scenario and  It's just really wonderful to see someone  living this incredible five life and  Going through the prototypical path and I absolutely love it. I think you're gonna love this episode with that welcome to choose that fine  I'm going to go to the next slide.  Marla, my great friend.  Oh, it is so good to see you.  Thanks for coming back in the show.  Thanks for having me, Marla.  Great to see you too.  Yeah, it has been.  Goodness.  It's been almost nine years since we met at Camp Mustache, probably with Southeast before  it was called Camp Fi in Florida.  That's right.  That's what's going to be a great podcast to have even launched.  I'm at both you and John with them.  That was absolutely wild.  Yeah, became fast friends there.  have stayed obviously in touch ever since. And yeah, you were the person who I thought of when  it came time to think about somebody who is truly living off of the 4% rule. I think there's been a  lot of talk in the community lately of, is this real? Are there actually people who are doing this?  Can I actually sell my assets when the time comes? And I've kind of taken a little bit of a  kind of hard line approach on this where I say, like, okay, if you've put a plan and this is not your  story obviously, Marla, but just just for every way, because I'm trying to like tough  in everybody up a little bit, which is, hey, you put a plan in place for 10 to 20 years  and you've won.  You've won the game.  You've reached five.  If you're going to chicken out because you think you can't lean into five minutes of  discomfort and just log into your brokerage and just click sell that one time.  Like you're going to give up success.  Five success for the next five decades because you're worried about logging in and pressing  sell one time because that's what it is. Right? Marla, I imagine you had a little bit of discomfort  that first time because you saved for your career. And then you went from a saver to somebody who  now has to live off their assets. And I would imagine I'm putting words in mouth. I'd love to hear  the psychology of this. But I would imagine that very first time it was maybe a little bit weird.  But you know what? You're an adult and you did it and you won the game. So that's kind of my  my hot take on this. But let's go back to that. So you retired in 2013, right?  Yes. I went to the first Chautauqua, so that's the JL Collins event at the time that was in Ecuador.  And as soon as it got announced, and the speakers were going to be JL Collins, Mr. Muddy-Moustache,  JB Roth, I was like, I need to buy a ticket, I need to bring my numbers because I think I can do this.  And so I basically retired on the spot after showing them my numbers.  Wow, oh that just, that's really cool.  I don't think I even knew that aspect of the story.  That's really neat.  Well part of it was my competitive nature,  which has largely gone away since retirement,  but there was a guy, Jason, who came down in the morning,  we were all during our introductions,  and he's like the same age as I am,  and he says I just retired two weeks ago,  sold my health, moved, and I was like,  he can do it.  Ha ha ha ha.  He can do it too.  Or in that Jason, I can do it too.  Exactly.  Exactly.  So yeah, I think it's true that when you start having to sell,  you start to go back into the little timing the market.  So if we'd lost the compunction to time the market when we're buying,  I think you do go back to trying to time the market when you're first starting  to sell.  So learning to automate that and not be not chicken out of you just said is  probably still a lesson I've got to learn.  because I'm probably withdrawing more like,  oh, the market's really up right now.  I'll take out a bunch.  And I definitely keep more cash.  So when we talk about the whole optimizing,  I think in the beginning,  I was definitely like a hardcore optimizer.  And as you gain, it's been 10 years now  that I've been retired.  As you get more comfortable with the numbers  and you see your portfolio continue to grow  and grow beyond what you expected,  I start to say, maybe I don't want to optimize,  maybe I just want to have a little bit more of a cash cushion  at all times so that I don't  check it out when I stick with the plan.  Okay, I can't share.  Yeah, and again, tough love aside,  this is natural, right?  Like that's the thing,  but that's what we have to understand.  This is natural to be nervous about it.  It absolutely is.  And even for you who's been doing this, right?  Absolutely.  And I think it is this full learning to flex a new muscle.  And I think this has been talked about,  I think Pete actually wrote a post about it  where it's like, we've all gotten really good  having a strong savings muscle, but this idea of a spending muscle is new and something  that we really got to try to work on.  Yeah, I remember I think the post was something on the order of the skill of spending.  I wrote about it in my newsletter.  I loved when Pete came up with that phrase and it's, yeah, we've had this skill of saving for  so long.  But really at some point, when you were just rolling in abundance and that we're going to  talk about that also in terms of how well your portfolio has done over the last 10 plus  years, all the while with drawing. When you're rolling in abundance, you really do have  to come to the point and say, all right, look, I need to start spending this money and I need  to get good at that. And that's just part of the game. I think that's what a lot of people  like about five is like, you can gamify this. And it's almost like, it's a little bit of  keeping score. It's not keeping up with the Joneses. We don't want to get into that obviously.  maybe if you reframe it to,  hey, spending is part of my new game now.  Maybe just maybe that'll help you spend a little bit more?  I think one of the messages that maybe  dissuades people from trying to be a person  who retires like I do,  where I don't try to earn any other income,  is we sort of diminish somebody like me  in our general five talk where we say,  if you think you're gonna sit around on the couch  and eat bon-bonds or go to the beach  drink margaritas, you're not going to do that, you're probably going to find another way to make  money. And I think by us saying that and by those of us who consume phi media, we propagate that  myth because we wind up saying, oh, nobody sits around and does nothing. Like you're, you know, 43  years old, you're gonna just be like a 65 year old retiree, probably not. And how many 65 year  old retirees just sit around and do nothing? So I'm not saying I sit around and do nothing, but I  don't make money. So I find other ways to have purpose and meaning and fun. Mostly fun. I think  that's the truth of it all. And maybe part of our psychology that you were alluding to  is this guilt. Like, are we deserving of a life that's just fun?  Yeah. I mean, that's a great point. And clearly, I'm guilty of charge. You probably used  almost exact verbatim of something you've heard me say 400 times, right? Like, are you really  going to sit around and sipping umbrella drinks is what I say. And I think I understand as  you're saying it that the implicit thing there is, oh, you're going to earn money in  somewhere. And I strongly, I know that I've said those words. But I think to me, it's always,  you're going to do something interesting. Is really the message that I'd love to get across?  Not that you need to earn money because I find that a very uncoupelling case, that you're going  to earn money or you have to earn money or something about your self-worth is I have to earn money in  some way. Like that to me doesn't seem like winning. But don't you think we use that argument as a way of  saying reassuring? It's the argument that you can go ahead and pull the plug and we need to find  another way to encourage people that your plan is solid and you do have enough and you can go ahead  and pull the plug and the chips will follow where they may and that's part of what's exciting and  fun and an adventure. So you can pull the plan and start your adventure as soon as your plan says  that you're ready and you're not going to regret it. And when we, you're going to talk about the  presentation that I just did, when we presented that and talked to a room of 50 people,  how many people who are already retired, wish that they'd retired earlier. It was like,  you know, 80% of the room. Some people couldn't because they retired. Like I did right when  when they hit the number, but most people, we did too long.  Yeah.  No, you're, I mean, listen, you're exactly right.  And yeah, I think it is almost like an end around  to help convince people, hey, you can do this.  But to your extremely hard line of reasoning,  do we need that end around?  Can't we just say, this just works, right?  Because that's what most of us know.  This just works.  It simply works.  But there's so much fear.  You know this.  I know this, there's so much fear in this community.  Because a lot of us are scarce in your mind,  that a lot of us have been savers our whole lives.  It's hard to get over that psychological hump.  And yeah, I guess probably some people do use that  as an end around for it's gonna be okay.  Take a deep breath.  But I think, and your presentation talks about this  of having a little bit of flexibility,  maybe even being willing to go up or down 10 to 20%  in your expenses in a given year,  based on how things work.  Like, that might do it.  Maybe saving that amazing trip,  and I'm not putting words in your mouth here,  Marla Banyman's, but like saving that amazing trip  for a year that the market was incredible.  And that doesn't mean you're not gonna travel every year.  Obviously, I know you travel all the time  and we're gonna talk about that too.  But just maybe a little bit of adjustment,  but at the heart of it, this just simply works.  I do think, yes, it does work.  And I'm a good case study to prove it out.  And also that doesn't take away that you might need a few years of it to believe it.  So I think you can look back now and be a lot more comfortable when you're me.  And I guess when we were talking about like you telling people that it works when you still earn money and run a successful podcast.  Or most of the other bloggers and podcasters and writers are still earning money.  That becomes part of the problem where the consumers of that content are like, well, maybe I also have to earn money.  because who is there in the fire community that isn't still earning money?  Yeah, it is a very interesting thing.  And I had an email recently from a woman named Nicole who wrote in about almost that verbatim.  It was basically saying, like, if the people who talk about this the most don't quote-unquote trusted,  why should I trust it?  And, well, A, I think I would just argue the premise of the entire thing,  which is, frankly, if you look at, let's say,  a broad swath of a thousand five bloggers and podcasters.  I think just knowing what I know about online business,  95 to 99% of them are earning $0 or less.  They're essentially, they're paying for the right,  to write their journal online as opposed to write their journal  in a notebook.  But it's hard.  And I had a conversation, a group of us,  a five group of us have walks here in Virginia, in Richmond, a couple of times a week in  a perfect world. I make it infrequently, but one of the more recent ones, I talked with a couple  of my real good friends and they were saying the very same thing, which is like, oh, but all these  bloggers and bloggers. I'm like, oh, guys, come on. Like these are just regular. Just because  someone decided to grab a domain name for $12 that go daddy and spend $4 a month for hosting.  doesn't mean there's some mythical creature that is a blogger. Like they decided to take  their notebook and put it online for you for free and it's costing them to do so. So everyone  just hear what I'm saying. 95% of personal finance and certainly finance independence  bloggers and podcasting make zero dollars or less. So I don't think that should make you trust  them less or more, but it is just simply the truth. They're not a different animal. They're not  different species. They're just regular people who took their journal and put it online for your  benefit. So stop castigating them as if they're weird people. They're just they're wonderful.  But more than you can tell this gets me a little hot and bothered because it's just people just  don't understand. And it really is important. Like we shouldn't minimize these people just because  they decided to put their journal online. Yeah, if anything, we should we should hold them up because  I think we all become evangelists of five where we really want to share this amazing life and  and this ability to get off the hamster wheel to quote  another good podcaster.  Yeah, like we wanna share the story  and see how many people, you know,  and also maybe track our journey  and also, you know, give ourselves some kind of purpose  and that's where a lot of people have turned  to becoming producers of content.  And I would argue it also comes a little bit from guilt  because I think we, it's hard to, you know,  live in this abundance and not feel guilty when you see  almost everybody you know, struggling and working so hard.  And that's the reality of the sort of North American lifestyle  is everybody's working really hard and running  on this treadmill and somehow not saving  because they're big spenders and we're just not.  Yeah, I hear you.  And it is interesting.  I'm finally in the first part of my adult life  where I'm really flexing some fly muscles, which is actually  really cool.  And I know I've talked a lot about some of the changes  in my personal life, or I haven't talked a lot about it,  but I've talked in passing a couple of times  about changes in my personal life.  And yeah, I mean, it's really interesting now  to try to look at my online life, my website and podcasts  and such and really kind of compartmentalize that.  And I've been doing a lot more traveling  and it's really been great.  And I'm able to do things now  that I simply would not have been able to do  if I wasn't fine.  So even though I am still earning some money  covers my expenses from Tuesday. I'm still living, I believe that I'm living a  five life and I'm seeing the benefits of it and it's remarkable and frankly,  if Tuesday, if I went away tomorrow, which it's not, don't know anybody  where I put, if we went away tomorrow, I would be fine and I'd be living all  four percent just like you, Marla. And I would gleefully sell every month or  however I'll set aside it and it would work just as well. So hopefully it  doesn't diminish my efficacy as someone who talks about this just because I'm  I'm not currently selling assets.  Anyway, this is a very long, very long preamble.  So, okay, we're gonna get into your presentation.  It's funny because I thought of you, again, my great friend,  as somebody who would be awesome to talk about  living off of their assets before even knew  that you did this presentation at Camasas recently.  So, this is just like another benefit  that you actually have it written down  and we can really go through numbers.  But, let's start at the beginning.  So, you retired in maybe mid to late 2013.  We'll say you started tracking your numbers for real in 2014, according to the presentation.  So give everybody a sense of like, we're where you financially, what were your expenses?  What did your financial life look like that?  So getting to the numbers of having this mythical million dollars, which I would say it was  pretty close to what I had when I went and had Mr. Monday, my stush Pete in particular,  look at my numbers.  I had about a million dollars saved and that had been from 15 years of working and I realized  that my savings rate, this was way before I ever had heard a glimmer of anything to do with  financial independence or early retirement. I was always a great saver and when I look at it now,  I think I saved about 50% of my income for my whole career and strangely after 15 years,  I had about $1 million and my spending was always very low. So I think I was ready then. So that's  where the money came from and then going back. So yes, preparing for this presentation,  which I did with one of the organizers I've can't master. She basically helped me because I'm not very  organized. I'm not very good at charts and spreadsheet. So she was the mastermind, but  we looked at my numbers and it was real. It was really fun to kind of look back at this 10 years  and see what happened to that million dollars. Like, okay, there was a million dollars and then I  spent about this much and I kind of did follow the exact path that's recommended in the plan  for five. If you had a million dollars in 2013 and you took 4% out so 40,000 and you adjusted it for  inflation and took out that amount every year, what would you have enough to live hopefully for  a long and abundant retirement? So my example shows where I'm out after 10 years and my end result  is 2.3 million in my portfolio and I'm currently taking out 52,000 a year. So that's the 10-year plan.  So starting with a million, living what I would say is a very abundant life,  increasing my withdrawals based on inflation and obviously we've had some big increases to inflation  in the last couple years and then winding up taking out 52,000 my portfolio now and I'm 55 years old  is sitting at 2.3 million.  Mike, drop.  Yeah, yeah, my jump.  And we can end the episode there.  Good, that is incredible.  That is absolutely incredible.  Yeah, I'm looking at this, the chart, and it's really something.  And it's just, yeah, the numbers don't lie.  You have annual return of each, including down years, like 2018, 2022,  the inflation, your exact withdrawal, and your urine portfolio.  And so I just wanted to take one quick sidebar, which is the, as you're saying, the mythical million dollars.  And it's funny because I think back in the day, it was always like, oh, we can do this.  If your life cost $40,000, using the 4% rule, you just multiply your annual expenses by $25,  gets you to a million dollars.  And that's your fine number.  But that was always just like you said, mythical, because as we know, this is all depending on what your life costs.  the number works the same. If your life costs $20,000, your  flight number would be $500,000. If your life costs $80,000, your  flight number would be $2 million. And onward and upward from there.  So I don't want anybody to think for one second that $40,000 a year and  $1 million are the only flight numbers. Of course, neither of us were saying  them are, but it is important to take that little sidebar.  Well, and I think to look back and say, okay, that was in 2024.  So I think what we did conclude after preparing the presentation and really looking at it is,  I think it's time, like obviously we were using a million on 40 as nice round numbers when everybody  was starting to talk about fire. But I think that if we're going to use nice round numbers, we are  looking at more like 52,001.3 million as your numbers. And that hopefully starts to make people go,  okay, well, can I live on that type of expense? And I know when Mr. Money Mass Dash, for example,  says he's still living on, you know, sub 30,000. If you have a paid off house, you know,  your cost of living can go way down. And for me personally, I rent now. I sold my house.  So you, you can really anticipate what your expenses are and plan accordingly.  Yeah, I think this is really important because I think people, even though we say at the beginning  of five, like you really just need to get this down on paper. Like what is your life actually cost?  It's still, it's hard for people. And I think they overestimate what their expenses are because  Like you said, your savings rate was 50% for your 15-year career.  And let's just look at $50,000 of annual expenses.  Okay, so if your annual expenses were $50,000,  let's just say at the time you're working,  and you had a 50% savings rate,  we usually, there's some ambiguity around this,  but the way that I look at it is, it's your after-tax money.  So you would take your gross income,  less your tax liability, to get down to your after-tax income,  and then that's where I would look at the savings rates.  So working backwards, okay, someone making approximately $140,000 an income.  So just top line say $140,000, my total tax burden is 30%.  I think for most people it's less than that, but let's just say that.  So then you get down to about $100,000 after tax, and then all of that $100,000,  you're saving 50, and you're spending 50.  So interestingly, Marlin, in that scenario, right?  Like this person is making $140,000, they think they're anchored to that amount.  on some level. Like, oh, I need to somehow cover 140,000. But no, no, no. Like, the two main components  of that are the taxes and the savings that you need to save dramatically to get to  five and 15 to 20 years. Right? So your annual expenses are nowhere near that gross income. In  your case, it's about a third. And I think that's probably fairly reasonable. So again, another  sidebar, but I think it's just really important for people to understand, like, it has nothing to do  with your current income because by definition in your current income you're going to have a  significant amount of tax and you're going to have a huge amount of savings to get to fight.  So it's just a really important thing.  I think it's really important and like interestingly when you're looking at that sort of when  we're looking at hypothetical numbers this $140,000 gross salary you don't have to be earning  that for your whole 15 years or 10 year work life. Like my salary and obviously this is back in  Listen, I'm talking about how many years ago it was, but you know, I never earned more than 130,000 and that was only in my last two or three years of my career.  So if you're always saving a 50%, the rest of that money is compounding over that much, much longer period.  So when we all start talking about oh, everybody has to be a tech bro or make this huge amount of money. I was not a tech bro or gal.  Sorry, some people will get that reference.  So, whoa.  But this is what happens as you see  like the stock market chart going up your salary goes up too.  So both of those things are all working together  as does compounding.  Yeah, and like you said, and also in my case,  I was a CPA, I never made more than $100,000 in my job.  So, and.  Well, mine was Canadian dollars to be fair.  Yeah.  So.  Yeah.  But yeah, two point also is when you have your housing  cost under control, like you're saying with Pete,  housing costs under control, you don't have a car payment.  Your life just simply doesn't cost that much.  I think people also overestimate that head.  And it's pretty darn hard  when you don't have a car payment  and you don't have a house payment  to spend more than 40 or 50 thousand dollars.  I'm not saying it's impossible.  So don't yell at me from your car, your seat,  wherever you're listening to this.  But it really is pretty darn hard.  I mean, to spend more than $4,000 a month  just on random food and entertainment,  like that's not the easiest thing to do month after month.  So it's just, again, further bolstering the case mentally for people.  I was like, oh, this is doable.  Oh, this does make sense.  So that $40,000, that was your exact annual expenses in 2013, 2014, right?  Yeah.  I mean, like I say, I haven't been the greatest of trackers, but I think if you do the math  based on my salary, like I'm not exaggerating where the money came from.  So I did sell a house along the way.  So I had other income come in.  But in terms of my spending, I never had lifestyle inflation after I retired.  I never inflated my lifestyle.  And I can look back at my spending and go, yeah, this is pretty accurate.  Like ups and downs probably where some years I spent more than 40.  But I don't think I ever went over 52 even in my highest spending years.  Okay.  Thanks for listening to Choose a Vai and for all your support of our mission here.  The absolute best way to support Choose a Vai is when you sign up for your next rewards  credit card to use our cards page at chooseabout.com such cards. I keep this page constantly updated  so it should always be the top resource for you. Thanks for being part of our community and for  your support. I think what a lot of people want to know is the actual mechanics of how much you  took out, like where you keep your cash, how frequently you sell. Do you sell like the entire  year's worth on January 1st? You do it month by month. You talked about earlier like I guess  It's not necessarily automated. It sounds like so talk us to that because I think this is the part that really gets people a little bit nervous.  I think this is probably a do as I say not as I do come to worry, but I've become comfortable and I think if we look at my 10 years of retirement,  the year that was the most stressful for me was the COVID crash for a whole bunch of reasons in terms of what my travel lifestyle and COVID  COVID didn't really go together very well.  So it was a tough time.  It was definitely an existential crisis.  But the financial part watching that portfolio dropped  so dramatically, so quickly, was really scary.  But what I did was I went and looked  in all my investment accounts and saw how much  was sitting in cash.  Like I don't do the drip or the reinvesting of anything.  I use a lot of my dividends and those type of payments  to just be part of, like, keep it in cash.  So I kind of totaled it all up and realized, oh,  I've got more than two years worth of cash or cash equivalents sitting there.  And I think like at times over this 10 years, I'm like, oh, I have too much in cash.  But I think like when you talk about the sleep at night strategy,  I think I've realized and certainly seeing, you know, basic interest rates  on high interest savings accounts going up, I feel more and more comfortable  at just keeping about two years worth of cash around.  So I'm still selling.  And as I say, I'm kind of timing, attempting to time the market,  which I don't think is the recommended approach.  But I would say once a year, I'm probably looking at my money,  looking at where the market's at, and selling to pad to keep that number  at around two years of cash.  OK, gotcha.  That makes sense.  So right.  Once a year, maybe twice a year, you were selling to either good.  Yeah, like you said, either the full year's worth of expenses,  even though it's not for that current year, you could cut money  It's fungible, right?  You could kind of make the argument that it is.  But regardless, you're trying to keep roughly  a two year buffer of cash just for your own sleep at night test.  Is that a real clear?  And I guess the other thing that makes my investments  a little bit different than they would be  if I had known about five at the beginning  of my investing career is I still have a lot of individual  stocks that I have to manage the sale of.  And so that's where a lot of the money comes from  in terms of my selling.  So my stuff that's in VTI would be the equivalent of what mine is.  I haven't started selling that.  I'm mostly trying to sell and manage my capital gains on the stuff that I bought before  I learned about ETFs.  Gotcha, gotcha.  Okay, that makes sense.  And yeah, like you said, you don't reinvest the dividends, but clearly from what I'm hearing  of having significant amount of index funds, you're not a quote-unquote dividend investor.  It's just, hey, they're sending me these dividends.  So instead of reinvesting them and selling them,  I'm just gonna take them as part of my annual sale.  And then let's say your life does cause 52,000 now  and I'm just making this up.  You get 20,000 in dividends, right?  Like, let's say about 1%, right?  So you would then only need to sell  about $30,000 of funds each year.  So it's functionally, it's kind of the same deal,  but it's just you're doing it in a two-pronged way.  Yeah, and I'm trying to manage my income tax in the same way to make sure that I don't hit.  So I'm selling so that I'm keeping myself in a low tax or a mid to low tax bracket on my sales between my cap gains and my regular income that comes from the sale.  Okay, does that make sense?  It does make a lot of sense to write the dividends regardless of whether you take them as cash or reinvest them dividends are taxable income in the current year.  Exactly.  So that's going on your tax.  I know you're in Canada, but I'm talking with American tax, but I imagine it's substantially  similar if anything's different.  Obviously, let me know.  But yeah, so that's a taxable event.  But then, right, in America, we're going to get a pretty big standard deduction.  And there's that 0% long-term capital gains tax rate.  So yeah, you can kind of massage to take some money out of, I guess, selling for your  taxable brokerage account and realizing those long-term capital gains.  But paying, again, in America, you'd be paying 0% tax on that, which is pretty remarkable.  Up to somewhere in the vicinity of like $96,000 of taxable income, which is crazy.  If for American-American.  I don't know about that situation.  We pay a 50% tax rate on the top.  Yeah.  Wow.  50.  But I'm still selling it at a lower marginal tax rate because I'm keeping it in  come to low. So my tax rate is, you know, it's not zero. It's still probably 22% something like that.  So yes, we do pay higher taxes in Canada. Yeah. Yeah. Yeah.  Yeah. Okay. But get a vote for our taxes. Let me tell you.  Yeah. I believe that you do. I know you do. We've talked about that many a time.  So Marla, in terms of obviously we talked about inflation and on this presentation, you did,  you're actually going by the actual inflation. But your expenses aren't always going in lockstep  with inflation. Like some years, if you had sold a paid off house and now you're renting,  your expenses presumably are going to be more, but then you also have extra money that's now  sitting in your investment account to draw down on. But when do you actually look at what is my  my life costs. Do you reassess that every year? Do you get bothered with that? Did you even  care?  I used to, but I think as I said, I've gotten comfortable over the years to see, especially  riding out some of these drops in the market. And I'm just looking at how much my portfolio  has grown. I really don't stress about it anymore.  Okay.  So I do keep some level of track of my spending based on credit card statements. So I pay  attention to money. I pay attention to prices. I've always been that way. I always will  be that way. So I know what my spending is based on the fundamentals of rent and what I spend on my  credit card. So between those two I'm like yeah I'm fine. Right. And honestly we didn't talk about  travel rewards but my travel expenses even though I'm probably out of the country 180 days a year  is what I've tracked. My travel expenses are still really low. I'm able to do a lot with you know  three or four kind of card sign up bonuses a year and being really good at looking for a deal.  You are the best person I know at that and I still you're constantly telling me about all these  different things you're doing and I wish my brain was agile enough to understand it all the time.  But yeah, you're you're remarkable. I know we had you on the way back.  That's part of the joy that if people start looking at what is my purpose in my passion, it probably  is like planning the next trip. So that takes a lot of time. It takes a couple hours, you know,  probably three, four hours a week of watching all the different travel blogs and planning things  and skipping up deals when they come up. Yeah. And the cool thing about you is you make this  friend family community event of travel, right? Like that is the joy that I see you just living  into every single year. It's amazing. Like you're always going on these grand  adventures with all sorts of different people and hopefully someday I'll be  able to join you maybe five years from now and my daughters are both in  college and beyond and but yeah less anybody think that you're living some  miserly life. It's the polar opposite. You're traveling everywhere.  Interesting. Well and all these friendships that I've made through  five, it's amazing you know you sort of collect friendships through your life  and I'm happy that I have lots of friends from way before that and people  aren't part of the five community. But once you find some of your five friends,  they tend to have more free time to do fun things together. So yeah, some really great friendships  and the more times you go to the different events, the more you really build on these friendships,  and then you do want to go on trips together or do something fun. So yeah,  and lots of lots of fun adventures. Yeah, I love that. And it's so neat as I learn more about the  the community and meet more people.  I know they're just all sorts of different groups  of people who just, like you said,  they just travel together.  No Becky Heptig, who used to be one of the co-hosts  of catching up to five and her husband Stephen.  They travel all over the world with their group of five friends.  And I'm constantly seeing you travel.  Obviously, there are all these events.  And now a lot more of them are going international,  which is really cool.  So Chris and Knapp is now doing the five friends travel.  And Amy has the Bollywood treat.  even Stephen Boer has doing the Camp 5 Spain.  I think he's planning on expanding it.  So yeah, it's really very cool.  And I would add in.  I've done the Go With Less trip.  So you've had even Tim from Go With Less on.  Of course.  And she's just really seen a need for people  who are really global nomads who  want to find some community while they're on the road.  And her Facebook group has facilitated all these amazing  friendships.  And she organizes lately.  It's been quite a bit of cruises.  And I was like, I'm not trying to really like the idea of cruises  because you're not seeing much.  But the cruises themselves are the time to meet the people  and become friends.  And then when the cruised dogs, everybody's now,  so in this example, everybody was in Australia.  And then those same people, like 25 people from the ship,  are all traveling around Australia.  And we're all meeting up with each other more times  of doing more things together.  So that type of friendship building where you go,  I'm on a Christopher nine days of 26 days.  You really get to know people.  You are a captive audience in that case.  And yes, we actually have a huge, huge five community in Australia too,  which I didn't realize until I went to Bali.  And yeah, there's an even an event there.  My good buddy Rob runs an event.  I think it's every October.  So that's something we'll have to add to the calendar as well.  So maybe a future year will all head down to Australia.  That would be fun. Well, and honestly, I had thought I need to save Australian New Zealand and go for a really long time because it's so far at the time difference on the cost.  And then I went and I'm like, I'll be back within like two or three years. That's so amazing.  Nice. That's super cool. Yeah.  Going back to your numbers real quick. So you're now at about 2.3 million, which means according to the 4% rule,  you could live off of a little more than $90,000, which is amazing.  And you're only pulling a little more than half that Marla. That's why I know.  I know. It's crazy.  So what's so wild is you are living this incredible life of abundance.  Right? Like you're traveling, like you said, 180 days a year.  You love looking for these deals and all these things.  Like, but yet you're only withdrawing of a 2% of your nest egg now.  Now, clearly, clearly, unless anyone misunderstand that,  Marla retired on 4% she's been living off of this the entire way and just by virtue of it all working right like it works and that was even amidst some craziness right with covid and such and and there were scary times obviously when you saw your portfolio drop 30 or 40% in a month or two period.  This is not all rainbows and unicorns, but like we often talk about like most people are going to die  with significantly more money than they started that point of fight with they just are and I mean one of the you are on the  trajectory to have just more money than you could possibly imagine in essence. Do you ever think about?  I'll turn of things to do with the money  different like spending habits. Does that ever cost your mind?  It does and I think you know it was what a year and a half ago that the  Die with zero  Everybody was like losing their mind about it and talking about it  But I think what concerns me is I think that those stories of all of us  You've been retired for a longer amount of time and having too much money quote-unquote  I think it left the listeners and consumers of media feeling like who are you like now instead of like convincing us  that our plan is solid and we can retire on the 50,000 a year.  Instead, it's like, oh, poor ass,  we need to start spending more money  and having exotic trips and that kind of thing.  So I'm reluctant for your listeners to leave them.  Like, I don't think that's really the heart of my story.  And yes, I thought about, you know,  mostly I've been thinking about philanthropic uses  for any excess and how to do good with the money  and what my plan is that way.  But yes, I'll splurge on the odd thing now.  And I'm not an idiot.  I can see that I can spend more money.  So I probably will.  But within reason, and I mean, those habits of,  like I feel proud about being a frugal person  and not wasteful.  And I care about the environment.  And when you think of Pete's original message  for his blog that Mr. Mandy Mass-Sash  is really a message about caring about the environment  and being anti-consumer.  So I guess that's where I, you know,  stories of all these exotic trips for campfires and all the different events that people can do,  those are not important to our happiness. Those are nice to have that if you want to splurge  fantastic, but I want to hopefully be, you know, you asked me on to talk about can you live on the  4% yes you can. If you wind up with more money, you know, as they say it's a good problem to have,  and let's all get generous and do good things with that money.  That's yet another mic job moment Marla.  It's absolutely true.  No, it's absolutely true.  And I love what you said about just being proud about being frugal.  And frankly, I'm proud of being frugal.  I always have been.  And that's just it's deeply ingrained in me.  And I don't like being wasteful.  I am also cognizant of the fact that it's funny because I suspect that I, my fervor  for I was zero led to some of that time period,  everybody talking about it,  because I know I talked about it here,  and she's a vialod.  But to me, it wasn't the concept.  Like a lot of that book was not that great, frankly.  But it was the seasons of life  that I think that really impacted me,  and especially with daughters that are growing up,  really fast, and are gonna be out of the house really soon.  I think it gave a naturally frugal person,  like me, maybe the license to do one or two things  that I probably wouldn't have done otherwise.  And did it mean that all of a sudden,  I'm a different person and I'm spending like a free-reeling,  crazy person?  No, of course not.  But when presented with a trip to go to England  and Barcelona with my daughters to see some amazing concerts  like Taylor Swift, I'm like, well, of course I'm gonna do that.  You know, of course, even though part of me says,  oh, but it's a, you know, it's X number of thousands of dollars  in Yada, Yada, Yada.  So I think that's where that opened my mind a little bit.  But yeah.  with you. And I think, like, the book was still really useful. I just think I've read enough  about how it kind of turned off a lot of people who were on their path. So it was like people  who were underspending, talking to each other about how to live a life that's more abundant,  which I think is very valuable and true. But I think these one time expenses and one time splurges,  you know, even if you do those one time things 10 times, 15 times, 20 times, there's still like,  they're just a byproduct of having extra money and yes you should you should say yes  like we should all be saying yes to a life of abundance and we shouldn't say no because we're  frugal so I think that in itself is a very positive message but if it's a year where you're  portfolio is not doing great and the rate of inflation is really high then that's a great year  to hunker down and you know not spend a whole lot of money and we have that muscle and I think  that's the part that's so wonderful about five is like you're so trained on saving and being  good with money that's not going to be a problem for you. Like what we learned in preparing for the  presentation was that if you wanted a hundred percent success of your portfolio and you in a bad  year where it was looking bad all you had to do was cut your spending by 15 percent in that one year  and you would be back to a hundred percent success. So I think we can all find 15 percent of savings  like clearly you're not going to go to Europe for Taylor Swift in that year, but you should go  three or four times in a year where the markets are turning up 24%. Right? Yeah. That's really  interesting. So in that in that down year, a mere 15%, you actually told me something interesting,  which is a thought experiment. I think we should all undertake and love for you to explain it is  the concept of fixed cost. And as your argument is fixed costs aren't always quite as fixed as  people read themselves to believe.  Yeah, I think that's true.  Like, if you look at the major categories of fixed costs,  a lot of them are things like food.  And I think we all know that our food,  like, adjusting our restaurant spending  and our grocery shopping, that alone  is a huge portion of your expenses in a given year  once you're retired.  And I know we could all cut back  of those spendings and cook from home  and have some more simple food and not  treat ourselves as much. We can cut our alcohol purchasing budget back a little, all those kind  of things. So 15% is a very easy number to save. So I would encourage everyone to look at their  fixed expenses and think about how fixed they really are. And as we said, even I think when we were  talking about this before, we started recording, even with your housing. Like, maybe you have more  house than you need. And in a not so good year, you get a roommate or rent a room just for like a month.  just a month, committing the difference.  So, or rent your own house and go to Mexico.  You know, rent out your house and go on a trip  to a lower cost of living area.  So the whole geographic arbitrage, I think, is exciting.  Like, if you're still working and you're on this path  and you're dreaming about what your life can find,  is like the main thing I can tell you is it's flexible.  Like, all the lack of flexibility you have  when you're a working person goes away  and your life becomes so much more flexible.  Yeah, I love that concept of, well, a flexibility.  I think that is just so incredibly true.  And be like, again, looking at something  that you think is fixed and realizing, oh no,  this is not fixed at all.  I actually have a lot of, a lot of wiggle room here,  especially if you're only talking,  like you said, 15%, so 15% on $40,000,  there's only $6,000, right?  Like, I know I was recently introduced to something  called, I think it's Furnish Finder  and a friend of mine rents out a bedroom in her house  to travel nurses for a couple of months a year.  And that's just a really great way.  It's like very vetted and you can find people  who're just gonna be there for a couple of months.  And that's a great way to earn some extra income  from empty bedrooms that are just sitting there.  And that's just, again, that's a cool way of doing this.  And you never know.  You might meet interesting people,  make lifelong friends.  You just never know who passes through.  And yeah, I mean, that was just a cool thing that I just never, never been presented with.  I have friends who did the traveling nurses thing.  And when they were first telling me about it, I was like, what are you talking about?  They're five friends and they kept referring to the person as my friend's name is Adam.  Adam's night nurse.  And they found a nurse that worked nights.  So I never even, so she rented out a room in their house.  She worked nights.  And then she slept during the day. They never even crossed paths.  And they made, you know, X amount of money that helped them with their savings.  Right. That's really, really cool.  And I mean, it just sounds cool, Brad. Like, if you had Brad's night nurse, I mean,  you get some good street credit.  I don't know how we can reply to that one, but yes, you're exactly right.  You could cut that out if you want.  Oh, that's thin.  and I'm not saying that.  So I know in your presentation,  you had the less lucky Marla,  which is basically like,  if you retired at the worst possible time,  and how this would have worked.  So let's talk through this  because like you said,  the heart of why you're here is to talk about,  hey, this is real, I'm doing this.  The 4%, I'm selling assets, I'm living off 4%,  this is work for me, and it has worked great.  But even if you had retired in 2008,  which is about the worst possible time.  It looks like there's still what it works.  So yeah, talk everybody through this one.  Sure, well, that's what we did,  because I think that that's one of the main arguments  when you attend a bunch of five answers.  We have had unprecedented growth in the market  over this period of my since I retired in 2013.  So not discounting these ups and downs.  It's a pretty darn good chunk of time  in terms of the market going up and to the right.  So we tried to do the same exercise  and imagine a less lucky Marla who retired in 2008.  So I guess we had her retire in 2007  and start the numbers in 2008.  And so she started with the same million.  And at the end of her very first year of retiring,  her numbers had gone down to $604,000.  So if that wouldn't freak you out  as a person working on your plan, I don't know what would.  And it took a full five years for less lucky Marla  to get back up to the million dollars that she started this.  So keep in mind, so to me,  this is the most reassuring part of the story  because keep in mind, she is still withdrawing her $40,000  inflation adjusted through that whole five years  and her portfolio is growing in the background.  And so certainly at the end of her 10 years,  it's not as impressive as what my end of 10 years is  because she winds up with 1.2 million.  but that is pretty reassuring to watch your portfolio drop by 50%  and now your 10 years older,  and you're starting again with 1.2 million,  which is fantastic.  So now we plotted taking less lucky Marla  all the way up to today's date,  and it doesn't even seem possible,  but the real me at the end of 2023 had 2.26,  I think we said, and less lucky Marla  by that point in time, her portfolio has grown  to over 2.3.  Wow. So that's basically from 2008 to 2024.  Wow. Okay.  So even in a worst case scenario,  I think the point is you're retiring for the long haul.  You're not retiring for the first five years or the 10 years.  Like even a much smaller nest egg is going to still grow and catch you up over the long term.  That makes a lot of sense. So right.  Because it had recovered by 2013 in the less lucky Marla scenario.  that I think that's why the less-looking Marla actually has more money than you do today,  which is fascinating to think, right?  It is fascinating.  She retired with a million bucks, spent her 40,000 of her year.  The market went down a crazy amount and she ended up with 40% less than she started with  a year before, but stuck with it and kept withdrawing.  Like, that getting back over to a million dollars in 2013, that's not just like she sat  on the money.  She was still obviously withdrawing to live off of her year.  Yeah, I mean, it really like, I think until I looked at these real numbers with the real  inflation adjustments, instead of just sort of looking at my spending and what my big  number at the end of the year of my portfolio was, I don't think I really saw the mechanics  of how it actually works until we got prepared for this presentation.  And it was like, you know, pretty much everybody that was in the group watching the presentation,  they were pretty convinced, like once you showed them these numbers, and it was like, because  we all go through the wet if or what if the market crashes right away.  Like, do you think that's going to happen?  Like, and when we look at monetary policy and how monetary policy has changed  based on each of these, you know, worldwide financial occurrences, like, you know,  the feds of all these different countries, they move, move,  have an on earth to try to correct things and have the recovery be as quick as  possible. So, you know, they're helping us.  Yeah, well, certainly certainly seems that right there have been a lot of, uh,  a lot of significant crises in the over the last 15, 20 years.  But yeah, it is remarkable to see to see the state we're in.  And yeah, this is just really incredible to look at these numbers on paper,  even in the worst case, the less lucky Marla,  worst case scenario.  And just see it just simply works.  And yeah, it's funny because, and I love your thoughts on this, Marla,  because this again comes down to the psychology of like,  you have all these brilliant people.  Like, I'm basically just presenting this stuff.  Obviously, I'm not doing any of the research by any means.  We have all these brilliant people.  Phil Banging, who was the original creator of the 4% rule.  Obviously, there was the Trinity study.  We have people like Carson from an early retirement now  who's just running these numbers constantly.  Many, many more people that I can't name right now.  But yet, people still distrust this.  And that's like, it's hard to reconcile sometimes.  Do you think it's just fear?  I know you've thought about this a lot.  and I'd love to hear your thoughts on why that is  and how you, who've been,  you've been doing this now for 11 plus years,  it's like, how do you have that conversation with someone  who comes to you and says,  like, more of it does this work,  I'm a little afraid of this.  Yeah, it's a good question.  I have thought a lot about it  and certainly meeting all these five people on their path  and seeing people not be able to pull the plug.  I think that the strongest message I can give them is  that you know, you have to believe the numbers  and stick with your plan,  which sounds easier said than done.  But when you get to that place where you're maybe  gonna do the one where you're syndrome  and you're gonna keep trying to pad the number  and keep trying to get that 4% down to 2% or whatever.  Whatever it nonsense, as you would say,  of people like to.  I think that you just have to like hold your nose  and go with your plan because what happens is  this beautiful moment of when you now  or off the hamster wheel and you have time on your side  is this time that you have gives you the opportunity  to look around.  And I think that's been the biggest gift of size,  that you have much more time to be reading  and paying attention to world events  and watching what's going on and thinking of new ideas  and I call it scheming and dreaming.  And I think that's what helps you discover your purpose  or helps you gain confidence  that the numbers are gonna work.  Like I think that's all that I can say is,  because I remembered doing a one on one thing when Katma Stessher was virtual and there was a medical  doctor on there. And I could just tell he was like, he clearly had plenty of money and money wasn't  the thing that was stopping him from pulling the trigger and retiring. But he was filled with so  much angst and I think that that's I think the psychology is so much less about the money and so  much more about who we think we are like our identity and just these issues like we're just going  going to use excuses to not do it because it is scary.  And it's like, what am I going to do tomorrow  when that beautiful moment happens?  And I'm just alone with myself and my thoughts.  Like, you kind of have to have a plan.  But if you don't have a plan, you've now  got all kinds of time to make a plan.  So embrace that.  And it might be uncomfortable that you  are going to feel uncomfortable.  But it's worth it.  And think of all those meetings you're sitting in right now  and how terrible they are.  You don't have those anywhere.  Oh, goodness, boy.  I used to call it the poke out by eye with an iron poker meeting.  I'm like, oh, terrible.  Yeah.  Now you have time and resource freedom.  And you can do whatever you want.  I love it.  And yeah, it's funny, because that again,  feels like another kind of mic drop in the episode moment.  Because really, like, that is at the essence.  You have all this freedom now.  I mean, that's been a through line of the episode here.  It's like freedom and flexibility and just looking at these numbers and saying like,  okay, look, this actually works. This works in good years and good times and bad times as you  shown. And it just like you have been living this for more than a decade now. And you were  living your best life as anybody can tell from here and you're just an incredibly joyful person.  And you're traveling all over the place. You're scheming and dreaming constantly. You're  coming up with these amazing trips for family and friends. I know you're constantly planning these  things like you were living the beautiful five life. And it's, uh, it's just such a pleasure to see  and to be to be a friend. I just, I love it for you. That's so sweet, Brad. Thank you. And I mean,  it isn't all, you know, coins and rainbows. But the good part is that, you know, in this 10 years,  tragedy happens, terrible things happen. The same things that happen for anybody in their life,  whether they're fine or they're not fine. But five does give you the breathing space to address  those tragedies and be able to help people or family members as you need to. And like that's  the greatest gift of all. And I want to leave people with the message of your honest journey. It's  hard work. You're saving, you're probably script big and you might be sacrificing a little.  But stick with your plan. Your plan is going to work. You've run the numbers of million times.  You have this wonderful community of five people.  You can run your numbers by them.  Everyone is willing to share and talk.  You can certainly reach out to me.  I know you can reach out to Brad and stick with it  because life on the other side is so worth it.  So you've worked hard.  You do deserve it.  You're never gonna regret this decision.  So go ahead, follow your plan and live your best life.  Your best life, not the life I lead.  Lead the best life that you want to lead  when you're able to pull the trigger.  Wow, okay.  Well, that I think is a beautiful way to end this one.  Thank you so much for coming on.  I'm sure that people are gonna have questions.  So this is something we can definitely do  another followup episode on.  I think people, they're gonna be a lot of questions.  So if you're out there and you wanna send in,  we now have a new way to send in questions and feedback.  Just go to choosea.com such feedback.  And we actually have a lot of our friends  and colleagues who are amazing world class experts  responding to a lot of these questions,  which is really cool.  Marla, it's one of the neatest things I've done here  at Tuesday of I in the last eight years.  And we have people like Carson,  Bigger, and answering questions on Safer Draw.  We have Chad Carson answering questions on real estate  and Jillian John's route on many of your time  and it's on and on and on.  And Dr. Bobby and Dean Turner on Health and Fitness.  So the list goes on.  And yeah, that's where really at this point,  you can say, if you're listening to this,  sending questions, sending feedback.  I'd love to do another episode of Marla  because I feel like there are gonna be questions  on maybe more than nuts and bolts I suspect.  And just send them in.  If you have questions, if you're fierce,  like Marla is literally living this life  and she's living it just incredibly.  And she's not the only one.  Let's be entirely clear.  There are a whole host of people  who are living this five life.  Obviously, just by virtue of your consuming this content,  most likely you're still in a simulation phase.  That's just the reality.  So I think when people look at and say,  oh, nobody's actually doing this,  well, we're all still saving.  We're all still on our path to five for the most part.  But there are a lot of people like Marla,  who have been in this community for quite some time  and are living into their best lives.  And I think it's just so exciting.  We're gonna see more and more people like her  as the years go by who have saved for this time  and have now reached five.  And have pulled the trigger  and are living these incredible lives.  And I think, yeah, we need to start talking about this.  We need to start talking about what does it look like, Marla,  to live that amazing life.  What do you do?  You're like you said, there is some nervousness  that first day, because you maybe you did have  some identity wrapped up in this.  But like you said, I mean, and I'll throw this back to you  even though I said I was gonna close it up.  It's like, yeah, like you worked in a job for 15 years.  And I imagine to flip that switch off  is not the easiest thing to just turn it off forever.  But what did those first couple of months look like for you?  I know it's a while. It's probably 11 and a half years ago this month.  For me, it was more than the first few months because unlike I think most of the people who are in the  Phi community now, I didn't have a plan so I really just like,  ostentatiously pulled the trigger and I didn't really know what I was signing up for.  So I think my doubts and fears were more extreme, hopefully than what most people would have.  So yeah, I think I was in a really like a lot of things about, you know,  whether I was deserving of this type of life and really feeling sort of if I didn't feel  overtly judged, I felt judged by myself that in my wasting my best earning years and  in my you know if I wasn't using my time really well like who's the judge of how you're using  your time well but I was really down on myself about that so I think it did take me a number of  years to kind of get past that and feel like you know what I'm doing the best that I can and  every year I'm getting better at this and every year I'm having more fun and giving myself permission  to just say, I can just have a fun life. There's nothing wrong with that.  Nothing wrong with that at all. And yeah, to your point, you hit-fi and pulled the trigger back  in the early days, right? The 2013 era of the fire movement or fire community. And yeah,  I think a lot of us have realized because we've heard some cautionary tales of people who  had this existential crisis when they pulled the trigger or because they were just shooting for a  number on a screen and they didn't think about life afterwards, right? They were running away from  something instead of running towards a great life. And I think hopefully we've all realized like  this is not just about the digits on the screen. It's about maybe during those years along the  journey now, trying to figure out, hey, what do I want my life to look like? And again, we've had  Jillian talk about many retirements. We've had just from the fine years to talk about the cure for  for the boring middle and it's experimentation, right?  And you need to figure out like,  what do I actually wanna do with my life?  And yeah, I mean, I think this stuff is really important.  And I love, I think, Marla, to me,  that's what's so cool about our community is like,  we're all learning together and we're learning  from the people who came before us who have realized like,  okay, I did all these things great,  but maybe in these couple things,  if I could have done it all over again,  I would have done it a little differently.  And I think that's the beautiful part  about being in this worldwide community.  I agree.  You know, I didn't have a lot of peers at the time that we're already retired, but we all  have a lot of peers now.  And so being in the community and having all these resources is really going to help you.  And if you are stuck, if you're working, I think the saddest stories I hear are the people  who are working so hard and they're like, but I don't have a purpose.  I don't have something to retire to.  And they think they need to have that all figured out.  If you don't have that figured out, it's still okay.  You can still pull the trigger and you can have the time on the other side to start working  on your plan.  I can guarantee you when you don't have an alarm going off in the morning and you pop  out a bed with joy and no dread, no Sunday scaries, you're going to be much more prepared  to start planning the next chapter.  Well, you've been there and done that.  I really appreciate you coming on, Marla.  This is fun.  Yeah, I'm very serious.  I'd love to have you back on.  Please, anybody listening, sending questions, let us know what you want to talk tomorrow  about because I think this is really, really important as we all move along the path on our  five journey. So, well, thanks again for being here. Thanks for having me great to see you.  Yep, you too.  Thank you for listening to today's show and for being part of the Choose the Vai community.  If you haven't already, the best ways to get involved are first, subscribe to the podcast  so you're listening to this on a podcast player and just hit subscribe and then subscribe  to my weekly newsletter. I actually sit down every Monday and write this by hand and I  send it out Tuesday morning. So just head over to chooseavai.com, such subscribe and it's  really, really easy to get on the newsletter list right there. And I would really appreciate  it. It's the best way to get in touch with me. You can actually just hit reply to any of those  emails and it comes directly to my inbox. So that's the way that I keep a pulse of the community  and how we keep this the ultimate crowdsource personal finance show.  And finally, if you're looking to join an in real life community,  we have choose of high local groups in 300 plus cities all around the world.  So head to chooseivina.com slash local and you'll find a list of all of those cities in  20 plus countries all across the world. And if you're just getting started with Phi or you have a  family member or friend who you think would be interested to easy ways. Choose a Phi episode 100  is kind of our welcome to the five community.  And even though it's a couple years old at this point,  it still stands up and it's a really great just starting point  to get an understanding of what is financial independence.  What are we doing here?  Why are we looking to live a more intentional life  where we save money and use it as a springboard  to live a better life?  And then choose a vibe, created a financial independence 101 course  that's entirely free.  Just head to chooseavata.com such fi101.  And again, thanks for watching."
}