{
  "podcast": "Persian News - NHK WORLD RADIO JAPAN",
  "episode_id": 41353198134,
  "episode_title": "NHK WORLD RADIO JAPAN - Persian News at 13:30 (JST), August 18",
  "audio_url": "https://www3.nhk.or.jp/nhkworld/upld/medias/fa/radio/news/20250818133000_persian_1.mp3",
  "duration_seconds": 536.064,
  "created_at": 1755530259,
  "podcast_author": "Persian News - NHK WORLD RADIO JAPAN Team",
  "podcast_description": "Persian News - NHK WORLD RADIO JAPAN shares insights, stories, and expert conversations for curious listeners.",
  "text": " and the only thing that's in the world is that we're not going to get it.  And that's why we're going to get it.  And that's why we're going to get it.  And that's why we're going to get it.  And that's why we're going to get it.  And that's why we're going to get it.  And that's why we're going to get it.  And that's why we're going to get it.  And that's why we're going to get it.  And that's why we're going to get it.  And that's why we're going to get it.  And that's why we're going to get it.  and the  the  the  the  the  the  the  the  the  the  the  the  and the  and the  The first time I was in the hospital, I was in the hospital for a long time, and I was in the hospital for a long time.  The hospital was in the hospital, and I was in the hospital for a long time, and I was in the hospital.  The hospital was in the hospital, and I was in the hospital for a long time, and I was in the hospital.  and the  This is the first time I've been working on the pandemic, and I've been working on the pandemic.  I've been working on the pandemic, and I've been working on the pandemic, and I've been working on the pandemic.  I've been working on the pandemic, and I've been working on the pandemic, and I've been working on the pandemic.  In the future, we are going to be able to see the most important  and the  but no it has been in the area of the area of the area.  Also, I hope that you can see the right side of the area.  I hope that you can see the area of the area of the area.  I hope that you can see the area of the area of the area.  I hope that you can see the area of the area of the area.  I hope that you can see the area of the area of the area of the area.  I hope that you can see the area of the area of the area of the area.  The first time I was in the first time, I was in the first time, and I was in the first time,  and I was in the first time, and I was in the first time, and I was in the first time,  and I was in the first time, and I was in the first time, and I was in the first time,  and I was in the first time, and I was in the first time, and I was in the first time,  and the first one, the first one, the first one, the first one, the third one, the third  one, the third one, the third one, the third one, the third one, the third one, the third  one, the third one, the third one, the third one, the third one, the third one, the third  one, the third one, the third one, the third one, the third one, the third one, the third  and the most important part of the show is that the show is not only the same, but the  same thing that is the same, but the same thing that is the same.  The show is the same, but the same thing that is the same.  The show is the same, but the same thing that is the same.  The show is the same, and the same thing that is the same.  The show is the same, and the same thing that is the same.  and the  family.  In the same time, we are  going to be  able to  meet the  family.  We are  going to  meet the family.  We are  going to  meet the family.  We are  going to  meet the family.  We are  going to  meet the family.  We are  going to  meet the family.  We are  going to  meet the family.  We are  going to  meet the family.  We are  and the first time I've been in the hospital for a long time,  I've been in the hospital for a long time,  and I've been in the hospital for a long time,  and I've been in the hospital for a long time,  and I've been in the hospital for a long time,  and I've been in the hospital for a long time,  and I've been in the hospital for a long time,  and I've been in the hospital for a long time,  and I've been in the hospital for a long time,  and I've been in the hospital for a long time,  and I've been in the hospital for a long time,  and I've been in the hospital for a long time,  I think that the pandemic has been a bit difficult to see, and that it has been a bit difficult to see.  I think that it has been a bit difficult to see.  I think that it has been a bit difficult to see.  The  The  The  The  The  The  The  The  The  The  The  The  The  The  The  The  The  The  The  The  The  The  The  The  The The  I think that the  and the  Jup, shado un y dvara si."
}