{
  "podcast": "That Horror Movie Podcast",
  "episode_id": 41349858624,
  "episode_title": "That Horror Movie Podcast: #112- The Best Zombie Movies and Horror Q&A!!",
  "audio_url": "https://content.rss.com/episodes/223323/2172033/thathorrormoviepodcast-yt/2025_08_18_04_47_15_d1bfe1e1-c805-4fab-9eb7-cca4532ec197.mp3",
  "duration_seconds": 6875.276,
  "created_at": 1755534453,
  "podcast_author": "That Horror Movie Podcast Team",
  "podcast_description": "That Horror Movie Podcast shares insights, stories, and expert conversations for curious listeners.",
  "text": " Hey folks, happy Sunday. We're here to annoy you on another Sunday night.  At least now and a half, not two hours.  What's up folks? Everybody had a great weekend, great week since we saw everybody on Tuesday for our last watch,  long which was H2O. And tonight we...  Brett, I completely forgot about this because I was busy. I had my band played yesterday,  so I was busy with that all day, and then I was on the handle after party, and that's how I had to  that Halloween movie, quite sure,  having a little bit to drink too much to drink last night?  Yeah.  So I didn't realize yesterday was the 40th anniversary  of the release of the returning to the living dead.  So we thought, well, so we don't live this too.  Or talk about some zombie movies tonight.  Our favorite zombie movies,  everybody in the chat's favorite zombie movies,  and do a review of Return of the Living Dead.  Yeah, we bumped Pee Wee's Big Adventure again.  It will do it one of these weekends.  Maybe it will do a member stream,  But we're gonna do return to Living Dead,  watch along on Tuesday to celebrate 40 years of  at Classic, which is considered to be  a lot of people's favorite zombie film.  And, Brady's just getting set up.  He didn't have his headphones.  While he's getting set up, I'm gonna,  my phone fell on the floor.  So hold on one second.  Okay, I'm here.  I'm here.  Hi everybody, hello.  All right.  Happy Sunday, bud.  Happy Sunday.  get a clean sheet from my book because I always write things down.  Now you're looking to look two different flights and steps.  So yeah, so tonight I was told that zombie movies that once be like,  one said, may or may not even seen, people can suggest people can let us know in the chat  which their favorite zombie films are. We'll be reviewing Turn the Living Dead.  Because like I said, you mentioned that it was turned 40, I say, which I didn't even realize.  So we bought Peemies Big Adventure maybe to next week or a members chat.  members are only stream and we'll do a review of that and then we're doing our top five.  We changed it to Pee me or was it how I hate to say I thought how we was a  reaction one of voting even though I don't know. I don't know.  Oh that's right resurrection did win that poll.  It's like the first one.  Pee we probably did.  But we're gonna make sure.  Even like a fur we bought it to Pee we but I thought if we're going off of the poll from last  they're from Tuesday.  Yeah it's got the poll that one was resurrection yeah because everybody likes to make fun of it.  So yeah, I did bump that maybe we could do another night.  If you're free, we can do two this week.  I don't give a shit.  I don't have much going on this week.  So you get me a schedule is and we can just make it up.  And I got to talk like practices, but if maybe one of them  we can do a little bit later and evening maybe.  Yeah, we heard a little bit later.  So you're home in time.  And our top five because of Fred.  Mike and I finally watched together the other night.  So you're about to do our top five body horror movies  because movie was pretty fucked up.  Oh, yeah.  Yeah.  I know you would have gotten a kick out of it, though.  So yeah, I remember you tell me about it.  Other people are talking about it.  So I figured I'd watch it.  Mike, Mike, you know, I didn't think that would be his movie,  though.  No way.  No.  But it was fun to watch.  It was interesting to say the least.  I like her a lot, though.  She's been on a lot of things I've watched over the last few  years.  So yeah, she was good.  But the other one was, um, hey, John.  And the actor, the guy was, um, just that, what's the name?  His brother.  Yeah, James Frankl's brother.  Hey, you do know those two have been married for a number of years.  She's got a few years on him.  They're really married.  I figured you'd probably knew that right now.  No, no.  I really did not know that.  So the two, the girl that was in him are married in real life.  Yeah.  I was free and day Frank or married.  Yeah.  Did not know that.  It was interesting.  Can me, it was, I mean, I, it's pretty interesting.  concept for somebody that even create that. It's pretty fucked up. Just say for  least, but yeah, you know, were you thinking, okay, or did you want to talk about  the movie now or you talk about it later? I guess it doesn't matter whatever you want.  Yeah, we're talking about when we get into that. Yeah, we can, we can, we can chat.  We can go, uh, say hello to everybody in the chat. Let's see who's hanging out with us  on a Sunday night.  Brody was hanging out with us in here. He is.  Hey, yes, I was.  That's already.  David, yeah, what's up? Thanks, buddy. Make sure everybody hits that like button.  Thanks, David.  Definitely helps and if you're not subscribed,  don't forget to subscribe button.  Doesn't hurt. Just touch it.  It make it baby.  Look at bigger.  Is that a different shirt than the one I bought you?  They're at the same time.  One time.  One time.  It is the same one for Walmart.  Yeah.  I got to pick up a Walmart daily day.  Okay.  So then I'll, I'll make sure that I don't have to send you that then.  I was seven.  Just a bit one more too.  Oh, I didn't know that.  I don't know.  Yeah.  You had me pick that up in the hoodie.  Did I have you pick this up?  Just ask me.  I'll take it because I always have my multiples of these because they're cheap.  They're like eight, nine bucks.  I always buy multiples.  So, radio ball ones, I think I bought like three of them for four bucks.  Then they have a clearance.  Yeah, they're cheap.  Gory's in the house. What's up, Gory? JG's up. What's going on?  Hey, JG.  Is there's Jean? What's going on?  Jean?  Hello, Gendard.  King Matthew. What's up, Matthew? What's up?  How are you doing tonight?  Unfortunately, I'm only able to stand straight for a few minutes tonight.  So, I'm about to go out to eat with my girlfriend since it's our...  Oh, happy anniversary.  Happy anniversary.  Yeah, have a good dinner. That's awesome.  Keep the health going man. Keep it. Yeah. Also me and my girlfriend are getting married next month.  So most of the pre- Well, oh, did you show fiance I would assume that's that's good news.  Mamp congratulations congrats. Yes. Congrats. Very cool. And I've got this. Watch this.  I mean, realize how they were once like us human beings. Yeah, because so when we  didn't watch the long have landed the dead, you it's weird because usually you always  have sympathy for the characters that are being chased by the zombies and we  watched that. You had more sympathy for the zombies because they just like the  guy said he's like they're just trying to find a place you know yeah it's you  know they didn't choose to be that so World War Z I still didn't see World War Z  I just know the red movie what's that I just know of the Brad Pitt movie the  world worthy good for them. I think they're supposed to do another one I thought. I don't know what happened.  What is the one that was the TV show? Was that world worthy? Not the walking dead. There was  another one, another zombie one. I'll be on the chat. I can be a name of it. I'm curious which one you're  talking about. Yeah. Also, even though this doesn't count as a move of my favorite zombie TV show,  either between, there's a z-nation. Thank you. Z-nation. Oh, z-nation was that?  Yeah, I think we had something to do with that and the walking dead. Yeah. I tuned out of the  walking dead at like season five or six and I was like yeah.  I don't even think I watched more than two seasons. I just, uh,  as my kiss buddy what's up John? What is shaken?  What are your thoughts on death becomes her? My family walked out of it  last night during movie night because they're lame because that becomes her.  I haven't seen that one a long time.  I haven't seen it since the first came out. I should probably revisit it. Me too.  better opinion. That's um what uh is that Goldie horn? Is that Goldie  horn? Meryl Streep and first wolf? I think so. Yeah I've had seen probably since  came out either. It's been uh that's actually pretty cool that you mentioned them.  Maybe I'll have to revisit that. Oh there's our buddy Bill. Hello bin. And uh let's  give him his proper intro since he is here in the house. Fuck the other ever  gave. Fuck you. Send me this shit. It's a Bella Rose Salini. And this is a Robert  Zebekka spent. So really? Death becomes our ham. Yeah, check that out. Yeah, have to check  it out. It's been a long time. If you know it's a werewolf movie, but the character of Jack Goodman  and the all the werewolf victims in American werewolf and London is so very funny. Yeah,  Mark. Oh, yeah. Class. I landed this man. He knew what he was doing.  He was on fire back then. But he was just putting out tons of good movies and then that  whole thing with the twice. I'm really the smear on everything.  Unfortunately. But yeah, let's see. I have, let me get my, I had to get some slides together of  some of the ones that I do like. What is that? It's a wrong button. But I cons on streamyard and  and I don't like it at all.  It used to say exactly what it is,  but now they show icons.  And I'm like, well,  what if you can't figure out what the fuck am I going?  It's icons.  I don't know.  That becomes it.  It's a classic and the same thing,  it's reanimator and the substance.  Yeah, they may or may not be on my body horror.  Top five.  Why if he's not Google Slidesmith?  Oh, there it is.  You know what, man?  Do folks, I wife just got home.  So I knew she was coming from home just  I was about to get started. She was away helping the door to get settled in at school.  Where the hell was my pen? Shit. Start up that slide, Pat. Whatever you're ready.  Did come up. So yeah, I just threw a bunch of zombie movies out here. We can see where  which ones we like, which ones we didn't care for. And throw some more in the chat. I know these are not all of them.  These are just the most popular ones. And I know that I've, I think I've seen all of them.  I remember correctly when I went through this. Well, so of course this one is what I've mentioned  before is like my comfort movie that I put on all the time which I put on.  Once it Friday night, you're Friday night, I put it on.  I put this movie on the go to help me go to sleep.  Not because it's boring, but it's like comfort food, but not living dead.  The OG is just my favorite.  I just love not living dead.  We watched it so much as a kid just brings back memories of watching it every Halloween.  Because it was always on TV.  And yeah, so for me, my jibbit is still the OG.  I mean, I love all the other ones in the Romero franchise, but this is still always going to be my favorite.  Classic public domain.  Public domain. Yeah. And there's a lot of no, that was your mistake. They never put a copy right on it. So they screwed up.  One of the account favorite zombie movies has to be hammers plague of the zombies from 66 to make up zombies or creepiest. I've never seen that.  I haven't seen anything before. I live in dead when it comes to zombies.  Yeah, well, Colin, definitely, one of these days,  I think probably when they'll cool,  cool weather comes, I'm gonna revisit a lot of hammer films  and then maybe we'll start doing some type of hammer  watch along, and I'll be on.  Because I'd love to go back and revisit them.  There's so many of them I did see.  When I was younger than I'd seen,  I didn't see, but I just,  once the weather gets colder and, you know,  we'll put it up in the house, I can catch up on all that stuff.  White zombie, yeah?  True, the OG.  White zombie with Bella Lugosi.  White zombie.  by our name to uh...  for our zombies uh... first man  it did i'm sure it did right  long live  but naya return to the living dead yes yeah  when he uh... when he uh...  and i would make it because uh... world war z was disappointing yet you think so  i never saw world war z did you see it  yeah i didn't mind it uh... i i i i i got to go revisit  i i remember going into a slow expectations as probably why i like that a little  bit more  It's one of the ones I've not yet to see.  John says, for zombie movie, it would be the Omega Man,  for horror would be the original Poltergeist.  Well, the original Poltergeist is awesome,  but it's not me, what do you make a man?  Why am I, I don't know, they don't make a man.  Do you know that one?  Charlton Hestin, oh yeah.  Oh, that was like his era of like that,  and so I like green.  I know the movie, but I did not,  for life, he did not remember the name of it.  Holy shit.  Don't eat the so-called green, it's crazy.  I was going to put up here where I think was way back up here on the stream.  I thought I saw it on.  You just go up there.  Yeah, I can agree with Bill.  Oh, and Steve.  Yeah.  Yes, he did.  General Zad.  Zad died.  Yep.  Or head of what's the name of that?  It's the name of that organization.  And the, do you ever see the movie, both anger?  Both fingers great.  He's the head of mine head.  That's right.  I'm a company member of mine head.  Welcome to mine head.  Folkshees, Gates of Hell trilogy count.  Well, the Gates of Hell didn't that include zombie?  The original zombie?  I don't we consider anything zombie when a corpse comes back to life.  Pretty much.  That's why I agree with Bill.  Honestly, that cemetery can be considered as a zombie movie.  Yeah, no, I didn't put another creeps on my slides.  I forgot.  That's true because I'm always just considering it like a comedy.  somebody. You always forget that it's actually a zombie movie.  Absolutely.  Some people when I was looking online considered neither the  comedy movie you and I both like somewhat of a zombie movie.  I was like, I guess.  I can sort of see that. Yeah, that's another one.  We haven't watched that. I'm surprised we haven't been  done on a watch along yet.  I love the girls.  Cute girls too.  Oof.  Yeah.  Omega Man is based on Matheson's I am legend.  It was the second adaptation after the  of his surprise starring last night,  which Romero was likely influenced by Ford,  and I'd love to get it.  Oh, definitely.  Yeah, the original I Am Legend,  and well, if in the remake is really good.  Don't of the Dead,  so Vietnam has always been Bill's number one,  and we're trying to live in Dead,  a close second.  I'm original, don't of the Dead,  I'm right there with him.  That is my favorite zombie movie of all time easily.  Just the idea of being stuck in the shot,  I'm happy. Right. Brilliant concept because okay, if you're going to be in a zombie apocalypse,  where would you want to be? Let's go to a mall because it's got everything in it. It's  the perfect place to get. Those are the spencers or hot topic. I guess I'm okay. Anything  with, you know, yeah.  Davey up. Day to day. Yeah. I know that is definitely your, if you've mentioned that before.  That is your favorite. That alive brain dead is a, what did put that live on here too.  Shit. What the fuck was I thinking? That would, if I had count that one, that's probably  number two for me with the rat monkey with a rat monkey. Yeah.  There's not even there.  The cute girl in that too.  No, no.  Lie.  Yes.  Lie.  Zombie flesh use.  Yeah.  Zombie.  I think I have this on that stuff down here.  It's second favorite zombie.  We've all time the makeup score.  Emus hearing that's the movie I picked up solely because of the cover, the  cover of that rotting zombies.  So I just remember to vividly seeing in the video stores back in the day.  That's how I found most of the horror movies back in the day.  just went through the horror section just if it looked cool on the cover I had to take  it home and watch it. That's how I got into return of living data actually saw that cover  I was like yeah this looks cool. Let's watch this. Yeah, that's it. You know that's what  the way it was back in the day. The people understand it's like you went to video store and  just looked at the cover you flipped it over you read a little bio and you're like okay  cool let me watch this.  Now that's kind of. Can you head now? And there it is day of the dead. There's Bob. That's  They should make a bub animatronic.  It's a price they haven't done that yet.  It got us definitely some merchandise of them though.  Yeah, they have that, but that'd be cool to have like a bub animatronic in the background.  There were some tales from the crypt episode which includes zombies like the second season episode  till death.  True, yeah.  An article practical revisit.  That's a tale may have to put down my Christmas list to share to get the whole set of  all the pictures.  there's one season that I don't have and it's like five or something like that. I have  all the DVDs of them. That's got to be streaming. Well, actually it's an HBO product. It's  probably a max, right? It's got to be. Probably. Maybe if we ever get done with Tales  from the Dark Side by the time you're 16 by the time I'm 50. Really? What do we, what is  this? Oh, should I say this Friday? I do. But they have this Friday. I'm actually in  my bands playing. So I can't. I thought we're already doing Teen Wolf coming up, right?  Is that next Saturday night, Teen Wolf?  I think that's what we told Bill.  Yeah.  Yeah, that's fine.  I feel like I'm going to meet with my friends  in the lobby for the second show.  The theater manager gave us seats in the crying room.  There's four seats in the room separated by glass.  You could smoke the crying room.  Oh, you know, the church, it's funny.  The church that my kids went to in the local parish,  you know, they actually had a room behind glass.  I'm every first cone.  They're like, the last the crying room.  I'm like, the crying room?  But again, as we go with your kids,  so they don't disrupt everybody.  About the crying room.  Ha ha ha ha.  Last, David Chek tells me the crypt isn't on HBO Max,  but I think they're all available on YouTube.  I wanna, they have to have a set of all of them.  I wouldn't mind just owning the set.  I don't know.  I can't imagine taking a tail from your dark sign.  I think they did something,  but it's like a lot of them are all single,  as far as I remember.  David Brown, how you what's up, man?  Has anyone in my life?  I know. Any fans? Um, no. What does Fido have you seen Fido? I can't say I have no.  No. Tell us more about it. I don't know Fido. I mean, I know people who've named their dogs  Fido, but I didn't know there was a movie about zombies named Fido. I've been ready to  hit them. I was looking for something to watch.  For some reason, I'm thinking of the other guys and the guy from Alien in front. He's  said, yeah, fat koto.  Yeah, that's the best game.  Yeah.  Has anyone seen Fido?  Yeah, I can't say I've ever, yeah.  No, that's interesting.  Day of the dead is showing in theaters in the States at the moment for its 40th.  Is it really?  I didn't know day that that was it.  I know chainsaw massacres supposed to be in the theater.  Chainsaw because of that date and jaws is coming up in 3D or not 3D.  Max. Well, didn't, well, wasn't it the 15th? It wasn't the 15th change from Oscar date. So that passed.  I wish I would memorize it, but it's not like, uh, you know, Halloween 1978 to me.  Exactly. Fido's, uh, decent zombie fake bells. See that.  Yeah, Fat Koto's decent zombie.  Why John wants to know we can find the trick or treat box. It didn't just know what you bought.  isn't that the special episode that came out last year?  What is your?  Yeah, it's that vendor.  I forgot what company made it.  Who made it, who made it bills?  It's sign apps or whoever made that like they were,  they found some extra ones and they brought them to Flashback.  And I think he was almost sold out by the time Bill bought his, I think.  So.  Chainsaw is playing only tomorrow.  Okay, very tomorrow.  18.  Hmm.  I wonder if it's played at the theater by me.  I'll go check it out.  Yeah.  The original Pirates of the Caribbean, the Pirates of basically zombies you can have Captain  Barbados, a famous line in Elizabeth. You've got to stop being in those stories in this journey.  You're in one pirate. The original, I don't think I've never seen the original Pirates of the Caribbean.  Like the first Johnny Depp one in Orlando, Blue? Well, I think the original, isn't it the original  one before that? It wasn't. It was a Disney story. I don't know if it was in an original movie.  I should know the first part of the Caribbean Johnny Depp one is great. I think it's awesome.  But I would do see that. I had no day. The dead was gone. I have to look for that one.  Colin, I did not know that. I'd go check it out in the theater.  I went for the 50th, um, me and Terrence went. So I'm not living dead for the 50th in the theater.  And they had a whole like the first half hour was like this, um,  you can find on YouTube now. So it was like a half hour, 45 minute documentary on it.  And then they played the movie. It was awesome.  I'm trying to think I saw what did I I saw a zombie movie. I went downtown to go see Patton last year. What the hell was it?  Oh, the the original dawn of the dead. My brother. I my brother and I saw the 3d which actually wasn't that bad 3d  I'm not the biggest 3d person. Hey, you know what clear picture. No sharp  No, I'd say give it a shot if it's ever on 3d again  And this one we watched not that long ago. Oh, yeah  Yeah, maybe the dead then we had a lot of fun with it and you know watching it again  is what I had mentioned earlier where it's I don't I watched it many times back in the  day but this is the first time where I really empathize with the zombies.  Yeah, this is the first movie that made you empathize with the zombies.  Made you feel it right.  Yeah.  So Dave says the fight was a Canadian was on me comedy set in the 50s after an outbreak.  Humans figure out a way to domesticate the undead and treat them like pets.  That sounds cool as fuck.  I have to watch that.  I have to go check that out.  We will watch it tonight after this.  I have to look for it.  Oh, gee bloodline.  What's up, man?  What's happening?  The actor would play Bob in the day.  The dad is the same guy who played the guy that had the junior mitts.  So, yeah, that's right.  He was a junior mitt guy.  That was on the table.  We, uh, there's the one up there is.  What's up?  Who I forgot to, uh, leave a button.  Sorry. Thank you. Yeah. Oh, it's on to be awesome. Maybe I'll watch it tonight  Yeah, fit coat though on to be yeah, fit  I don't think you would have it on here, but I've talked about it a few different times  There's a later movie that came out. It's only  2013 called warm bodies. It's got a lot of it's kind of like a comedy slash  It's like that you've seen that the zombies are they start getting more human as they start showing feelings  So they slowly start becoming back to a human as opposed to being zombie.  John Malkovich, one of my favorites at the time, and how much she's been doing you as much  to reset Palmer if anybody's ever seen her and stuff.  And Nicholas Holt, some good people that oh, we're going to talk about later Pat, Dave  Franco, James Franco's brother.  Yes.  Dave Franco.  It's a costume this is away life, man.  What the fuck is wrong with you, man?  It's such a great line.  Who's the guy?  And we'll be doing review of this tonight. So stick around and we're watching this is our watch along for Tuesday  Because it turned 40 years old yesterday great soundtrack to this movie's got a great soundtrack  Yeah, Darren and Frank have a good best and worst over this episode. It's one of the ones I laughed at more  He's from our best and worst of this episode. I did hit him in the fucking brain  I hit that fucking brain  Hey, well, part what's up? What's shaking?  Hey, I'm the zombie beavers. It was actually more enjoyable than the name  of the zombie versus right. I forget about that.  It's my voice.  The second guy's name when he calls him when he's like trying to make  to his composure. What's the boss's name? The first name?  Oh, I can't remember. I haven't watched him so long.  No return to living dead. Oh, and they're trying to live in dead. I think  men. What's the boss's name when he calls? Hey, we have to have a problem.  on a bird. Yeah, bird. Yeah, bird.  They have sort of a problem here.  My boyfriend's back in search of zombie movie. I yeah, I think we get on here.  I actually put a buddy called on here, life after Beth because I thought that  that movie is funny as hell. And it goes to his hell.  If we're talking about, could you consider idle hands somewhat of a zombie movie?  You know what I didn't put it on here, but I don't know why not. Yeah.  Absolutely.  Oh, here's the remake. Good. What good fun?  I'm glad to see that this got a lot more love over the years because I mean, I saw this when I came out the theater and  Everybody just didn't seem like it whatsoever  And I don't know why you remember Pat in early 90s like this is right where this is probably some of the first like  Remakes right and somebody saw the preview for this probably is like it looks the same exact thing as the original  Which in a way it kind of is right?  but I think once people grow the sevini in  I saw his stuff.  I think it's caught.  Got momentum since this came out, I guess.  A lot of movies are like that, right?  Nobody saw office spaces at the theater, right?  Yeah.  Yeah, but sometimes they find bigger lives on a home video.  Another favorite of mine is burial ground  and Italian core classic.  Some weird, asked storylines in that one,  the zombie makeup is gross.  You feel dirty after watching it.  Oh, I know.  I know.  I know, I guess I'm gonna be recommendations from Colin  on this topic.  I'm actually looking forward to the call to weather comments.  I can catch up on movies.  Oh, hell.  Yeah.  Yeah.  We just watched this, uh, not that long ago too.  We went, we didn't, uh, we watched it not that long ago when I  enjoyed it even more.  Cooper.  Right.  Isn't that what the guy's name is?  It lacks himself in the basement with the daughter and a wife.  That's the, uh, what do you call it?  The sheriff from house with 1000 corpses.  I can't think of his name.  I think this is the show I know.  Yeah, but one or two scenes in Happy as a Garden,  Rob Zombie's Halloween.  That's right. Yeah.  Go for it.  It is sort of a ghost and zombie movie.  Yeah, I can see.  I can see how you can relate that because they basically were zombies.  Surf 2 isn't underrated class.  They have to pull out of someone's I've never seen before.  Never saw surf 2.  I thought this would be a good topic because I figured it gets  some good recommendations on top of it.  Aside from like, you know,  the popular ones that I threw on here,  like the remake of the dead's a lot of fun too.  Now it's because of the original, but the remake is good.  Definitely have fun with this.  And this is one we have to do too.  We have to throw this on the watch long one day.  The remake is great.  Tom tolls is who you're thinking of by the way, too.  Tom tunnel to come and watch the comewash.  What?  What a fun remake, man.  I'm sorry.  And it's a.  Rick Co written by somebody who's pretty big right now.  Why can't I think of this damn name?  He did slither.  I got it just did the new Superman movies.  Why am I?  I know. I know. I know. So as we see, so you look at up here, all that guy can leave his name James gun. James  guy. There you go. Should remember that because it sounds like a porn name. Big gun.  Does James gun though hell of a nice guy and he's made some good stuff here and as much as I know you're not big into the comic book stuff is more hopefully he'll keep the DC universe at bay. So we'll see.  The original Scooby-Doo series had some episodes involved zombies like mom, Boamba and the  Voodoo.  Oh God, we can go.  Oh yeah.  That's true.  And it was always just like, let's see who it is.  They pulled a mask off and it's, yeah, I love Scooby-Doo is one of my favorite cartoons  as a kid.  I got my, I got Terrence.  I saw the hook, Don Scooby-Doo would be a bit of a kid.  Pat, it still holds up.  My kids love it.  My, uh, both my nephews love it.  I love it.  My brother loved it.  Yeah.  It's, it's kept, it's held up for some generations now.  All right, a moment of clarity here, I'll tell you guys,  I joke, not joke something funny.  So when Terrence was a, when he was younger,  and we lived still in Jersey as a matter of fact,  you know, try again to bed at night was a nightmare.  As you know, with your kids,  you just didn't want to go to sleep.  So my guy started watching Scooby-Doo movies.  He was like obsessed with Scooby-Doo,  he loves Scooby-Doo.  And I like to talk about his meeting Scooby-Doo.  So I would actually go out to the garage  and I'd call the house and pretend to be Scooby-Doo  on the phone and tell him he's got,  he should listen to his mom and dad  and he should go to sleep.  That's where they go.  And I used to do like the worst impression  that this would be due.  And he'd be like, okay, sometimes you'd be crying like,  why can't I meet you?  Yeah, the things you do for your kids.  You don't randomly came across my feet,  and I don't know if you ever heard it,  where this kid's in the car,  he gets picked up from school and some kid goes,  did you what the bed last night?  He says, check your mom's bed and find out.  No, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no  Even the girl that played  The hell is bitten the one that was bitten no that she played  Yo, you we should put that you should get that brief you should get a snippet of that  Yeah, I should do the blonde girl in it opposite  Oh, you're talking to me Barbara. You mean he talked about that sort of I'll get I forget that coming to get you Bob  But yeah, she was cute and that too. Like very ramboish  She's ram bet return living dead part two. I got to watch the second one. I haven't seen the long time  Me neither I threw it on here more self in nostalgia and the fact that  We were at the fog church and it was also in this movie too  Oh, it was I forgot yep. Yeah, I'll go back and read your revisit this one, too  It's been a long time. You're thinking of Patricia Tom and who played a  Barbara and the remake.  And she was cute.  I saw the cover.  It was cool.  Yeah, the cover is awesome.  Watch the tombs of the blind dead for the first time last year.  It has a zombie, quiesadores, on horseback with swords that are pretty cool looking.  Never heard of it.  Sounds interesting though.  And how did you type conquistadores correctly with your buys and size fingers?  I thought it was spelled differently, but he got it right, I think.  I think it looks right. I just wonder how you got that with those big fingers.  Surf 2 is a 60s beach party parody. Kids turn at the zombie surf punks after ingesting a chemically  laced cola. Starring a young Eric Stoltz. Oh, I definitely, I wrote it down. I gotta check that out.  Oh, really?  What else we got here?  See, I never saw Return of Living Dead 3. Did you ever see Return Living Dead 3?  I think it's not a long time ago. I never did Kristell since say you worked on this movie. I think he did I  Never saw I threw it up there because I'm like you know, I don't remember  Was this street to video?  I can't see this being theatres. I thought the cover is pretty cool  It's got it looks pretty damn cool. I'm like I might when I was looking at the picture and I was like  So you never saw it? No, I never saw it  Eddie these and isn't surf too the Simpsons stole the plot from the movie for their games  I'm interested in creating a project.  Any decent.  Isn't any decent the geek that got always  placed the geek?  He does a lot of voice acting.  He was in Greece.  He was in the fuckers.  He got a movie.  I remember he was in 1941.  I think that's him.  Yeah.  Yeah.  Councils.  Yeah.  Chris Nelson worked on that one.  Yeah.  I have to go check it out.  I've not seen.  I've never lived in Dead 3 is one that got better  for Bill with age.  It was Chris Nelson's first movie he worked on.  Sorry.  It's getting better.  That is it, I thought that was it.  Yep.  Chris Nelson did work after he talks about it a little bit on the things I had.  Yeah, that's the worst thing.  I'll go back and check it out.  And there it is.  Now that was the most iconic Azzambi look at cover.  Yeah, this one, you got to, this is a classic.  What we should put, like I said, maybe when we get around to it, to order some of  watch along.  Because to some rate because this August is ramp and it's gonna be fricking Halloween season for you now  I mean it's already Halloween season for some people Halloween season right now. I would want to watch this before I do a watch on  Guess this is another one that's been a long time  Yeah, I would have to revisit it and before I get a really good two to death with it  Yeah, very just know he's something was wrong features of zombie who doesn't realize that he's dead  Hmm, no  They ever did they ever turn into a film or anything. I mean that plot sounds familiar  No, I know this is I know you're big fan of Folchies zombie epic. Yep  They had some cool shirt to this too. They came out that long. Oh, I should have picked up a shirt  Zombie land now. This is if this was one this one special me and my son why love this movie  We used to watch all the time together zombie land  First movie I saw after I came back for my honeymoon. I love zombie land probably top five I counted the zombie movie  even though it's a comedy. Yeah, it's just such a classic, it's such good lines in it. I like  how it tells, you know, all the different things you should do in the zombie apocalypse.  And the Bill Murray scene is just priceless. Makes that whole movie. Oh, God, yeah.  And even does on the land? Double tap. I was used the first one. But still fun.  still fun. Yeah, it was, you know, kind of a letdown for some part of it, but yeah, it's  still worth it entertaining. Yeah, it was definitely fun. It's from the anthology books  you're scary stories to tell in the dark. Oh, okay. Say them. I never read any of those.  I know I saw the movie that came out. I didn't think much of the movie. The movie  was a lot better than I thought it was going to be. The books I read, those books  I don't know if I was a kid.  I'll do the back and revisit it.  I started in the theater with, I think my daughter.  And somebody brought back the scary stories I thought.  I remember seeing it advertised at a con.  Sorry, my eyes are bothering me.  Cry?  Yeah, crying, laughing, you know.  Favorite zombie movie scores in the pose that go.  I'll be the first to say goblin, just to get it out there.  Zombie movie scores.  I'm not too familiar with the scores, but it'd be something cool to visit and composers.  I mean, I know all the soundtracks and then I mean, I would have to say,  we're trying to live in Dead simply because just the group of bands that are in  there just all. I mean, one of my favorite bands of all time is T. S.  Well, T. S. Well was on that. And that was big at the time for me. I was like,  whoa. T. S. Alex, you made it in a movie. That's a tough question. Yeah.  Too much about me neither. As that's then it intrigues me. Like to the point where I  have to investigate it. Colin has two thoughts. Masks from Fultie zombie.  Definitely some of their better masks. I didn't even know that. Tots made them. That's  awesome. I mean, just so much shit now. Yeah, me and Mike were watching this show and we  really liked it. We have to go finish it. The Santa Clarita diet was an awesome zombie show  starring Barry Moore and Timothy Olafant that ended way too soon. Yeah, we were watching  the Netflix, wasn't it? I was, no, we watched it on his not so legal service that he has,  but we were watching that and we were really enjoying it. We were watching that and we  I want to talk with the whole show we watched and that we have to get on.  The one with the girl from, from, uh, what the fuck is it?  Yeah. The big nang theory where they start a podcast with a real serial killer.  Did you see that?  You lost me, huh?  You never saw that. It's a two. It's some show.  And the storyline is it's the girl that plays Penny. I can think of her real name.  and she plays her and her husband  want to start a podcast and she's only to like serial killer stuff and they find  a real serial killer that's out there killing and the cops have any of the  found them and they start a whole podcast with him.  That sounds familiar.  It's a good show.  I have to go back and finish it but we have to finish to consider clear it for  really diet too.  It sounds a lot of fun.  I saw that, yeah, the yuck mouth opened up for T. as well.  when Sean was posting all this stuff and he showed the bill, I'm like, oh, dude, he's freaking  playing with TSOL. One of my favorite bands. I'm so, I'm like, I'm jealous.  Did you, uh, did you watch him with his tasting of his foods? Or is that not your kind of  watch? I watched it today. I had it on the background when I was doing some stuff. Yeah, that,  I don't know, man. There's a fair near here by me that they have every year, the Wayne County  Fair and they do you know, and they have, you know, it's carne food, but there's some weird  shit food that he finds in that place. Man, that's some crazy shit.  Bill and I were going back and forth because that chasing green.  Dude, that guy makes me laugh. So hard.  He gets off with like that grab a tron thing.  He's like, I didn't even know we were spinning.  I don't know. We're just talking.  I'm like, this is a rib, right? This is a joke. There's no way.  Yeah. I remember I told his show on everyone's,  so while I threw it on the other night, because who do you have live?  Oh, yeah, exact wild on the other night. Oh, no kidding. Okay. Yeah. So I threw it on I was watching the background. It was some interesting guess  I messaged them. I would have to know like that place is probably got to have some goofy alcohol drinks too  If it's got all the other goofy other food and drinks a  Pickled Dr. Prepper. Did you see that? Oh, oh  Yeah, some of stuff he was eating. I'm like, oh my goodness a brave man. I wouldn't eat some of that shit. Well, dude  I I would totally try that  that's the hot Cheetos Twinkie Smashburger.  That's right, we're just saying.  I don't know, man.  My ass just quivering thinking about that.  That would kill me.  What movie was she in?  With, oh,  why movie with Kayleigh Cawoko?  That's the one that's Penny.  But the TV show was a show, it was on,  I don't know, it was on one of streaming services,  where she does the podcast thing.  The best thing with Kayleigh Quokko is in why him  when she's the voice, like the Alexa voice in the background  and that rich guy's house.  That's what we use, that's terrible.  It's not particularly good, but garden of the dead  is memorable for having the preacher from Halloween four  and people that turn at the zombies from  in Hailey from Al behind.  Well, I can see that.  So, so Reverend Jackson P. Sarah's is in the?  Isn't Reverend Jackson P. Sarah's an ex-Kape for New York too?  where he keeps on calling on chief.  Isn't that the same guy?  Easy of their chief in the theater.  The theater's married.  I think that's him, yeah, you're right.  I bet that was the same guy.  That's it, based on a true story.  That's the name of the show with Kayleigh Cuoco  where they start a true crime podcast about a serial killer.  It's a good show, it's fun.  We have to get back and watch it.  I know what my-  Whoa, this was, what's the issue is this song?  Oh, it's on Petecock.  You want to talk?  to  but I was highly intoxicated.  So.  And I, I was just exhausted from last couple of days before that,  walking around the con.  So in the coming home and one day doing all.  Yeah.  Cause I got, cause the wife, I guess, said she was away last night  cause my daughter went back to school.  So she went with her, set her up in a new apartment,  and she stayed over.  So my band played yesterday afternoon.  And then by the time that was over, I hang out at the bar  and then before I was not pointing at the happen,  I said, let me go before I drank a little bit too much.  I don't want to be driving. So got back here. So drinking more beer. One of my mics drank more beer there. Oh my god. What time are you up until late?  Huh?  No, I actually wasn't up to too late because I was pretty I was pretty glad I lost my freaking glasses. I don't know what the  Funkie do with them.  Because I have a pair of your glasses too.  I always lose a pair. That's why I have I because they're all cheater. Not they just cheat us. I have  Stacked on all other places. I was losing.  It was a bad day for glasses because I lost my sunglasses at the show that was playing at  the TV.  I lost my favorite cheaters.  I lost them.  I don't know where they are.  I thought maybe they fell off my head between my house and his house, but I didn't see  them on the ground anywhere.  I felt my dogs are quite creative.  One killed one of the Michael Myers stuffies one way and then the other one killed another  way.  Well, that's his name.  Yeah, Carmen Flippy.  Flippy, Flippy, Flippy.  Yeah, I always remember his weird last name.  is that all you're using Sandflakes too.  Yeah, but it's, well, as Tar of Hands,  you'll always be Reverend Jackson Peace Air.  Yeah, it ain't just.  Dave got this in goblin performing Knoxville  times he last year for a demon's retrospect.  They performed the score with the film  in the background at the end of the,  they performed one of the dead mashup.  That's cool as hell.  Where?  Another kick on.  I wonder if that guy pet is Reverend Jackson Peace Air.  Is that, that's not the same guy in the one-merd  with children episode that tries to rip him off  the bottle opener when they're stuck in the desert. Remember that one? Oh, I have to go back  and look. I know the episode by time. I'm starting to see his face. It might be. It looks  like him in a Jefferson like they have a bottle opener is pocket for the Coca-Cola machine.  You have to go to that. I don't know if you guys have ever played it.  No, no, no, no, no. There was a horror video game called zombies. He hit my neighbors.  that I don't know because I was I tuned at once I tuned at a  political vision. Oh, actually the first Sega system I should say. So that was  an early eight. I don't saw that.  I don't know.  I remember it's last year Fred. I believe I played it on super Nintendo or Genesis.  That was that era.  Is it neighbor or parents? He said zombie at my neighbors.  Eight my neighbors. Sorry.  Okay. I do remember the game though. Sorry.  Yes, he did. Yeah, he was on mere good children.  That was him. Okay. I was going to go look it up. That's it. Yeah. So Bill will not  last night, watch it, making the Teen Wolf females. So next Saturday night, folks, join  us as we celebrate it's 40 years. Right? 85. Yes, I didn't wear my Teen Wolf shirt yet. So I  make sure I wear that. Yeah. So with next Saturday night, we're doing a 40th anniversary watch  along with Teen Wolf and the bills joining us live. So tune in. Probably set the stream up  tonight. So you'll see it on the channel. Teen Wolf. Yeah. And I don't know if you have one of  of those movies that you watched over and over and over  and over and over again at a young age.  That was probably one of my movies I watched over and over.  But you're working off?  Yeah.  Maybe aside from Halloween, it was probably Animal House,  the Lou's Brothers, of course.  Flatch, Jesus Christ, I watch Flatch a million times.  Watch clue a million times too,  but that thanks to my sister.  Clue will be doing it in December.  Well, make sure we get my sister on for that.  We're going to be sure we can.  No, that'd be fun.  It said his shirt.  Oh, I'm pretty sure.  Talking of the cock, I just watched a new great documentary  on Richard Ramirez.  The Lost Tape's definitely worth a watch.  One of the better ones for him.  Interesting.  Yeah, I love, I got to tell my daughter.  My daughter is the scaring me for a while.  She was like, I've said to serial killers  when watching documentaries on them.  I watched Colin.  I watched Richard Ramirez special that was on Netflix.  It was a multi-part one with the detective  talking about it.  Dude, I knew of that.  I was very young when that happened, Pat.  but I didn't realize how nasty that guy was.  Holy cow.  What guy I am starting reading the chat?  Richard Ramirez.  Oh, yeah.  I mean, cool.  Well, he did.  And how disgusting.  Oh, man.  Oh, yeah.  It was in pretty.  Did you ever see that he was on the episode of the dating game?  They showed it.  Yes.  And that documentary on that.  And they would have one day with him,  didn't go on it because she felt he was too creepy  that it was something weird about it.  So she didn't go on the date with him.  Oh, well, blame.  David Brown was asking about the scare fest in Kentucky.  I think our friend Cody Snyder, he must be out and about.  Is Joe going this year?  As far as I don't Joe has said anything to me  because that one would be more realistic to go  than the horror hounds for next month now.  But I would probably only make the horror hounds  wouldn't work if something changed with you,  but I know that's probably, yeah,  You know, you got a lot of stuff.  I got much going on.  I'd love to.  But I pretty much after, after  Liberty weekend, I think I have  something booked every, I've had to do  there's a job at work that it's got to be done  in the weekend and I've been putting  it off almost a month now and they're like,  Pat, when are you gonna come do this?  I'm like, I haven't had a free fucking weekend.  So I can't do it until the second week in September.  Because every weekend is just booked.  I have something going on every fucking weekend.  Better get it done, Pat.  Better get it done.  I got to get it done, man. Yeah. I was a team wolf. Alan.  Unless I'm a team wolf, that's gonna be fun. Yeah. Yeah.  Maybe they're side team will afford for word on Saturday.  I didn't tell you, Pat, though. I think I've told you the story when so that we met Michael  J. Fox right after Lisa went and never mentioned and that was like one of his first  conventions he ever did. And I had the team wolf shirt on and I got that signed instead of a  back to the future item. He was like, Oh, wow. I think he saw something different. Yeah, exactly.  Oh, anyways. Yeah. Oh, so, yeah, he knows which document I'm talking about that.  Oh, that's right. It was the other guy Rodney Alcala. That's it. That's the guy who won that.  That was Ramirez. I thought it was Ramirez too, because I've seen a documentary about that too.  Yeah, I must be getting a mixed up two cats. Yeah, he too. I could have swear it was him.  I did not know that because where it was.  I just get a kick.  They had like the helicopter following him from like bust a bus.  Trying to get away.  It was like a huge long chase.  She didn't want the video today and the guy was at a con called mid summer  scream. Yeah, I've heard of it. And John Carpenter was there.  Yeah, so Carpenter said he's still doing some cons. I didn't think he was doing  some.  Scream was this weekend. I thought that was the one, isn't that the one that's in Orange  County? I think it was the con this weekend. I think so.  PJ souls because I met Russell's there with  Oh, that's right. I saw Matt's posts. Yeah. He's so pictures with  yeah, I hope that's okay. Matt has a bit in our chat. Oh, wow. That's good.  I don't blame him. I have to message him and  I'm speaking of our buddy Joe. This is his favorite movie right here.  Shauna the dead.  Shauna that's fun. There's no sad about it. I like the second one better  which might not be too popular by many people, but hot fives. I like hot fives more.  We talked about watching it.  I don't remember.  How we talked about it, but how does this do it?  That's pretty wild.  It is good.  I thought we talked about doing it, I guess we didn't do it.  No, we do it as it's going to blow up.  I want to call off.  If we do it, definitely have to have Joe on for that one.  Only if this wasn't the preseason, Pat, the bears are winning.  This one was fun.  This one was fun. I only watched this one not that long ago. Did you ever see this?  Is that what's her name?  Um, that's not the comedian chick, right?  No, this is um, the hell is her name. I'm helping some chat if you know it.  I watched this not that long ago. It was on Pluto and I never even saw it.  So this is his girlfriend she gets killed and then she comes back as a zombie.  And it's funny as hell.  Yeah, that's all replaza. Okay, it is.  I did this here, okay.  Yeah, this is funny.  John C. Riley's in this Paul Reiser, who I just met.  You never saw me.  I never even heard of it.  It was on Pluto probably a couple of months ago.  And I put it on and I was watching it and I might just  move these funny as fucking hell.  Yeah, this one's worth checking out.  It's a lot of fun.  We got to watch that movie, Miss March.  That's the one I want to watch with you.  I picked it when that's the last slide I have.  But yeah.  Let's move this over here.  What's up there?  Oh, it's only on prime.  How the hell is that happening?  Anyways, it's a similar plot.  Yeah, that you've seen over and over at movies,  but I just I've never even heard of it and it came on.  And I was like, this movie is funny as all hell.  I enjoyed it.  If we, I don't mean to change subject.  If we end up seeing anybody good in December,  it's still CityCon.  We could always revisit getting together for that too  because I know it's like a halfway point for you of me too.  to just.  That's in December.  Oh, yeah.  December not so bad.  I don't know anything.  December.  December is actually so far is open.  Yeah.  So that that might work.  Yeah, that could definitely work.  But we'll see.  We'll see who shows up there because then we can always get the Romero stuff like the  Taylor Swift dark side stuff.  September's scattered, but October and November is just books.  Howling.  Jesus.  It's Port solid.  Solid.  Yeah.  I'm looking forward to returning to Living Dead doing that this Tuesday night, but throw  some more in the chat because there was a lot more of these you guys mentioned I didn't  heard of.  And sound interesting.  There's life after death.  There's Dante's bearing the X.  I remember bearing the X, but I remember Nina forever.  Nina forever.  It sounds like porn.  Nina forever.  But let us know.  If you're watching this after the fact throw some in the comments.  Let us know some of your zombie films.  bit nobody's matching movies in the life.  Three sazes there. Sorry.  You gave it you gave the movie three sneezes.  I gave the movie three sazes. Yeah, that's all.  And we can do tonight.  We're going to do since right off the heels of talking about zombie movies.  So celebrating 40 years of returning to living day, which was actually  yesterday, we're going to do a watch along of  But you can call it personal living dead. So let's do a quick movie review and talk about some return of living dead  So tonight we're gonna do a movie review of return of living dad. Let me get my little  Get rid of this stupid ticker here and go first pat because I've been sneezing like crazy  I'm gonna try to get it right over there. I don't know  I guess I did not  I did not.  Right?  Who is the legendary Daniel Bannon, right?  That's who did return Living Dead?  They're a badly-rected.  I'll just carbon this, buddy.  Even though he mostly wrote stuff, right, he didn't direct too much if I'm correct.  He wrote a lot of stuff.  What did he direct?  Did he direct anything?  No, I was wrong.  I'm very sorry.  For some reason, I thought he directed it as well.  He was mostly a writer.  No, yeah, he directed it.  What am I talking about?  I'm sorry.  Do you like to return Living Dead?  Yeah, I did not know that I  Like you said, I'm out of it, but I knew he wrote it. I did was not aware that he actually  Directed it too. Yeah, this was like his claim of fame as a director  He only did two other things called bloodbath in 1969 which is a looks like a short movie and the resurrected for a  1991 so  Yeah, there's a lot of memories of a time living dead because like I said, I knew  the soundtrack was a big thing for me.  You know, probably around 83, 84s when I found the band T.S. well.  And then when I found that they were going to be on the soundtrack,  I remember going to see in the theater,  and I thought it was so much fun.  It was great hearing all that stuff.  I remember this is probably around the time when I was in my punk rock phase,  doing I was writing a skateboard, and it was right in the middle of the 80s  and the skateboard craze.  Send more paramedics and cops member said more coming  So this movie it's it's it's so entertaining. It's so funny. Take your baby. Thanks bud memorable characters in this film  The baby. Oh, you got a little stream. I don't sign it. It's having a great. You're the only but you're doing a stream tonight to a night o'clock  Why are you doing so early? Definitely? We're gonna miss it. You're dirty. Right? Yeah, just started to 10 o'clock  So I can we can we can hop on and watch it  Well six o'clock for him. That's not too bad  But now I look forward because he always says,  it's a stream late at night when there's nothing on.  So I put Davy on.  But yeah, I love this movie.  Remember all characters, great soundtrack,  memorable lines of so many great lines from here  that you remember.  And the characters, you just love all the characters.  I mean, the guy from Poltergeist is in it,  who's James Watt, James Something Rather.  James Karen.  James Karen, you like, they got to play,  bird was good he's in a bunch of stuff of course tom Matthews  you know famous in the fire thirteen th  world  uh... the uh... the undertaker guy time calfa  you remember what he's from  i like a lot he's the guy kills bernie  poly from we get a bernie's give some that right he kills bernie  and he's been he was a big character he used to be it he was always pop up  on a lot of TV shows a lot of sitcom back in the day i was remember seeing his  big character actor yeah i wasn't a bernie miller i think  He was in 1941, which I didn't remember.  Who was in, I remember in 1941, I love it.  It's set a small world here, home on vintage.  And then of course you had Demon,  our Friday 13th part five buddy was in there.  Who else?  The guy, the one punk guy with the Christian,  uh...  what he called the  with the uh...  the fuck is it  why am i trying to like gone uh...  back to the future  make flyman  mister make fly  oh you're talking about uh...  you should be in the state  a ten  right yeah  christian what mike and my mom i don't like his last name  now you made me draw  complete black of his last name  That's that Christian. It's, um,  Chris, man, Chris, man,  Glover. Yeah.  That's my Christian was  Tommy off and said,  it's never 10.  So there was a,  it was a show. Sorry.  His hair cut in that the guy in the  return of living dead that has the same  hair cut. He was just, he was in point  break. So he was in point break,  which was great. Actually, I was just  watching point break the other night.  The OG and who else is in there?  Of course, Linnea quickly, famously gets  naked, but she's really not naked.  If you find out if you actually watch  the return of living dead documentary.  You'll find out she was wearing like a bodysuit,  which totally killed it for me,  because I thought she was fully new.  So such characters, soundtrack,  memorable scenes, fun story,  the apocalyptic ending at the end of it,  because it doesn't have an ending,  because it's just gonna get worse,  because of what they did.  And you also have the kernel in there.  The guy who was actually deep on  from  Halloween 3 season of the witch and  Great characters this this movie for me  do this this is this is uh  This movie is just about perfect movie for me. So this is like a 9.5 movie for me easy  We got our share of how or Friday the 13 people here right with Tom Matthews and  What's this up Miguel at new news right? Yeah, man. That is  Yeah, that's a 9.5 for me, dog.  Yeah.  Yeah.  Yeah.  Yeah.  This is I just when I saw this, I didn't expect it to be a comedy, right?  Like that whole beginning with Tom Matthews and James Caron is so funny.  So good.  It's so funny.  And just when they got that body out, right, like out of the unlocked and they're screaming,  like,  Oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh  What a asshole yeah, we said he was in something too, right? Halloween 3 he was the bomb at Halloween 3 gets his head pulled off  Well, that's the same guy. Yeah, boy  Hey, what's up hurt what's she aching? Hey, Herbert? Yeah, you know, I guess I'm just gonna go simple 9 on it. It's so much fun  just it's  Lot of memories and watches for the first time just laughing you know  It's good about this movie if you don't watch it like I  I enjoyed more fun to watch it all the time.  You know, a lot of people can watch this over again.  Like if I watch this, like, you know, once,  like every couple of years,  I seem to like it a bit more.  If I put it on repeat, I'm afraid,  like I'd get worn out with it, you know?  Yeah, it's not a movie I put on a lot  because it's the same, yeah, I don't wanna wear it out.  It's just, it's a fun thing to do every so often.  That's why in the last time I,  I think the last time I watched it was probably  or watch along.  Yeah.  It was like, it was over a year ago.  And how about his sacrifice into movie, right?  It's like so damn emotional.  That music, remember the music when he's putting himself in through the chamber?  Burn the flames.  Yeah.  Oh, God, remember the paramedics are checking them.  You should be dead.  This tells me you're dead.  But...  Yes, I know.  do nothing beats when they bring the group, the limbs all like chopped up to what's the  guy's name again?  Ops Earl.  Next door in Ernie like they lived, remember they opened up the bag, he's like, where  was I, somebody was bringing it up somewhere where they said he was supposed to be like  a like a Nazi guy in hiding.  That's why he had like the Nazi music playing and he had like a lute like a, I can see  that. I'm somewhere where did I hear that? I don't know. I could see that. And the guy with the  dozerring or you know, or the with the earrings right, the punkie guy with the crazy haircut. He's  been in some stuff right? Wait, he was in Halloween, not Halloween, part five, Friday, 35.  What you told me right? I was asking him. I thought that was his name. The guy plays Chuck, right?  Not the same guy. I think you're really out of line. Vic.  That's the same guy. Vic, Vic, the guy you played Vic is him.  The dude actually gets his head eaten by the the slimmer.  It's a hard one. You got a line. I think you really have a line. Vic.  Herbert's watching his favorite 80s slash or problem that I just watched problem  That's another movie I put on a lot.  That's just a comfort food.  The OG prom night.  I just love that movie.  Burt.  Um, Burt.  Burt.  That's gonna be so much fun watching that.  I was trying to find that Walmart exclusive steelbook  because I just have a regular DVD of that Jesus Christ.  You can't do that.  You're gonna give Pat a heart attack to the enemy too.  You can't do that the Pat.  Please apologize, Tom.  I'm sorry.  That's okay buddy. You scared? You scared me?  Oh my god, you scared somebody audience. Where are you going?  Okay.  Hey, he only cost me. He only cost me 80 dollars. He only cost me 80 dollars at the  contest today. He just...  You saw it?  He was a little bamboo samurai sword. Not like the metal one. You know, that would be...  I'd be going to jail if I gave him a hug.  I'm gonna tell you his mom that would have done that.  I gave him a, he got a bamboo, one made a bamboo so he could even bring it to not the school of course, but to another kind if you wanted to.  Oh, I'd be that guy, but there's a hit definitely since Bryant Peck is in it or does it bother you. Oh, yeah, didn't you get convicted? Was he like a sex offender or something?  He did something with a, I did, did they catch me to sting or something like that if I remember correctly.  Uh, burnt.  Um, now it's a, um, burn.  Yeah, I'm the same way. You got to separate it. Yeah, because it's a movies portraying a character and I get that. Yeah, that's just  Yeah,  Don't living dead is almost like either a sequel or a spoof of Night Living Dead. Oh, that's basically what is meant to be. I mean, it's not really part of the Romero movies because  Romero didn't do it, but yeah, he's right about the actor Brian Peck. I remember hearing that. Yeah, I remember like it's like he was like a sex offender, right?  All right. Yeah, he pleaded. What's this say here?  Perfect.  Fred's going to go change his trousers after that jump scare.  I'm actually recollecting my thoughts.  You really scared the crowd bad.  I mean, that's awesome.  That's awesome.  Yeah, please, no conscious of charges of committing a Luddak against the child 14 or 15  in oral completion of verse and under 16 he was convicted and received a set to 16  months. It was ordered to register as a sex offender. So okay.  I fucking smell what people I really don't know.  He was pen pals with John Wayne Gacy even had a painting against his alter ego  program. The clown of Gacy made form. Wow. Wow. Okay.  Wow. Why?  Yeah, the civilian remake was great. Yeah, we talked about that earlier. It's a lot of fun.  And we got a new extended cut coming out of that and that might have to be something we explore.  Even I know a lot of the figure that I was pat if he's not getting to have that edition, but that'll be fun to check out.  Yeah. Was a big deal because he was in the Fender Associated with Nickelodeon and I think one of his victims was Drake.  Real? I doubt I did not know. How was he associated with Nickelodeon? Did he work there or something?  I saw a lot of Drake and Josh.  I was one of those favorite shows when he was a kid.  You know, I forgot to tell you about that I wanted to.  I said when I wait his line.  I wanted to get Rob Schneider to sign my dude's big little poster.  So whenever what's the same comes around again.  Our buddy from Halloween, Rob Zombie's Halloween.  He's my reason to do big loads of detective.  Oh, yeah.  What the hell is the guy for?  Yeah.  Well, you're in foresight.  Yeah.  What's mad?  Jelsie, you don't know what his A is?  Look at this dick, right?  It's like it's no, it's bad.  It's bad.  I haven't seen two spigelow in forever.  Two spigelows fun.  Oh, it's great.  I just haven't seen it in forever.  Actually, my school.  Yeah, let us know.  That's our review of Return of Living Dead.  Let us know in the comments.  Yeah, sorry.  We don't.  We're going to be watching it on.  We will be watching it this Tuesday  for our watching long to celebrate 40 years.  This Tuesday, be there.  He worked. Oh, so yeah, he worked at Nickelodeon. Okay. It's all in that docuser is quiet on set.  Oh, because that was that J. G. Michael was that the show that Amanda Bines did us episode of about Amanda Bines. I think on that. Yeah.  Where is that show?  Quiet on. So what's the different episodes?  The show with just yeah, all the scandals with child actors. Yeah, there's the Amanda Bines one. They.  I don't think you think it was past your Nickelodeon time, but the show hey dude, like you know the main girl is  Christine Taylor that's been stillers for life life. She does a podcast with the one guy Ted from hey dude. Oh, I loved her  She was great. No, she was she was Marcia in the Brady bunch. What we should have this out. Yeah, and she was in  She was in the zoo lander movies with his husband. Yeah, and she was uh, she played the  the girl who shaved her head in the friends episode that was hooked up with Ross.  She used to shave her head.  She was friends with Phoebe.  She said, no, I'll set you up with my friend.  She said, what the ball chick?  She said, tell her.  She had hair.  So they go on this trip and Rachel wants to get back with Ross so she convinces her to  shave her head again.  She comes back and he's like, oh, her burden.  knows they do it. Yeah, they're they they talk in their podcasts.  They've been trying to find Danny forever. They can't find Danny.  Danny's never done anything else other than he do.  There's a whole documentary about the Nickelodeon scandal. It's on Max  or Netflix. Oh, scandal has been gone to the very neighbor kid from  better off dead really Ricky from better off dead.  Ricky. What the hell is he? What did he do? Did he do something like?  Cause he never saw that guy again. I mean, I don't ever ever see me in  anything. Yeah, Ricky, G Ricky and real sorry, a mom blew up.  10. I did not I think I watch all this shit.  Probably because are you afraid of darkness from the can away from crazy California?  I'm not going to argue with you there.  You know, I'm very still, I mean, I'm funny are  right in the darkness problems. Yeah, well, that's well, everything's  something that we can now or in the south, the southeast.  Oh, absolutely. Georgia Carolinas.  Yeah, oh shit. I didn't do my top five. What's on?  Jamie Lee Curtis looking like that on the set of something.  Huh? For what? What was that? Was that from whatever that picture I sent you?  With her and the musk look. Oh, yes. Okay.  Maybe that was that show on about the Chicago restaurant because she's on that, right?  She's on that.  What's the bear?  Yeah, she's been on the bear.  Yeah.  Did not know that.  So I'm doing my top five.  I knew which one I had a button.  I'm just a bit nervous.  Herbert, I don't remember that episode, but I watched he do.  And it's something I should probably revisit somewhere down the road where it's at.  I do the name of the show, but I didn't because it took a little bit too old.  I could have sworn I'd danced my son if he watched it.  Maybe that's where I've heard it.  one second let's see if I can hold on here who was the star in that move in that  show I wasn't really one like I think you could probably say Christine Taylor was  like the one that like really kind of became something of it you'd figure the  forget what it is that the things on yeah I'm gonna get things we're gonna get  you to overloads of the show  okay  sorry so tonight we're gonna do our top five thing our top five body horror  movies oh just like I said we'll probably talk about it fresh off of me watching  together the other night with with Mike and so you found together but you did  not find the other one yet did you?  No, no, it's like a cam footage one.  So we're waiting to find the way  the little bit longer to get the real one on there.  So yeah, I think it's the C weapon jet.  Okay, okay.  And if he doesn't like that movie,  I'll be like to have a role that's going on buddy.  What's going on with you?  Need the talk.  Yeah, we wanted to watch that one,  but yeah, we have to wait and see until it pops up.  But let's do our top five tonight.  So our top five, Bobby horror, let's do it.  Yeah.  Alright, so tonight we're doing our top five body horror movies and you can do a lot of  movies you can say we're fringe on the edge of body horror but since all subjective to  so I just picked you know movies that I definitely knew were body horror that I liked.  Yeah.  I'll go first.  My number five is exactly what we just talked about the movie together.  If you've not seen together, there's some seriously weird shit that goes on in that film.  And there's a match with Pat Knight and that. That's my number five as well. Yeah.  I think maybe now Pat, I don't know, you probably don't feel different, but  can you see how those two are actually really together in real life, like how that movie  panned out in their performances? Could you see how. Yeah, yeah, now I can definitely see another  thing you mentioned that they're actually married in real life. There's like a six or seven year  different. She's older than him. But yeah, that guy is either she pisses you off or he pisses  you off. I think he might have pissed me off more than she did. But he doesn't have the  most because she's cute as hell and he's having spoiler alert here if he's not seeing it. I'm not  gonna reveal everything. But you know, he's in this like funk where he doesn't want to have sex with  her. And all she wants to do is have sex. It's like dude, that's wrong with you. Don't take a pill.  It's just a way to talk about what happens when they do.  Holy shit.  Yeah, I was waiting for that.  We both called that when it happened at the school in the stall.  Yeah, you want to see me quiver in a theater seat screaming?  Thank God nobody else is in that theater besides my brother.  I was like, oh, that's beautiful.  Oh, the holy crap.  You saw that coming too.  No pun intended.  I was actually, some people might not like the ending of that movie, but I thought it worked.  It didn't go in the direction you thought it first, but then it did.  And then it went, it did a little bit of a little swipe turn, right?  That's probably the best way to say it.  Yes.  Number five for college.  Scanners.  Great movie.  Yes, slash your friend.  I wanted, I could really put RoboCop in here.  I didn't.  The fly may or may not be on my list.  Baskey case. Yeah, that didn't make my list best. That's true. We have by best case was I  Remember renting that we talked about earlier about renting movies from the theater  And I don't remember renting that and getting it home and be like this my food thinks this shit up  Yeah, I you know because it together the fly fell off of my list  I'm so sad about that. I know that's kind of crazy  Shivers is another good one, too. Look at that. Councilor. I asked you anyone since I'm a on my list here, but it's good  What did you do is your number four? I'm sorry? I'll do number four  So for me my number four is video drum. Oh, oh  Get that love video drum. I was one of the movies. I love from the 80s another one  I found in a video store that I just rented and because I didn't know anything about it and I saw Debbie Harry was attached to it  Which is blondie and  Watch that and I remember always used to be on late night on cinamax too. It was always on cinamax really  Yeah, so video drum if you're not seeing it long live the new flesh is it  This is a laugh.  The movie James Woods, Debbie Harry, creepy weird Crona Berg film.  My number four, it's really only bodyry horror mode of just one character.  We just talked about it.  James Franco's slither.  I can't wait.  We haven't watched it, but we need to watch slither together.  I think we'd have a lot of fun about that.  I've not seen it.  I got to check it out.  Do you haven't seen that, Pat?  Really?  No.  Society.  Society?  No.  I don't know that one.  It's slitting out.  I never got about to see that.  I could have put that alive on here.  It's one of my favorite movies.  I don't know why I just don't think  of a body order even though clear as day is.  Yeah, I know I almost put in the realm of zombies,  but I can see body horror for that, definitely.  Bill's number four is the substance yet.  That's definitely on my list.  It's coming.  Yeah, it's coming.  It's coming, it's right.  Definitely the epitome of body horror right there.  Absolutely.  All right, so number three for me is where's my number three?  Oh, speaking of, I think,  I know three is the substance like just like bills number four that moving just I  Mean it was such a buzz about it and then when I finally watched it  I was just like first of all it's a great movie. She deserved the nomination nomination as did  What the hell is the other girls?  I'm coming out with it from the one-tone brother  And because I mean she really put herself out there to me more in that movie, so she actually definitely deserved it  There's a lot of fun  Only thing is it just it probably just went a little bit too far like the last 20 minutes didn't need to be there  That last 10 or 15 minutes was out of this world. It was just crazy. I might that's where that's where it you know  It jumped the shark so to speak because I was like really  This is just a little bit much here  Yeah  But good movie love that movie and yeah all the praise of God. It's nice to see that it got all that praise so  Well, I'm sure you're coming up for you  but the thing is what falls right in my number three slot. There's no doubt about it.  Groundbreaking for its time. I really, this movie probably would have done a lot better if it didn't  come out around the same time as ET. I think that what really killed it a bit and Carver  didn't got so much shit about this movie and now, like most people say it's one of his best movies.  So yeah, the thing, number three. Yeah, they did not see that. If we go check that one out, that's  that's one of the buildings.  90s body horror, rich people's sucking,  actually shape shifting and sucking the poor dry.  Interesting concept.  Dr. Giggles is, I haven't seen that movie in ages.  Oh.  There's an ever-skated song based on the movie's leather.  Cool, that's cool, but.  Oh.  If it's on one of those CDs I've got,  I just put those, I came across the CDs  who had given me the last year or two.  So.  number two for Colin is dead and buried for me one.  Well, Ted and buried. I've seen dead and buried.  That's actually an older one I've seen.  Very cool. All right, so.  Number two right number two.  Now correct the Monday.  Yep.  So what I know these are orders.  See, this was my number two.  Oh, number two for me is.  Reanimator.  Oh, look at that. Yep.  One of my favorite movies of all time,  love that, love me some Barbara cramped in that.  To be a severed head in that film would have been beautiful.  If you know, you know.  That movie just, I mean, even the hell is his name?  Who plays Robert West?  Have we loved the guy?  What is that guy that Sean was telling Bill and I about  how we talked?  You're talking about Jeffrey Combs?  Jeffrey Combs, he's just so great in that.  He really, really is.  Who's gonna believe a talking kid?  Get a job.  Get a job.  Yeah, love, love, love, reanimate.  Jeffrey Combs, yep, there it is.  We never did a watch a long reanimator.  We gotta do that.  That and from beyond too, we should really do.  Oh, from beyond Jesus.  Somebody mentioned from beyond the peer too, yeah,  but oh, yeah, number three from beyond for Colin.  Oh, she's just amazing in that.  She's amazing in anything.  Sorry.  even as the mom in your next she was hot.  Wow, okay.  My number two,  some people might not consider it body horror,  but to me, it's Claire's day's body horror,  and it's a great film.  It's one of Eli Ross,  early films called Cabin Fever, baby.  Oh, Cabin Fever, nice.  You see some good stuff from the ladies  in this movie too, so.  Yeah, no complaints there.  But just to think of what,  where this is all coming from, right?  as you start to collect them where there's some sort of, yeah.  Yeah, that's all I'll say.  Name an old tree too, Freddy's Revenge,  Freddy bursting out of Jesse.  Oh, definitely.  Number two for Bill Hellraiser, yeah.  I didn't even, I'm not a big hellraiser guy.  So that's probably, I don't know.  I just always forget about that franchise.  That didn't mean anything for me.  By the way, I got it before I forget to ask you.  Did, did strict, my strict mentality was going  at the Friday 13th convention or did maybe I missed that and he posted all those pictures.  I think he mentioned it to me or maybe did that in the chat when he came in our chat.  Something like that.  All those pictures. I was like, oh, damn, look like he had a good time.  Yeah, look like fun. Glad he went. That looks like fun. I haven't seen a lot of that's  the only person I've seen online with post a picture from it. I didn't see anybody post  anything from it.  Especially our California friends that didn't really know. I know although, uh,  Lido said why he didn't so yeah, he was busy with work so  anyways and  Colin I have a match my number one the fly 86. I mean come on you can't get any more than that  Old one stuff oh god. Nuts in man reanimator video drone extra. Oh yeah, but yeah for me number one is the fly  I  I just because now it's the only movie I'm gonna think of so much with body horror.  And I'm my number once in some since I just...  I think...  I think, Demi Moore, I'm so glad she did this film.  I think it really showed a different side of her.  And I really...  I think it extended her career doing this movie.  Oh, the revitalizer career goes...  I mean, she wasn't necessarily dead in the water,  because she just wasn't doing a lot.  Like, she was on landman, but she's got such a small role,  which I think that's going to change now in this next season that's going to be coming on in November so  probably yeah that's okay Oscar nominee here let's put her in some more shit  heck yeah but yeah if you could have done some with the last 15 minutes differently  I just you and I talked about it if Ray Lee ordered in die he was that role of Dennis Kued which  I could totally see but Dennis Kued was a great replacement though  And it's great. Yeah. I mean, that's, you know, sometimes you can't see how somebody, but I could totally have seen Ray Leode in that position as well.  He could pull it off, but Dennis. Great.  Yeah.  Like he's a lot of it.  I don't want to do a lot of definitions for body.  Horry. Yeah. Like God, I think even built when we were watching Frightnite with him,  like you could even count like a little bit of Frightnite as body.  We're our transformations.  that might be a better thing to do next time maybe is our best body horror scenes or transformations maybe.  I don't know like pick our significant scenes from that.  Yeah, here's one right here when David turns into a werewolf in the American werewolf in London.  That scene was groundbreaking at the time especially.  Oh yeah. Hey, Leanna. What's going on?  Hi, Leanna. Hey, happy Sunday.  little Nicky is body horror. Harvey Gotts, though, gives Kevin the Ewan boobie's  eyes. That's true. Bill's like, oh, drats. I forgot the fly. But that is number  three and shift everything lower down a peg. Sorry. Yeah, see, I was thinking  about doing it that way too, Bill, but I just kept that as a runner up. Yeah, the  fly is just such a great movie. That's a movie. I'm surprised we haven't done it  watch along yet. Tusk is another one. Another decent body horror movie.  I can't tell. Tusk is a good one. Tusk is a good one.  Yeah. Behold fish boy. Tusk is a rough. That's how body horror is done with 80 cars  Oh.  Thanks.  There it is.  Elliot posted.  Did you just naps?  Go one.  Yeah.  Oh, we did wear a Wolf movie so well back.  I know that we did all the thing on.  We did.  Oh, yeah.  You're pretty sure we did.  No.  You know, that's a Kevin Smith movie too.  If I ever saw a Wolf movie.  I said Kevin Smith movie.  That was his, uh,  That's what's the Kevin Smith movie too if I'm giving Smith movie.  That was his, uh, that was his, uh, path to getting into horror.  I do not know that.  I do not know that, but that's what I'm talking about in horror movies.  Keep talking to the chat if you want.  If you want to, if you want to talk to the back, throw them in the comments.  Let us know some other ones that we missed or movies that you think you  can sit about the horror because it's all subjective.  So don't be shy.  Let us know.  It's all in hips.  The only thing we didn't do is tonight we didn't show some new stuff. So I'll show I have to gather it all so I might I have to  You too had the same problem  Yeah, I don't know what it is because he started hitting some of the stores and  So I definitely got a lot of stuff. I'd bring some pictures. I'll bring them up. Well, yeah  Like I just I did ones that would just been easier with the pictures and then I'll show off whatever we got  that's a good one, Billy.  I definitely body horror.  I can see that.  Yes, indeed.  That movie was bizarre.  Fair.  I read the book.  I was on this kickboard, I was reading  like a lot of the Stephen King books  and the Richard Bachman books,  and I remember reading that book.  And I always wondered like how the hell  could they make this a movie?  And they did, because he wore that fat suit.  And the movie, the movie wasn't that great.  To me, the best part of it was,  call it. Cari were, she's hot as hell. Oh yeah. Yeah. Yeah, that was boarding on  horror too, but Bill, you're right. Red State's a good film. Like that, that's John Goodman.  The great John Goodman speaking of John Goodman. So, man, I did buy that blanket while you're  doing your stuff. You did buy it, huh? Yeah. Um, I'm guessing, because I didn't send you a picture  this. I'm guessing you did not buy this or did you take a chance to get this or no?  I was going to, but I was like, oh, I just need another one. Oh, because they didn't have my size.  I thought the Excel fit quite nicely for me, Pat. No, they didn't have an Excel. All they had was  they had large and below. They didn't have a, when I saw it, they didn't have an Excel in there.  I don't think they came in super fat. And I'm guessing this was the new one, right?  Yeah, that's the one I picked up.  Okay, I actually, I was kind of with you with all the blankets I didn't want to  get more, but that one's pretty cool.  I thought it was cool.  If you're still working, I'm just, uh, no, I'll bring it up on them.  It's, um, I found that little guy.  I know you got the little game.  I got cool guy.  Oh, and Pat, this is where it's really bad.  Are these from last year?  No, those are the resurrection ones.  No, Halloween two ones.  Oh, no, those are new.  Yeah, they had resurrection ones.  I have to pick up the Halloween two ones.  I don't think I had to actually let me bring this out for a second moment so we can see  Yeah, that's new they didn't have them when I was there because I look oh god of my good. Thank you  Nice  Yeah, it's usually sometimes I'll go off of the date 10 bucks. Yeah, I'll go off of the copyright  But they didn't have a copyright game on here. So  Okay, sorry. No, I'm sorry. I have to pick those up. I didn't see them  I know I leave found one spirit. So there's two I've been stalking so I'll probably ride by him tomorrow  See if they're open. I want to get those H2 lights  Yeah, I saw Frank got him  Yeah, he got him. I got I met the ask him which one because Frank doesn't live far you that's the back of that comic. Yeah  Did you get this or no?  No, I did not get this comic. Is this one of Frank was talking about?  It's a it was a San Diego Comic comic  did he talk about it on a stream and I didn't know that he did maybe?  Maybe it was probably a chrome cover?  Yeah. There's another picture of the front of him and it's a badass cover.  Yeah, this is the one he did a stream on Friday and just talking about it.  Oh, he did. Okay. Yeah. I don't know if it's still available or not.  That's where I left that back part of it so you can see.  That's pretty cool.  Oh, dude, this is a canvas from the artist.  His name and I left his card on the bottom there.  Tony, Santiago, I sat at this guy's booth  looking at all of his art.  And he had two canvases, or you can buy the print.  Some kid bought the canvas right in front of me.  So he had one left and I had to buy the canvas.  That's nice.  I like that.  Cool as hell.  Isn't it so fucking bad, I asked you.  That's 16 by 24.  That's nice.  We're, um, that's a movie we, well, you and I can bond over and I know neighbor Mike loves that movie. We're bringing a baseball guy. So  and the artist added you, correct. He died, which he told me all by. He's like, yeah, I didn't have money originally, but  I was like, I put him on there after the fact. I'm like, that's cool.  So  that's a I bought that canvas too because I love that shot on the bottom from the end of the first film. I think that's such a significant  camera angle from when they're getting Gary Bucie there. So  but yeah, these are canvases, Pat. That's nice.  That's I met Helen Hunt, very sweet lady. She signed it on the tornado there.  I talked to her briefly about some other films like, you know, what women want and as good  as it gets, I like as good as it gets.  I haven't, I wasn't a man about you, fan.  That might have been your area a little bit too, because you know, Paul Reiser was there.  And he was next to her, which was kind of funny.  Oh, what's that, but to show us that.  I mean, about you and that used to be all right.  Yeah.  And Paul Reiser is busy with that.  He was busy because it was a huge halo in the union there.  So yeah.  Yeah, good to beat her.  There it is.  Look at that.  I'm doing it.  I'm doing it.  This guy falls in my top 10 celebrities have ever met.  Unbelievably cool guy.  Gave you all the time in the world and he had such a long line.  Now, thank you.  Not like he would like.  Yeah.  Yeah.  Yeah.  And he asked me.  Let me regard, of course.  So I do it to say.  but I wanted him to sign it in black and he's like dude this is awesome and red so  he's got a beautiful signature it makes cool yeah so I that's a movie we've  never watched together we should probably we should yeah I agree 100% love that  movie good cast and I was telling you about these from flashback where the guy  gave my brother bought like ten of them and he gave these two like duplicates  for free my brother gave them to me yeah because there was so many I got a look on  somewhere one of my drives somebody sent me all these to print out.  I got a lot of people.  But dude, my brother bought like, yeah, like it doesn't run for like 60 bucks.  And he gave me these.  He gave him these extra two, which he already had.  And the clings.  You want to buy it?  Okay.  The Hadn't Feel Tribune.  Oh, it was an Anthony Massey sent to go.  And he did that lost river driving thing.  He made an actual newspaper.  And I have a copy of it.  I feel unhappy.  Let me know.  I thought he didn't send you one.  Maybe he did.  But when he sent us framed ones.  Yeah, you probably did Pat. You're right. Wouldn't he send us the games the board games? Yeah  Well, yeah, we've talked about Spike Lee. This is one of the only few movies. I really enjoy that he did and he was actually cool dude to meet so  Yeah, and there's really sure looks like it's actually part of it. Yeah, it does right?  Jersey that movie with Edward Norton  I've never seen it  You know, it's about his time before he has to go to prison for a long time. Yeah, it's  So it's probably not the movie you can watch over and over again, but it's one of Spike Lee's better films  I think so  Interesting. Yeah, we keep on going up and there's all my sign to figure so  Yeah, oh, I said to the picture on the side of with Marty Kova. We talked about the  What's the last house on the left we talked about that for a bit? Mm-hmm. So  Look at all these bad-ish keychains, Pat.  The most old sold, is that like a custom made?  That's the name because they're cool as hell.  I like them.  Yeah, I didn't really have the great signal.  I was getting a message to you, but that person I got their business card.  So all those, that wasn't even 50 bucks.  Yeah, those are pretty cool. I like them.  So I've got their business card, Pat.  Cool.  And there's my parents' laser discs, of course.  Brenda Fraser beautiful signature. I know you're not a big signature guy, but  He sounds pretty damn nice. No, it is it's definitely cool  My my parents loved that movie up top. That's a kind of a  That's a sad movie in a way, but that's a very good movie. Not a lot of people talk about that movie. No, I remember the movie  But I don't think I've ever seen it a lot of people probably remember the Madonna song from the movie too  So and yeah, we added Paul Reiser to their Beverly Hills Copies and discover so  Oh, that's the US.  Oh, that's the scars.  Oh, there he is.  There you go.  He didn't bite me.  Hey, man, he's holding up well, though.  God bless him.  I got to tell you, Pat, this is what drives me crazy.  He had like 30 pictures on his table, right?  Only one from Rambo for his blood part two.  Only one.  And I'm like, God, only one from Rambo.  Because he was such a sleaze bag.  just sleaze bag. Remember how he left them there in a helicopter? Yeah. Oh, man. Nice guy though.  Very sweet guy. It's cool to be there. Oh, I said to that because he put this is not my  locker and said, this is not my office. That's right. Yeah, he's holding. But that's fine.  And it's a good story to talk about though. So he was pretty expensive for an autograph.  I mean, I'm gonna get that.  I did not get that, but it looks really nice.  That's, this is a terrifying flannel hoodie,  but no flannel hoodie that's that spirit stores looks awesome.  And this here, you sent me too.  Is this you walking into spirit?  Oh, then Burlington's right next door.  That's right.  That's, yeah, because I'm like, oh, look at this.  There's a Burlington.  And then there's, did you get anything in Burlington?  That picture.  the picture you're looking for. Oh, okay. Oh, you got the picture. I can't find that  fucking thing anywhere. It's some of a bitch. Oh, there's our buddies. So I bought Pat  one of those wobblers. They're at Menard stores in our neck of the woods. They're hard plastic.  That's funny. I'm surprised the dogs weren't going after them. Oh, they were locked up.  Cool stuff. Yeah. A lot of good stuff. Yeah, I think Pat for showing all that, but  see what's everybody saying here actually Kevin Smith's red state was also  bordering on horror the blab re makey as I mean yeah body my lihara scenes I  agree there og house with wax dr. Jacob is how I can be considered body horror  oh definitely especially actually both of them oh yeah because it gets I  don't know why it's so long such a good movie what Madonna song is in that I'll  remember. I'll remember, I'll remember you. One of these I forget what it is. And I can just  don't remember. He had one column from last time select just one black white photo. Did they  do they do look like penis character? Yeah, they do. Like we talk about that with the inflatables.  The inflatables too. Yeah. Now he didn't take a buy-out when he said it. He's like, no, he didn't bite  me. He did. He didn't bite me. He gave me a free picture. So he's trying to get back at a good  graces. Why are you guys are while you chat away? Let me go and get this  stuff right away. I should have brought it over here. Hold on one second.  As I hit the microphone hold on. Yeah, I got to start selling some stuff.  So yeah, Marty, cool real nice guy. There are some real good people there.  Like I really I have a you know, Kate Gillin from the Guardians of the Galaxy  Chris Nelson did her makeup. She was there and I have the picture of Chris Nelson doing her makeup.  And I totally forgot she was going to be there otherwise I would have brought that picture and  I would have been cool to talk to her about Chris Nelson too. But, well, Rob Schneider was there  like we're talking about. Who's the girl from the last Ghostbusters movie, The Young Girl? She's  She was there.  She had a ton of people there.  Jennifer Beals was there.  So everybody going flash dance crazy for her after life here.  There's some McKenna Grace's there name.  McKenna Grace, she was pretty busy.  You had the Reno 911 stars there.  Those two main characters.  They were walking around their uniforms.  Oh, God.  Michael Rooker, the whole National Impounds vacation, the original Griswold family.  all four of them were there in Randy Quaid. Chevy, Chevy canceled last year so they brought  he came back to make up for his cancellation last year so they seemed to have all done pretty well.  The big one there was John Cena, Holy cow. They must have made a ton of money at that  show for John Cena. Well, I just I wore on Tuesday, right? The button down. Yeah, I'm gonna have  I have to find that bad boy.  You can't find it.  Let me know.  I'll look.  Got that.  This was at the five below.  Sketchbook.  Yeah.  And it's got a cool back to it.  Yeah.  Yeah.  This is cool.  I picked up a sketchbook.  I picked the other little mini bastard from spirit.  The baby.  The puppy.  Let's see.  And did you see these all at five  below to I haven't been to a five below recently so I haven't done a key chain  there along with the sketchbook they have the key chain H2 magnet they had  this there and another H2 lanyard as well I think I can't keep track of them  Your cheap is hell. I love that. I can buy below. It's it's five in below. So I think it's playing. That was nice. That's cheap stuff.  There he is.  God that music is ridiculous isn't it? It is. And while I was here, these came out last year  the two myos figures. They have different packaging now. And me being a geek, had a buy, I guess they have different packaging.  So you knew they're different packaging or did you just determine that I didn't know until I looked at him  I looked at him. I'm just to see if there was anything different and they're different packaging  And of course  Maggie met my  display  Yeah  Hold on here. I've just read and  Met go back in April and Pittsburgh and he made a video for my steps on for free Wow  Wow, love Maggie loves him.  She brought him cigar as a present.  He loved it.  That's cool.  Yeah, because he's always got a cigar with them, Colin.  We're having a home and drank.  We're gonna drop Schneider back in like 2011.  It was really.  I'm trying to think, Lane.  I was at when he first started going around doing  his stand up because that might have been the time  we saw him before our kids were born.  So they were always looking forward to the keyboard.  The keyboard?  Oh, so I think I've told you like my parents will live too far from a very heavy Indian reservation and they have like a big casino there and they always have big acts there. That's where I saw Huey loose in a news like 15 years ago.  But Rob Schneider was there at the police and I went to go see him and like we met him afterwards and really he's like, oh, you're from Chicago huh? It's like, yeah, it's like what are you doing up here? It's like, oh, my parents are retired. We'll be like, we'll tell you parents are said hi.  So random. It was cool.  Yeah, I went and so do we see years ago down my rarer that can meet you. Have you ever done my rarer?  Remember to see him and he hung out at the bar with us afterwards. He was funny as hell.  No kidding. Okay.  You got more stuff, Pat, where you just search it away.  Actually, you know, stuff I did forget to get out of the closet, but this is this is the big thing.  So I'm going to have to move the mic so I don't hit it.  Oh shit.  Oh, I called itchy. Itchy.  Pat, Newseer's itch.  Yes, one of those itchy and scratchy freaking doormats and  Shatter of Burlington. $7.00. Fucking cheap is hell.  That's why I got to all of them.  And I thought, I was, what do they?  Oh, I got this shirt at Walmart.  I don't buy the hoodie. You and I are going to work on shipping.  No, I could find the hoodie in my size.  So I'm not going to buy it anyway.  What the fuck else? I thought about something.  Oh, did Mike send stuff yet for the next tasting or something?  He was talking about, you know, he said,  I told him one night this week, we'll package everything up and shoot it out.  So maybe I should send you your stuff at the same time, you think?  Or maybe leave it at weekend?  Do you want anything leaving at weekend?  No, I'm unless I'm no, I'm probably not going back up North. I hope I don't know if anybody watching up North  I hope or not  I  Got too much going on. Are you drinking whiskey?  No, I was drinking this white wine. I got so much wine dude  We got I  Haven't had anything to drink since I took my mom out the dinner or no  Yeah, I didn't drink with you with the cigar the other night. It was when I took my mom out the dinner  I was like, I didn't even have a beer at the crowd.  I didn't even have a beer at the crowd.  I had two beers with Mike and the man came before I came over and then weighed too much  last night because like I said, we played this fan bank and they gave us a bunch of leftover  clams and shrimp.  So I called Mike on Mike what he doing.  He's like, I got steamers and I got bags of shrimp come over.  So we picked that last night and then kept breaking.  What a funny guy.  Did he go, did he have to go help with the move?  didn't he? I thought he did. No, because we got everything done here. And the wife felt bad.  She's, I don't make it dry for now. So he's got them care. So we managed to get everything done.  So I don't have to have to,  so he was able to stay home and have some shenanigans with me instead.  The shenanigans. So your mom, you're so Cathy just went then, right?  Yeah, she just went. She went and her roommates parents went. And then my wife stayed  you know, and the apartment with my daughter and who makes parents stayed in a hotel.  So they got everything set up and Kathy already on. Yeah, she got home like it's literally 20 minutes  before we started the stream. That's why I was a couple minutes late myself. She's tired of self  she was up late last night. She was up early dealing with my daughter arguing with the water as  usual. Oh, God, that's why I didn't that's why I didn't come back down after setting it up. I  I had to deal with that with the two upstairs.  Yeah, it never stops.  We started wrong before I get hit.  Yeah, never stops.  So yeah, that was my, so I had the nice plot.  Well, quite morning, the puppies have  looked me up super early to let them out.  Then went back to sleep.  So it was nice, waxing day.  Very nice.  It was a beautiful day where I get nothing in college.  And I can just relax.  Yeah, so that's everything tonight, man.  May we get the hell out of here.  I'm probably the ghost.  if the wife probably sleep and she's asleep,  I'm probably gonna go,  Mike's in the man cave,  we'll go hang on the man cave,  if not maybe I'm gonna be out in the garage.  Maybe I'll catch up on Davey Death,  right who's doing a stream right now.  Let's see what they're doing.  I will let you know in the off chance,  if I can do that here, but.  Yeah.  Do we have a certain time?  Oh yeah, so let's talk about that.  So next Saturday night.  It's a short night.  So why is that short?  I'm sure.  We're gonna do a watch along with Teen Wolf,  celebrate in 50 years of Teen Wolf.  Bill you're not working tomorrow? I'll hit you up.  Let a, what's a good time for you next Saturday? You got the young kid. So I'm good. My kids are out of the house.  Okay.  My son's gone. It's just me and the wife. The puppies again.  Our game is at 9 a.m. I am available at night. Anytime. I think we should start it right. That's  7 p.m. central. What do you think?  You want to do 7?  you're going to be eight p.m. central nine your time. Yeah, let's do a p.m. central nine.  Bill, do you have a problem?  Yeah, is that work for you, Bill?  Eight central nine Eastern Fermi. A Michael, what's up?  Dang, I never remember your stream. So, don't set the hit the little notification bell.  It'll say, hey, it's good. It's already there. No, you come on.  It's okay. We're getting it done in under two hours, which is  Yeah, I'm gonna go get done and maybe hit a bill I will we'll cigar  Catch up on David. Davey's stream. Oh, no go to our favorite game show. David. That's right  The David death ratio the game show  He goes well who's on it is it the David that star guy  I said that the guy that liked weapons and didn't like weapons.  My hang out on Mike is a cracks me up sometimes.  Like I have music on, but every time I'm outside,  especially on a Saturday Sunday,  there's always music last night.  I always put the serious through my speakers outside the house.  And they'd be like, oh yeah, I know the song.  It'll be like, sweet, chocolate money.  He's like, is this like Motley crew?  And he's just like dead serious.  Or he just comes up with a, I'm like, what?  I'm like, what'd you live in a bottle?  What are you, boy, in the barn?  Oh, it's funny shit.  I thought he was kind of tires, he might have fell asleep.  I told, I said, if he's in the man cave, I see the man cave open and the TV's are  not stopped, but I feel like I'll be in the garage, so I'll probably hitch up, though.  Yeah, let's see if I can escape everybody and come out there.  Colin, of course, my brain is fried.  We talked about having you on again for a watch-on, for a fresh memory.  Why are we going to have Colin on for?  the  carl and refresh our memory one  yeah our memory  one  down  red doesn't remember either we were we were talking about having on for  moving I'm trying to remember what it was because I want to get it down on here  and we can plan it so before we sign off let me know yeah  yeah two is going to be a lot of fun make sure we come back make sure you hit the  like button for tonight if you haven't subscribed hit that subscribe button  We hit just hit 2,000 20, some members would be,  love to hit 3,000 by the end of the year.  I don't see it happen at the rate.  It would be nice though.  Well, we can try to make that happen.  Why not?  It'd be nice.  Yeah, maybe.  You know, I'll do another contest.  I did the contest years ago.  I'm gonna do another contest where I give something away.  I'll have to figure it out.  A Halloween prize package?  Yeah.  Maybe combine a whole bunch of stuff and just say, hey.  Yeah, well, team of's gonna be a lot of fun.  I haven't watched team of them so long.  It's gonna be fun.  You haven't watched it in so long.  Jesus.  Yeah.  Regular viewing.  I've even shown that movie to my kids.  That's right.  We were gonna have them on for George and I completely forgot.  We watched George and he's like,  oh yeah, we're gonna be nice if I was on it.  I'm like, fuck, I forgot about that guy.  But then I straight back when you went for something that  didn't I see want to come on first another movie?  I thought there was.  Well, why don't we make it a, why don't we watch full cheese zombie or something?  Maybe we can do because I know he's a big fan of that.  Yeah, we can do that.  We can do that.  We want to do a Tuesday night watch along with zombie.  And next, like within the next month.  Yeah, let me know.  We'll talk afterwards and hit me up and let me know how to how to tonight's workout with  the new job you're starting because if it doesn't work out, we can do it a different  night.  Speaking of that Pat, that's a good point.  I might be assistant coaching for softball here.  I'm gonna know on this upcoming Tuesday.  So if I have watched, we do watch along  and I probably wouldn't make it back until like 7.30,  but Wednesday's I'm open and Monday's I'm open.  So and Thursday, so I'm just saying  if it's gonna make it easier to possibly change it one day.  Well, let's just, let me just see what's gonna happen  on Tuesday.  If you move the two, choose that if you move the Wednesday nights, that works.  I'm okay on Wednesday nights.  I think we originally did too.  I've seen why we did Sundays and do Sundays are easier to do a podcast.  But I know you helped me out when Taylor was doing softball last fall.  We did stuff on Wednesdays for a little bit.  But yeah, we can move them to.  Yeah, that's fine.  Well, let's yeah.  Okay, good.  Good colony.  So it's maybe a week from Tuesday, week from Tuesday, week from Tuesday, we can do zombie.  And we'll have fell in our.  Yeah, and then next week or this upcoming week, we should make it up with what resurrection and  From return to living dead is that what we're talking about  We're talking about living dead is on Tuesday  We're gonna do teen wolf on Saturday  But we could squeeze resurrection in one night. I'll do that  I think maybe we should try to do this since we did a poll I guess  Guys I made an executive decision when I realized it was the 40th of return of living dead, but um  I know I said something to Pat the other night. I'm like, hey, I just realized that this is turning 40 and it wasn't on the list like it told you, Pat, because I think we've done, I think we've actually done two. We did one with Michael and then we did one with just us.  Yeah.  Anyways.  Yeah, and this will be a moment we won't have it as a watch long again for quite some time because they're only going to do it again because it's very significant milestone that it turns 40.  Yeah, so we definitely will hit you up and we'll set it all up now.  Yeah, but I'm fine.  Have you had been there on an awhile because they see it?  the  this week here. No, it's not too bad because I'm in Newark. So it's only so I can sleep till  five thirty. So tonight, probably the next couple days, it's not going to be bad.  Oh, that's not bad then. Okay. Okay. I'm starting the project in Princeton probably towards  the end of the week. If not, beginning of the next week, that'll be back to getting a bit  sucking for 20. Yeah. Blake, what's up? It's probably in the say hi, Brett. I were watching  a Sulta devil's island right now. Who know who is the star of that? Oh, it's Hawco going to  car weather's baby. I remember an Hogan film that like good stuff. I hope you do.  I have to say I was watching the thing you did the other day you and Ronnie were you  did talking about the Crystal Lakes photos and you did a little parody about Frank.  Dude I was driving home and I was fucking lay off my balls off. Did you watch that yet?  No, no.  Oh, and Frank then right after Frank went live. I'm sliding on my way home from work  And I'm like did you see the eggnet the ATGN 80 guys? He's like yes, and I will be contacted my lawyer friend for  I was fucking laughing go check it out is hysterical. I ever watched their last couple so I will check that out  I just don't hope you never mustache Blake in that yeah, okay  Hey James without happy for it and that the first read to his favorite zombie film to return to live.  He did make sure you hear we're just about to sign off make sure you're here on Tuesday night  That's what we're watching along  We're gonna be doing it James  But yeah, so let's get out of here. We're under two hours again. We're getting good at this and yeah  I'm gonna go hang out if you can hang out if not no worries everybody  Thanks for coming in tonight. Thanks for everybody hanging out in the chat. Sorry  There's no some more zombie movies. We may or may not have missed  Roman the comments after the fact at the like button to subscribe button. Well, that's a happy horseshit and make sure you come back to tonight  And we will be doing watch longer for turning living dead next Saturday night with build the ever skays right here  We'll be doing celebrate 40 years of Teen Wolf with a watch long outside tonight. Yeah, monster maybe I didn't make it down here  I wanted to go front and night James  But I kind of got a little bit of shit from the wife because  So I mean the laugh that you've had the chat about that  Yeah, I was all set to go, but she was giving me shit because I wasn't gonna be there to help really help my daughter move  So I need to get home get shit done and help pack up on Saturday long story, but yeah  Unfortunately, I did not make it I was no one you didn't make that right  Yeah, take care of the Anna. All right, everybody  We can we'll see everybody on Tuesday night and  Let me get everything set up here. There it is. All right, but I'll see you I'll talk to you in a second and everybody else  Have a great week see you Tuesday  Thank you."
}