{
  "podcast": "You Are Not So Smart",
  "episode_id": 41351850699,
  "episode_title": "320 - Misguided - Matthew Facciani",
  "audio_url": "https://stitcher.simplecastaudio.com/aa9f2648-25e9-472a-af42-4e5017da38cf/episodes/0402e258-4e75-4e97-a8c6-608c3ee0f2da/audio/128/default.mp3?aid=rss_feed&awCollectionId=aa9f2648-25e9-472a-af42-4e5017da38cf&awEpisodeId=0402e258-4e75-4e97-a8c6-608c3ee0f2da&feed=N5eKDxJI",
  "duration_seconds": 4135.863,
  "created_at": 1755547790,
  "podcast_author": "You Are Not So Smart Team",
  "podcast_description": "You Are Not So Smart shares insights, stories, and expert conversations for curious listeners.",
  "text": " You can go to kittedkit.com and use the code smart50, SMART50 at checkout, and you will get half off a set of thinking superpowers in a box.  If you want to know more about what I'm talking about, check it out, middle of the show.  Welcome to the You Are Not So Smart podcast.  Episode 320.  The classic example is someone who is very convinced they are unbiased, but that thought  process of really stridently thinking you're unbiased.  Ironically, it makes you more biased because you're not open to the idea that you could be  wrong, so you're just following this very narrow track in your mind that allows you to believe  various falsehoods even though you think you're not.  That was the voice of Matthew Fachiani, who is a doctor of sociology, a sociologist, and  interdisciplinary social scientists, which means he researches neuroscience, psychology,  and sociology, and then pushes them all together to help make sense of the world. His focus these  days, his specialty, is media literacy, which means he studies misinformation and polarization,  and how nefarious actors manipulate all of us on purpose to get us to think, feel, and do things  things they would like us to think, feel, and do. He studies all of that and then comes  up with ways to better combat all of that and teaches it to people in the form of media  literacy. He has a podcast called Ms. Guided and he just released a new book titled Ms. Guided,  which is all about misinformation, where it starts, how it spreads and what to do about it.  That title is important here.  Miss Guided.  Because as Fachiaity explains, the research is clear.  The evidence is overwhelming that people who fall for fake news, people who share misinformation,  who believe it, people who just believe things that do other people seem clearly false.  These people are not stupid.  They're not crazy.  For the most part, they have been miss-guided.  And as Fuchiani's research reveals and his book explains, there are a lot of nefarious  actors out there.  Organizations and individuals, political institutions, corporate entities, and so on, that count  on this.  They understand how people actually work, and they use that understanding to purposefully  generate miss information.  These nefarious actors, they produce such misinformation a lot.  That way, you get exposed to it repeatedly.  All in an attempt to mis-guide you toward the assumptions, conclusions, and behaviors they  would like you to assume, conclude, and engage in.  We will talk about all of that in just a moment.  We'll get into things like superordinate identities and affect control theory.  What we can do about all of this is the train headed for the cliff or can we actually create  environment where there's a whole lot less misinformation or just inoculate ourselves  against it?  All of these things are coming up soon.  But first, I wanted to take a second to define just what is misinformation, scientifically  speaking.  According to the American Psychological Association, misinformation is quite simply.  false or inaccurate information.  While this information is false information which is deliberately intended to mislead.  As Fauciani explains in his book, Ms. Guided, misinformation includes both intentionally  and unintentionally false information.  It's put out their own purpose or it just so happens to be not true.  So if you have a belief based on such inaccurate information, that would be considered a misperception.  And as he puts it, if someone were to say, believe that walking backward cures the common  cold, that would be a misperception.  That's a belief that is not supported by the evidence.  That's someone who, for some reason, is misinformed.  Which is not the same as being uninformed.  An uninformed person wouldn't have any beliefs about how to cure the common cold at all.  They're just absent of beliefs in this regard.  In this framework, misinformation is therefore a big umbrella term under which there are  many kinds of misinformation.  So for instance, disinformation in this framework would be intentionally false or misleading  information.  That means the person or people who spread disinformation want the people who are exposed  to the misinformation they spread to believe it.  And they want them to believe it because they have some goal in mind toward which the belief  in things the spreaders know are false serves some purpose.  Propaganda in this framework is a form of disinformation.  Probably, propaganda is used to change attitudes via changing beliefs via misinformation.  So if you want to shift public opinion from negative to positive or positive to negative,  you can do so by identifying an area in which people may be uninformed.  Then you can mis-inform them and then once they are misinformed, they will on their own  generate positive or negative emotional reactions to the issue for which their false beliefs  now provide them with an inaccurate model about some concept or event or institution or person  or political party or so on. For instance, someone who does not live in a major metropolitan  area who has never visited one, they might be uninformed about the rate of crime in major cities.  The truth might be that crime rates have been going down for a long time and are currently  at a 50 year low, but they don't know that.  So an nefarious actor might spread disinformation about high crime rates in major cities for  the sake of misinforming the uninformed.  And now the misinformed will generate negative attitudes about the safety and overall  health of cities they've never visited in person.  You can then manipulate people's deeper beliefs, attitudes and behaviors by suggesting actions,  laws, and blame that those attitudes will now support.  And that's not just some hypothetical, this is how it work.  This has been done a lot.  There is a long history of propaganda throughout all of civilization, especially during  sort of the radio into television era where it became much easier to spread that sort of  thing and get a lot more bang for your book.  Propaganda.  It's a thing that happens.  Still happens right now.  It's happening today.  It's happening wherever there is a device where you can look at things that tell you  how things might be working around you.  It's a real thing.  There's a wide array of this sort of stuff.  There's another kind of misinformation that's rarely mentioned in the literature they call  it mid-information.  And that's when no one really knows exactly what the truth is yet, either concerning a science  fact or historical incident or some sort of evolving situation.  As Fauciani points out, this was the case during the Middle Ages before the development  of germ theory.  Back then most medical experts believed my asthma or bad air was the true cause of the  bubonic plague.  What they didn't know was that it was actually being spread through direct contact with  individuals.  So in this case, it wasn't what they didn't know that got them in trouble so much as  what they thought they knew for sure because they took actions to avoid bad air all the  time, but they did not take measures to avoid direct contact.  So this has been with us forever.  Misinformation in some form or another is part of the human experience.  It's been part of our information exchange for a long, long time.  It's just now the information economy is much more complex and misinformation, disinformation,  propaganda, and so on.  It's much easier to spread and share at scale.  And if that bothers you, you are not alone.  A recent Pew Research Center poll found that 70% of people pulled across 19 countries said  the spread of false information online is a quote major threat.  When polling people just inside the United States, 84% of people said they believed this  This information was a, quote, very big problem today.  But here's the thing, the fallout and impact of misinformation, it's not inevitable.  We actually understand scientifically how all this works and we understand it quite well.  We've been researching this for a long while and we know how to fight against it.  And that's what we're going to talk about in this episode.  As we're going to discuss with sociologist Matthew Fachiani right after this commercial break.  The School of Thought.  I love this place.  I've been a fan of the School of Thought for years.  It's a non-profit organization.  They provide free, creative commons, critical thinking resources to more than 30 million  people worldwide and their mission is to help popularize critical thinking, reason, media  literacy, scientific literacy and a desire to understand things deeply via intellectual  humility. So you can see why I would totally be into something like this. The  founders of the school of thought have just launched something new called  Kitted Thinking Tools, KIT, TD, thinking tools. And the way this works is you  go to the website. You pick out the kit that you want. And there's tons of them.  And the school of thought walls send you a kit of very nice beautifully  designed, well curated, high quality. Each one about double the size of a  playing card matte, cello, 400 DSM stock prompt cards,  and a nice, magnetically latching box  that you can use to facilitate workshops.  Level up brainstorming and creative thinking sessions,  optimize user and customer experience and design,  elevate strategic planning and decision making,  mitigate risks and liabilities, and much, much more.  And each kit can, if you want to use it this way,  interact with this crazy cool app.  Each card has a corresponding digital version with examples and templates and videos and step-by-step  instructions and more.  You even get PowerPoint and keynote templates.  There's so many ways you could use this.  Here's some ideas.  If you're a venture capital investor, you could get the investor's critical thinking kit  and use it to stress test and evaluate different startups for Series A funding.  If you're a user-experienced designer, you can get the user design kit to put together  a workshop with internal stakeholders for a software product.  Or if you're an HR professional, you could mix and match these kits to create a complete  professional development learning program tailored specifically for your team over the  course of the next two years.  So if you're the kind of person who is fascinated with critical thinking and motivated  reasoning and intellectual humility and biases, fallacies and heuristics, you know, those  sort of person who listens to podcasts like you are not so smart, you're probably the  kind of person who would love these decks.  If you're curious, you can get a special 50% off offer.  That's right.  Half off offer right here, you can get half off of one of these kits by heading to kitted.shopkit.edu.shop  and using the code smart50 at checkout.  That's smart50 at checkout.  5% of the profits will go back to the school of thought.  So you're supporting a good cause that distributes free critical thinking tools all over  the world on top of receiving a set of thinking superpowers in a box.  Check all of this out at kitted dot shop or just click the link in the show notes.  And now we will turn to our program.  My name is David McRaney.  This is the You Are Not So Smart Podcast.  our guest in this episode is sociologist Matthew Fauciani. And who is that? Matthew will tell  you.  So I am a social scientist who studies why people believe the things that they do. I've  been working at the University of Notre Dame for the last few years and their computer science  department where we've been studying how to teach media and digital literacy in a way that's  scalable and engaging.  wrote a book about all this and I think the title is important. Miss Guided is a good term that I will  use and I will cite you and I use it because what I often see in discourse about all this is to assume  that if people are behaving in ways that you disagree with or they believe things you disagree with  that they're stupid or that they are rues,  or that they have been tricked  because they're stupid in rues.  And the framing of they've been misguided  is the different frame when you get them  into the scalpel first, like this.  So let me ask that as a question.  Are people who fall through misinformation  Matt, the expert on this topic?  Are people who fall for misinformation stupid?  No, to give a yes, no answer.  I would say no.  Because there's so many intelligent people  that fall for misinformation,  it kind of goes against that idea.  And my whole point is that we're all vulnerable  to this process because we're social creatures  remotivated by these social motivations  to belong in our groups and to have community.  And I start out the book and often use this example  outside my book, but the idea of like flat earthers  and how there was this really great documentary  behind the curve that came out a few years ago.  They're really dives into this very beautifully.  They talk about the community and the social aspects  of people who believe the earth is flat.  And how those use conferences and friendships  that develop and this community around that.  And I think that's so critical  understand the community component  because it provides with so much self esteem  and makes us feel supported within ourselves.  So I think when we think about like  why someone might believe something false,  even something as extreme as the earth being flat,  that belief by itself may not have a big impact  or any impact on their day-to-day life.  So whether the earth is hexagon or square or spherical,  it's really not changing the day-to-day life,  But what definitely impacts the day to day life  is if they lose all their friends  and people they care about in their community.  So from that perspective, it's actually pretty rational  to uphold this belief and say,  I'm gonna continue believing what my friends  and close connections believe  because I wanna maintain that community.  And these people care about me, I care about them.  And this belief is part of a larger set of beliefs  that kind of holds us together  and we can connect with each other.  So, to me, it is very rational from a psychological perspective to maintain a variety of beliefs,  some of which may be false. And that speaks to my larger point about the book, misguided.  Ms. Guided is something that happens to all of us. It's a process of being guided by social forces  that provide us with self-esteem and meaning and reductions of uncertainty.  So we have this strong motivation to protect our identities and our groups that provide us with this meaning and self-esteem.  So a lot of times, like we're very positive, we're guided towards being a good parent because we care about our children.  Like that's an identity process.  Or, you know, we want to do well on our sports team because we care about the sports team that we belong to.  But when we belong to a political team, for example, sometimes that support of that political  identity and that support of the political team might mean rejecting certain facts that  make the political team look bad.  And that's where we run into these issues with people having this motivation to protect  that identity so strongly that they will reject information and believe falsehoods sometimes.  So that's kind of like the larger issue of identities.  And then it gets more complicated as you dive into the context  to which these identity forces are most impactful.  If we're going to know the second,  but I just love how surprising this can seem  to be uninitiated because you're doing it all day every day.  And we've been doing it all day every day  for the entirety of human civilization.  Right.  Yeah.  And yet this can still seem quite surprising.  Yeah, I felt similar, I mean, you know,  I study this stuff every day.  So like, I know other people who don't,  maybe don't think about it as much  and it could be a lot more novel.  But I think it's even broader and deeper than that  because whenever you're learning about these social biases  that, okay, we have this motivation  to protect important identities.  And we have this motivation to protect identities  and meanings that bond us with our communities.  What the broader message is that we're actually  motivated by these forces that we're not always  aware of or thinking about.  And human beings like to believe that we're  very rational and logical and we're making decisions  completely by logic and reason.  And we're just in control driving how we believe things  and how we come to different conclusions.  But the reality is much more complex  and that we have a lot less control than we might think.  And we might be very biased by our environments  and the social and psychological forces behind that.  So I think some of that requires awareness  and this broader intellectual humility that yes,  we can be biased and yes, there are forces  that we might not even know about.  and appreciating that makes us less biased.  So it's kind of interesting whenever someone is trying to say,  like, no, I know.  The classic example is someone who is very convinced  they are unbiased.  But that thought process of really  stridently thinking you're unbiased, ironically,  makes you more biased because you're not open to the idea  that you could be wrong.  So you're just following this very narrow track in your mind  that allows you to believe various falsehoods,  even though you think you're not.  What comes up a lot in these discussions,  I find is the information deficit models,  what comes up because it just seems like,  if you just saw the things I saw,  if you just been exposed,  especially in academia,  if you just exposed the information that I've been exposed to  and just acknowledge that I am an expert on this topic.  And so therefore, take a look at this information  that I have provided for you.  Then you'll look at that and go,  oh, okay, I was wrong about that.  And it seems to me there's an element of,  this group is trusting one source of information,  this group is trusting a different source of information.  As a question, what would you suppose  is the difference between a person who believes  here at this round, a person who believes there's flat,  when it comes to who they're trusting?  But yeah, I mean, what's altering that  different trust basis?  Trust is such a critical component.  And it's also another very social type of thing here,  because it's comprised of how you feel about the person  and how competent you are, you think they are.  So it's interesting to think about trust  in the form of experts, because so much of how we determine  if someone's trustworthy or not,  is not just a very technical aspect of how competent they  are at certain problem solving.  It's not like we're just viewing all their test scores  something and saying, okay, this person's competent or not. A huge chunk of trust is warmth.  Is how do you believe that this person has your best interests in mind? And that component  is a huge predictor of whether or not we trust someone. So if you don't know any scientist  personally or any physicians personally, then you might have less interaction with them.  And it might be more easy to believe that they're not having your best interests in  mind and they might be corrupted somehow.  So as far as the flatter thing, it's like, okay, imagine you have this contrarian free  thinker influencer that you like to follow who is always in your phone and your hand every  talking to you directly, sometimes responding to your comments.  And you have this connection with them.  It might be a pair of social connection, but it's still a social connection with this person.  And you believe that they have your best interests in mind.  They're constantly affirming identities and questions that you have.  So you trust them.  And they might think that they're earth is flat,  or they're presenting that view to you.  And maybe they're showing some of their work in a technical looking way.  And you trust that because of the social connection you have with them.  And you can compare that to this faceless abstract scientific institution that releases a statement  on their website and says, you know, the earth is round.  Well like from a psychological perspective, which one of those pieces of information are  more likely to trust?  The person that you have this ongoing social contract with or this faceless abstract  non-human entity of just this big science group that you're supposed to distrust.  I think that really speaks to how we form trust and then what that looks like in practice  and how a lot of these institutions have been super slow to adapt to the current media landscape  and have been so cautious to have dialogue with people that now we're seeing the negative  effects of that, where we need people like going on podcasts and having dialogue with people on  social media from these institutions, whether it's academic institutions or medical institutions,  science institutions, because people want to see that level of social reality, that social  relationship. And if you don't have that, then you're already being reduced so much in the components  that determine if you're trustworthy.  And it creates a vacuum for someone else to come and be like, hey, that person's not  even talking to you.  Or when they do talk to you, it's a very patronizing, like, top-down type of process.  So instead, trust me.  And I will talk to you and I'll give you access and, you know, answer all your questions  directly.  So you were seeing that asymmetry between these institutions that didn't value science  outreach enough and all of these influencers who are all about outreach and connecting with  their communities, how the asymmetry and trust conform from that perspective.  You talk about this in the book.  There's a question of how much of this has always been the case and how much of this is new,  especially when it comes to the polarization.  And you go from the Zomaniac and the street,  you're like crazy things in your small village.  And you know that person and everybody knows who that is.  And then you switch us to every maniac that has access to the internet's yelling and  and alters like the signal to noise ratio and what goes the top. And then you've got  newspapers that radio at the television, the internet. Every single one of those changes the  information economy and the attention economy and the and then what gets incentivized. And what  everybody's consciously or unconsciously A, B testing all of that and going with what works,  especially if you make a living off of it.  Cable news started having, you know,  punditry that was just angry is that,  it's like, in my perspective,  it's like accuracy was never what was connected  to the person who was that they were angry  at the same things you were angry about.  Exactly.  And that's the issue that's at stake.  That's what's actually the motivation.  Even when you're arguing with your family member,  like what you want them to do is come over to your size  to what's no longer in us versus them situation.  And the actual topic is almost irrelevant.  And you just want to want you on my side.  Right.  So that you're motivated by the same things  I'm motivated by and you're angry at the same things.  I'm angry about it.  And the landscape just adapted to it.  So that's what you do upfront is portray your anger  and portray your us versus thinness and everything sorts.  that seems new or at least how quickly the economy can adapt to that is faster  than now. I think I'm on the right track there, right?  Yeah, absolutely. I think the psychological biases that we've been talking about  have been around since humans have been around. But what is different now is the speed and  the scalability of enacting those biases. I mean, social media makes it instant,  whereas before you'd have to have a group of people actually meet them in person and have conversations,  And then it gets really messy.  And I think that's kind of another interesting distinction  of before whenever you would try to bring up politics  or something.  Like, if you were embedded in within your local community  and you were like going to community events  and interacting with lots of different people,  there was, you knew you had to have future encounters  with these people.  So you had to treat them with respect and, you know,  mutual respect and understand that they're full humans  with their complex ideas just like you.  But with the age of the internet and social media,  you can self-select people who think almost exactly  like you and affirm your identities and your ideologies  and make the world much cleaner.  And these are all the good guys on my side  who agree with me 100%.  And everyone else who's disagreeing with me is on the bad side.  And it just makes it so simple and so quick.  and algorithms amplify that and keep showing you stuff  that you like and you're interact with.  And AI makes that even more personalized.  Like we're just like streamlining these psychological biases  to make them more impactful.  So it's not so much that like social media itself  is creating polarization.  It's just making these existing social psychological biases  much easier to be introduced to us  and then amplified and reinforced as we interact with them.  I think this is one of the things that is most difficult  for like a, especially in a United States culture,  but just Western culture and general.  You wanna think that people are being misled  and they're being tricked.  And the battle is like to fight the agents  who are brainwashing people.  And there's a little less emphasis on a person  actively choosing to engage or disengage with certain sources and information.  The idea that there will be any responsibility involved is a prickly thing to introduce to  the conversation for a lot of people. And who do your thoughts are on that?  Yeah, I mean, it's an interesting, yeah, I think both, this is something that both sides of the  political spectrum will say. It's like the other side is there's brainwashed, there are NPCs or whatever.  And I think that's an interesting idea of itself.  Because what does that say about how you view other people?  Do you view other people as just these easy to lead and mislead people?  But you're not part of that.  So it's very much othering this group of people that it's like you're assuming  they have completely different psychological processes than you do.  And this is not true.  human beings, we all have these social psychological biases. Again, that's like my main  point is like we all have these and we're all vulnerable to it. And it's important to understand  what context and what situations make these biases more impactful. So yeah, I think it's  an easy way to just ascribe a simple explanation to something, especially if we don't like  the outcome. That goes into just world hypothesis stuff and thinking about neat, simple solutions  of, well, you know, my dad, I want to believe my dad is good. And what he's believing is something  I consider not good. So there must be this external thing that's driving that. And instead of  like, under diving into the complex interplay of environment and social influence and how we  all of these biases. I'm just really, really things in a way, but I find that to be...  One of the things that most nature corresponds to is this othering that you're describing.  Because there's just so much research into the world. People will actively avoid certain  types of information. You do that enough. When it was just newspapers or books, there's  one sort of impact there. But as you're describing it, constant from the almost...  If you're especially if you wake up and you begin doom scrolling within  you know, 30 seconds of entering conscious reality again like  like yeah, you're doing a lot of work to stay inside your bubble.  Right.  A lot of people are helping you do that more and more and almost making it as easy as  ordering room service. But it's you know, it's a the effort you have to put in to doing  the thing that you're going to do. They're making it so easy to get from here to there.  Okay, I can talk about that forever and I'll turn a lot of time to talk about that because  I find that particularly fascinating right now.  Identity, that's a word that is in the common parlance, but an actual social scientist,  a cognitive researcher has a much more robust understanding of the term identity.  So let's just start there.  From a scientific perspective, what do we talk about when we talk about identity?  Yeah, great question. So from a social science perspective, how I can go other people have different identity or different definitions of identity.  So that's a whole other conversation of like the nuance there. But broadly speaking from a social psychological perspective.  And identity is defined as a set of meanings that allow us to identify with a role or a social group or a unique characteristic that defines a set of unique person.  So the set of meanings is really how we're thinking about it. So what does that mean? And how do we define those meanings and how we measure them?  people we can try to track how they interact with different things, but really  thinking about identities as meanings and values that we want to adhere to. And  why that matters is because once we know that there is these important  identities and then associated with these important values and meanings, we  then know that people have this motivation to protect those identities by  acting in ways that are consistent with those meanings and values. And when people act in ways that  are consistent with these meanings and values, it provides them a source of self-esteem. So there's  this constant motivation to maintain consistencies between the behaviors that we do, the information  that we process, and the meanings and values associated with those important identities. Because  they provide us with this feedback loop of self-esteem.  So for example, let's say you're a student and you care about being a good student.  That's an important identity for you.  There's roles associated with that identity, such as studying and going to class.  And whenever you're studying and going to class and then you're getting good grades, that  provides you a self-esteem boost because you care about that.  And it allows you to verify that identity in your mind in a way that keeps giving you  this positive feedback loop.  So you want to keep studying, getting good grades, being a good student, and so on and so forth.  So that's the positive aspects of identities.  And not only do we have this feedback loop with self-esteem, identities also allow us to  connect with other people who share characteristics with us so we can form bonds and provide  all the social support and communities. So there's all these positives that go along with identities,  like this constant verification of the meanings and the values of these identities make us feel good.  So we're constantly motivated to do that. But as we've been describing, whenever we have this  motivation to protect those identities and act in ways that are consistent with those meanings,  Sometimes it means rejecting facts and rejecting reality in a way that's adhering to these  falsehoods because what matters more is protecting those identities, protecting that source  of self-esteem and protecting the communities associated with those identities we belong to.  And that's where we see issues of vulnerability to misinformation.  We like to think about identity as something that just is.  that was this is why I either was born with this identity  or I chose it from the panoply of options.  The fact that I was influenced  to consider this identity important to me  is something we'll get prickly about  because it feels like I have no agency involved.  Agency is a keyword there.  And I think that's one of the challenges  with having these types of conversations  is we have to acknowledge that we have less agency  might think. And that's an uncomfortable truth to try to present with people. You know, talk about like a meta discussion of identity.  Yeah.  Because identity is, it feels like it's synonymous with agency, but it's not.  Right.  Yeah, it's a psychological process. Like we're measuring psychological bias in the form of social influence through identities.  And when we have these identities, they do happen, sometimes randomly.  Like college is a good example because you're meeting lots of different people and you're kind of growing up and becoming who you are.  And your identities can be formed by just who you interact with, who you have class with.  Like if you're just walking through campus and this kid comes up to you and is like, hey, you want to join my club and let's say it's a religious club.  and he seems really nice.  And then you become religious, ultimately,  because of that interaction,  or maybe you become non-religious  if it's like an atheist club.  So it's like, you might not even think  that that was a thing that pushed you,  but what do you think of like the preponderance  of your social interactions  were motivated again to be the social creatures  and have social support from people we care about.  And that can be due to who we connect with.  And that can be a very random process  that we don't always like to think about.  Which is in itself.  We could have been born into a culture  that was more okay with that.  Yeah, it's good.  That is so quick.  Yeah, it's just my favorite thing.  And we can have many identities  as you talk about in the book.  You can be a parent and a teacher and a musician and ex-military and American and from Iowa  and a fan of this and you like this and I go to this conference and this convention and  I like this TV show and all these things are multiple aspects.  I do think they can become, depending on the context and depending on the other people  that share it will have more impact on your cognition and behavior because it rises  and the importance of that context that identity is front and center.  Tell me a little bit until everybody in the world would look about the difference between  identity salience and identity prominence.  Yeah, so identity prominence is referring to how personally important the identity is to  you.  identity salience is more about if it's top of mind or not.  So if something is salient, you're thinking about it.  If something is prominent, it's more of a deeper personal association with that identity.  And both of those influence our behavior, because if we're reminded about an identity  we have, so it's more salient, we're also more likely to want to support that identity  and act in ways consistent with that identity.  if it's an important identity, a prominent identity,  we're also motivated to support it.  And these are constantly changing what's top of mind  for us is a constant process of like,  if you remind someone about their identity,  then they may be more likely to think about it  and then have a motivation to protect it.  So one of the studies that I mentioned  that kind of dives into this is this political identity  study where if you have people right about their political identities, they become more biased.  And that's because they're thinking about it more.  And they're like, oh yeah, I'm a conservative or I'm a liberal.  And now that I'm thinking about this, I'm going to respond to even having stronger political  attitudes than the group of people in the study that you don't ask to think about your  political identity.  So it's becoming more salient in their mind.  It's more top of mind.  And it was already important to them for many of that.  So both of those concepts explain how motivated we are to protect these identities when  we're consciously thinking about them or unconsciously thinking about them if it's a deeper  broader personal importance, like with prominence.  You did research into this affect control thing.  People heard a story.  I'm sure a little bit if you could about this, the research you did into the affect control  theory.  Yeah, so alpha-control theory talks more about how we feel towards cultural ideas and how  we think about different components of language.  So you mentioned language.  So you might find this interesting because what we're actually doing is evaluating each word  on three dimensions of meaning, like evaluation, potency, and activity.  evaluation, good bad, potency, strong week, and activity, like really active or more passive  and slow. And there's been a lot of research on showing that these three dimensions of  meaning really break down a lot of concepts just with those three factors.  Yeah, so this is like part of my dissertation work. So it's been a few years since I've  really dove into this. But I remember it being such a cool way to try to quantify how  navigate our social and cultural worlds. Because whenever we experience the world in a way that  contrasts from what we expect, it creates this sense of unreality and this kind of like  a-oh response and we're motivated to try to fix that in some way. So for example, I think this is  an example I provided in my book. One way to study this is through really short statements and  One statement is, I think, like mother hurts child.  So you break down each of those components  even more specifically.  Like mother, we think more positively for as a culture.  So this word in this concept, we think, okay,  mother, good, hurt is a bad thing.  So a bad action, a strong action.  And then child, we think good.  So it creates this cultural inconsistency  and this psychological inconsistency for us  to read that sentence of mother hurts child.  We think, uh oh, like something,  we then are motivated to reframe one part of that sentence.  So maybe the mother, we think, is a bad person.  We say, oh, this is actually like more of a monster,  not a mother.  Or hurt, maybe we're saying, oh, maybe hurt  is just they're disciplining them.  They're not actually hurting them.  So we're trying to reframe this constantly in our mind  to try to make sense of the world.  And I think that's an interesting way to think about how we process identities and biases on a very granular, detailed level.  It's like, even at the level of each word, we're trying to make sense of it.  And we are rejecting these inconsistencies whenever we see them even at a very lower level.  So, uh, to connect to the politics, which is like the easy political identity to fit in here.  If we're a Republican, we're a Democrat, and we read a story about like Democrat Hertz person.  If we're a Democrat, we read that. We're like, oh, well, we're less likely to think that's true.  But if we're a Republican, we read that same sentence, we're more likely to think that's true.  Because the Republicans are evaluating the word Democrat very differently than Democrats are.  So you can really like quantify at a very simple mathematical level how, how much conflict  people are going to perceive these statements based on their own identities.  And that's what I was trying to study in my dissertation is really breaking down these political  attitudes at this like, sennatical level of, okay, Democrats and Republicans are going to evaluate  each other differently. And that also means that they're going to evaluate the likelihood of events,  differently based on how they are evaluating different words.  So like Democrats and Republicans, I think in my dissertation, I did use the example  Democrat Hertz person, Republican Hertz person. So Democrats and Republicans evaluated the words  hurt and person pretty similarly, but they evaluated Democrat and Republican very differently.  And you can do this mathematical equation of seeing how much conflict there is between  the words in that particular sequence.  So a Democrat reading the sentence, Democrat hurts person, creates a lot of conflict or what's  called in the literature deflection because you're saying good word is doing bad thing  And that's this big conflict in your mind,  whereas Republicans, it creates a lot less deflection  and less conflict in their mind  because that is more similar to their expectations  based on their identities.  And so we can kind of like mathematically operationalize  how much psychological conflict  are people experiencing when they read these short sentences.  And then you can expand that to like a broader way  of how they view their worlds where, all right.  So right from the beginning, we're seeing that this person is going to consider this  social situation much more or less likely depending on the identities that they have.  And that likelihood is really what a driving ad is like, how likely do you think this event  is?  And that likelihood is dependent on how you evaluate each component of the social situation.  So again, if you're viewing the actor in this situation good or bad, you're going to view  the subsequent behaviors of that actor differently.  So it's kind of speaking to this broader identity bias, but it's really diving into the  details of like, okay, here are the nuts and bolts of where it starts.  And you can see these like building blocks of identity bias based on how people just  evaluate certain words and certain actors they experience in their environments.  Something you wrote up, I think it was an amazing who had brought this up. I have noticed this,  and it's a strange thing, and I'm wondering if you had any insights into this or just any curiosity  about it. It seems to be in my lifetime, and I could be wrong about this, and maybe this  happen to all throughout history. I just happened to be in a pocket of it what's happening now.  Being in American culture, being a Democrat or being a Republican has become this superordinate  identity. And you can say left versus right, but it seems like this this this becomes salient,  this becomes the thing. And then this mega identity as she was describing it. This feels at least  in my lifetime. It feels stronger than ever, but I'm wondering if you have any insights  as to how did that come about? Why is that now our superordinate identity across all sorts of  context? Yeah, I think there's a variety of reasons for this. One thing has just been how you  could talk of like the macro level of how political discussion from political leaders has changed  has become much more adversarial in just the past few decades. So you can see this like top down  effect of people becoming much more aggressive towards their opponents, considering their opponents  as the enemy more versus just someone they disagree with. And we saw that in the 90s with like  new King Ritchen stuff, where the language used was just very different. And so that's  That's like the macro level.  But then there's also the personal level.  And the environment we are in now  is very different than it used to be.  So we talked about social media.  Social media is just amplifying this existing process.  So we already have these social biases,  these social identities, and these networks that amplify  these identities.  But now you can find your own cable channel  that supports your political identity.  Whereas before there wasn't like a personal cable channel  that it was more of a broad channel that applies to everyone.  So now it can be personalized with one identity of the other,  but not just cable identities like it was in the 90s  and early 2000s.  Now we're seeing social media.  You can have your very personalized social media  information that will support your identity  and tell you the other identity is bad.  So it's this amplification process.  And that's really the major vulnerability  that I see with these identity processes.  It's not so much that we have these identities that bias us.  Like, yes, we should be mindful these identity biases,  where it really becomes a problem is the spaces where it's  reinforced to be the superordinate identity,  like you speak of, or this mega identity.  And what context and situations allow for that to happen?  So any sort of amplification process  is going to make us more vulnerable to these identity  processes.  And that could be surrounding ourselves  with people who think just like us and are constantly reinforcing our identities and our beliefs  and our meanings associated with those identities.  So that again, that could be like a cable news show you watch it and it's constantly affirming  that.  But then it's not just cable news, it's your social networks, it's your social media,  and it's constantly amplifying these existing forces to create such a strong polarization  that connects other identities together.  And that can be because when we are navigating our world,  we wanna associate with people who are like us  and share our characteristics.  And when politics is such a driving force of who we are,  we wanna be around people who think similarly to us.  But this can be an issue when we are so motivated  to be around people that we share characteristics with, that we stop assusting with people  who think differently than us or have different backgrounds.  And this relates to this idea and this research topic that I talk in a book of this, this  social psychological concept of social identity complexity.  And that's a really interesting way to think about identities.  So it's not just that we have this identities that exist in vacuums, but our identities operate  in a context of intersecting with other identities.  And how does that influence us?  So if we have, let's say, our political and religious identity, how much overlap do those  two identities have?  If they have complete overlap, this is an extreme example.  Let's say we have four really important identities in our lives, which is just an extreme  example.  Let's say our political identity, our religious identity, our volunteer identity, and  our friend identity.  So this is who we are.  So let's pretend that our religious and political identity completely overlapped.  All the meanings are 100% agreement.  And we volunteer at our place of worship.  So we are there, we care about the volume of volunteer, it's also connected to this.  And all of our friends are also at this place of worship and also share our political  beliefs.  Then in this example, 100% of how we derive our social self-esteem is based on this very narrow  lens of meanings that are all within this four identities that completely overlap and completely  amplify and increase the prominence of these identities.  So it's not just that these are personally important to us, but they share meanings with  other personally important identities that then enhances the overall importance of those meanings.  So 100% of how we view ourselves is through these few meanings associated with these identities.  So any information that challenges those identities challenges 100% of where we derive our self-esteem from.  So it's a super strong personal attack that makes us motivated to reject it because it feels very  very uncomfortable, very very negative. You could think of the converse of that where we have a  much broader set of identities that do not overlap very much. So we can still have a political and  religious identity. Let's say they're not over-connected all that much. Our church doesn't even  really talk about politics all that much. And let's say we volunteer, but we volunteer at like a  a pet shelter, something completely outside our church.  And we have friends that maybe a few go to our church, but we have a lot of friends who don't  go to our church.  So our friend identity is much broader.  Now our meetings associated with our identities are spread across a wide range of social  support systems.  So whenever we encounter information that challenges our political identity, it's only  a small subset of where we're deriving self-esteem from.  And we're much better able to absorb it  and process it more objectively,  because it's not completely attacking our entire sense of self,  but only a small component of it.  And that's how we're more resilient towards misinformation  if we're experiencing information that is false,  that challenges these identities.  Oh, that's awesome.  I'm gonna make a new slide for my next thing.  I'm gonna present to talk about this.  It would take a long time to get here on your own,  but once you see it, it's like,  ah, yeah.  You kind of have to build it up, yeah.  But once you get it, then you can just see it.  Like I literally try to see,  like what I visualize is you can write it down on a map  and some people have talked about  like how that could help reduce polarization  by actually like visualizing your identities  on a piece of paper.  But like you can see how this all connects  because we have our identities  our identity maps and how much overlap they have spatially. And then you can see the network  effects of all those identities amplifying them. And then if you really get really crazy and granular,  you can think about that affect control theory and how we view social situations based on  our evaluations of specific words and actions and how that is all interacting with each other  and potentially amplifying our susceptibility to misinformation and bias. So it's like  like it gets really complicated,  but that in that complexity,  you can really start to understand  the broad effect of how we're vulnerable  to these social biases and what we can do about it.  Yeah.  And I'm imagining all throughout our history  of different types of ways of being civilized,  villages, communities, empires,  how that alters the way your identities get a chance  to be overlapped just because of the practicality  of the situation and the geographical limitations.  And you don't have a media source,  you don't even have literacy yet.  So it goes like you.  It's my politics and my religion and my friends  and my volunteers, it's all smushed up.  And it makes sense that when you meet,  you suddenly, when this group suddenly meets the Romans,  like, oh wow, there's not a whole lot of overlap here.  Exactly.  Yeah, so it's wild to think about how much we can visualize  these processes happening.  And it makes a lot of sense of how strong and quickly  that othering can be when it's not just,  okay, it's one identity.  It's this confluence of all these identities  that amplify each other.  And that's really where that polarization stems from.  This is basket stuff.  Okay, I do want to get one last thing in.  And sure, which is, and this is a question  to take two hours for you to answer.  So I understand that.  In these discussions, no matter who you're talking to,  if you're talking to somebody who seems like the next person,  the question is, okay, what would we do about this?  Because it seems like we're like with the trains headed  for the cliff.  What options are available according to the research we've done  that seems actually has, can have some positive impact  on all of those?  Is this just an inevitable outcome of what happens with society's get complex or do we have options here?  And I'm wondering what your thoughts are on that.  Yeah, so it is a big question and yeah, we'll take several hours to really dive into it.  But to try to summarize it, what I've been referring to is the particular vulnerability of our  susceptible to misinformation from a social science perspective.  My point is that happens under context where our identity biases are amplified and reinforced.  So in order to reduce that vulnerability, we need to reduce that reinforcement and amplification process.  And that's kind of like a good starting point of like, okay, well, now we actually are defining stuff.  So it's like, okay, so where do these vulnerabilities take place?  One is, you know, social media is an easy one, so you can kind of visualize it.  And I think we have an idea of what that looks like whenever we're in these hyper echo chambers on social media,  it provides a way to amplify and reinforce these identities.  So trying to break out of that is be one way, like trying to not doom scroll and constantly obsess over whatever your particular  particular political ideology is trying to break out of that.  And I think people are aware of this,  like the whole idea of like touchgrass.  Like that's a common thing.  Like people know like, yes, sometimes it's good  to vlog off and meet people in the real world.  And it sounds so simple and obvious, but it's true.  Like literally just getting outside social media,  outside whatever these screens  or how we're receiving these online information,  It's important to take a break and not allow yourself to become radicalized through this  reinforcement process that will take advantage and exploit these identity processes that we've  been describing. So actually like meeting lots of different people, again, it seems so obvious and  simple, but I think it's a really important component to improve our resilience to misinformation.  we need to expand our diversity of identities.  And what that could look like is simply volunteering at different places,  getting a new hobby, meeting different people, joining a sports league.  So again, it seems silly, but there's so much power in literally joining a local sports league  and meeting people from all different backgrounds.  So that's why I really enjoy sports because one, it's like good physical exercise  and good for your mental health, but all those good for your social health.  Like just meeting lots of different people and being active and thinking about how  there's a variety of people out here from different perspectives that you might otherwise not  have a chance to meet. So personally, on an individual level, we can try to expand our identity maps  and do different things, meet different people, and not have our identities so wrapped up in a  narrow set of meetings. So we can individually we can do that. Now the issue is like what does that  look like on a societal level? And we don't always have opportunities to do that. So in the United  States we don't have a lot of what's called third spaces where you know we have our home, we ever work,  but there's not really a lot of good community spaces where we can meet lots of different people.  So that's kind of the tricky part is like how do we fund initiatives for more people to do this?  This requires a whole structural bigger picture thing, but there are opportunities for people  to join sports leagues or volunteer with different things, meet people at their local libraries  and stuff.  There are publicly available things like that.  That's one part.  I think it's diversifying ourselves, diversifying our identities, diversifying our networks.  Then there's the education component, which is what I've been working on for the last  few years.  not only do we have to be aware of our social biases and work on that, but that should  be merged with this idea of becoming as media literate as we can.  Like how do we learn how to navigate our media and information landscape as best we can?  And that speaks to some of the work that I've been doing at Notre Dame, developing these  short media literacy games that teaches people different aspects of verifying the credibility  of sources, for example.  what's called lateral reading often, where instead of looking within an article and trying  to fact check it within the confines of the article, you're going laterally and opening new  tabs and seeing who the author is, what their biases might be, what outlet are they writing  for and what journalistic practices does that particular media out that have.  So like learning those skills is also really important.  And in the age of AI, I think that connects to digital literacy, learning the limitations  of artificial intelligence and these large language models, these chatbots.  So, like, there's that whole education component too.  But the education component, I would argue,  can only go so far.  You have to have that social understanding as well.  And that awareness of your own social biases,  because that allows you to combine the best of both of those techniques.  Where it's like, okay, now I know how to fact check.  And I'm aware of my social biases.  So, I'm not just fact checking stuff  that's inconvenient or convenient for me.  So that's on the individual level,  is trying to understand how we can learn about our biases,  learn how to fact check better,  and how to navigate the internet.  So that's individually,  but then I could also go into the meso and macro as well,  because I think that's also important.  So I dive into this into my book  about the meso level of basically communities,  and what that looks like.  So we've talked about trust  and how trust is a social process  of how we trust someone  when they think they're competent  and we think they have our best interests in mind.  So that might require forming relationships with someone.  So what I would like to see happen  is more of these scientific and medical institutions  that have lost some trust  actually go out in their communities  and form relationships again  with their local communities  or on social media, like actually invest in this  and have people speaking about  what is the importance of a university?  What are they actually doing?  What research are they doing  that makes a difference in your life?  And that reduces this psychological distance  between people who are not familiar with universities  and the universities themselves.  So, you know, I often think like,  I'm within academia, I know a lot of scientists  and physicians.  So for me, it's a lot easier for me to trust them  because I know them personally.  But if you don't personally know these people,  then that creates a barrier and it creates an opportunity  for someone else to be like,  hey, don't trust those people.  You don't even know them.  Trust me instead.  And I think if more opportunities existed  for partnerships between local community leaders  and their hospitals and universities  and really invest in those partnerships at a local level  and then scale that throughout the United States.  Like that's like my big picture.  If I could wave a magic wand,  I would have these hospitals and universities  have resources to invest in those community outreach programs.  And then of course, there's like big, big picture  of like thinking about social media  and what they can do a better job on.  And that gets really tricky  because it requires regulation.  But I mean, some simple things are just like having  these companies share their data more and have more transparency.  That's something, unfortunately, that we've drifted away from,  because ideally, we'd have independent researchers  studying these platforms and having access to their data,  so we can actually really know what these algorithms are doing and how they're affecting us.  That's a big component of it as well.  It should be complicated. If you had a simple answer, I'd be like, me.  That is it for this episode of The You Are Not So Smart Podcast for links to everything  we talked about.  Head to urenotsosmard.com or check the show notes right there in your podcast.  Player, my name is David McRaney.  I have been your host in those show notes.  You can find my book, How Minds Change, wherever they put books on shelves and ship them  and trucks details for a David McRaney dot com and I'll have all of that in the show notes  as well.  Right there in your podcast player.  On my homepage, David McRaney dot com, you can find a round table video with a group of  persuasion experts featured in the book talking all about it.  You need a sample chapter, download a discussion guide, sign up for the newsletter, read  reviews, all sorts of things for all the past episodes of this podcast.  is Apple Podcasts, Amazon Music, Audible, Spotify or you are not so smart.com.  You can follow me on Twitter and threads and Instagram and Blue Sky and everything else that's  like that at David McRaney.  At symbol David McRaney, follow the show at not smart blog or also on Facebook slash  you are not so smart.  And if you'd like to support this one-person operation, no editors, no staff.  me go to patreon.com slash you are not so smart pitching in it any amount gets you the show add free  but the higher amounts that it gets you posters and t-shirts and sign books and other stuff the opening  music that is clash my caravan palace and if you really really really want to support this show  the best way to do that just tell people about it either rate and comment on it on all these platforms  Or just tell somebody directly, hey, should check out the show.  Put them to an episode that really meant something that really connected with you.  And check back in in about two weeks for a fresh new episode."
}