[
    {
        "title": "Locked On Angels - Daily Podcast On The Los Angeles Angels",
        "url": "https://feeds.simplecast.com/ujyPYTC9",
        "description": "Locked On Angels podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Los Angeles Angels and Major League Baseball. Hosted by Super Halo Bros., Mike and Jon Frisch, the Locked On Angels podcast provides your daily Angels fix with expert, local analysis, and coverage of all aspects of the Angels franchise. Locked On Angels takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Angels locker room and all over MLB. The Locked On Angels podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 330901,
        "author": "Locked On Podcast Network, Mike Frisch, Jon Frisch"
    },
    {
        "title": "Bengals Booth Podcast",
        "url": "https://www.omnycontent.com/d/playlist/e73c998e-6e60-432f-8610-ae210140c5b1/218b01ba-4e5c-4581-b447-aeac013301e7/d1024af1-554d-4f25-bb78-aeac013301f5/podcast.rss",
        "description": "The Bengals radio team keeps fans up-to-date with the latest news, features and highlights.",
        "id": 809929,
        "author": "Cincinnati Bengals"
    },
    {
        "title": "Dodger Talk",
        "url": "https://www.spreaker.com/show/5937289/episodes/feed",
        "description": "Dodger Talk with David Vassegh, Tim Cates, José Mota bringing you the latest on the Los Angeles Dodgers ",
        "id": 327247,
        "author": "AM 570 LA Sports (KLAC-AM)"
    },
    {
        "title": "UFO Chronicles Podcast",
        "url": "https://www.spreaker.com/show/3395068/episodes/feed",
        "description": "First-hand witness encounters of the Strange and unexplained.<br />The host Nik will take you head first down the rabbit hole in a refreshing and different podcast format. Witness accounts from everyday people from all over the world with uninterrupted monologues of their encounters. The phenomena that people experience shared here range from sightings of UFOs to traumatic alien abductions, scary heart stopping stories of ghosts, demons and the Occult. Accounts of crossing paths with Bigfoot, Sasquatches and all manner of dark entities that lurk and dwell in the dark woods and remote areas. Psychic abilities of precognition, premonitions, and the people who have journeyed to the other side with their near-death experiences.<br />The encounters in this podcast will stay with you long after you have finished listening.<br /><br />Want to share your encounter on the show?<br />Email: <a href=\"https://gmail.com\" target=\"_blank\" rel=\"noreferrer noopener\">UFOChronicles@gmail.com</a><br />Or Fill out Guest Form:<br /><a href=\"https://forms.gle/uGQ8PTVRkcjy4nxS7\" target=\"_blank\" rel=\"noreferrer noopener\">https://forms.gle/uGQ8PTVRkcjy4nxS7</a><br /><br />Podcast Website: <a href=\"https://ufochroniclespodcast.com\" target=\"_blank\" rel=\"noreferrer noopener\">https://ufochroniclespodcast.com</a><br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/ufo-chronicles-podcast--3395068/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/ufo-chronicles-podcast--3395068/support</a>.",
        "id": 764742,
        "author": "Nik Hunter"
    },
    {
        "title": "Video Game Outsiders",
        "url": "https://feeds.megaphone.fm/NSR4849377281",
        "description": "<p>VGO has been churning out stupidity and gaming since 2005 making it one of the longest running podcasts of all time. Hosts John “John’s Arcade” Jacobson, and comedy creator Michelle Madison, explore all things gaming from console to PC, with a healthy dose of random insanity in between the latest videogame and tech news. Live every Tuesday on Twitch.tv/johnANDmichelle, Video Game Outsiders is home to a unique community of adult gamers. For weekly extra episodes, game giveaways, and ad free VGO - join our Discord: https://discord.gg/Ab6pxpT For older episodes and the rest of the perks you can also download our VGO app or visit our website VideoGameOutsiders.com for more info.</p>",
        "id": 738877,
        "author": "Pickaxe"
    },
    {
        "title": "Locked On Magic - Daily Podcast On The Orlando Magic",
        "url": "https://feeds.simplecast.com/cZ_GUU6u",
        "description": "Locked On Magic podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Orlando Magic and the NBA. Philip Rossman-Reich of the Orlando Magic Daily provides your daily Magic fix with expert, local analysis, and coverage of all aspects of the Magic franchise. Locked On Magic takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Magic locker room and all over the NBA. The Locked On Magic podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 174462,
        "author": "Locked On Podcast Network, Philip Rossman-Reich"
    },
    {
        "title": "Flying Free",
        "url": "https://flyingfree.libsyn.com/rss",
        "description": "Flying Free is a support resource for women of faith who need hope and healing from hidden emotional abuse, spiritual abuse, and narcissistic abuse. Because of misogynistic theology taught in controlling and spiritually abusive churches, many Christian women find themselves in destructive marriages where there is an uneven power dynamic. Male partners use their status as a husband to gain power and control over a woman’s mind, emotions, body, social life, finances, and more. When she tries to get help from her equally abusive church environment, she is betrayed and re-abused. Flying Free offers a Christ-centered, gospel-oriented perspective on domestic abuse that protects and honors the voices and autonomy of women. Tune in each week to hear conversations with emotional abuse advocates and fellow survivors who will walk with you on your journey up and out. We hear you. You are not alone. Learn more at https://flyingfreenow.com",
        "id": 1045377,
        "author": "Natalie Hoffman"
    },
    {
        "title": "Flying Free",
        "url": "https://feeds.transistor.fm/flying-free",
        "description": "Flying Free is a support resource for women of faith who need hope and healing from hidden emotional abuse, spiritual abuse, and narcissistic abuse. Because of misogynistic theology taught in controlling and spiritually abusive churches, many Christian women find themselves in destructive marriages where there is an uneven power dynamic. Male partners use their status as a husband to gain power and control over a woman’s mind, emotions, body, social life, finances, and more. When she tries to get help from her equally abusive church environment, she is betrayed and re-abused. Flying Free offers a Christ-centered, gospel-oriented perspective on domestic abuse that protects and honors the voices and autonomy of women. Tune in each week to hear conversations with emotional abuse advocates and fellow survivors who will walk with you on your journey up and out. We hear you. You are not alone. Learn more at https://flyingfreenow.com",
        "id": 1331214,
        "author": "Natalie Hoffman"
    },
    {
        "title": "The Epstein Chronicles",
        "url": "https://www.spreaker.com/show/5003294/episodes/feed",
        "description": "Jeffrey Epstein was a multi millionaire who had political and business ties to some of the most rich and powerful people in the world. From businessmen to politicians at the highest levels, Epstein broke bread with them all. <br /><br />Yet for years the Legacy media and the rest of high society looked the other way and ignored his behavior as multiple women came forward with allegations of abuse. <br /><br />Even after he was convicted and subsequently received a sweetheart deal those same so called elites welcomed him back with open arms. <br /><br />Now after his death and the arrest of Maxwell, the real story is starting to come together and the curtain has begun to be drawn back and what it has revealed is truly disturbing. <br /><br />From Princes to Ex Presidents, the cast of scoundrels in this play spans continents and political affiliations leaving us with a transcontinental criminal conspiracy possibly unlike any we have ever seen before. <br /><br />In this podcast we will explore all of the levels of Jeffrey Epstein and his criminal enterprise. <br /><br />From his most trusted assistants to obscure associates, we will leave no stone unturned as we swim through the muck searching for clarity and answers to some of the most pressing questions of the case. <br /><br />From interviews with people directly involved in the case to daily updates, the Epstein Chronicles will have it all. <br /><br />Just like our other project, The Jeffrey Epstein Show, you can expect no punches pulled and consistent content. We have covered the Epstein case daily(everyday since October 1st 2019) and will continue to do so until there are convictions. With a library of well over 1k shows, you can expect a ton of content coming your way including on scene reporting from the Maxwell trial and from places like Zorro Ranch. <br /><br />Thank you for tuning in and I look forward to having you all along for the ride.<br /><br /><br /><br /><br />(Created and Hosted by Bobby Capucci)<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support</a>.",
        "id": 4089394,
        "author": "Bobby Capucci"
    },
    {
        "title": "Missing Persons Mysteries",
        "url": "https://www.spreaker.com/show/5624803/episodes/feed",
        "description": "<a href=\"https://www.youtube.com/@MissingPersonsMysteries\" target=\"_blank\" rel=\"noreferrer noopener\">Welcome to Missing Persons Mysteries!</a><br /><br />Best Selling Author and Entertainment Icon Steve Stockton discuss Missing Persons Cases, True Paranormal Stories, Unsolved Mysteries, Missing 411 Cases, Unexplained Phenomenon, The Supernatural, True Crime, Bizarre and Unsolved Disappearances and Stories of Survival.<br /><br /><a href=\"https://www.youtube.com/@MissingPersonsMysteries\" target=\"_blank\" rel=\"noreferrer noopener\">🎞️ Check out our YouTube channel!</a><br /><br /><a href=\"https://www.patreon.com/missingpersons\" target=\"_blank\" rel=\"noreferrer noopener\"> 🎉 Check out our Patreon for exclusive content! </a><br /><br /><a href=\"https://www.spreaker.com/show/missingpersonsmysteries\" target=\"_blank\" rel=\"noreferrer noopener\">🙌 Missing Persons Mysteries Podcast</a><br /><br /><a href=\"https://www.youtube.com/playlist?list=PLBX35PgIa2RCg7nAlODRiMOsjQ7FD-XoI\" target=\"_blank\" rel=\"noreferrer noopener\">🆕 Playlist with ALL the channels content</a><br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/missing-persons-mysteries--5624803/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/missing-persons-mysteries--5624803/support</a>.",
        "id": 4261229,
        "author": "Steve Stockton"
    },
    {
        "title": "Sky News",
        "url": "http://a.365dm.com/api/apple/v1/audio/news-bulletin",
        "description": "Sky news delivers breaking news, headlines and top stories from business, politics, entertainment and more in the UK and worldwide.",
        "id": 6807189,
        "author": "Sky News"
    },
    {
        "title": "Anchored with April Vokey",
        "url": "https://feeds.megaphone.fm/WPCM8100104444",
        "description": "<p>Join renowned angler April Vokey as she sits down for intimate, face-to-face conversations with some of fishing and the outdoor world’s most fascinating and influential voices. Driven by curiosity, she takes a behind-the-scenes, honest, and often vulnerable approach—uncovering stories that have never been told before. An Anchored Outdoors production.</p>",
        "id": 172767,
        "author": "April Vokey"
    },
    {
        "title": "108.3 WGKSRADIO DEEP HOUSE PARTY",
        "url": "https://media.rss.com/1083wgksradio/feed.xml",
        "description": "<p>This is an introduction of what's to come in deep houze muzic from master mixologists MSL MALACHI & DA. AFRICAN PRINCE LOVKID!</p>",
        "id": 4199971,
        "author": "Chocolatchip Lovkid & MSL Malachi"
    },
    {
        "title": "Raised By Giants",
        "url": "https://www.spreaker.com/show/4895847/episodes/feed",
        "description": "Raised By Giants presented and produced by Ryder Lee, provides a platform from which philosophers, researchers, authors, and UFO researchers can come together and communicate their studies, observations, thoughts, Ideas, reflections and research. Infusing them into common everyday knowledge with their understanding of life and the universe. Ryder Lee of Raised By Giants will be diving deep into these topics, interviewing and hosting this ever-growing number of people, searching for a deeper understanding and truth.",
        "id": 3844854,
        "author": "Raised By Giants"
    },
    {
        "title": "SSPN: A San Antonio Spurs Podcast",
        "url": "https://anchor.fm/s/53e00db4/podcast/rss",
        "description": "A San Antonio Spurs Podcast and YouTube channel hosted by Ethan Quintero and Jude McClaren. You can find post-game recaps, podcast episodes + more below and on YouTube!",
        "id": 3686150,
        "author": "Ethan Quintero, Jude McClaren"
    },
    {
        "title": "Stocks for Beginners",
        "url": "https://rss.acast.com/stocks-for-beginners",
        "description": "<p>We're all investors in the stock market, either directly or through our retirement plans. We're handing over management of our assets to financial advisors and fund managers. The best will look after our interests and make us wealthier. But how can we know for sure? Where are the investors' yachts? The big money on Wall Street is made by charging us fees. The finance industry is collecting for managing money, whether they win or lose or break even.</p><br><p>Where do you go if you're completely new but want to start learning about investing in the market yourself. The jargon is dense and it can feel like we're being kept deliberately in the dark with many confusing metrics.</p><br><p>In Stocks for Beginners you'll hear from people in the finance industry and together we'll explain the key concepts of investing while they share their financial knowledge. More importantly, they have insights that allow us to look under the hood of the stock market, explaining how it works and what to look out for.</p><br><p>How is your <strong>Roth 401</strong> (k) or 401 (k) investment retirement account linked to the stock market? It's crucial to understand the fundamentals of stock markets. I recommend \"The Intelligent Investor\" by Benjamin Graham and Warren Buffett's newsletters.</p><br><p>I explore the basics - what a stock is and how to buy one, and delve into the world of value investing, exploring strategies to identify undervalued stocks. I cover the NYSE, FTSE, Dow Jones, S&P500, the Russell, CBOE (Chicago Board Options Exchange), ETFs (Exchange-Traded Funds), Mutual Funds, ESG (Environmental, Social, and Governance), and the difference between passive and active investing.</p><br><p>There are many traps for beginner investors and it's good to be aware of the role and risks of options, warrants, CFDs (Contracts for Difference), day trading, bonds, cryptocurrencies like Bitcoin and Ethereum, the difference between fundamental and technical analysis.</p><br><p>Tracking your investments is essential, and it's important to know about watchlists, understand dividends, robo-investing, dollar-cost averaging, fixed income, index funds, and micro-investing.</p><br><p>What is the role of stockbrokers and online brokers and how to buy and sell stocks.</p><br><p>I've interviewed industry experts and collaborated with Gary Brode, Caleb Silver, Spencer Jakab from Wall Street Journal, Erik Smolinski, Investopedia, Stockopedia, Lawrence Carel, Deep Knowledge Investing, 2 bulls in a china shop.</p><p>We have to be smart. We have to be diversified and we have to have good risk management strategies if we want to invest for the long term. That's what I'm all about. I'm Phil Muscatello. Join me on Stocks for Beginners. For more information go to<a href=\" https://www.stocksforbeginners.net/\" rel=\"noopener noreferrer\" target=\"_blank\"> https://www.stocksforbeginners.net/</a></p><br><p>Stocks for Beginners is a production of Finpods Pty Ltd. The advice shared on Stocks for Beginners is general in nature and does not consider your individual circumstances. Stocks for Beginners exists purely for educational and entertainment purposes and should not be relied upon to make an investment or financial decision. If you do choose to buy a financial product, obtain appropriate financial advice tailored towards your needs. Philip Muscatello and Finpods Pty Ltd are authorised representatives of Money Sherpa PTY LTD ABN - 321649 27708, AFSL - 451289. </p><hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 440998,
        "author": "Philip Muscatello - Investment Education for the Stock Market"
    },
    {
        "title": "Tech Updates",
        "url": "https://feeds.transistor.fm/tech-updates",
        "description": "Latest tech updates",
        "id": 7346442,
        "author": "Meir Tsvi"
    },
    {
        "title": "Jesse Kelly Show",
        "url": "https://www.spreaker.com/show/4984703/episodes/feed",
        "description": "Jesse Kelly Show",
        "id": 4047282,
        "author": "710 WOR (WOR-AM)"
    },
    {
        "title": "Daily Fantasy Morning Grind",
        "url": "https://feeds.acast.com/public/shows/66d1e4af98647d420edb2cb3",
        "description": "This daily fantasy podcast is your first word in sports with game analysis for the upcoming slate at DraftKings, FanDuel, and others! Stevietpfl gives picks and talks game theory for Daily Fantasy Baseball, Daily Fantasy Football, and more! Follow the Morning Grind's YouTube page to watch all the episodes live - https://www.youtube.com/@MorningGrind 21+. Gambling Problem? Call 1-800-GAMBLER<hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 445764,
        "author": "Stephen Young"
    },
    {
        "title": "HT Daily News Wrap",
        "url": "https://feeds.megaphone.fm/HTMEDIALTD4383121932",
        "description": "Things never cease to be in news no matter what the medium. As a part of the beta testing initiative our AI, Aditi brings to you the world of politics, business, sports and entertainment in person; every morning and evening. Listen to HT Daily News Wrap to keep abreast with all that's happening around you, now more than ever.\nThis is a Hindustan Times production, brought to you by HT Smartcast.\nFollow us on:\nInstagram: https://www.instagram.com/htsmartcast/\nFacebook: https://www.facebook.com/htsmartcast\nTwitter: https://twitter.com/HTSmartcast\nLinkedIn: https://www.linkedin.com/company/ht-smartcast/",
        "id": 722161,
        "author": "Hindustan Times - HT Smartcast"
    },
    {
        "title": "☀️ 全球串連早安新聞｜Morning Taiwan Glocal News",
        "url": "https://feed.firstory.me/rss/user/cklqae6gy388f0892i2qmv851",
        "description": "<p>☀️ 小路&浩爾 策展主播 <br />週一到週五台灣時間 8-9 am @ Clubhouse <br />補充時事營養素，與世界接軌 <br /> <br />努力認真，希望節目越做越好，讓更多人關心國際，誠摯歡迎建議！ <br /> <br />本節目由付費訂閱的聽友支持得以持續運作 <br />歡迎加入Premium聽友的行列 <br />👉 https://open.firstory.me/join/morningtaiwan <br /> <br />🙋‍♂️🙋‍♀️ \\Instagram好友募集中/：https://www.instagram.com/morningtaiwan/ <br />🔔加我們的Facebook 社團，跟大家串連在一起：https://www.facebook.com/groups/morningtaiwan/ <br />✉️ 早安新聞商業合作信箱 → morningtaiwannews@gmail.com <br /> <br />代表單位：浩瀚兄弟文創社 <br />統編：42415706 <br />Tel：02-25338767 <br /> <br/>Powered by <a href=\"https://firstory.me/zh\">Firstory Hosting</a></p>",
        "id": 3637161,
        "author": "浩爾&小路"
    },
    {
        "title": "You Betcha Radio",
        "url": "https://anchor.fm/s/87aac94/podcast/rss",
        "description": "The most \"Midwest\" podcast on the planet. Myles the You Betcha Guy and the gang, Ryan, Tyler and Jerrod, have been talking man culture, nostalgia and being from the Midwest since 2019. Listen to each comedy filled episode every Wednesday. Cheers!",
        "id": 240630,
        "author": "You Betcha"
    },
    {
        "title": "The Juan Chavez Show's podcast",
        "url": "https://www.spreaker.com/show/6590817/episodes/feed",
        "description": "Teaching kids that Disney movies has fun and educational values told through animated musicals.<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/the-juan-chavez-show-s-podcast--6590817/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/the-juan-chavez-show-s-podcast--6590817/support</a>.",
        "id": 7291918,
        "author": "The Juan Chavez Show"
    },
    {
        "title": "True Crime Podcast 2025 - Police Interrogations, 911 Calls and True Police Stories Podcast",
        "url": "https://www.spreaker.com/show/5693470/episodes/feed",
        "description": "True Crime Podcasts 2025 - Police Interrogations, 911 Calls, Police Stories and Unsolved Mysteries Reddit Podcast <br /><br />r/TrueCrimePodcasts: Reddit True Crime Podcasts 2025 - Police Interrogations, 911 Calls, <br /><br /><br />Reddit True Crime Podcasts 2025 - Police Interrogations, 911 Calls, Police Stories and Unsolved Mysteries Reddit Podcast<br /><br /><br />True Crime Podcast 2025 - Police Interrogations, 911 Calls and True Police Stories Podcast<br /><br />True Crime 411 - Police Interrogations, 911 Calls, Police Stories and Unsolved Mysteries Reddit Podcast<br /><br />True Crime Podcast 2024 - Police Interrogations, 911 Calls and True Police Stories Podcast<br /><br />Welcome to the Police Interrogations, 911 Calls and True Police Stories Podcast. <br /><br />This podcast will feature real-life stories from police officers, crime scene investigators, survivors of violent crimes and more. We'll share stories about how police investigate, assess and solve criminal cases, how 911 calls can provide valuable information to police and how crime victims can seek justice. Every episode will feature a different story, providing a unique insight into the world of law enforcement and crime. <br /><br />We'll bring you interviews with experts from the police force, crime scene investigation teams, prosecutors, defense attorneys, victims and more. We'll explore the impact of crime on individuals and communities. We'll also examine the ethical and legal issues that arise in criminal cases, and the efforts of police to protect the public and bring criminals to justice. <br /><br />We'll be discussing the latest news and developments in the criminal justice system, and the implications of new laws and policies on the safety of communities. We'll also provide valuable resources to help those affected by crime, and look at the impact of crime on the mental health of communities. <br /><br />We hope you'll join us as we explore the world of crime and justice, one episode at a time.<br /><br /><br /><br /><br />true crime is a nonfiction literary, podcast, and film genre in which the author examines an actual crime and details the actions of real people. The crimes most commonly include murder; about 40 percent focus on tales of serial killers.<br /><br />As much as we love listening to a celebrity interview or cultural discussion, there’s nothing quite like a true crime podcast to keep you hooked for hours on end.<br /><br />There’s a reason why so many true crime series have climbed the podcast charts over the years – from the genre-defining brilliance of Serial to the unexpected twists and turns of Sweet Bobby, true crime is the genre that just keeps on giving.<br /><br />True crime has never been more popular than it is today, as evidenced by the astonishing number of podcasts, TV shows, and documentaries dedicated to the genre. At its core, however, true crime is a type of nonfiction literature. From influential works like Truman Capote’s In Cold Blood (1966) to modern-day investigations such as Michelle McNamara’s I’ll Be Gone in the Dark (2018) or Elon Green’s Last Call (2021), such narratives are unique in the way they connect with their readers, precisely because they explore harrowing real-life events that could happen to anyone.<br /><br />Want to know more about true crime? Here we define the genre, take a fascinating look at its origins, and cover some of its common themes.<br /><br />The Definition of “True Crime”<br />It seems like the definition of true crime would be obvious: A story about a crime that actually occurred. Indeed, most true crime books explore dark and distressing subject matter, and reader discretion is advised. Granted, the first rule of true crime is that the narrative must include as many nitty-gritty facts about the case as possible: Readers expect the actual names of people involved and the correct time and place, information about what they did, and as many details of the crime and its investigation as the author can dig up.<br /><br />True crime books can be about a single event, like a kidnapping. They can also be about the collective crimes of serial killers, thieves, or cult leaders. However narrow or broad the focus, the best true crime books deliver well-researched, finely written examinations of the case at hand.<br /><br />But the wealth of details is just half of what makes true crime so popular with readers. The most talented true crime authors excel at presenting the facts of a case while vividly re-creating the atmosphere that surrounded the crime. They put criminals and their victims in context by establishing elements like the political climate of the day, the history of a town, or the struggles faced by a particular community. They dig into everyone’s motives, then weigh these motives against the actions and developments they document. They re-create dialogue as faithfully as possible, although of course sometimes it’s necessary to take artistic liberties.<br /><br />In other words, the most popular true crime authors transport readers to the scene of the crime, with all senses fully engaged. Without an author’s narrative talents, the details of the crime would simply read like a legal report.<br /><br />Best True Crime Stories Podcast 2024 Police Interrogations, True Crime Investigations and MORE!<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/true-crime-podcast-2025-police-interrogations-911-calls-and-true-police-stories-podcast--5693470/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/true-crime-podcast-2025-police-interrogations-911-calls-and-true-police-stories-podcast--5693470/support</a>.",
        "id": 5768814,
        "author": "True Crime Podcast 2025"
    },
    {
        "title": "True Crime & The Court of Public Opinion with Alexis Knight",
        "url": "https://www.spreaker.com/show/6292057/episodes/feed",
        "description": "<b>True Crime & The Court of Public Opinion with Alexis Knight</b><br /><br />Dive into the complexities of justice with \"True Crime: The Court of Public Opinion,\" where we explore real-life cases through three thought-provoking categories: Under the Influence, Mad or Bad, and Murder or Self-Defense.<br /><br />Each episode dissects a controversial crime, challenging you to question the motives, mental states, and legal outcomes that shape our understanding of guilt and innocence. Was the suspect manipulated into their actions, suffering from a deep mental illness, or simply making a choice between life and death?<br /><br />Join host Alexis Knight as she presents the facts, examines the arguments, and invites you to render your verdict in the court of public opinion. Your perspective could change everything.<br /><br />#truecrime, #courtofpublicopinion<br /><br />This podcast will feature real-life stories from police officers, crime scene investigators, survivors of violent crimes and more. We'll share stories about how police investigate, assess and solve criminal cases, how 911 calls can provide valuable information to police and how crime victims can seek justice. Every episode will feature a different story, providing a unique insight into the world of law enforcement and crime. <br /><br />We'll bring you interviews with experts from the police force, crime scene investigation teams, prosecutors, defense attorneys, victims and more. We'll explore the impact of crime on individuals and communities. We'll also examine the ethical and legal issues that arise in criminal cases, and the efforts of police to protect the public and bring criminals to justice. <br /><br />We'll be discussing the latest news and developments in the criminal justice system, and the implications of new laws and policies on the safety of communities. We'll also provide valuable resources to help those affected by crime, and look at the impact of crime on the mental health of communities. <br /><br />We hope you'll join us as we explore the world of crime and justice, one episode at a time.<br /><br /><br /><br /><br />true crime is a nonfiction literary, podcast, and film genre in which the author examines an actual crime and details the actions of real people. The crimes most commonly include murder; about 40 percent focus on tales of serial killers.<br /><br />As much as we love listening to a celebrity interview or cultural discussion, there’s nothing quite like a true crime podcast to keep you hooked for hours on end.<br /><br />There’s a reason why so many true crime series have climbed the podcast charts over the years – from the genre-defining brilliance of Serial to the unexpected twists and turns of Sweet Bobby, true crime is the genre that just keeps on giving.<br /><br />True crime has never been more popular than it is today, as evidenced by the astonishing number of podcasts, TV shows, and documentaries dedicated to the genre. At its core, however, true crime is a type of nonfiction literature. From influential works like Truman Capote’s In Cold Blood (1966) to modern-day investigations such as Michelle McNamara’s I’ll Be Gone in the Dark (2018) or Elon Green’s Last Call (2021), such narratives are unique in the way they connect with their readers, precisely because they explore harrowing real-life events that could happen to anyone.<br /><br />Want to know more about true crime? Here we define the genre, take a fascinating look at its origins, and cover some of its common themes.<br /><br />The Definition of “True Crime”<br />It seems like the definition of true crime would be obvious: A story about a crime that actually occurred. Indeed, most true crime books explore dark and distressing subject matter, and reader discretion is advised. Granted, the first rule of true crime is that the narrative must include as many nitty-gritty facts about the case as possible: Readers expect the actual names of people involved and the correct time and place, information about what they did, and as many details of the crime and its investigation as the author can dig up.<br /><br />True crime books can be about a single event, like a kidnapping. They can also be about the collective crimes of serial killers, thieves, or cult leaders. However narrow or broad the focus, the best true crime books deliver well-researched, finely written examinations of the case at hand.<br /><br />But the wealth of details is just half of what makes true crime so popular with readers. The most talented true crime authors excel at presenting the facts of a case while vividly re-creating the atmosphere that surrounded the crime. They put criminals and their victims in context by establishing elements like the political climate of the day, the history of a town, or the struggles faced by a particular community. They dig into everyone’s motives, then weigh these motives against the actions and developments they document. They re-create dialogue as faithfully as possible, although of course sometimes it’s necessary to take artistic liberties.<br /><br />In other words, the most popular true crime authors transport readers to the scene of the crime, with all senses fully engaged. Without an author’s narrative talents, the details of the crime would simply read like a legal report.<br /><br />Best True Crime Stories Podcast 2024 Police Interrogations, True Crime Investigations and MORE!<br /><br /><br /><br />Police Interrogations, 911 Calls, Police Stories and Unsolved Mysteries Reddit Podcast <br /><br />r/TrueCrimePodcasts: Reddit True Crime Podcasts 2024 - Police Interrogations, 911 Calls, <br /><br /><br />Reddit True Crime Podcasts 2024 - Police Interrogations, 911 Calls, Police Stories and Unsolved Mysteries Reddit Podcast<br /><br />True Crime 411 - Police Interrogations, 911 Calls, Police Stories and Unsolved Mysteries Reddit Podcast<br /><br />True Crime Podcast 2024 - Police Interrogations, 911 Calls and True Police Stories Podcast<br /><br />Welcome to the Police Interrogations, 911 Calls and True Police Stories Podcast.<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/true-crime-the-court-of-public-opinion-with-alexis-knight--6292057/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/true-crime-the-court-of-public-opinion-with-alexis-knight--6292057/support</a>.",
        "id": 7016559,
        "author": "True Crime & The Court of Public Opinion with Alexis Knight"
    },
    {
        "title": "Security Now (Video)",
        "url": "https://feeds.twit.tv/sn_video_hd.xml",
        "description": "Cybersecurity guru Steve Gibson joins Leo Laporte every Tuesday. Steve and Leo break down the latest cybercrime and hacking stories, offering a deep understanding of what's happening and how to protect yourself and your business. Security Now is a must listen for security professionals every week.\nRecords live every Tuesday at 4:30pm Eastern / 1:30pm Pacific / 20:30 UTC.",
        "id": 202764,
        "author": "TWiT"
    },
    {
        "title": "Security Now (Audio)",
        "url": "https://feeds.twit.tv/sn.xml",
        "description": "Cybersecurity guru Steve Gibson joins Leo Laporte every Tuesday. Steve and Leo break down the latest cybercrime and hacking stories, offering a deep understanding of what's happening and how to protect yourself and your business. Security Now is a must listen for security professionals every week.\nRecords live every Tuesday at 4:30pm Eastern / 1:30pm Pacific / 20:30 UTC.",
        "id": 738797,
        "author": "TWiT"
    },
    {
        "title": "Orlando Magic HQ",
        "url": "https://feeds.simplecast.com/1GBhd7h3",
        "description": "Welcome to Orlando Magic HQ – Your Ultimate Destination for Magic Basketball Coverage!\nOrlando Magic HQ is the go-to source for everything Orlando Magic. Whether you're a lifelong fan or new to the team, we provide in-depth analysis, exclusive interviews, and expert insights to keep you connected with the Magic all season long.\nOur Flagship Shows:\nThe Orlando Magic HQ Podcast – Hosted by Anthony Velez and Al Grullon, this weekly show dives into the latest Magic news, both on and off the court. Get thoughtful discussions, expert breakdowns, and everything you need to stay up-to-date. New episodes drop every Friday.\nThe Close Up – Hosted by Stephen Cameron, this interview-driven series brings you unique perspectives from Magic insiders, national media, and key figures within the basketball world. Tune in for fresh takes on the Magic, the NBA, and more. New episodes are released Mondays or Tuesdays.\nWhat We Offer:\n- Post-game Live Spaces on X:** Real-time reactions, game breakdowns, and analysis.\n- Exclusive Content: Articles, YouTube videos, and behind-the-scenes access from our team of journalists.\n- Latest News and Updates: Follow us on our social media accounts to stay up-to-date on all of the latest Orlando Magic news and updates.\nSupport the HQ:\nBecome a Patreon [Patreon](https://www.patreon.com/orlandomagichq) Member for access to exclusive content, Orlando Magic HQ group chat, and much more.\nStay Connected:\n- 🌐 Website: [www.orlandomagichq.com](http://www.orlandomagichq.com)\n- 🐦 X: [@OMagicHQ](https://x.com/omagichq)\n- 📸 Instagram: [@orlandomagichq](https://www.instagram.com/orlandomagichq)\n- 📘 Facebook: [Orlando Magic HQ](https://www.facebook.com/orlandomagichq)\nStay informed. Stay engaged. Go Magic!\nDisclaimer: Orlando Magic HQ is not affiliated with the Orlando Magic or the NBA.",
        "id": 1195820,
        "author": "Orlando Magic HQ, Bleav"
    },
    {
        "title": "Tavis Smiley",
        "url": "https://www.spreaker.com/show/6286410/episodes/feed",
        "description": "\"Tavis Smiley\" is the flagship program for KBLA, America's newest progressive radio network and LA's first Black-owned talk station. Broadcast live across southern California on 1580AM and around the world on KBLA1580.com and TuneIn, this podcast presents the best of Tavis Smiley's conversations with activists, influencers, thought leaders, and cultural vanguards.<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/tavis-smiley--6286410/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/tavis-smiley--6286410/support</a>.",
        "id": 5000046,
        "author": "KBLA Talk 1580"
    },
    {
        "title": "KCSN: Kansas City Royals Podcasts",
        "url": "https://feeds.simplecast.com/NyP53kMG",
        "description": "We cover the Kansas City Royals.",
        "id": 5204961,
        "author": "KC Sports Network"
    },
    {
        "title": "Who Are These Broadcasters?",
        "url": "https://feeds.megaphone.fm/whoarethesebroadcasters",
        "description": "<p>Hosted by Christian Bladt and Eric Zane, Who Are These Broadcasters is a show that very much fits under the Who Are These Podcasts umbrella. The show breaks down the lowlights and lowerlights in broadcasting. They cover the week of local and national news, politics and political pundits, talk shows, radio hosts, sportscasters, and the best broadcasting moments in history. Give it a listen for a laugh or two, all we ask is that you don't learn anything.</p>",
        "id": 6628417,
        "author": "Karl Hamburger"
    },
    {
        "title": "Locked On MLB - Daily Podcast On Major League Baseball",
        "url": "https://feeds.simplecast.com/EzlTNH0T",
        "description": "Locked On MLB podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info from all around Major League Baseball. All the hits, runs and strikeouts. Host Paul Francis Sullivan, a comedian, TV producer and creator of the Sully Baseball Podcast, brings his humor and passion to our national pastime, as the Locked On MLB podcast provides your daily baseball fix with a unique spin that you won’t forget. From the jaw-dropping plays to the awe-inspiring performances that make each game a masterpiece, Locked On MLB takes you beyond the scoreboard for the inside scoops on the biggest stories from all over MLB. The Locked On MLB podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 644196,
        "author": "Locked On Podcast Network, Paul Francis Sullivan"
    },
    {
        "title": "Shut Up I Love It",
        "url": "https://feeds.blubrry.com/feeds/shutupiloveit.xml",
        "description": "Many years ago, Sasha Feiler and Joe Cabello met in line for an improv show. They were young, dumb, and full of it. What followed were comedy shows so explicit, “genitalia” was practically a term of endearment.\n\nFast forward 5 dogs, 6 cats, and way too many weird inside jokes later, Sasha and Joe are no longer young or dumb—but they’re still brimming with you-know-what. Here, they’ve teamed up to bring you a podcast where they interview a guest who passionately defends something universally hated, misunderstood, forgotten, overlooked, Mandela-effected, canceled—you name it. The key? They LOVE it. \n\nFrom toupees... to B-movies... to aliens, psychedelics, and the occasional surprise character, Sasha and Joe are here to spread love to the world that birthed them (but maybe should’ve used protection).\n\nSo come and get that love because no one else will give it to you like we do.\n\nAlso, don’t forget to check out the Patreon Bonus version of the show:\nhttps://www.patreon.com/c/ShutUpILoveItPodcast",
        "id": 249201,
        "author": "Sasha Feiler and Joe Cabello"
    },
    {
        "title": "Curiosity Chronicle",
        "url": "https://feeds.transistor.fm/the-curiosity-chronicle-d386f1e7-8f95-4fd3-9267-43615d7a439e",
        "description": "Delivering curiosity-inducing content every single week. \nThis is the audio version of my newsletter. Sign up at the bottom of the page!",
        "id": 3997065,
        "author": "Sahil Bloom"
    },
    {
        "title": "Setting The Pace: A Pacers Podcast",
        "url": "https://feeds.simplecast.com/1zFV2hJ3",
        "description": "Setting The Pace is a Pacers Podcast with Alex Golden and Mike Facci. Brought to you by the Blue Wire Podcast Network.",
        "id": 768329,
        "author": "Blue Wire"
    },
    {
        "title": "Red Gold & Bold - A KC Football Podcast",
        "url": "https://www.spreaker.com/show/5063726/episodes/feed",
        "description": "Red Gold & Bold is a Kansas City focused Football Podcast. Jeff Chadiha (NFL Network/NFL.com), Sam McDowell (Kansas City Star) and Soren Petro (Sports Radio 810 - WHB) break down everything going on with the Kansas City Chiefs... Past, Present and Future. From last Sunday's game to the future of the Chiefs salary cap, it's all broken down by three of the most knowledgable football minds in the industry.",
        "id": 4240838,
        "author": "Soren Petro"
    },
    {
        "title": "Newsflash",
        "url": "https://www.spreaker.com/show/2206348/episodes/feed",
        "description": "Newsflash, hosted by Spenser Walsh is a progressive political podcast dedicated to exposing the truth about the world we live in today, through the use of great journalism, analysis and opinion from experts on the day's news. Newsflash has new episodes every Monday and Friday<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/newsflash--2206348/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/newsflash--2206348/support</a>.",
        "id": 1023508,
        "author": "Spenser Walsh"
    },
    {
        "title": "Yahoo Fantasy Forecast",
        "url": "https://feeds.simplecast.com/s3ulbOAs",
        "description": "Matt Harmon and the rest of Yahoo Sports’ world-class fantasy football experts dish out high-level fantasy advice on America’s top fantasy football platform. Matt, alongside Andy Behrens, Dalton Del Don & Scott Pianowski, brings you diverse insights and strategies to suit any play-style in a fantasy show guaranteed to make you a more informed manager. In your pocket and in your ears five days a week from August until the end of the regular season, listen to the Yahoo Fantasy Forecast on YouTube or wherever you get podcasts.",
        "id": 5009,
        "author": "Yahoo Sports"
    },
    {
        "title": "Rabbi Yaakov Wolbe Podcast Collection",
        "url": "http://jewishpodcast.org/index.php/feed/podcast/",
        "description": "The Rabbi Yaakov Wolbe Podcasts Collection gives you the opportunity to listen and enjoy to all the Torah & Insights from Rabbi Yaakov Wolbe in one feed. The The Parsha Podcast, Jewish History Podcast, The Mitzvah Podcast, This Jewish Life, TORAH 101 and The Ethics Podcast in one convenient place. Enjoy!",
        "id": 17529,
        "author": "TORCH"
    },
    {
        "title": "Dead Men Walking Podcast",
        "url": "https://feeds.buzzsprout.com/958282.rss",
        "description": "<p>Exploring theology, culture, and politics within a biblical and reformed worldview. Welcome to the Dead Men Walking Podcast. </p>",
        "id": 29600,
        "author": "Greg Moore Jr"
    },
    {
        "title": "Locked On NFL Draft - Daily Podcast On The NFL Draft, College Football & The NFL",
        "url": "https://feeds.simplecast.com/5ujc3Xhx",
        "description": "Locked On NFL Draft podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the National Football League Draft and all over the NFL. Hosted by Damian Parson, national scout at The Draft Network, and Keith Sanchez, a senior draft analyst for the Draft Network and 2019 LSU National Football Champion, the Locked On NFL Draft podcast brings the NFL draft to life daily with expert, local analysis, opinions, breaking news, special guests, and coverage of all aspects of the NFL and every college prospect. The Locked On NFL Draft podcast takes you beyond the big board for the inside scoops on the biggest stories from every NFL front office and all over the NFL. The Locked On NFL Draft podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 52687,
        "author": "Locked On Podcast Network, Damian Parson, Keith Sanchez"
    },
    {
        "title": "Bastards of Boston Baseball (Red Sox)",
        "url": "https://feeds.redcircle.com/e3f05fff-4434-4258-b139-7b17ccb6278b",
        "description": "We are the storytellers of the 2025 Boston Red Sox!",
        "id": 71844,
        "author": "Red Sox Podcast"
    },
    {
        "title": "Postcards From Midlife",
        "url": "https://rss.acast.com/postcardsfrommidlife",
        "description": "Are you living in a hormonal hothouse, feeling a little overwhelmed and in need of some positive, uplifting and comforting guidance on how to lead a more magnificent midlife? Well, you're not alone and this podcast is for you. Hosts Lorraine and Trish chat with celebrities and experts on all things midlife, from menopause and perimenopause to parenting teens via fashion, beauty, wellness, nutrition, fitness, careers, relationships and finances. The witty duo, who have been editing glossy magazines for more than two decades, have six children, two husbands, two dogs and one cat between them. They share their personal stories alongside the advice and wisdom of spirited women with extraordinary stories to tell. And they ask experts all the questions you need answered to have a healthier, happier and more harmonious second act. <hr><p style='color:grey; font-size:0.75em;'> Hosted on Acast. See <a style='color:grey;' target='_blank' rel='noopener noreferrer' href='https://acast.com/privacy'>acast.com/privacy</a> for more information.</p>",
        "id": 103003,
        "author": "Lorraine Candy & Trish Halpin"
    },
    {
        "title": "Breakpoint",
        "url": "https://colsoncenter.libsyn.com/rss",
        "description": "Join John Stonestreet for a daily dose of sanity—applying a Christian worldview to culture, politics, movies, and more. And be a part of God's work restoring all things.",
        "id": 161995,
        "author": "Colson Center"
    },
    {
        "title": "Locked On Falcons - Daily Podcast On The Atlanta Falcons",
        "url": "https://feeds.simplecast.com/l96cnojt",
        "description": "Locked On Falcons podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Atlanta Falcons and the National Football League. Hosted by football analyst Aaron Freeman, the Locked On Falcons podcast provides your daily Falcons fix with expert, local analysis, and coverage of all aspects of the Falcons franchise. Freeman provides film breakdowns, interviews and hot-button topics surrounding the Falcons. The Locked On Falcons podcast takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Falcons locker room and all over the NFL. The Locked On Falcons podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 165088,
        "author": "Locked On Podcast Network, Aaron Freeman"
    },
    {
        "title": "As The Story Grows",
        "url": "https://feeds.simplecast.com/T5FiyIM_",
        "description": "Discover Your Next Favorite Band!",
        "id": 173048,
        "author": "Bryan Patton"
    },
    {
        "title": "In Touch Ministries Daily Devotions",
        "url": "https://www.intouch.org/listen/podcast/daily-devotion/",
        "description": "Daily audio devotional from Charles Stanley’s In Touch Ministries.",
        "id": 174248,
        "author": "Dr. Charles Stanley"
    },
    {
        "title": "Leading The Way Radio",
        "url": "http://ltw.s3.amazonaws.com/podcast/ltw_audio.xml",
        "description": "Leading The Way with Dr. Michael Youssef is uniquely equipped to reach a global audience by using today’s technology to connect individuals with sound Biblical teaching—whether here at home or in closed countries and remote regions. Daily, Leading The Way is sharing the Gospel with the nations, broadcasting in multiple languages on radio and TV more than 13,000 times a week to audiences across 6 continents.",
        "id": 198802,
        "author": "Dr. Michael Youssef"
    },
    {
        "title": "Locked On Steelers – Daily Podcast On The Pittsburgh Steelers",
        "url": "https://feeds.simplecast.com/y_l5uReM",
        "description": "Locked On Steelers podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Pittsburgh Steelers and the National Football League. Hosted by Christopher Carter of the Pittsburgh Post-Gazette, and an extra on WPXI-TV and Steeler Nation Radio, the Locked On Steelers podcast provides your daily fix of the black and gold with expert, local analysis, opinions, breaking news, and coverage of all aspects of the legendary Steelers franchise. The Locked On Steelers podcast takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Steelers locker room and all over the NFL. The Locked On Steelers podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 203290,
        "author": "Locked On Podcast Network, Christopher Carter"
    },
    {
        "title": "Locked On NBA – Daily Podcast On The National Basketball Association",
        "url": "https://feeds.simplecast.com/XThpxTzR",
        "description": "The Locked On NBA podcast is your daily ticket to everything NBA. \nOn the daily Locked On NBA show, Matt Moore (Locked On Nuggets), Haize (Locked On Bulls), and Doug Branson (Locked On Hornets) discuss the latest news, rumors, analysis, and insider info in 30 minutes from all over the league.\nOn the Locked On NBA Game Night show, our group of local experts tackle \"Every Game, Every Night\" by literally covering every game 7 days a week from the Pre-season to the NBA Finals and beyond. Hosts Danny Cunningham (Locked On Cavs), Swipa (Locked On Nuggets), Nick Angstadt (Locked On Mavericks), Camille Davis (Locked On Bucks), Wes Goldberg (Locked On Heat), Tony East (Locked On Pacers), Jackson Gatlin (Locked On Rockets), David Ramil (Locked On Heat), John Karalis (Locked On Celtics), Jake Madison (Locked On Pelicans), Rylan Stiles (Locked On Thunder), Gavin Schall (Locked On Knicks), Haize (Locked On Bulls) & Swipa (Locked On Nuggets) will take you beyond the scoreboard with the best NBA analysts in the business. Part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 217331,
        "author": "Locked On Podcast Network"
    },
    {
        "title": "Sports Gambling Podcast Network",
        "url": "https://feeds.simplecast.com/RkSs4uS_",
        "description": "The Sports Gambling Podcast Network is your home for all your sports betting, gambling, and entertainment. Our team of degens have the most comprehensive sports and betting knowledge around. Whether it is data-driven or gut-handicapping, SGPN has you covered for all of your sports gambling needs, Degen Nation!\nCJ Sullivan of Bottom Line Bombs brings comedy and gambling picks for every sport. Justin Mark and Colby Dant talk about all things CFL on the CFL Gambling Podcast, while Philadelphia Eagles super-fan Sean Green chops it up on the Diehard Eagles Podcast. Need more football content? Join Dave Heilman for Five Minute Fantasy for all your fantasy football needs. Don’t forget to listen in to the Degen Docs with Sebastian Fearon, bringing you all the football injury news.\nWe also have Colby Dant and crew talking about every college football game on the industry-leading College Football Experience. The “Dantabase” Dant knows college football forward and backward. Also, make sure you tune in and check out the Big XII College Experience as well! And we are branching out to bring you the Stadium Heads show focusing on College Football stadiums AND the FCS College Football Experience too.\nMaybe the hardwood is more your speed? Join Munaf Manji and the rest of the NBA Gambling Podcast team to talk hoops. The team is live every day all season long. Do you prefer college? Colby and his team of degens also bring you the College Basketball Experience every night, from Midnight Madness to One Shining moment for all your college basketball gambling picks. Then, be sure to check out the WNBA Gambling Podcast all summer long to keep the winners flowing.\nLooking to lay some prop action? Munaf and his team of prop-betters have you covered with the Propcast! Whether it is NFL, NBA, or anything else, if there are props, they will talk about it. \nHave you heard about Underdog Fantasy? We have, and we love it. Join host Britton Hess as he talks daily about the best Underdog plays every day across all sports.\nDon’t forget about soccer, either! We deliver two soccer shows with distinct flairs and lots of knowledge on both. For all your soccer betting needs, subscribe to the Soccer Gambling Podcast with host Billi Bhatti. Billi delivers winners, and no one knows more about soccer worldwide than he does. If you want to lock in on the Premier League, join Mal and Baz for the Premier League Gambling Podcast as they back their boys and try to win a few pounds each week, too.\nAre you still reading this? Good! You should be because we have even MORE PODCASTS to bring you, which you can find on this feed.\nLooking to win with baseball betting? Check out Noah Bieniek’s College Baseball Experience all spring long as he wins you money all the way to Omaha. No one knows college baseball better than Noah. Then, join Munaf and the team for the MLB Gambling Podcast, delivering daily picks and plays for every MLB game all season.\nNeed more? Rod Villagomez and Cody Zeeb break down all the fast things on with the F1 Gambling Podcast and the NASCAR Gambling Podcast. If you like speed and cashing bets, then SGPN is the place for you. Oh, and The Wolf of Oaklawn hosts the Notorious OTB to deliver all the horse picks you need.\nRyan Gilbert and his crew of degens deliver bangers over on the Hockey Gambling Podcast. Whether the NHL or beyond, the gang’s all there, and they’re ready to scrap, bet, and laugh.\nThe Golf Gambling Podcast with Steve Schirmer, Boston Capper, and team are ready to deliver winners for every tournament and every prop they can find on the PGA or LIV tours all year. \nOh, and to wrap it up, you need to join Scott Reichel for the Tennis Gambling Podcast and Justin and Miranda Mark for the Old Fashioned Football Podcast. \nOH MY GOD, entering the octagon to knockout corporate gambling, it’s Gumby and Jeff Fox bringing you the MMA picks and bets you need. From UFC to beyond, Jeff and Gumby have you covered with the best mixed-martial-arts gambling podcast around.",
        "id": 233731,
        "author": "Sports Gambling Podcast Network"
    },
    {
        "title": "Locked On Tigers - Daily Podcast On The Detroit Tigers",
        "url": "https://feeds.simplecast.com/4elrfT1b",
        "description": "Locked On Tigers podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Detroit Tigers and Major League Baseball. Hosted by diehard Tigers fan Scott Bentley, the Locked On Tigers podcast provides your daily Tigers fix with expert, local analysis, and coverage of all aspects of the Motown franchise. Locked On Tigers takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Tigers locker room and all over MLB. The Locked On Tigers podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 243238,
        "author": "Locked On Podcast Network, Scott Bentley"
    },
    {
        "title": "MRN Classic Races",
        "url": "https://rss.art19.com/mrn-classic-races",
        "description": "Classic NASCAR races from the audio archives of The Motor Racing Network.",
        "id": 313631,
        "author": "Motor Racing Network"
    },
    {
        "title": "Time Sensitive",
        "url": "https://feeds.simplecast.com/P0r8htaw",
        "description": "Candid, revealing long-form conversations with leading minds about their life and work through the lens of time. Host Spencer Bailey interviews each guest about how they think about time broadly and how specific moments in time have shaped who they are today.\nExplore more at timesensitive.fm",
        "id": 342108,
        "author": "The Slowdown"
    },
    {
        "title": "The BUMP Podcast",
        "url": "https://anchor.fm/s/1ceb1894/podcast/rss",
        "description": "A place for Believers of the Unexplained, Monsters, and the Paranormal to share ideas and encounters about all that goes BUMP in the night.",
        "id": 449611,
        "author": "Bo Kennedy"
    },
    {
        "title": "Hood Politics with Prop",
        "url": "https://omnycontent.com/d/playlist/e73c998e-6e60-432f-8610-ae210140c5b1/7E1493C7-EBF2-4878-BD99-AE3900554DE8/71DDAB40-ADC1-47F6-B7DF-AE3900554DFF/podcast.rss",
        "description": "The political landscape can be confusing, but it doesn't have to be. If you've survived junior high, lived in an urban city or understand gang life, you can understand geopolitics. Join rapper and author Propaganda and his friends as they use their hood-knowledge to break down the political scene.",
        "id": 477090,
        "author": "Cool Zone Media and iHeartPodcasts"
    },
    {
        "title": "Locked On Flyers - Daily Podcast On The Philadelphia Flyers",
        "url": "https://feeds.simplecast.com/MjmHOhpH",
        "description": "Locked On Flyers podcast is the daily podcast that drops the puck and keeps you ahead of the game and the first to know the latest news, analysis, and insider info for the Philadelphia Flyers and the National Hockey League. Hosted by Rachel Donner with regular contributor, Russ Cohen, the Locked On Flyers podcast provides your daily Flyers fix with expert opinions, local analysis, and coverage of all aspects of the Flyers franchise from right here in the City of Brotherly Love. Locked On Flyers takes you beyond the ice for the inside scoops on the biggest stories from within the Flyers locker room and all over the NHL. The Locked On Flyers podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 477599,
        "author": "Locked On Podcast Network, Rachel Donner, Russ Cohen"
    },
    {
        "title": "Revive Our Hearts",
        "url": "https://cdn.reviveourhearts.com/podcasts/revive-our-hearts.rss",
        "description": "Are you a woman who wants to know God and live life His way? If so, Revive Our Hearts can help you. The host, Nancy DeMoss Wolgemuth, has an incredible passion and love for Jesus Christ and for women. Listen in to this nationally syndicated radio program heard each weekday on nearly 1,000 radio station outlets as Nancy interviews guests and teaches directly from God's Word. This is more than just a program--get ready for a personal, counter-cultural revolution in your heart and home!",
        "id": 481076,
        "author": "Nancy DeMoss Wolgemuth"
    },
    {
        "title": "Horrifying History",
        "url": "https://rss.pdrl.fm/47cc87/feeds.simplecast.com/Ru5wj5yU",
        "description": "Welcome to Horrifying History where you are about to hear about the unexplained, paranormal, and supernatural happenings that has stained the pages of history. \n\nDo you love the strange, the unexplained, and the downright terrifying?\nHorrifying History takes you on a chilling journey into the dark corners of the past, where history and horror collide.\n\nFrom haunted places and ghostly legends... to mysteries and terrifying true stories... you'll uncover the twisted facts that history books leave out.\n\nWho were the real monsters behind the infamous legends?\nWhat dark secrets lie buried in the pages of history?\n\nEvery episode, we reveal the eerie truths that will send shivers down your spine.\n\nAre you brave enough to face the darkness?\n\nHorrifying History available now, wherever you listen to podcasts.\n\nDon’t wait too long... the past might just come looking for you.\n\nListen, if you dare…",
        "id": 501220,
        "author": "Horrifying History, Bleav"
    },
    {
        "title": "Bill O’Reilly’s No Spin News and Analysis",
        "url": "https://feeds.megaphone.fm/RSV2429196838",
        "description": "<p>No Spin. Just Facts. Always looking out for you. Head to BillOReilly.com for more analysis.</p>",
        "id": 545008,
        "author": "Bill O'Reilly"
    },
    {
        "title": "The Mistress Carrie Podcast",
        "url": "https://feeds.megaphone.fm/mistresscarrie",
        "description": "<p>Mistress Carrie ™, host of the Mistress Carrie Radio Show, and Cocktails in the War Room, hosts this weekly podcast featuring interviews with up and coming artists, bands that you already know you love, backstage antics, lifestyle topics like travel, motorcycles, tattoos, and skydiving, plus she continues her extensive work with the U.S. military, veteran's community, and first responders. You never know what she's going to be talking about next! If Mistress Carrie thinks it rocks, it's on The Mistress Carrie Podcast! Plus get all of your Rock News, Music Headlines, and Industry Info every weekday, with the Mistress Carrie Situation Report! A proud member of The Pantheon Podcast Network! www.mistresscarrie.com</p>",
        "id": 552783,
        "author": "Mistress Carrie"
    },
    {
        "title": "Remember The Game? Retro Gaming Podcast",
        "url": "https://feeds.megaphone.fm/rememberthegame",
        "description": "<p>Comedian Adam Blank hosts \"Remember The Game?\", a retro gaming podcast. Each week, Adam and his guest will select a video game that they grew up playing, and spend time reminiscing about what they loved (or hated) about it. Not intended to be a history lesson, \"Remember The Game?\" is more like a conversation you'd overhear on the playground as a kid. The discussions are all over the place, and are guaranteed to fill you with that warm, nostalgic feeling. (Or rage, like you felt with the underwater level in the original Ninja Turtles game). Either way, it's gonna be fun! New episodes every Wednesday!</p>",
        "id": 568432,
        "author": "Adam Blank"
    },
    {
        "title": "Ongoing History of New Music",
        "url": "https://feeds.megaphone.fm/CORU5791969113",
        "description": "<p>Ongoing History of New Music looks at things from the alt-rock universe to hip hop, from artist profiles to various thematic explorations. It is Canada’s most well known music documentary hosted by the legendary Alan Cross. Whatever the episode, you’re definitely going to learn something that you might not find anywhere else. Trust us on this.</p>",
        "id": 636844,
        "author": "Curiouscast"
    },
    {
        "title": "Believer's Voice of Victory Audio Podcast",
        "url": "https://feeds.captivate.fm/bvov-audio/",
        "description": "Over the years, Kenneth and Gloria Copeland have delivered Bible-based teachings about faith, love, healing, prosperity, redemption, righteousness, the anointing and the principles of victorious Christian living. KCM has gone around the globe-from Alaska to Australia, from Eastern Europe to Africa, from remote islands in the Pacific to crisscrossing the United States-just to bring you the news that Jesus Is Lord, no matter where you are.\n           \n        With today's busy schedules, it may be difficult to find time to watch the Daily Believer's Voice of Victory broadcasts. That's why we've created this Podcast so that you can take advantage of these teachings by listening when it's convenient for you.\n        \n        Visit www.kcm.org for additional resources.",
        "id": 720257,
        "author": "Kenneth Copeland Ministries"
    },
    {
        "title": "Maxwell Leadership Podcast",
        "url": "https://johnmaxwellleadershippodcast.libsyn.com/rss",
        "description": "The Maxwell Leadership Podcast is a regular examination of what it means to be a transformational leader—someone who daily influences people to think, speak, and act to make a positive difference in their lives and in the lives of others. This podcast will teach you the principles, practices, and process of becoming a transformational leader because leadership isn’t an event—it’s an uphill journey. Every week we will offer a free tool to help you on this journey, so let leadership authority Dr. John C. Maxwell show you the way.",
        "id": 743519,
        "author": "John Maxwell"
    },
    {
        "title": "Top Traders Unplugged",
        "url": "https://feeds.captivate.fm/top-traders-unplugged/",
        "description": "Discover the fascinating world of investing with Niels Kaastrup-Larsen and his remarkable co-hosts. Each week, we bring you compelling conversations with legendary investors, leading economists, masterful traders, and forward-thinking thought leaders. From Trend Following and Global Macro to Geo-Politics, Commodities, Quant Investing, Crypto, and Volatility, we uncover the strategies, stories, and lessons behind their success. Gain actionable insights from industry veterans as we celebrate their achievements and learn from their challenges. Stay ahead in the ever-evolving landscape of investing - tune in weekly and elevate your financial knowledge. For the latest episodes and expert insights, visit https://toptradersunplugged.com",
        "id": 761537,
        "author": "Niels Kaastrup-Larsen"
    },
    {
        "title": "Spenny and the Nets",
        "url": "https://feeds.buzzsprout.com/2370440.rss",
        "description": "<p>Spenny and the Nets is the ultimate Brooklyn Nets podcast for every Nets fan, whether you're a lifelong or a newbie!  <br><br>Tune in weekly with host Spen Harris! </p>",
        "id": 763600,
        "author": "Spen Harris"
    },
    {
        "title": "The Ten Minute Bible Hour Podcast",
        "url": "https://thetenminutebiblehourpodcast.libsyn.com/rss",
        "description": "Welcome! You can start with today's episode or go back to the beginning of any of these five seasons:\nSeason 1 - Matthew (Began October, 2019 - Episodes 1-800)\nSeason 2 - One Book of the Bible Per Day (Began January, 2023)\nSeason 3 - Esther (Began April 9, 2023)\nSeason 4 - Nehemiah (Began January 1, 2024)\nSeason 5 - Galatians (Current Season Began August 26, 2024)\nYou can also check out the daily audio-only podcast on YouTube here: https://www.youtube.com/@TenMinuteBibleHour\nHey I'm Matt, and if you're interested in understanding the Bible better and you prefer your Christianity quick and punchy with a healthy side of humor, and an equally healthy side of me not telling you what to do, we're probably going to get along great. This is my podcast where we pick a book of the Bible and then break it down one part at a time every weekday morning.",
        "id": 764167,
        "author": "Matt Whitman"
    },
    {
        "title": "Creative Pep Talk",
        "url": "https://feeds.megaphone.fm/TPG2212080179",
        "description": "<p>A Weekly Podcast Companion for Your Creative Journey</p><p>Transform your creative potential into reality by making your creativity a practice. A “creative discipline” can feel like an oxymoron. Creativity is about doing something new. Discipline is about doing something consistently. The aim of this podcast is to help you strike that elusive balance. </p><p>Each week, New York Times Bestselling Author Illustrator Andy J. Pizza shares everything he’s learning about building a thriving creative practice. Through solo episodes and interviews with top-tier creatives, Pizza brings you the strategies and stories that you need week in and week out to keep your inner critic at bay, bust through creative blocks and stay creatively pepped to the max!!</p><p><br></p><p>Learn more: creativepeptalk.com</p><p>Check out the host: andyjpizza.com</p>",
        "id": 838349,
        "author": "Andy J. Pizza"
    },
    {
        "title": "Daily TV Mass",
        "url": "https://feeds.buzzsprout.com/949645.rss",
        "description": "Warming Faithful Hearts. The NCBC provides access to the Daily TV Mass as a way for our community to stay near to the Church and our Catholic Faith. ",
        "id": 840678,
        "author": "National Catholic Broadcasting Council"
    },
    {
        "title": "Locked On Celtics - Daily Podcast On The Boston Celtics",
        "url": "https://feeds.simplecast.com/0y5b2GMh",
        "description": "Locked On Celtics podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Celtics and the NBA. Hosted by Boston Sports Journal beat writer John Karalis, the Locked On Celtics podcast provides expert, local analysis from a former basketball player who is at all practices and games. The Locked On Celtics podcast takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Celtics locker room and all over the NBA. The Locked On Celtics podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 845798,
        "author": "Locked On Podcast Network, John Karalis"
    },
    {
        "title": "Hammer Lane Legends",
        "url": "https://audioboom.com/channels/5015736.rss",
        "description": "",
        "id": 867211,
        "author": "Merkel Media"
    },
    {
        "title": "Locked On Red Wings - Daily Podcast On The Detroit Red Wings",
        "url": "https://feeds.simplecast.com/LoyiY2gk",
        "description": "Locked On Red Wings podcast is the daily podcast that drops the puck and keeps you ahead of the game and the first to know the latest news, analysis, and insider info for the Detroit Red Wings and the National Hockey League. Hosted by Radio podcast producer Brian Fisher and Detroit News journalist Scott Bentley, the Locked On Red Wings podcast provides your daily Red Wings fix with expert opinions, local analysis, bad jokes, amazing guests (like Moritz Seider, Darren McCarty and Keith Gave) and coverage of all aspects of the Red Wings franchise and their 11 Stanley Cups. The Locked On Red Wings podcast takes you beyond the ice for the inside scoops on the biggest stories from within the Red Wings locker room and all over the NHL. The Locked On Red Wings podcast is part of the Locked On Podcast Network. Your team. Every day.",
        "id": 884931,
        "author": "Locked On Podcast Network, Brian Fisher, Scott Bentley"
    },
    {
        "title": "Knicks Film School",
        "url": "https://rss.pdrl.fm/58a028/feeds.simplecast.com/4Plw6lQm",
        "description": "The official podcast of Knicks Film School - where fans learn about the New York Knicks!",
        "id": 896394,
        "author": "Blue Wire"
    },
    {
        "title": "Live in the Light Daily Broadcast",
        "url": "https://feeds.castos.com/om012",
        "description": "Listen to daily messages from Pastor Robbie Symons and the Live in the Light team. \n\nLive in the Light is a ministry of Hope Bible Church Oakville.",
        "id": 938309,
        "author": "Live in the Light"
    },
    {
        "title": "Fight For Your Marriage Podcast",
        "url": "https://fightforyourmarriage.libsyn.com/rss",
        "description": "Is there hope for my hurting marriage? Can my marriage be restored? How do we heal as a couple after a divorce?\n\nWelcome to the Rejoice Marriage Ministries podcast where your host, Charlyne Steinkamp, will answer these questions and others as she helps you gain hope for your marriage. You will be encouraged as you begin to see your spouse as the Lord sees them and the hope that you can have for your marriage to be healed and all that God intended it to be!",
        "id": 939389,
        "author": "Rejoice Marriage Ministries"
    },
    {
        "title": "Locked On Heat - Daily Podcast On The Miami Heat",
        "url": "https://feeds.simplecast.com/lHa4Xho2",
        "description": "Locked On Heat podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Miami Heat and the NBA. Hosts David Ramil and Wes Goldberg provide expert, local analysis and break down every game. Locked On Heat takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Heat locker room and all over the NBA. The Locked On Heat podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 1045113,
        "author": "Locked On Podcast Network, Wes Goldberg, David Ramil"
    },
    {
        "title": "We Got This with Mark and Hal",
        "url": "https://feeds.simplecast.com/OVap9of7",
        "description": "Each week, actors Mark Gagliardi and Hal Lublin (Drunk History, The Thrilling Adventure Hour, Welcome to Night Vale) sit down to settle all the small debates that are a big deal to YOU - once and for all. No subject is too small for Mark and Hal to tackle! Even though you may think it's an impossible puzzle to solve, don't worry... We Got This",
        "id": 1055001,
        "author": "Hal Lublin and Mark Gagliardi"
    },
    {
        "title": "Reformed Brotherhood | Reformed Theology and Brotherly Love",
        "url": "https://reformedbrotherhood.libsyn.com/rss",
        "description": "Honor Everyone, Love the Brotherhood\nHey brother! When you join the Church, you join a family. The Reformed Brotherhood delivers a definitive episode each week that will have you so excited you’ll feel like running through a wall. Hosted by Jesse and Tony, who have over 400 episodes under their belts, our podcast offers a confessional approach to exploring Reformed doctrines, church history, and practical Christian living, all grounded in the teachings of the Bible.\nJoin us as we dive into rich discussions, featuring insights from our friend Reginald and unique “Fergusonisms,” while tightly coupling these elements for a deep understanding of our faith. Subscribe, become a patron, share the episodes, and connect with our community in the lively Telegram chat!",
        "id": 1058962,
        "author": "Tony Arsenal and Jesse Schwamb"
    },
    {
        "title": "Supply Chain Now",
        "url": "https://feeds.captivate.fm/supply-chain-now/",
        "description": "Discover why Supply Chain Now is the #1 Voice of Supply Chain. Our hosts comprised of seasoned industry-leaders, practitioners, and solution providers address the industry’s challenges, trends, and innovations for our global audience. With engaging, informative, and on-trend content, our podcasts, livestreams, and webinars bridge expertise and entertainment, empowering supply chain professionals to elevate their businesses. Listen, watch, and subscribe to the #1 Supply Chain Podcast on Apple Podcasts, ranked in the Top 1% of all Global Podcasts!",
        "id": 1065092,
        "author": "Supply Chain Now"
    },
    {
        "title": "The Pool Guy Podcast Show",
        "url": "https://feeds.buzzsprout.com/110832.rss",
        "description": "<p>In this podcast I cover everything swimming pool care-related from chemistry to automatic cleaners and equipment. I focus on the pool service side of things and also offer tips to homeowners. There are also some great interviews with guests from inside the industry. </p>",
        "id": 1121640,
        "author": "David Van Brunt"
    },
    {
        "title": "The Zero to Finals Medical Revision Podcast",
        "url": "https://feeds.buzzsprout.com/223820.rss",
        "description": "Hello and welcome to the Zero to Finals podcast. My name is Dr Thomas Watchman. I am a GP in the UK and I love creating educational material for studying medicine. This podcast is designed to be a time-efficient revision tool to help you study for your medical exams. Each podcast leads on from the next and each season tackles a different area of medicine. The podcast supplements the material available on the www.zerotofinals.com website, in the Zero to Finals books and on the Zero to Finals YouTube channel. Whilst listening to a podcast you can follow along with written information and illustrations on the Zero to Finals website or books. You can also find Zero to Finals on instagram, Facebook and twitter. If you have any comments, suggestions or want to get in touch you can email me at tom@zerotofinals.com.Enjoy the show!",
        "id": 1153356,
        "author": "Thomas Watchman"
    },
    {
        "title": "The Cordial Catholic",
        "url": "https://feeds.buzzsprout.com/268742.rss",
        "description": "<div>A podcast for non-Catholics, new Catholics, or anyone interested in digging deeper into the Catholic faith. Hosted by Keith Little, a non-denominational Evangelical convert to Catholicism.</div>",
        "id": 1167389,
        "author": "Keith Little"
    },
    {
        "title": "Mere Christians",
        "url": "https://feeds.simplecast.com/36A_UalZ",
        "description": "How does the gospel influence the work of Mere Christians—those of us who aren’t pastors or religious professionals, but who work as entrepreneurs, baristas, and accountants? That’s the question this podcast explores every week as Jordan Raynor interviews guests across the widest variety of vocations.",
        "id": 1188235,
        "author": "Jordan Raynor"
    },
    {
        "title": "The Commercial Break",
        "url": "https://feeds.megaphone.fm/tcb",
        "description": "<p>The Commercial Break is a podcast. It is summarized by an A.I. chat bot like this: \"\"TCB is an improv-comedy, interview, and variety podcast hosted by longtime best friends Bryan Green and Krissy Hoadley. Often described as the \"Cheesecake Factory of comedy podcasts,\" it’s a show that proudly embraces its chaotic, unpolished charm—self-aware that it’s \"just FINE\" and not for everyone. Airing Tuesday through Friday, the duo dives into their quirky friendship, blending twisted humor with discussions on pop culture, internet oddities, relationship drama, and dark comedy. They also have celebrity guests each Tuesday, play games and offer intentionally half-baked responses to listener questions and comments, creating a vibe that feels like a casual, irreverent escape from everyday life.</p><p>The podcast features a mix of standalone episodes and a Tuesday \"TCB Infomercial\" series, where they bring in notable guests—think comedians like Ron Funches, Ari Shaffir, Hannah Berner, Steve-O, Tom Papa or Felipe Esparza—to riff on everything from personal anecdotes to absurd life experiences. Show topics can range from the mundane (spam texts, bad dating advice) to the bizarre (Mountain Monsters, Naked Attraction reactions), often veering into unexpected tangents that highlight their offbeat chemistry. It’s less about structure and more about the raw, relatable banter between two people who’ve known each other for decades, making listeners feel like they’re eavesdropping on a hilarious, unfiltered conversation.\"\"</p><p>Thanks you silly chat bot! Wah-bam!!</p>",
        "id": 1228059,
        "author": "Comedy Podcast | Commercial Break LLC"
    },
    {
        "title": "Encounter the Truth",
        "url": "https://anchor.fm/s/2ed4a174/podcast/rss",
        "description": "Through faithful teaching of the Scriptures, we seek to facilitate encounters with the truth of God’s Word – and ultimately, with the Lord Jesus Christ, who is the Truth that came down from heaven. Our prayer is that those who do not yet know Jesus will come to a saving knowledge of the truth, that believers will be grounded in the truth, and that local churches will be encouraged in their witness to the truth.",
        "id": 1283774,
        "author": "Jonathan Griffiths"
    },
    {
        "title": "For the Love of Yoga with Nish the Fish",
        "url": "https://feeds.buzzsprout.com/1485745.rss",
        "description": "The world of Yoga is wide and varied. In this podcast, yogi Nish the Fish shares the deeper dimensions of Yoga, Vedanta and Tantra, asking the big questions: why do we practice? What is meditation? What is the purpose of a human life? What is Beauty? What is Death? Nishanth Selvalingam studied various South Asian philosophies with his Shaivite grandfather in an ashram in Kuala Lumpur, Malaysia and moved to Los Angeles to study philosophy, teach yoga and play guitar in a rock band. Join him and special guests as they explore Yoga, in all its splendours. For more episodes and instruction, and to support this humble offering of the heart, visit me on Patreon: patreon.com/yogawithnish ",
        "id": 1378531,
        "author": "Nishanth Selvalingam"
    },
    {
        "title": "Healthy But Human",
        "url": "https://feeds.redcircle.com/801c4a04-908e-444f-854d-e1353ec201f1",
        "description": "Looking for a relatable health and wellness podcast that feels like you're facetiming your bestie and having an honest convo about all things faith, fitness, relationships, mental health and navigating your twenties? Grab your oat milk latte and take a hot girl walk with Callie Gualy (formerly Callie Jardine) your new healthy but human bestie. In her podcast, Callie shares relatable moments and struggles, showing you that you don't have to live a perfectly aesthetic Pinterest life to still be the best version of you that God designed you to be.",
        "id": 3465954,
        "author": "Callie Jardine-Gualy"
    },
    {
        "title": "Al Ahly Pharos",
        "url": "https://feeds.buzzsprout.com/1830222.rss",
        "description": "Welcome to our daily podcast featuring the day's top news commentary and technical recommendations delivered to you before the opening bells of the Egyptian Stock Exchange (EGX).Alongside our morning podcasts, we will be publishing a collection of episodes presenting indepth analysis and insights on EGX's equities, all brought to you by Al Ahly Pharos.",
        "id": 4124751,
        "author": "Al Ahly Pharos"
    },
    {
        "title": "Daily Devotions With Pastor Robert Maasbach",
        "url": "https://feeds.buzzsprout.com/1849910.rss",
        "description": "<p>Daily Devotionals With Pastor Robert Maasbach of Life Church Folkestone are around 15-20 minutes of devoted time to the lord where the listener can reflect and discover the grace of God through Pastor Robert's teachings.<br>Pastor Robert Maasbach has been a pastor for over 30 years and preached all over the world.<br>Using these devotions he imparts the wisdom he has gained from all of his experiences and helps and encourages the listener to delve deeper into the heart of God and the Holy Spirit.</p>",
        "id": 4274152,
        "author": "Robert Maasbach"
    },
    {
        "title": "Moriel Ministries",
        "url": "https://feeds.buzzsprout.com/1857736.rss",
        "description": "Moriel Ministries is active in the area of discernment withstanding the popular apostasy in the contemporary church that The Word of God warns would precede the return of Jesus. We remain firmly aligned to the conviction that contemporary events in The Middle East , Europe, and in the church make the present time in history different from other eras when people thought it was the last days. We affirm the belief that Jesus is coming again and prophecy of His return is radically being fulfilled increasingly.",
        "id": 4320960,
        "author": "MorielTV"
    },
    {
        "title": "LOVERS by shan",
        "url": "https://audioboom.com/channels/5085699.rss",
        "description": "",
        "id": 4367835,
        "author": "LOVERS by shan"
    },
    {
        "title": "Tales from the Backlog",
        "url": "https://feeds.fireside.fm/talesfromthebacklog/rss",
        "description": "A video games podcast where Dave Jackson and guests break down and discuss the games they play. Each episode looks at one game in depth, focusing on mechanics, story, music and other aspects, with no spoilers until a clearly marked spoiler wall in the middle.",
        "id": 4426546,
        "author": "David Jackson"
    },
    {
        "title": "It Is Taught Tanya Podcast",
        "url": "https://feeds.buzzsprout.com/1883130.rss",
        "description": "Daily Teachings from the Tanya by Rabbi Schneur Zalman of Liadi (AKA “The Alter Rebbe”)In loving memory of Avraham Yitzchok ben Binyamin HaCohen Z”L",
        "id": 4484818,
        "author": "Sarede"
    },
    {
        "title": "Traction",
        "url": "https://feeds.cohostpodcasting.com/GR6RmIGj",
        "description": "On the Traction Podcast, we bring you discussions with founders and CXOs of the fastest-growing companies in technology, covering everything from product, marketing, innovation, fundraising and more through proven strategies for rapid growth.\n\n\nPresented by:\nBoast.AI R&D Tax Credit Software - https://boast.ai\nLaunch - https://www.launchacademy.ca\nTraction Community - https://tractionconf.io",
        "id": 4487336,
        "author": "Lloyed Lobo"
    },
    {
        "title": "Cryptids Of The Corn",
        "url": "https://feeds.redcircle.com/1b4c3586-ab25-4a39-a4f1-43019f2e1871",
        "description": "Welcome to Cryptids of the Corn! We are a couple of buddies with a shared interest in the cryptozoological, paranormal and the plain strange. We focus on the Midwest and the Appalachia regions of the U.S and venture out of those borders. We cover big cryptids, one off cryptids, some big questions on the subjects of the strange, interviews with eyewitnesses and a little bit of a science lesson. We invite you on this journey with us thru this strange, wonderful world of ours. Find us on Facebook and other social media or email us at hardinbigfoot@gmail.com. Find us where you listen to podcasts.",
        "id": 4552366,
        "author": "Cryptids of the Corn Podcast"
    },
    {
        "title": "The Midnight Project Techno Music",
        "url": "https://feeds.captivate.fm/the-midnight-project/",
        "description": "Welcome to The Midnight Project, a weekly techno music podcast hosted by renowned DJ and producer Sebastiaan Hooft.\nEach episode is a carefully curated journey through the pulsating world of techno, featuring fresh releases, hidden gems, and timeless classics. Immerse yourself in the energetic rhythms and hypnotic beats that define this genre as Sebastiaan expertly blends tracks to create an unforgettable listening experience.\nWhether you're a techno enthusiast or a newcomer, The Midnight Project is your one-stop destination for the best in techno music. With his unique perspective and in-depth knowledge, you'll better appreciate the music and the people behind it.\nAs a charted show on 1001 Tracklists, The Midnight Project has garnered a loyal following of fans who appreciate Sebastiaan's passion for quality techno and his ability to introduce them to new sounds. Each episode is designed to transport you to the dancefloor's heart, whether at home, the gym, or on the go.\nSubscribe now and join the growing community of listeners discovering techno through The Midnight Project. Don't miss an episode, and be sure to share your thoughts and favorite tracks with Sebastiaan on social media using the hashtag #TheMidnightProject.\nExperience the exciting techno world with Sebastiaan Hooft – press play and let the journey begin!",
        "id": 5317941,
        "author": "Sebastiaan Hooft"
    },
    {
        "title": "Fox Weather Update",
        "url": "https://feeds.megaphone.fm/FOXM1453943228",
        "description": "<p>America's Weather Team is now in the palm of your hand. Utilizing the resources of over 100 meteorologists! Get <a href=\"https://foxweather.com\">FOX Weather</a> Updates throughout your busy day, every day, during every daypart, 24/7/365 on The FOX Weather Podcast!</p>",
        "id": 5392477,
        "author": "Fox Weather"
    },
    {
        "title": "The Dirt on Flowers",
        "url": "https://feeds.captivate.fm/thedirtonflowers/",
        "description": "Learn from our mistakes as we talk business, marketing, and growing techniques to help you create the farm of your dreams. So, let's roll up our sleeves and get the dirt on flowers!",
        "id": 5452673,
        "author": "Shannon Allen and Lyndsay Biehl"
    },
    {
        "title": "The Careless Talk Climbing Podcast",
        "url": "https://feeds.buzzsprout.com/1996606.rss",
        "description": "<p>Aidan Roberts and Sam Prior host this climbing-themed podcast that kind of goes where it goes. Lots of tangents and rambles as well as hopefully thought provoking questions. Sometimes it's very focussed on climbing, sometimes climbing barely comes up. The guests tend to be elite level climbers, but we often willingly get lost in the weeds and end up wildly off-topic. If you're enjoying our podcast and would like to support it: https://www.patreon.com/user?u=70353823</p>",
        "id": 5485976,
        "author": "Sam Prior & Aidan Roberts"
    },
    {
        "title": "Antiwar News With Dave DeCamp",
        "url": "https://feeds.buzzsprout.com/2017881.rss",
        "description": "A daily summary of the top U.S. foreign policy news stories from an antiwar, non-interventionist perspective with Antiwar.com News Editor Dave DeCamp",
        "id": 5576269,
        "author": "Dave DeCamp"
    },
    {
        "title": "THE DR. BETH'S podcast",
        "url": "https://feeds.buzzsprout.com/2051532.rss",
        "description": "Afro-Centric Economic, Socio-Cultural and Empowerment discussion podcast.",
        "id": 5695299,
        "author": "Dr. Beth"
    },
    {
        "title": "The XB2 — A Gaming Podcast",
        "url": "https://feeds.megaphone.fm/NSR2628308212",
        "description": "<p>The world's best gaming podcast is here: The XB2. 😎 Connect with us at <a href=\"http://TheXB2.com\">TheXB2.com</a>, for YouTube, Discord, Patreon, and much more. Also known as The Xbox Two, we're an Xbox and Windows PC-oriented gaming podcast featuring \"The Xbox Two!\" We're two Xbox super fans and industry analysts, Jez Corden of WindowsCentral.com and YouTuber Rand Al Thor 19. Every Friday, we discuss the week's gaming news, share exclusive information, and offer unique insights, with some good humor along the way. </p>",
        "id": 5747788,
        "author": "Rand & Jez"
    },
    {
        "title": "Journey Through Scripture",
        "url": "https://feeds.simplecast.com/fTDQ7O4C",
        "description": "A commentary on the entire Bible, one day at a time, to grow in wisdom and understanding of God's Word.",
        "id": 5928476,
        "author": "Doug Becker"
    },
    {
        "title": "MercyCast",
        "url": "https://feeds.redcircle.com/34f61a49-2c28-4d65-818b-789ad650c801",
        "description": "Have you ever hit a wall and asked yourself, \"What do I do now? How will I ever get past this?\" If you are human and have a pulse, you probably have. The MercyCast is a podcast dedicated to learning the subtle art of compassion through the adversity of everyday life. Join Raleigh Sadler, the host, as he has honest and thought-provoking conversations with friends he has met along the way. Each Wednesday, listen to the encouraging true stories of people, like you and me, who are learning compassion through hard times. For more information and show notes, go to mercycast.com.",
        "id": 6009527,
        "author": "Let My People Go"
    },
    {
        "title": "說品酒 Vinovoices",
        "url": "https://feeds.buzzsprout.com/2179789.rss",
        "description": "<p>分享日常品酒的產區、酒莊、葡萄品種特色、品飲感想再額外參雜一點點品酒教學。<br><br>節目一集約5-10分鐘，每週三更新，適合在通勤、摸魚、放空時無壓力收聽。<br><br>未滿十八歲🔞禁止飲酒•禁止酒駕<br><br>Instagram | Facebook | Apple Podcast | Spotify | YouTube <br>搜尋：說品酒 Vinovoices </p>",
        "id": 6334960,
        "author": "KK Kallen"
    },
    {
        "title": "All Apologies Podcast",
        "url": "https://feeds.buzzsprout.com/2185213.rss",
        "description": "<p>Go on an apology tour!  Trucker Andy and Joe 6 Pack poke holes and fun at celebrities, athletes and politicians that beg for forgiveness. </p>",
        "id": 6357942,
        "author": "Andrew"
    },
    {
        "title": "Evangelio del día",
        "url": "https://feeds.buzzsprout.com/2197801.rss",
        "description": "<p>Meditaciones diarias de la Palabra De Dios. <br>Por: Fr. Jonathan Vásquez, O. de M.</p>",
        "id": 6406385,
        "author": "Fr. Jonathan Vásquez, O. de M."
    },
    {
        "title": "NYPTALKSHOW Podcast",
        "url": "https://feeds.buzzsprout.com/2227857.rss",
        "description": "<p>NYPTALKSHOW: Where New York Speaks<br><br>Welcome to NYPTALKSHOW, the podcast that captures the heartbeat of New York City through candid conversations and diverse perspectives. Every week, we dive into the topics that matter most to New Yorkers—culture, politics, arts, community, and everything in between.<br><br>What to Expect:<br>    •    Engaging Interviews: Hear from local leaders, activists, artists, and everyday citizens who shape the city’s narrative.<br>    •    In-Depth Discussions: We unpack current events, urban trends, and community issues with honesty and insight.<br>    •    Unique Perspectives: Experience the vibrant tapestry of New York through voices that reflect its rich diversity.<br><br>Whether you’re a lifelong New Yorker or just curious about the city’s dynamic energy, join us as we explore what makes New York, New York—one conversation at a time.<br><br>Tune in and let your voice be part of the dialogue on NYPTALKSHOW.</p>",
        "id": 6608821,
        "author": "Ron Brown and Mikey Fever aka Sour Micky"
    },
    {
        "title": "The Hillsdale College Online Courses Podcast",
        "url": "https://www.omnycontent.com/d/playlist/0c7e618e-d306-498b-89ea-af55014957fe/1d7d34d3-8828-4090-ae8c-b07d0131af41/7d2973c6-f9b9-4a28-a5cb-b07d0133889b/podcast.rss",
        "description": "Hillsdale College was founded in 1844 with a mission to provide \"all who wish to learn\" the education necessary to preserve the civil and religious liberties of America. This Podcast, hosted by Hillsdale Online Learning Directors Kyle Murnen and Juan Davalos, expands that mission to a whole new audience. The Hillsdale Online Courses Podcast brings free, full online courses to your podcast feed, with introductory commentary.",
        "id": 6618646,
        "author": "Hillsdale College"
    },
    {
        "title": "Whistle Talk",
        "url": "https://anchor.fm/s/f24e4dd0/podcast/rss",
        "description": "Inside the Mind of a Football Official\nAn inside look at the world of Football Officials. Interviews and content related to officiating the greatest team sport around. Mike D the Referee will bring you information ranging from Penalties, current game content, to how you can become an official yourself. From youth, high school, college to the NFL, Mike D will help give you the insight of what goes on Inside the Mind of a Football Official.\nAnd be sure to follow on TikTok @mike.d.the.referee On Instagram @mikedthereferee and Youtube https://www.youtube.com/@MikeDtheReferee and X @MikeDtheReferee",
        "id": 6801341,
        "author": "Mike D the Referee"
    },
    {
        "title": "Todays Prepper",
        "url": "https://feeds.captivate.fm/todays-prepper/",
        "description": "As a Navy veteran turned homesteader and survivalist, I am dedicated to mastering the art of self-sufficiency one day at a time. My journey has equipped me with valuable skills and knowledge that I am eager to share with you. From growing your own food to building sustainable systems, I believe that anyone can thrive off the grid with the right guidance and determination. Join me as we explore practical techniques, reliable resources, and the rewarding lifestyle of living in harmony with nature. Together, we can cultivate resilience and independence in our lives! RSSVERIFY ",
        "id": 6833201,
        "author": "gloryroad56"
    },
    {
        "title": "Is This A Great Game, Or What?",
        "url": "https://feeds.simplecast.com/bIsbukFs",
        "description": "Hall of Fame Baseball Writer Tim Kurkjian is joined by his son, Jeff, as they chat all things baseball. Each week you will hear from one of the sport's most storied experts on the history of the game and how it pertains to today. Plus, every week they will be joined by a guest. Without a question, there will be plenty of father-son prodding throughout the show!",
        "id": 6845774,
        "author": "Tim Kurkjian, Jeff Kurkjian"
    },
    {
        "title": "Daybreak Devotions and Nighttime Prayers",
        "url": "https://feeds.transistor.fm/daybreak-devotions-and-nighttime-prayers",
        "description": "Experience God’s Word and renew your walk with Him with Daybreak Devotions and Nighttime Prayers - a daily devotional for Christian women by authors on Crossmap.com. We’re excited to deliver encouragement, guidance, and biblical truths right to you each morning and evening. When you subscribe to Crossmap Daybreak Devotions and Nighttime Prayers, you’ll get access to morning devotionals and evening prayers, composed of personal stories and testimonies of faith and encouragement.",
        "id": 6953385,
        "author": "Crossmap"
    },
    {
        "title": "Liama Podcast",
        "url": "https://feeds.buzzsprout.com/2399337.rss",
        "description": "<p>Tamamaa Podcast's a show about interesting game entertainment has just launched</p>",
        "id": 7000605,
        "author": "Liama Podcast"
    },
    {
        "title": "NPR News Now",
        "url": "https://www.spreaker.com/show/6304648/episodes/feed",
        "description": "The latest news in five minutes. Updated hourly.",
        "id": 7041115,
        "author": "tester"
    },
    {
        "title": "WGKM",
        "url": "https://feeds.godcaster.fm/player_3.xml",
        "description": "The first Podcasting 2.0 player designed exclusively for Christian media and ministry!",
        "id": 7045677,
        "author": "KGOR Radio"
    },
    {
        "title": "Shine FM",
        "url": "https://feeds.godcaster.fm/player_20.xml",
        "description": "Shine FM Safe & Fun for the whole Family. Bringing you positivity and encouragement while also sharing the love of Jesus Christ.",
        "id": 7066841,
        "author": "Touch Canada"
    },
    {
        "title": "The Light",
        "url": "https://feeds.godcaster.fm/player_53.xml",
        "description": "The Light is a Contemporary Christian talk radio with positive, uplifting and inspirational programs broadcasting throughout Southern Alberta",
        "id": 7097537,
        "author": "Touch Canada"
    },
    {
        "title": "The Whole Truth: Leadership Stories with Sarah Perugia",
        "url": "https://feeds.captivate.fm/leadership-stories-sarah-perugia/",
        "description": "Welcome to Leadership Stories with Sarah Perugia, where each week, the show dives into unscripted, candid conversations with female leaders who share their stories, learnings, and wisdom to empower and inspire others on their leadership journeys. This first series, Women on a Mission, highlights women in leadership who are dedicated to creating change within their organisations and beyond. \nThrough the power of storytelling, this podcast reminds us of the strength we gain from hearing the real-life experiences of others – leaving you feeling energised and reassured you are not alone in the challenges you face. \nHosted by Sarah Perugia, an expert women-in-leadership coach, whole-person leadership transformation specialist, and captivating speaker, this podcast will help you build confidence, empower you to take action and discover joy in your leadership journey. \nIf you’re looking for inspiration, practical advice, and stories that resonate, this podcast is for you.\nwww.sarahperugia.com",
        "id": 7098484,
        "author": "Sarah Perugia"
    },
    {
        "title": "Karen Hunter Is Awesome!",
        "url": "https://feeds.simplecast.com/odA5Ge8K",
        "description": "Some things just shouldn't be discussed on the radio. \"This is my space to explore those topics,\" said Karen. Host of “The Hottest Show in the Galaxy” on SiriusXM (Ch. 126, M-F, 3-6 p.m. ET), Karen dives deep into everything from Bible prophesy to the purpose of race to what TV shows and movies we should be watching. This podcast also includes some of the most compelling interviews with some of the most awesome people of our time.",
        "id": 7113592,
        "author": "Women's Empowerment Network, SiriusXM"
    },
    {
        "title": "Velvet Rope Playbook",
        "url": "https://feeds.captivate.fm/velvet-rope-playbook/",
        "description": "Welcome to The Velvet Rope Playbook, where stories of affluent marketing take center stage. Dive into the lives of fascinating characters, explore the opulent worlds they inhabit, and uncover lessons on exclusivity, influence, and the subtle strategies behind successful branding. Through tales brimming with wit, intrigue, and charm, Mark Satterfield offers insights into what truly resonates with the affluent. Whether you’re seeking inspiration, actionable advice, or simply a delightful escape, The Velvet Rope Playbook delivers stories that educate, entertain, and elevate your approach to marketing in the world of luxury.\nCatch all the episodes at http://VelvetRopePodcast.com and claim your FREE copy of my #1 Amazon Best Seller, The Affluent Marketing Blueprint—your guide to attracting wealthy clients.\nThe Velvet Rope Playbook is an independent production and is not affiliated with or endorsed by any other organization.\"",
        "id": 7145331,
        "author": "Mark Satterfield"
    },
    {
        "title": "In Touch",
        "url": "https://feeds.godcaster.fm/player_184.xml",
        "description": "",
        "id": 7158943,
        "author": "Inspire.FM"
    },
    {
        "title": "Live in The Light",
        "url": "https://feeds.godcaster.fm/player_191.xml",
        "description": "",
        "id": 7158954,
        "author": "Inspire.FM"
    },
    {
        "title": "Ambassador Programs",
        "url": "https://feeds.godcaster.fm/player_236.xml",
        "description": "From new voices to legacy ministries – these broadcast programs are some of the best available in Christian radio today, representing a broad spectrum of topics and formats.  In this list you’ll find many award-winning broadcasts and new favorites.  Explore and select programs we know will meet with your high standards for content and production quality . . . and that your listeners will love!",
        "id": 7169050,
        "author": "Ambassador"
    },
    {
        "title": "Tanya Thoughts",
        "url": "https://feeds.transistor.fm/tanya-thoughts",
        "description": "A brief life lesson from the daily section of Tanya Study",
        "id": 7176431,
        "author": "Rabbi Baruch Epstein"
    },
    {
        "title": "Hayom Yom Thoughts for the Day",
        "url": "https://feeds.transistor.fm/hayom-yom-thoughts-for-the-day",
        "description": "A brief life lesson gleaned from that day's Hayom Yom entry",
        "id": 7176433,
        "author": "Rabbi Baruch Epstein"
    },
    {
        "title": "Daily Proverbs with Adam Qadmon",
        "url": "https://feeds.buzzsprout.com/2461533.rss",
        "description": "<p>Adam Qadmon dives into the book of Proverbs. Our prayer is that you take a quick moment to read the Proverb and then listen to the podcast for that day. Together we explore how ancient wisdom is still very much alive.</p><p><br></p><p>John & Kim</p>",
        "id": 7256536,
        "author": "Kim & John"
    },
    {
        "title": "Experiencing God Day by Day Podcast",
        "url": "https://experiencinggoddaybydaypodcast.libsyn.com/rss",
        "description": "This podcast will air each day's devotional from the best-selling book, Experiencing God Day-by-Day by Henry and Richard Blackaby.",
        "id": 4650730,
        "author": "Dr. Richard Blackaby"
    },
    {
        "title": "Parenting Roundabout",
        "url": "https://www.spreaker.com/show/3680863/episodes/feed",
        "description": "Join parenting writers Terri Mauro and Catherine Holecko for a weekly look at the things parents are talking about, complaining about, and obsessing about right now.",
        "id": 561921,
        "author": "Parenting Roundabout"
    },
    {
        "title": "Wade Keller Pro Wrestling Post-shows",
        "url": "https://www.spreaker.com/show/3275545/episodes/feed",
        "description": "PWTorch editor Wade Keller brings you post-show coverage following WWE Raw and Smackdown with a rotation of guest cohosts from the wrestling journalism and podcast field, plus live on-site correspondents from the arenas, live callers, and mailbag segments.<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/wade-keller-pro-wrestling-post-shows--3275545/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/wade-keller-pro-wrestling-post-shows--3275545/support</a>.",
        "id": 579656,
        "author": "Pro Wrestling Torch"
    },
    {
        "title": "True Crime Historian",
        "url": "https://www.spreaker.com/show/2909311/episodes/feed",
        "description": "Tales of classic scandals, scoundrels and scourges told through vintage newspaper accounts from the golden age of yellow journalism<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/true-crime-historian--2909311/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/true-crime-historian--2909311/support</a>.",
        "id": 1041409,
        "author": "Pulpular Media"
    },
    {
        "title": "The SeedPod for Kids by Starting With Jesus",
        "url": "https://www.spreaker.com/show/4667105/episodes/feed",
        "description": "A daily (Sunday-Friday) devotional Podcast geared for KIDS! Listen to stories, read the Bible, learn hymns and memory verse songs. Learn more about Jesus and how He wants to be YOUR best friend!<br /><br />To find out more about other programs we offer, go to <a href=\"http://www.startingwithjesus.com/seedpod\" rel=\"noopener\">www.startingwithjesus.com/seedpod</a>",
        "id": 1330980,
        "author": "Starting with Jesus"
    },
    {
        "title": "Bizarre Encounters with Shayn & Orin",
        "url": "https://www.spreaker.com/show/6292129/episodes/feed",
        "description": "Join <b>Shayn & Orin</b> as we dissect the <i><b>bizarre</b></i> one encounter at a time. From deep dives to interviews we've got you covered on any and all of your fascinations into the bizarre and anomalous.<br />.<br />.<br /><b>Social Media/Email/Donate/Merch/Patreon</b><br />http://linktr.ee/bizarreencounters<br />.<br />.<br /><b>CONTACT US / REPORT AN ENCOUNTER</b><br />bizarreencounters@outlook.com<br />(313) 364-1551 <br />.<br />.<br /><b>Open Minds Media (OMM)</b><br />https://linktr.ee/open_minds_media<br />.<br />.<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/bizarre-encounters-with-shayn-orin--6292129/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/bizarre-encounters-with-shayn-orin--6292129/support</a>.",
        "id": 5635566,
        "author": "Shayn Jones & Orin Felix (Open Minds Media)"
    },
    {
        "title": "BHN: Peaceful Empowerment Works",
        "url": "https://www.spreaker.com/show/5880786/episodes/feed",
        "description": "<a href=\"https://www.youtube.com/watch?v=RhyoiDdHFc0&list=PLM8TxiTYtwl2jBbfnZod1m-z0uS8cU4y_&pp=gAQBiAQB\" target=\"_blank\" rel=\"noreferrer noopener\">Be Here Now: The Peaceful Empowerment Works Show(Presence, Perspective and Peace) </a><br /><br /><a href=\"https://www.youtube.com/watch?v=RhyoiDdHFc0&list=PLM8TxiTYtwl2jBbfnZod1m-z0uS8cU4y_&pp=gAQBiAQB\" target=\"_blank\" rel=\"noreferrer noopener\">Make the choice to Be Here Now with Hosts, Judy Forder, Certified Intuitive Counselor, Energy Practitioner, Reiki Master and founder of Powered by Your Soul, LLC. www.</a><a href=\"http://poweredbyyoursoul.com/\" target=\"_blank\" rel=\"noreferrer noopener\">PoweredByYourSoul.com</a><a href=\"https://www.youtube.com/watch?v=RhyoiDdHFc0&list=PLM8TxiTYtwl2jBbfnZod1m-z0uS8cU4y_&pp=gAQBiAQB\" target=\"_blank\" rel=\"noreferrer noopener\"> and Janice Leonard, Reiki 1, Sound Therapy 1, Lightworker and Peaceful Empowerment Works, Inc Board Member as they explore how a shift in our ability to be more present in our lives expands our perspective and ushers in peace. Through the work they have done in their own lives, </a><br /><br /><a href=\"https://www.youtube.com/watch?v=RhyoiDdHFc0&list=PLM8TxiTYtwl2jBbfnZod1m-z0uS8cU4y_&pp=gAQBiAQB\" target=\"_blank\" rel=\"noreferrer noopener\">Judy and Janice have come to the conclusion that people find and experience peace in many different ways. Their new mission is to introduce as many Pathways to Peace as possible while providing tried and true effective tools for listeners to experiment with in their own lives. </a><br /><br /><a href=\"https://www.youtube.com/watch?v=RhyoiDdHFc0&list=PLM8TxiTYtwl2jBbfnZod1m-z0uS8cU4y_&pp=gAQBiAQB\" target=\"_blank\" rel=\"noreferrer noopener\">Join Judy and Janice for some laughs, inspiring stories, and what they at PE Works call edutainment, where education and entertainment come together to provide a fun learning experience.  <br /></a><br /><br /><a href=\"https://gmail.com\" target=\"_blank\" rel=\"noreferrer noopener\">Email:  PeacefulEmpowermentWorks@Gmail.com</a>​<br /><a href=\"https://www.peacefulempowermentworks.org/\" target=\"_blank\" rel=\"noreferrer noopener\">Website:  www.PeacefulEmpowerment Works.org</a><br /><br /><a href=\"http://www.NEWStreamingNetwork.com\" target=\"_blank\" rel=\"noreferrer noopener\">www.NEWStreamingNetwork.com</a>.  Home of NEW Streaming TV, Going Bold Media, Going Solo Media. and WGSN-DB Going Solo Network Radio, Podcasts, and TV.<br /><br />",
        "id": 6853783,
        "author": "WGSN-DB Going Solo Network"
    },
    {
        "title": "Reddit Stories",
        "url": "https://www.spreaker.com/show/6237355/episodes/feed",
        "description": "Welcome to [ New Reddit Stories ] the ultimate destination for captivating stories from Reddit! Dive into a world of fascinating tales, from heartwarming anecdotes to spine-chilling mysteries. Each episode, we bring you the best stories shared by real people on Reddit, narrated with passion and authenticity. Whether you're commuting, relaxing at home, or looking for something new to binge, our podcast promises to keep you entertained. Follow us and tune in to [ New Reddit Stories ] to experience the most intriguing and unforgettable stories the internet has to offer! #redditstories #reddit #updates #realstories <br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/reddit-stories--6237355/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/reddit-stories--6237355/support</a>.",
        "id": 6967897,
        "author": "RedditKing"
    },
    {
        "title": "Reddit Tales",
        "url": "https://www.spreaker.com/show/6345769/episodes/feed",
        "description": "Reddit Tales",
        "id": 7048921,
        "author": "reddittales"
    },
    {
        "title": "Doomsday: History's Most Dangerous Podcast",
        "url": "https://www.spreaker.com/show/4866335/episodes/feed",
        "description": "Doomsday is a history lesson that easily disguises itself as a horror story. We explore the most traumatic, bizarre and most awe-inspiring but largely unheard-of disasters from throughout human history and around the world including the science behind every disturbing detail. If you like shipwrecks, decapitations, things that melt, living blankets of insects and people screaming for their lives, Doomsday is the podcast for you.",
        "id": 450236,
        "author": "Brad Choma"
    },
    {
        "title": "The Diddy Diaries",
        "url": "https://www.spreaker.com/show/5976627/episodes/feed",
        "description": "The Diddy Diaries: The Downfall of Sean Combs is a raw, unflinching look at the dramatic collapse of one of hip-hop’s biggest moguls. For decades, Sean 'Diddy' Combs seemed untouchable—a figure who rose from the streets to become a titan of the music, fashion, and entertainment industries. His Bad Boy Entertainment label defined a generation of hip-hop, and his entrepreneurial spirit made him a household name. But beneath the surface of this glittering success lay darker currents—currents that have now surged into the spotlight as the empire he built threatens to crumble beneath the weight of scandal and serious criminal allegations.<br /><br />This podcast dives deep into the allegations that have sent shockwaves through the entertainment world. At the center of it all are the accusers—those who have come forward with shocking claims of misconduct, manipulation, and abuse. These aren’t just sensational headlines—they are stories that expose a side of Sean Combs the public never saw. The Diddy Diaries explores how these accusations began to surface, what drove his accusers to finally speak out, and how the legal system has responded.<br /><br />But this isn’t just about Diddy’s public image taking a hit—The Diddy Diaries zeroes in on the high-stakes battle that Diddy now faces to stay out of jail. Each episode unpacks the legal drama as it unfolds in real-time: the charges, the court proceedings, and the fight for his freedom. Once a man who had it all—fame, fortune, and influence—Diddy now stands at the center of a legal storm that threatens to strip him of everything, including his freedom.<br /><br /><br />We trace the events that led up to this moment, looking at how Diddy’s larger-than-life persona masked a pattern of behavior that would ultimately bring him to this point. Listeners will get a front-row seat to the high-stakes legal battles, where the possibility of incarceration looms large. The tension is palpable as Diddy’s legal team works to combat the mounting evidence against him, while his accusers push for justice.<br /><br />Through riveting storytelling, The Diddy Diaries paints a full picture of Diddy’s downfall, from the heights of his stardom to the depths of his legal fight for survival. This is not a story about maintaining power or influence—it’s a fight to avoid the ultimate consequence: prison. As the allegations mount and the legal drama intensifies, The Diddy Diaries delivers a compelling narrative of a man grappling with the very real possibility of losing everything he once held dear.<br /><br />With every episode, listeners are drawn deeper into this unfolding saga of celebrity, power, and justice. The Diddy Diaries not only explores the high-profile case but also delves into the human cost behind the headlines. As Diddy’s world unravels, so too does the carefully constructed image he spent decades building. This podcast is a must-listen for anyone who wants to understand the full scope of Sean Combs’ downfall, where the stakes couldn’t be higher and the outcome remains uncertain.<br /><br />Prepare for a rollercoaster ride through the most shocking and consequential scandal in recent entertainment history. Tune in to The Diddy Diaries: The Downfall of Sean Combs to witness the dramatic fall of a man who once ruled the music world but now fights for his freedom in the face of life-altering allegations.<br />",
        "id": 6672935,
        "author": "Bobby Capucci"
    },
    {
        "title": "The World with Richard Engel and Yalda Hakim",
        "url": "https://podcast.global.com/show/6313331/episodes/feed",
        "description": "Sky News’ Yalda Hakim and NBC’s Richard Engel have covered world events for years. Now, they team up for a new podcast to share their experiences from the frontline.    <br /><br />They debrief from global flashpoints and discuss their encounters with the biggest decision makers. They’ll also be joined by some of those key players to help make sense of world events.  <br /><br />From conflict in the Middle East, to the US election, and the war in Ukraine there is no better place for analysis and expertise  <br /><br />New episodes from Richard and Yalda every Wednesday. Starting October 9th.",
        "id": 7027228,
        "author": "Sky News"
    },
    {
        "title": "The Midsters",
        "url": "https://media.rss.com/midlifemidsters/feed.xml",
        "description": "<p>Welcome to the Midlife Midsters Podcast! Unleash the power of midlife as we inspire you to embrace boldness and wholeheartedly say \"YES\" to making the absolute most of this incredible phase of life. Join us on a transformative journey filled with captivating stories, expert insights, and empowering conversations that will embolden you to seize every opportunity, conquer new challenges, and rediscover your passions. Get ready to redefine what it means to thrive in midlife, because it's never too late to live life to the fullest! Tune in now and let's embark on this exciting adventure together.</p>",
        "id": 6504514,
        "author": "American Midsters"
    },
    {
        "title": "Mission 66",
        "url": "https://media.rss.com/m66-eng/feed.xml",
        "description": "<p>Mission 66 brings the Bible to life each day as our hosts take you on a journey from Genesis to Revelation. You’ll understand God’s Word in a fresh way and grow in your intimacy with the Lord. In this chapter-by-chapter audio commentary from TWR, teacher John Mathews and co-host Esther Sisulu open the Scriptures in a personal and applicable way. They adapt the teaching of Brazilian Bible teacher Luiz Sayão, which he originally delivered in Portuguese. Mission 66 is heard in several languages through the hosting of TWR international teaching teams. Don't forget to download a copy of the Mission 66 study guide at <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://www.mission66.org\">www.mission66.org</a>  You can also interact with John & Esther on Facebook. </p>",
        "id": 7034438,
        "author": "TWR"
    },
    {
        "title": "Locked On Mavericks - Daily Podcast On The Dallas Mavs",
        "url": "https://feeds.simplecast.com/TGXowVSf",
        "description": "Locked On Mavericks podcast is your daily ticket to stay ahead of the game and the first to know the latest news, analysis, and insider info for the Dallas Mavericks and the NBA. Nick Angstadt (Host of Locked On NBA), Isaac Harris (Formerly of Mavs.com), and friends provide your daily Mavs fix with expert, local analysis, and coverage of all aspects of the Mavericks’ franchise. Locked On Mavericks takes you beyond the scoreboard for the inside scoops on the biggest stories from within the Mavs locker room and all over the NBA. The Locked On Mavericks podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 845840,
        "author": "Locked On Podcast Network, Nick Angstadt"
    },
    {
        "title": "The Critshow",
        "url": "https://feeds.megaphone.fm/thecritshow",
        "description": "<p>A group of friends have their lives turned upside down when they find themselves placed as the last line of defense between the everyday world and the things that go bump in the night.</p><p>This actual play podcast uses Monster of the Week and other Powered by the Apocalypse games, all within the same dimension hopping narrative, to follow the Indiana Paranormal Task-force (IPT) as they are thrust into the front lines of a battle they didn't know existed.</p>",
        "id": 525434,
        "author": "Critshow Studios"
    },
    {
        "title": "Office Ladies",
        "url": "https://feeds.megaphone.fm/office-ladies",
        "description": "<p>The Office co-stars and best friends, Jenna Fischer and Angela Kinsey, are doing the ultimate The Office re-watch podcast for you. Each week Jenna and Angela will break down an episode of The Office and give exclusive behind the scene stories that only two people who were there, can tell you.</p>",
        "id": 959344,
        "author": "Audacy & Jenna Fischer and Angela Kinsey"
    },
    {
        "title": "Renewing Your Mind",
        "url": "https://renewingyourmind.ligonier.org/rss",
        "description": "Renewing Your Mind is the daily podcast of Ligonier Ministries. R.C. Sproul launched this outreach to help Christians gain a deeper understanding of who God is as their minds are renewed according to His Word. Listen to today’s message to dig deeper into Scripture and apply its timeless truth to your life.",
        "id": 1047998,
        "author": "Ligonier Ministries"
    },
    {
        "title": "Networth and Chill with Your Rich BFF",
        "url": "https://feeds.megaphone.fm/VMP1282389759",
        "description": "<p>Vivian Tu, aka Your Rich BFF, is getting up close and personal, about the good, bad, and ugly on how money impacts all of our lives. Instead of your traditional boring business podcast, Networth and Chill covers financial topics as they relate to YOUR ACTUAL LIFE, all while feeling like a conversation with your best friend. Each episode breaks down a complicated economic or business concept into easy to understand terms, while tapping experts, professionals, and some of your favorite famous faces to give actionable tips & advice on how to make the most of your money. Grab a drink and get ready to Networth and Chill. Part of the Vox Media Podcast Network.</p>",
        "id": 6244706,
        "author": "Vivian Tu"
    },
    {
        "title": "Vox Scream",
        "url": "https://feeds.transistor.fm/vox-scream",
        "description": "A Warhammer 40,000 Kill Team podcast where we aim to help players of all skill levels supercharge their game and separate the signal from the noise. Hosted by Mark Meyer, George Pratt, and Joe Gallo. Coming to you from The Triangle in North Carolina. Thanks for listening, and enjoy the show",
        "id": 6963669,
        "author": "Mark Meyer, George Pratt, Joe Gallo"
    },
    {
        "title": "GBC | Big Three",
        "url": "https://feeds.simplecast.com/hwgerfcs",
        "description": "The GBC Big Three podcast is a weekly podcast where we unpack three big questions from Gymea Baptist Church's latest Sermon chosen by our congregation.",
        "id": 861280,
        "author": "Gymea Baptist Church"
    },
    {
        "title": "Gemara Markings Daf Yomi",
        "url": "https://feeds.transistor.fm/gemara-markings-daf-yomi",
        "description": "A Daf Yomi shiur that is focused on clarity of p’shat and the structure of the sugios, leaving the listener with a clear understanding of even the most complex issues.",
        "id": 6017114,
        "author": "Rabbi S Horowitz"
    },
    {
        "title": "Horror Movie Talk",
        "url": "https://www.horrormovietalk.com/feed/podcast/",
        "description": "<a href=\"https://www.horrormovietalk.com/\">Horror Movie Talk</a> is an opinionated and accidentally funny horror movie review show. New theatrical releases always get priority, but we also review older horror movies both good and horror-ble.",
        "id": 12360,
        "author": "Horror Movie Talk: Horror Movie Review"
    },
    {
        "title": "Thomas Paine Podcast",
        "url": "https://www.spreaker.com/show/5788750/episodes/feed",
        "description": "Mike 'Thomas Paine' Moore is a journalist and broadcaster and today serves as a top news-breaking muckraker. He previously worked for the FBI, White House, DEA, among many other Intel agencies and private concerns. Moore is the recipient of the coveted Gerald Loeb Award for journalism and two-time Pulitzer Prize for Investigative reporting nominee. As a Certified Fraud Examiner, Moore previously headed anti-money laundering operations for Citi in Chicago, Los Angeles, Delaware and New York City. He has an expertise in covert telecommunications, HUMINT, and OSINT intelligence gathering.",
        "id": 484324,
        "author": "mike moore"
    },
    {
        "title": "Key Life with Steve Brown",
        "url": "https://feedpress.me/keylife",
        "description": "Spend 15 minutes a day with Steve Brown with the free Key Life podcast! Heard on hundreds of stations, Steve's in depth Bible study will inform not only your day but your life as well.",
        "id": 740808,
        "author": "Steve Brown"
    },
    {
        "title": "Locked On Vols - Daily Podcast On Tennessee Volunteers Football & Basketball",
        "url": "https://feeds.simplecast.com/bGDwSDbR",
        "description": "Locked On Vols podcast is the daily podcast that keeps you ahead of the games and the first to know the latest news, analysis, and insider info for the Tennessee Volunteers. Hosted by Knoxville Radio Personality Eric Cain, the Locked On Vols podcast provides your daily Tennessee Volunteers fix with expert opinions, film reviews, interviews with athletes and coaches, recaps, local analysis, and coverage of all things Rocky Top. From the legendary gridiron battles at Neyland Stadium to the buzzer beaters at Thompson-Boling Arena, and everywhere in between, the Locked On Vols podcast takes you beyond the headlines for the inside scoops from the biggest stories inside the Volunteers locker room and the SEC. The Locked On Vols podcast is part of the Locked On Podcast Network. Your Team. Every Day.",
        "id": 774642,
        "author": "Locked On Podcast Network, Eric Cain"
    },
    {
        "title": "The Atlas Obscura Podcast",
        "url": "https://feeds.simplecast.com/xKJ93w_w",
        "description": "An audio guide to the world’s strange, incredible, and wondrous places. Co-founder Dylan Thuras and a neighborhood of Atlas Obscura reporters explore a new wonder every day, Monday through Thursday. In under 15 minutes, they’ll take you to an incredible place, and along the way, you’ll meet some fascinating people and hear their stories. Our theme and end credit music is composed by Sam Tyndall.",
        "id": 1384407,
        "author": "SiriusXM and Atlas Obscura"
    },
    {
        "title": "Commuter Bible OT",
        "url": "https://feeds.simplecast.com/3cfqu7SJ",
        "description": "Commuter Bible OT is a work-week audio Bible reading plan to match your weekly schedule. In five days a week, Monday-Friday, you can listen to the entire Old Testament over the course of a year. We even break on holidays! Presented chronologically, this podcast presents the Old Testament's contents in the order in which they occurred. Subscribe today and get more of God's Word in your daily life. Part of the Commuter Bible family of podcasts, using the Christian Standard Bible translation (CSB). Learn more at www.commuterbible.org",
        "id": 2653726,
        "author": "John Ross"
    },
    {
        "title": "Solving JFK",
        "url": "https://feeds.redcircle.com/217f60b5-3935-4cc6-8d92-71f1e769cba2",
        "description": "Solving JFK examines each issue in the JFK Assassination by looking at the arguments from both those who believe Oswald acted alone and those who believe there was a conspiracy to kill president Kennedy. Host Matt Crumpton analyzes each tree in the forest and then zooms out to look at the big picture. Objective truth is the paramount goal of the podcast, with every factual proposition cited. In season one, we look at whether the Warren Report got it right that Lee Harvey Oswald was the lone assassin, and if not, what the open questions are that still need to be resolved.",
        "id": 5778054,
        "author": "Matt Crumpton"
    },
    {
        "title": "Let's Talk Off Camera with Kelly Ripa",
        "url": "https://feeds.simplecast.com/aP5UvNFU",
        "description": "This is the show that goes on in my head, when the cameras stop rolling. I get to ask the questions that I really want to know and talk to friends and experts about the topics I really want to discuss. It's unfiltered, often unhinged...it's Let's Talk Off Camera with Kelly Ripa. \nSubscribe to SiriusXM Podcasts+ to listen to new episodes of Let’s Talk Off Camera with Kelly Ripa ad-free and a whole week early. Start a free trial now on Apple Podcasts or by visiting siriusxm.com/podcastsplus.",
        "id": 6095925,
        "author": "Kelly Ripa"
    },
    {
        "title": "Commuter Bible Q",
        "url": "https://feeds.simplecast.com/0UYolv9T",
        "description": "Commuter Bible Q is the \"quiet line-up\" audio Bible reading plan to match your weekly schedule. Published Monday-Friday, major (U.S.) holidays excluded, we'll begin in Genesis and read straight through to Revelation. In the course of a year, you can listen to the entire Bible! Subscribe today and get more of God's Word in your daily life. Commuter Bible uses the Christian Standard Bible translation (CSB).",
        "id": 6745962,
        "author": "John Ross"
    },
    {
        "title": "Where Everybody Knows Your Name with Ted Danson and Woody Harrelson (sometimes)",
        "url": "https://feeds.simplecast.com/0T4plG50",
        "description": "Ted Danson and Woody Harrelson are total opposites with an unbreakable bond since meeting on the hit sitcom “Cheers.” But after that show wrapped, life took them in different directions. This podcast is a chance to reconnect, both with each other and the amazing friends they’ve each met over the decades—that is, when Ted can get a hold of Woody! Join them as they dig beyond the career highlights and into the stuff of life that makes us who we are. Like the title says, this is a place to be known.",
        "id": 6904724,
        "author": "Team Coco & Ted Danson, Woody Harrelson"
    },
    {
        "title": "The Optimist Project with Yara Shahidi",
        "url": "https://feeds.simplecast.com/vCoXgVlw",
        "description": "Host Yara Shahidi sits down with incredible changemakers to unlock their secrets to conquering life, love, career, and everything in between with unwavering confidence and hope. \nWe often discuss joy and happiness, but this podcast goes deeper. Optimism is where the magic happens! Join us as we find ways to cultivate the practice of optimism in our own lives.",
        "id": 7043148,
        "author": "SiriusXM Podcasts"
    },
    {
        "title": "P.E.E.P. Podcast",
        "url": "https://www.spreaker.com/show/4611314/episodes/feed",
        "description": "P.E.E.P. = People Experiencing Everyday Paranormal. <br />The P.E.E.P. Podcast explores how scientists and researchers around the world are studying PSI phenomena while relating how people experience PSI in their everyday lives. <br />Science + PSI: It's more normal than you think.",
        "id": 1374852,
        "author": "Nicolle Morock"
    },
    {
        "title": "Sasquatch Odyssey",
        "url": "https://www.spreaker.com/show/4839697/episodes/feed",
        "description": "In each episode, we bring you riveting interviews with individuals who have had encounters with the elusive Sasquatch. Each one of these stories will leave you wanting more. <br /><br />But that's not all. We go beyond the encounters and explore the realm of Bigfoot research from a critical thinking perspective. We bring you interviews with field researchers who dedicate their lives to unraveling the mysteries surrounding Sasquatch. These dedicated individuals use hard science and rigorous methodologies to investigate the existence of this legendary creature. <br />Through thought-provoking discussions, we aim to shed light on the truth behind the Sasquatch phenomenon.<br /><br />Our show highlights the boots-on-the-ground researchers who tirelessly pursue evidence and employ scientific methods to answer the age-old question: Does Sasquatch truly exist?<br /><br />Join us each week as we embark on a thrilling journey into the unknown, uncovering compelling stories, and examining the scientific evidence that surrounds the mystery of Sasquatch. Get ready to challenge your beliefs and expand your understanding of this captivating subject.<br /><br />If you have had an encounter with Bigfoot or any other cryptid and would like to be on the show, email brian@paranormalworldproductions.com <br /><br /><br />Please make sure to subscribe to or follow the show wherever you listen. If you have the option, turn on those automatic downloads and never miss an episode. <br /><br />Now. Sit back, relax, and enjoy the show.<br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/sasquatch-odyssey--4839697/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/sasquatch-odyssey--4839697/support</a>.",
        "id": 2992185,
        "author": "Sasquatch Odyssey-Bigfoot Encounters"
    },
    {
        "title": "On This Day in Working Class History",
        "url": "https://www.spreaker.com/show/6070772/episodes/feed",
        "description": "Daily briefings of On This Day people's history anniversaries every day of the year. From the Working Class History team.<br />Help support our work by joining us on patreon and accessing exclusive content and benefits: <a href=\"https://patreon.com/workingclasshistory\" target=\"_blank\" rel=\"noreferrer noopener\">patreon.com/workingclasshistory</a><br /><br />Become a supporter of this podcast: <a href=\"https://www.spreaker.com/podcast/on-this-day-in-working-class-history--6070772/support?utm_source=rss&utm_medium=rss&utm_campaign=rss\">https://www.spreaker.com/podcast/on-this-day-in-working-class-history--6070772/support</a>.",
        "id": 6766530,
        "author": "Working Class History"
    },
    {
        "title": "FADE TO BLACK with Jimmy Church",
        "url": "https://www.spreaker.com/show/1302044/episodes/feed",
        "description": "FadeToBlack LIVE w/ Jimmy Church radio show covers UFOlogy, Paranormal, Ancient Civilizations, History, Conspiracy, and more. <br />Visit us on www.jimmychurchradio.com for more information and show archives.",
        "id": 3195792,
        "author": "FadeToBlack"
    },
    {
        "title": "BBC News",
        "url": "https://podcast.voice.api.bbci.co.uk/rss/audio/p002vsmz?api_key=JqAy8fGqi8lpxLsr3WaGxyG31AZ5URMr",
        "description": "The latest five minute news bulletin from BBC World Service.",
        "id": 4375921,
        "author": "BBC World Service"
    },
    {
        "title": "Last of the Nintendogs: A NINTENDO PODCAST",
        "url": "https://www.spreaker.com/show/5704856/episodes/feed",
        "description": "A Nintendo podcast from Jeff Grubb and Mike Minotti.",
        "id": 4063830,
        "author": "Jeff Grubb's Game Mess"
    },
    {
        "title": "Millennial Media Offensive",
        "url": "https://namillennial.com/wp-content/feed.xml",
        "description": "The MMO Show is a weekly podcast dissecting media narratives that target or involve Millennials or GenZ. Using comedy and audio clips, Millennials Dan G. and John G. Dew deconstruct the agendas aimed at younger generations.\nMillennial Media Offensive operates on Value 4 Value model. Please consider donating whatever value you place on our show! https://tinyurl.com/2tyv9xcs",
        "id": 4831193,
        "author": "Dan G. & John G. Dew"
    },
    {
        "title": "AI Unraveled: Latest AI News & Trends, ChatGPT, Gemini, DeepSeek, Gen AI, LLMs, AI Ethics & Bias",
        "url": "https://media.rss.com/djamgatech/feed.xml",
        "description": "<p>In this podcast, we'll explore <strong>groundbreaking research, innovative applications, and emerging technologies that are pushing the boundaries of AI</strong>. From ChatGPT and the recent merger of Google Brain and DeepMind to the latest developments in generative AI, we'll provide you with a comprehensive update on the AI landscape.</p><p>🚀 Whether you're a tech enthusiast, a professional in the field, or simply curious about AI, this podcast is your go-to source for all things AI. <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://podcasts.apple.com/ca/podcast/ai-unraveled-demystifying-frequently-asked-questions/id1684415169\">Subscribe for weekly updates and deep dives into artificial intelligence innovations.</a></p><p><strong>🚀 Power Your Productivity Stack Like AI Unraveled: Get 20% OFF Google Workspace!</strong></p><p>Google Workspace makes it easy to get started. Try it <strong>free for 14 days</strong>, and as an AI Unraveled listener, get an exclusive <strong>20% discount</strong> on your first year of the Business Standard or Business Plus plan!</p><p><strong>Sign up using our referral link at </strong><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://referworkspace.app.goo.gl/Q371\">https://referworkspace.app.goo.gl/Q371</a> and <strong>Use one of these codes during checkout (Americas Region):</strong></p><p><strong>Business Starter Plan:</strong> CD7FC9QM4TEPCGE</p><p><strong>Business Standard Plan:</strong> A4674QA7KF7H43P</p><p>Email <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"mailto://info@djamgatech.com\"><strong>info@djamgatech.com</strong></a> for more codes</p><p><strong>🚀Advance Your Career with Djamgatech</strong></p><p>From AWS to CompTIA, Djamgatech helps you pass with confidence. Access AI-enhanced practice tests and flashcards covering 50+ certifications with PBQs (Performance Based Questions)—all in one powerful app.</p><p>Try it FREE: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://djamgatech.web.app\">https://djamgatech.web.app</a></p><p>iOS: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://apps.apple.com/ca/app/djamgatech-ai-cert-master/id1560083470\">https://apps.apple.com/ca/app/djamgatech-ai-cert-master/id1560083470</a></p><p><strong>⚖️ </strong><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://apps.apple.com/ca/app/master-ai-machine-learning-pro/id1610947211\"><strong>AI and Machine Learning For Dummies</strong></a><strong>: Master AI and Machine Learning on the go!</strong></p><p><strong>Get it at </strong><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://apps.apple.com/ca/app/master-ai-machine-learning-pro/id1610947211\">https://apps.apple.com/ca/app/master-ai-machine-learning-pro/id1610947211</a></p><p>👥 <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/company/1730935\">Linkedin</a>, <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.youtube.com/@enoumen\">Youtube </a>✅</p><p><strong>🚀</strong><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://buy.stripe.com/fZe3co9ll1VwfbabIO\"><strong>Advertise on AI Unraveled: </strong></a><strong>Reach Thousands of AI Enthusiasts Daily!</strong></p><p><strong>🎨 </strong>Start podcasting like a PRO at <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rss.com/?via=005875\">https://rss.com/?via=005875</a></p><p><strong>🚀Ace the Google Cloud Generative AI Leader Certification</strong>:</p><p>The E-Book + audiobook is available at <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://djamgatech.com/product/ace-the-google-cloud-generative-ai-leader-certification-ebook-audiobook\">https://djamgatech.com/product/ace-the-google-cloud-generative-ai-leader-certification-ebook-audiobook</a></p><p><strong> </strong></p>",
        "id": 6325522,
        "author": "Etienne Noumen"
    }
]